{
  "Harbinger": {
    "adventures: ": "Harbingers adventure for many and sundry reasons, ranging from simple greed to revenge to genuine altruism. Many harbingers learn their trade from a mentor or master who sometimes imparts a mission or task to them, or initiates them into an organization that retains the harbinger as its agent. Harbingers aren't any less likely to take to the adventuring life out of friendship than anyone else and may be found in the company of mercenaries they've grown to love, or at least no longer feel like they can live without.",
    "characteristics: ": "Regardless of their alignment, religion, culture of origin, or beliefs, all harbingers have one thing in common: violence. For some anger and sorrow are tools they use to do their jobs, an acknowledgement that all sapients have both good and evil within. For others violence marks and defines their lives, with angry scars and psychological wounds. Some crumble before the anger within, becoming little more than puppets for their hate, and others refuse to give in and display a level of self-control that can only be called saintlike. However, all harbingers live their lives coming to-or failing to come to-terms with the darkness within.",
    "alignment: ": "Any. Though harbingers are marked by their darker urges they are not utterly defined by them, and many brave and noble souls succeed in staring into the abyss until the abyss averts its gaze. It is true that many Harbingers skew towards evil and/or chaos, but nothing stops a harbinger from turning their power to altruistic ends.",
    "religion: ": "Harbingers tend to be on one side or the other of the line between piety and indifference when it comes to religion. Many harbingers that have been scarred by violence or evil shy away from faith, unable to believe that higher powers truly influence their lives. Others embrace gods of violence, vengeance, tyranny or destruction out of a feeling of common sympathy or even obligation. Good-aligned harbingers tend to worship gods of justice or retribution, taking on the role of those who dispense justice to the wicked, or to gravitate towards gods they seek to emulate-gods of peace, love, or beauty that remind the harbingers of the things they choose to defend.",
    "background: ": "At some point in their lives, all harbingers encountered the violence within. Some come from cursed or tainted backgrounds, dragged towards power by fiendish blood or maledictions laid down upon their ancestors. Others have inherent but untapped magical potential that erupts in a moment of wrath or panic, and many harbingers have started on their path with blood dripping from their fingers and a look of shocked panic on their face. Harbingers tend to be from places marked or scarred by strife, and the majority emerge from lands wracked by civil war, military conflict, massive social change, crushing poverty or endemic crime, though this may be because the circumstances that awaken their power are so much more common in such places.",
    "races: ": "Any race capable of feeling anger, sorrow, or grief can potentially become an harbinger. That said, some are certainly more common than others. Savage humanoids such as orcs and gnolls produce a large number of harbingers; their day-to-day lives are marked with violence and maliciousness. Humans and part-humans (but especially tieflings) also make up a large part of harbinger membership, both because of the significant role negative emotions play in their lives and the endemic poverty and crime rates found in their cities. In contrast, races with gentle day-to-day lives such as elves or dwarves produce harbingers more rarely, and even then usually as part of a master-student relationship.",
    "other classes: ": "Harbingers can often have difficulty around divinely-empowered classes such as clerics and paladins, most often because of the ultimate source of their power. Paladins in particular tend to disapprove of harbingers utilizing evil urges, even for good ends, and the conflicts between the two can run long and deep.",
    "role: ": "Control. Harbingers command the battlefield with a combination of superior mobility and debilitating strikes, determining when and how they want to engage and targeting weak enemies while shutting stronger ones out of the battle. Their spread of supernatural maneuvers gives harbingers access to magical and unusual abilities that can shift the tide of battle in their favor.",
    "abilities: ": "Intelligence is pivotal to harbingers; it controls the save DCs of their maneuvers and boosts their accuracy and damage. Constitution helps a harbinger survive the rigors of battle, while Dexterity and Wisdom shore up her defenses.",
    "starting age: ": "Intuitive.",
    "starting wealth: ": "4d6 x 10 gp (average 140 gp.) In addition, each character begins play with an outfit worth 10 gp or less.",
    "hit die: ": "d8.",
    "skill ranks per level: ": "4 + Int modifier.",
    "weapon and armor proficiencies": "A harbinger is proficient with all simple weapons, martial melee weapons, light armor, and shields (except tower shields).",
    "maneuvers": "A harbinger begins her career with knowledge of five martial maneuvers. The disciplines available to her are  Cursed Razor ,  Riven Hourglass ,  Scarlet Throne ,  Shattered Mirror , and  Veiled Moon . Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Harbingers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it. Once the harbinger knows a maneuver, she must ready it before she can use it (see Maneuvers Readied, below). A maneuver usable by harbingers is considered an extraordinary ability unless otherwise noted in it or its discipline's description. A harbinger's maneuvers are not affected by spell resistance, and she does not provoke attacks of opportunity when she initiates one. The harbinger learns additional maneuvers at higher levels, as indicated on Table 1-1: Harbinger. A harbinger must meet a maneuver's prerequisite to learn it. See the  Systems and Use  page   for more details on how maneuvers are used. Upon reaching 4th level, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the harbinger can choose to learn a new maneuver in place of one she already knows. In effect, she loses the old maneuver in exchange for the new one. She can choose a new maneuver of any level she likes, as long as she observes the restriction on the highest-level maneuvers she knows; the harbinger need not replace the old maneuver with a maneuver of the same level. She can swap only a single maneuver at any given level. A harbinger's initiation modifier is Intelligence.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Harbingers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "unquiet grave:": "Harbingers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "maneuvers readied": "A harbinger can ready three of her five maneuvers known at 1st level, and as she advances in level and learns more maneuvers, she is able to ready more, but must still choose which maneuvers to ready. A harbinger must always ready her maximum number of maneuvers readied. She readies her maneuvers by meditating over the nature of malevolence, honing her killer instinct, dwelling upon grief and sorrow, or otherwise communing with her negative side for ten minutes. The maneuvers she chooses remain readied until she decides to meditate again and change them. The harbinger does not need to sleep or rest for any long period of time in order to ready her maneuvers; any time she spends ten minutes in communion with her darker urges, she can change her readied maneuvers. A harbinger begins an encounter with all her readied maneuvers unexpended, regardless of how many times she might have already used them since she chose them. When she initiates a maneuver, she expends it for the current encounter, so each of her readied maneuvers can be used once per encounter (unless she recovers them, as described below). In order for the harbinger to recover maneuvers, she must tap into her sorcerous malice by activating her dark claim class feature; the harbinger recovers a single expended maneuver whenever she Claims a creature, and she recovers a number of expended maneuvers equal to her harbinger initiation modifier (minimum 2) whenever a creature she has Claimed is reduced to 0 or less hit points. Alternately, the harbinger may concentrate on her inner negativity and recover a single maneuver as a standard action.",
    "stances known": "A harbinger begins her career with knowledge of one stance from any discipline open to harbingers. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, she can select an additional stance to learn. Unlike maneuvers, stances are not expended and the harbinger does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently maintaining as a swift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description. Unlike with maneuvers, a harbinger cannot learn a new stance at higher levels in place of one she already knows.",
    "dark claim (su)": "Starting at 1st level, a harbinger gains the ability to reach out with her sorcerous malice, marking foes as her own. As a swift action, the harbinger may Claim an opponent that she can see (including with special senses such as blindsense or tremorsense) within close range (25 feet + 5 feet per 2 harbinger levels) for a number of rounds equal to 1/2 her class level (minimum 1 round). A harbinger can have a maximum number of creatures Claimed equal to her harbinger initiation modifier (minimum 1), and may not Claim a creature she has already Claimed until or unless the Claim expires. Claimed creatures using the Withdraw action to leave a square threatened by the harbinger provoke attacks of opportunity from her. In addition, the harbinger automatically knows the position of creatures she has Claimed. Any opponent the harbinger cannot see still has total concealment (50% miss chance) against her, and the harbinger still suffers the normal miss chance when attacking creatures that have concealment. The harbinger is still denied her Dexterity bonus to her AC against attacks from Claimed creatures she cannot see.",
    "accursed will (ex)": "A harbinger is not an entirely physical being; the darkness within her supplements her body, impelling her to acts of stunning violence. Starting at 1st level, the harbinger gains an insight bonus on attack rolls equal to 1/2 her harbinger initiation modifier (minimum +1). At 10th level, she gains an insight bonus on damage rolls equal to her harbinger initiation modifier.",
    "ill tidings (ex)": "Like unwanted news, the harbinger travels swiftly. At 1st level, a harbinger gains a +10-foot competence bonus to her movement speeds. At 10th level, this bonus increases by +10 feet. Apply this bonus before modifying the harbinger's movement speeds because of any load carried or armor worn.",
    "dark focus (ex)": "Though all Harbingers tap into violence and sorrow, they inevitably specialize in a method of combat that calls to them deep within themselves. At 2nd level, a harbinger selects one discipline she has access to from her harbinger levels to be her dark focus. She gains a +1 bonus on attack and damage rolls when initiating strikes and counters from her dark focus discipline. The bonus to attack and damage rolls increases by +1 at 5th level and every four levels thereafter. In addition, she gains a +1 bonus to the save DCs of maneuvers from her dark focus discipline. At 6th level, the harbinger gains either Advanced Study or Discipline Focus in her dark focus discipline as a bonus feat, even if she does not meet the prerequisites. In the case of Advanced Study, both maneuvers selected must be from her dark focus discipline. At 10th level, the harbinger selects a second discipline as her dark focus in addition to her original dark focus discipline. She does not gain an additional bonus feat, although the other bonuses from her dark focus class feature apply to the second discipline as well. At 14th level, the harbinger's dedication bears violent fruit. She may expend a readied maneuver to spontaneously initiate any maneuver she knows from her dark focus disciplines that is one or more levels lower than the expended maneuver, regardless of whether or not she has the dark focus maneuver readied. The initiation action of the spontaneously initiated maneuver is unchanged. At 20th level, the harbinger treats all maneuvers from her dark focus disciplines as being readied at the beginning of each encounter, in addition to her normal pool of readied maneuvers.",
    "grim news (su)": "Like a ghost or a rumor, the harbinger moves with supernatural acumen. Starting at 3rd level, a harbinger can move up to her speed as a swift action once per encounter. She can use this ability twice per encounter at 9th level, and three times per encounter at 15th level. At 9th level and again at 15th level, the harbinger selects one of the following abilities. One made, her choice is permanent and cannot be changed. Dark Wings:  The harbinger gains a fly speed equal to her base land speed, with good maneuverability. This flight is supernatural in nature; though the harbinger may develop wings or another form of evident propulsion, she flies through supernatural acumen alone. \n Omenwalk:  The harbinger gains the ability to teleport up to her speed as a move action. The harbinger does not need line of effect or line of sight to her destination, although she still provokes attacks of opportunity for leaving a threatened square when using this ability. Spider's Boon:  The harbinger gains a climb speed equal to her base land speed. In addition, she develops a sticky grip that aids her in battle, granting her a +4 racial bonus on grapple checks and to her CMD. \n Water Dweller:  The harbinger gains a swim speed equal to her base land speed. In addition, the harbinger no longer needs to breathe and becomes immune to inhaled poisons.",
    "massacre (ex)": "The scent of blood in the air and the gentle throb of fading life force impels the Harbinger to further heights of violence. Starting at 4th level, a harbinger can initiate one of her readied strikes against an adjacent creature as an immediate action when she reduces an opponent to 0 or fewer hit points. She can only initiate strikes with an initiation action of one standard action with this ability. The harbinger can use this ability once per encounter at 4th level, twice per encounter at 10th level, and three times per encounter at 16th level.",
    "elusive shadow (ex)": "The harbinger's unnatural alacrity protects her from harm as she shies away from whirling blades and streaking spells alike. Starting at 5th level, a harbinger gains a +2 dodge bonus to her AC and Reflex saves during any round in which she has moved at least 10 feet (including by teleportation effects such as omenwalk).",
    "sorcerous deception (sp)": "Having become adept at concealing the malice within, the harbinger develops the ability to allay the suspicions of those who investigate her with magic. At 7th level, a harbinger can use  magic aura  as a spell-like ability at will, with a caster level equal to her harbinger level. She may only target items and objects she is attending, carrying, wearing, or wielding.",
    "ill intentions (su)": "Those cornered by the harbinger and her allies feel the weight of her malice pressing down against them. Starting at 8th level, whenever a harbinger and one or more of her allies flank a creature, that creature suffers a 2 penalty on saving throws and skill checks.",
    "black omen (su)": "Like misfortune, the harbinger does not seem to move so much as simply arrive. Starting at 11th level, a harbinger may move up to half her speed as an immediate action once per encounter.",
    "bleak prophecy (su)": "Those claimed by the harbinger are filled with dreadful visions of their own demise. Starting at 12th level, creatures Claimed by a harbinger become shaken while the Claim persists.",
    "dark murmur (su)": "Those claimed by the harbinger find her as hard to catch as rumor itself. Starting at 13th level, the harbinger's movement no longer provokes attacks of opportunity from creatures she has Claimed.",
    "rumors of war (ex)": "The harbinger sweeps through her enemies, spreading pain and woe wherever she steps. Starting at 17th level, a harbinger may move up to her speed and initiate a single strike at any point in the movement as a full-round action.",
    "voices in the dark (ex)": "Like a dark voice on the edge of hearing, the harbinger persecutes her enemies. Starting at 18th level, a harbinger can initiate a strike whenever she would normally be able to make an attack of opportunity (she still expends the attack of opportunity). She can only initiate strikes with an initiation action of one standard action with this ability.",
    "whispers of atrocity (su)": "There is no resisting the harbinger's malice. Starting at 19th level, maneuvers initiated by a harbinger ignore all immunities possessed by their targets. Favored Class Bonuses [ ] Any goblinoid race:  Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines. \n Blinkling: +1-ft. of movement for ill-tidings (only increasing the distance every 5 levels). \n Blue:  Add +1 foot of movement speed to the harbinger's grim news movement modes. \n Duergar:  Add 1/4 of a maneuver known from the Cursed Razor or Scarlet Throne disciplines. \n Eiremian: Add +1/4 of a maneuver known from the harbinger's dark focus disciplines. \n Gnome:  Add +1/4 of a maneuver known from the harbinger's dark focus disciplines. \n Half-elf:  Add +1/4 of a maneuver known from the harbinger's dark focus disciplines. \n Halfling:  Add +1 foot of movement speed to the harbinger's grim news movement modes. \n Half-orc:  Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines. \n Hexbreather:  Add 1/4 maneuvers known from the Cursed Razor or Veiled Moon disciplines. These maneuvers must be at least one level lower than the highest-level maneuvers the harbinger can learn. \n Human:  Add +1/4 of a maneuver known from the harbinger's dark focus disciplines. \n Lurker:  Add +1/5 to the harbinger's ill omens. \n Maenad:  Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines. \n Ophiduan:  Add +1/4 of a maneuver known from the Shattered Mirror or Steel Serpent disciplines. \n Thrallspawn: Add +1/4 use of grim news. \n Tiefling:  Add +1/4 of a maneuver known from the Black Seraph or Cursed Razor disciplines. \n Wulfkin:  +1/4 use of grim news. \n Xeph:  Add +1 foot of movement speed to the harbinger's grim news movement modes. Archetypes [ ] Crimson Countess Edge Lord Omen Rider Ravenlord Rosethorn Princess",
    "any goblinoid race: ": "Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines.",
    "blinkling:": "+1-ft. of movement for ill-tidings (only increasing the distance every 5 levels).",
    "blue: ": "Add +1 foot of movement speed to the harbinger's grim news movement modes.",
    "duergar: ": "Add 1/4 of a maneuver known from the Cursed Razor or Scarlet Throne disciplines.",
    "eiremian:": "Add +1/4 of a maneuver known from the harbinger's dark focus disciplines.",
    "gnome: ": "Add +1/4 of a maneuver known from the harbinger's dark focus disciplines.",
    "half-elf: ": "Add +1/4 of a maneuver known from the harbinger's dark focus disciplines.",
    "halfling: ": "Add +1 foot of movement speed to the harbinger's grim news movement modes.",
    "half-orc: ": "Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines.",
    "hexbreather: ": "Add 1/4 maneuvers known from the Cursed Razor or Veiled Moon disciplines. These maneuvers must be at least one level lower than the highest-level maneuvers the harbinger can learn.",
    "human: ": "Add +1/4 of a maneuver known from the harbinger's dark focus disciplines.",
    "lurker: ": "Add +1/5 to the harbinger's ill omens.",
    "maenad: ": "Gain a +1/4 bonus on damage rolls when using strikes from the harbinger's dark focus disciplines.",
    "ophiduan: ": "Add +1/4 of a maneuver known from the Shattered Mirror or Steel Serpent disciplines.",
    "thrallspawn:": "Add +1/4 use of grim news.",
    "tiefling: ": "Add +1/4 of a maneuver known from the Black Seraph or Cursed Razor disciplines.",
    "wulfkin: ": "+1/4 use of grim news.",
    "xeph: ": "Add +1 foot of movement speed to the harbinger's grim news movement modes."
  },
  "Mystic": {
    "adventures:": "Most mystics adventure to stretch the limits of their powers, learning to master the mysteries within their souls. Some do it to express their power in ways that suit their ethics, for good or for ill, and others travel to find others like themselves, to study and train with and hope to eventually learn more about why they are the way they are.",
    "characteristics:": "Mystics tend to be a very introspective lot, wielding a power so foreign to most with an intuitive sense of understanding. Many mystics follow ascetic lifestyles, hoping that the order and abstaining of life's vices will help them control their power. Others embrace their wild energies and move with the moment, pausing to reflect at the end of the day as to what drives their motivations.",
    "alignment:": "Any. Mystics do not follow any ethical or moral path, and choose their own destiny. Some cling to lawful alignments to master their powers, and others embrace chaotic alignments to freely express their talents.",
    "religion:": "Mystics who follow religion often find their faith with gods of battle, nature, magic, or freedom.",
    "background:": "Mystics universally have one thing in common, and that's a magical creature or magic-using being in their near family history. This power is an inherited consequence of such relation, and while it is not widely understood why it has chosen to manifest in such a way, the mystic's wild power is usually an expression of this relation's own power. Mystics are born, and must train to master their energies.",
    "races:": "Any member of any race could be a mystic, provided they had the ancestry and proper training available. Most commonly they are of thehuman,elven, andgnomeraces. Among monster races,koboldsand their draconic bloodlines are among the first and foremost experts in the realm of mysticism, and manyfeyorelementalblooded creatures as well.",
    "other classes:": "Mystics tend to chafe withsorcerersaround, as they see each other as failed expressions of the other. Otherwise, mystics find the most in common withrangersandmonksfor either their freedom or their discipline. Wizards find them interesting and enjoy studying their powers, and martially inclined characters find them to be steady and useful allies.",
    "role:": "A mystic will often find themselves in the role of both striker and party supporter. The glyphs they manifest will aid themselves and their allies, as their animus builds power and strength. Not as hardy as other warriors, however, mystics will find themselves needing the protection of their more robust allies from time to time.",
    "abilities:": "Wisdomis the primary attribute for the mystic, and this determines factors of their class features, maneuver saving throws, and their animus. As martial characters, a goodStrengthorDexteritywill help their ability to fight and a goodConstitutionscore helps with their otherwise modesthit points.",
    "starting age:": "Intuitive.",
    "starting wealth:": "4d6 x 10 gp (average 140 gp.) In addition, each character begins play with an outfit worth 10 gp or less.",
    "hit die:": "d8.",
    "class skills:": "The mystic's class skills are Acrobatics (Dex), Autohypnosis (Wis), Craft (Int), Intimidate (Cha), Knowledge (all) (Int), Perception (Wis), Perform (Cha), Profession (Wis), Sense Motive (Wis), Spellcraft (Int), Stealth (Dex), and Use Magic Device (Cha).",
    "skill ranks per level:": "4 +Int modifier.",
    "weapon and armor proficiency": "A mystic is proficient with all simple and martial weapons, katanas and wakizashis, and with light armor and shields (except tower shields).",
    "maneuvers": "A mystic begins her career with knowledge of seven martial maneuvers. The disciplines available to her are Elemental Flux , Mithral Current , Riven Hourglass , Shattered Mirror , Solar Wind , and Veiled Moon . Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Mystics may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it. Once the mystic knows a maneuver, she must ready it before she can use it (seeManeuvers Readied). A maneuver usable by mystics is considered an extraordinary ability unless otherwise noted in it or its discipline's description. A mystic's maneuvers are not affected byspell resistance, and she does not provokeattacks of opportunitywhen she initiates one. The mystic learns additional maneuvers at higher levels, as indicated on Table: Mystic. A mystic must meet a maneuver's prerequisite to learn it. SeeSystems and Usefor more details on how maneuvers are used. Upon reaching initiator level 4th, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the mystic can choose to learn a new maneuver in place of one she already knows. In effect, she loses the old maneuver in exchange for the new one. She can choose a new maneuver of any level she likes, as long as she observes the restriction on the highest-level maneuvers she knows; the mystic need not replace the old maneuver with a maneuver of the same level. She can swap only a single maneuver at any given level. A mystic's initiation modifier isWisdom.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Mystics may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "unquiet grave:": "Mystics may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "maneuvers readied/granted": "Granted Maneuvers and Alternate Recovery Methods \n \n \n If a mystic uses theLightning RecoveryorVictorious Recoveryfeats (or a similar method) to recover a maneuver, it is immediately added to her currently granted maneuvers. A mystic can ready five of her seven maneuvers known at 1st level, and as she advances in level and learns more maneuvers, she is able to ready more, but must still choose which maneuvers to ready. A mystic must always ready her maximum number of maneuvers readied. She readies her maneuvers by meditating for ten minutes. The maneuvers she chooses remain readied until she decides to meditate again and change them. The mystic does not need to sleep or rest for any long period of time in order to ready her maneuvers; any time she spends ten minutes in meditation, she can change her readied maneuvers. A mystic begins an encounter with all her readied maneuvers unexpended, regardless of how many times she might have already used them since she chose them. When she initiates a maneuver, she expends it for the current encounter, so each of her readied maneuvers can be used once per encounter (unless she recovers them, as described below). Mystics are unique among martial disciples in that they rely on surging, primal arcane forces within their being to fuel their martial maneuvers. Because of this, they do not have full control over their readied maneuvers; when a mystic readies her maneuvers, she selects two of her readied maneuvers to be immediately granted to her for use at any time (when these two maneuvers are used outside of combat, they recover on their own in the following round), with the rest of her initially randomized maneuvers waiting to be granted in combat. The remainder of her readied maneuvers are withheld and currently inaccessible until combat begins. If she is able to act in asurpriseround when combat begins, she is granted her maneuvers then as normal, but if she is caught unaware, she must wait until herinitiativebefore her maneuvers are granted (beyond the initial two). At the end of each of her combat turns, one previously withheld maneuver (randomly determined) is granted to her, and thus becomes accessible for her next turn and subsequent turns. She can freely choose to initiate any maneuver that is currently granted when her turn begins, but she cannot initiate a withheld maneuver. If the mystic chooses not to employ a maneuver in a given round, her currently granted maneuvers remain available, and a previously withheld maneuver is granted, as described above. In other words, it doesn't matter if she uses her maneuvers or not-at the end of each of her turns, one withheld maneuver from her selection of readied maneuvers is granted to her. Over the course of a few rounds, all the mystic's maneuvers will eventually be granted. A mystic can change the two readied maneuvers she has chosen to be immediately granted for use at any time by spending one minute meditating. If, at the end of the mystic's turn, she cannot be granted a maneuver because she has no withheld maneuvers remaining, she recovers all expended maneuvers, and a new group of readied maneuvers is granted to her, replacing her previously granted maneuvers if any remain unspent. She selects two of her choice (and gains the remainder of granted maneuvers as randomized selections, see below). At the end of her next turn, a withheld maneuver is granted to the mystic, and the process of surging power begins again. At 3rd level and again at 6th, 9th, 12th, 18th, and 20th levels, the number of maneuvers granted to the mystic at the beginning of an encounter and when she recovers her maneuvers increases by one. Unlike the mystic's initial granted maneuvers, these additional maneuvers are randomly determined (for example, at the beginning of an encounter, a 6th level mystic would choose two maneuvers to have access to, then randomly be granted two more). Editor's Note:  The text for granted maneuvers given here does not match the one given on the class' table; however, given the clear pattern in the table, it should be assumed to be the correct progression.",
    "stances known": "A mystic begins her career with knowledge of one stance from any discipline open to mystics. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, she can select an additional stance to learn. Unlike maneuvers, stances are not expended and the mystic does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently maintaining as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description. Unlike with maneuvers, a mystic cannot learn a new stance at higher levels in place of one she already knows.",
    "animus (su)": "A mystic's martial prowess is in part fueled by a reservoir of roiling, turbulent energy within her soul, and the passion and danger of combat causes this arcane energy to overflow outwards. This power, called animus, waxes and wanes with a mystic's use of her maneuvers in battle. Outside combat, a mystic has no animus to spend, but her inner power can still be used for more subtle arcane arts. Her levels in mystic count as arcane spellcaster levels for the purposes of qualifying for prerequisites (such as those ofitem creationfeats or theArcane Strikefeat), and if a mystic ever develops arcane spellcasting from another class, she may add her mystic level to her levels in that class to determine her overallcaster levelfor the purposes ofitem creationfeats. When a mystic enters combat, she gains an animus pool equal to 1 + her mystic initiation modifier (minimum 1) at the start of her first turn, and adds one point of animus to her animus pool at the start of each of her turns thereafter. Her animus pool persists for one minute after the last enemy combatant is defeated or the encounter otherwise ends. At the end of any round in which the mystic initiates a maneuver, she adds an additional point of animus to her pool. Certain abilities, such as some class features, maneuvers, and feats, require the mystic to expend points of animus to use. The primal power of animus can be used in several ways-the foremost of which is the augmentation of maneuvers. A mystic can spend points of animus to augment her maneuvers in the following ways, depending on her class level. If the mystic has the ability to augment her maneuvers in other ways, such as from another class feature or the maneuver itself, this cannot be combined with the augments granted by her animus class feature; she must choose which augmentation type to use when initiating the maneuver. Starting at 1st level, a mystic can spend a single point of animus to augment a maneuver as part of that maneuver's initiation action to apply one of the following effects to it (if applicable): Enhance Maneuver : For each point of animus spent, the mystic adds a cumulative +2insight bonusto all d20 rolls made (includingattack rolls, combat maneuver checks, and skill checks) when initiating that maneuver (maximum of three animus may be spent on this augmentation); if the maneuver allows the user to make multiple attacks, then this bonus only applies to the first attack. \n Increase DC : For each point of animus spent, the save DC of that maneuver increases by 1. When the mystic reaches 4th level, she can spend up to two points of animus on maneuver augmentation, rather than one, and she gains access to the following additional augmentations: Anima Burn : The mystic adds 1/2 her class level to damage rolls made during that maneuver. This augment costs two points of animus, and can only be applied once to a given maneuver. \n Increase Potency : For each point of animus spent, the mystic may ignore 10 points ofenergy resistanceor 5 points ofdamage reduction. When the mystic reaches 9th level, she can spend up to three points of animus on maneuver augmentation, and gains access to the following additional augmentation: Animus Rush : The mystic make move up to her base movement speed as part of the initiation action for the maneuver before initiating the strike. This is ateleportationeffect and the mystic must clearly see her destination. This augmentation costs three points of animus. \n Increase Range : The mystic may target a creature within 30 feet with a strike that normally uses a melee attack. Resolve the strike normally, as if the targeted creature was within the mystic's melee reach. This augmentation costs two points of animus. At 13th level, a mystic can spend up to four points of animus on maneuver augmentation, and at 19th level, she can spend up to five points of animus per augmentation.",
    "elemental attunement (su)": "A mystic contains incredible elemental power within her body, surging energies that constantly flow through her blood and muscle. Bringing these energies to bear is as easy as breathing for a mystic, shifting the flow of power with the subtle movements of her martial stances. When a mystic readies her maneuvers, she may select one of the following elements (and associated energy type) to be heractive element: air (electricity), earth (acid), fire (fire), and water (cold). After readying maneuvers, a mystic can change her active element by taking astandard actionto focus inwards, or by expending one point of animus as afree actionwhile assuming a new stance. Whenever she initiates a maneuver that deals damage, she may spend one point of animus as part of its initiation action to change all damage the maneuver deals to her active element's associated energy type. For example, if a mystic whose active element is currently air initiated the cursed fate Veiled Moon strike, she could spend one point of animus to change her attack's damage (including the strike's bonus damage) to from her weapon's normal damage type to electricity damage. If the mystic has access to theElemental Fluxdiscipline, then her active element from this class feature is the same as her active element forElemental Fluxmaneuvers. If she is psionic, she can change her active energy type whenever she changes her active element, and vice versa. Her active energy type need not match her active element.",
    "blade meditation (su)": "When a mystic finds that her martial power is beginning to wane or that few options remain available for use, she can pause in battle, drawing on her inner well of animus to reinvigorate her body and mind. As afull-round action, a mystic can spend one point of animus to grant herself all her remaining withheld maneuvers, then immediately expend them in a raging cadence of arcane power. As there are no remaining maneuvers to be granted, a new set of maneuvers is granted to the mystic at the end of her turn, as normal. In addition, until the start of her next turn, creatures that target the mystic with melee attacks are engulfed in the explosion of energy, taking 1d6 points of damage of heractive element'sassociated energy type, plus an additional 1d6 points of damage for every two points of animus remaining in the mystic's animus pool.",
    "bonus feat": "At 2nd level and every five levels thereafter, a mystic gain a bonuscombat oritem creationfeat. She must meet the prerequisites for these feats as normal.",
    "arcane defense (ex)": "Starting at 2nd level, the sorcerous power within a mystic's body makes her resilient to the supernatural. These energies defend her from magical and psionic powers, granting her a +1insightbonus to her AC and saving throws against psionic powers, psi-like abilities, spells, andspell-like abilities. This bonus increases by +1 at 6th level, and again at 11th level, 16th level, and 20th level.",
    "elemental glyph (su)": "Starting at 3rd level, a mystic learns to aid her friends with the arcane power of the elements. Although at first this surging energy was raw and unformed, she has begun to master this ability, and can use it to empower her allies, granting them benefits in combat. As amove action, the mystic can spend one point of animus to apply an elemental glyph to a number of allies equal to her mystic initiation modifier modifier within her sight. The effect of this glyph depends on the element it is associated with, but all glyphs last for a number of rounds equal to 1 + the mystic's initiation modifier. A mystic is not limited to casting glyphs of heractive element(as darkness, illumination, and metal have no elemental type). Allies may only be affected by one of her glyphs at a time, with new glyphs ending the current glyph in effect and replacing it on the affected ally. The benefits of these glyphs are cumulative (for example, an 8th level mystic grants both the 3rd level and 8th level benefits to her allies). Different glyphs from different mystics may apply to the same target. Glyphs aresupernaturalabilities and not subject to spells or effects likedispel magic but do not function within anantimagic fieldor similar effect. Air : The glyph of air fills the mystic's allies with energy and speed. At 3rd level, all movement speeds possessed by each ally under the effect of the glyph gain a +10-footenhancement bonusto speed. In addition allies may choose to make one turn of up to 90 degrees while makingchargeattacks. \n At 8th level, thisenhancement bonusto movement speed increases to 30 feet, and they may makeAcrobaticschecks to jump as if they had a running start. \n At 13th level, allies affected by the glyph of air gain the ability to move up to 30 feet as aswift action. This movement provokesattacks of opportunityas normal. \n At 19th level, whenever one of the mystic's allies uses the glyph of air'sswift actionmovement ability, they can make a single attack with a weapon they are wielding at their highestbase attack bonusat any point during this movement. Darkness : Though darkness often connotates evil, for the mystic its shroud offers both protection and insight, allowing the mystic's allies tactical avenues that they would otherwise be unable to access. At 3rd level, allies affected by the glyph of darkness gainconcealment(20% miss chance). \n At 8th level, affected allies gaindarkvisionand the effects of asee invisibilityspell out to a range of 60 feet. \n At 13th level, affected allies are shrouded in a pitch-black veil, gaining totalconcealment(50% miss chance). \n At 19th level, affected allies gain theblindsighttrait with a range of 30 feet. Earth : The dour, steadfast nature of earth allows the mystic's allies to better stand their ground and weather assaults At 3rd level, this glyph makes allies more difficult to move against their will. Affected allies gain a bonus to theirCMDequal to the mystic's initiation modifier. \n At 8th level, affected allies gainDR/adamantineequal to the mystic's initiation modifier. \n At 13th level, affected allies gainresistanceto all energy types equal to the mystic's class level. \n At 19th level, the first time during the encounter that an affected ally is reduced to 0 or fewer hit points, they are instead reduced to 0hit pointsand automaticallystabilize. Theirhit pointscannot be reduced below 0 for the rest of the round. Once this effect triggers on an ally, that ally cannot gain its effect again until the end of the encounter. In addition, affected are allies are immune tobleed damage. Fire : The unquenchable flames of passion drive the mystic's allies to feats of glory. At 3rd level, affected allies gain a circumstance bonus onattack rolls equal to 1/4 the mystic's class level (minimum +1). \n At 8th level, affected allies add 1/2 the mystic's class level as fire damage to attacks they make. \n At 13th level, affected allies' attacks ignore a number of points ofenergy resistanceequal to the mystic's class level. \n At 19th level, whenever an affected ally is targeted by a melee attack, the attacker takes fire damage equal to the mystic's class level, regardless of whether or not the attack hits. Illumination : The light of the universe reveals truth wherever it hides. At 3rd level, affected allies' attacks ignore the miss chance fromconcealmentgranted to targets by anything less than totalconcealment. \n At 8th level, affected allies gain a circumstance bonus onWillsaving throws againstillusionspells and effects equal to the mystic's initiation modifier. \n At 13th level, affected allies gain the effects of atrue seeingspell out to a range of 30 feet. \n At 19th level, affected allies are protected from any falsehood, gaining the effects of amind blankspell. Metal : Sturdy and unyielding like the forged iron from which it takes its name, the glyph of metal imparts resolute strength to the mystic's allies. At 3rd level, affected allies increase their natural armor bonus to AC by an amount equal to 1/4 the mystic's class level (minimum +1). \n At 8th level, affected allies gain a circumstance bonus onFortitude saves equal to 1/4 the mystic's class level (minimum +1). \n At 13th level, affected allies' attacks ignore a number of points ofdamage reductionandhardnessequal to the mystic's initiation modifier. \n At 19th level, affected allies gaindamage reduction/ equal to the mystic's initiation modifier and gainspell resistanceequal to 15 + the mystic's class level. Water : Fluid and changeable, the glyph of water grants allies flexibility in both their movement and their thinking. At 3rd level, affected allies gain a circumstance bonus to theirCMB and onSwimchecks equal to the mystic's initiation modifier. \n At 8th level, affected allies ignore difficult terrain when they move. \n At 13th level, affected allies gain the effects of afreedom of movementspell. \n At 19th level, affected allies gainfast healing10.",
    "mystic artifice (su)": "Starting at 4th level, a mystic is able to channel her animus into her craft, substituting primal arcane energies in place of more ordinary spells. When crafting an item, the mystic uses her initiator level as hercaster levelto determine how potent a creation she can and for the purposes of meetingcaster levelprerequisites. In order to create a spell trigger or spell completion item, the mystic's initiator must be at least the minimum required to cast the spell or spells in question. When attempting to create a magical item for which she does not possess a prerequisite spell, the mystic can attempt to replicate the spell through her innate power with aSpellcraftcheck (DC 15 + the level of the spell being replicated). If successful, she can create the item as if she had cast the prerequisite spell. The mystic must possess any material components necessary for casting the spell that she is replicating. If the item being created requires multiple spells, she must make this check for each spell she intends to replicate. If she fails the skill check, she may not try again for that spell while creating that item-the item creation DC increases as normal for the creation of an item without a prerequisite spell in such a case.",
    "withstand spell (su)": "Starting at 5th level, the mystic's natural instincts with magic work to protect her, guiding her reactions against offensive spells cast by her enemies and allowing her to siphon off a small amount of that energy for her own use. If the mystic is targeted by a spell,spell-like ability, psionic power, or psi-like ability that normally would have a lesser effect (such as a partial effect) on a successfulFortitudeorReflexsaving throw, she may make aWillsaving throw instead of the effect's normal save. If thatWill saving throw is successful, she is completely unaffected by the spell or power, taking no damage and suffering no ill effects. If she fails the saving throw, she suffers the effect as normal, and adds one point of animus to her animus pool. The mystic must be unencumbered and wearing light or no armor to use this ability. This ability does not protect the mystic from traps, extraordinary orsupernaturalabilities, or any other effects that require aFortitudeorReflexsave. Ahelplessmystic does not gain the benefit of withstand spell.",
    "instant enlightenment (ex)": "Starting at 6th level, a mystic is capable of drawing deep on her training to channel the untapped energies within her, granting her an infinitesimal moment of perfect clarity. Once per day as afree action, the mystic may expend one granted maneuver and instantly replace it with another maneuver she knows. This maneuver is added to her currently granted maneuvers and readied for use, replacing the previous maneuver. At 10th level and every four levels thereafter, the mystic can use this ability one additional time per day.",
    "quell magic (su)": "Starting at 9th level, a mystic can channel her animus to act as a sort of null-magic energy, smothering active magical effects with its flow. In order to use this ability, the mystic must have identified an ongoing spell or power through aSpellcraftcheck or other method. As astandard action, she can spend a number of points of animus equal to that spell or power's level to suppress (as if by anantimagic fieldspell) that spell or power for a number of rounds equal to her mystic initiation modifier. Time spent suppressed counts against the suppressed spell or power's duration. This ability can only be used on effects within 30 feet, although the mystic does not need to identify the effect while it is within that range, and it remains suppressed even if it leaves that range.",
    "font of animus (su)": "At 15th level, a mystic gains the ability to draw in energy from the world around her, converting it into animus to fuel her own primal power. As amove action, the mystic can add a number of points of animus to her animus pool equal to 1d6 + her mystic initiation modifier. Unlike other animus abilities, this may be used outside of combat to generate a small pool of animus that persists for one minute outside of combat. A mystic cannot use this ability multiple times to accumulate animus; additional attempts only reset her animus pool to 1d6 + her mystic initiation modifier. The mystic may use this a number of times per day equal to her mystic initiation modifier + 1 (minimum of 1).",
    "glyph mastery (su)": "At 20th level, a mystic's control over her elemental powers are strong enough that she can manifest two elemental glyphs at the same time. As amove action, the mystic may spend two points of animus and manifest an elemental glyph of any two elements, regardless of heractive element. These glyphs otherwise function as her elemental glyphs class feature. Favored Class Bonuses [ ] Aasimar:  Add +1/5 to the mystic's arcane defense bonus. \n Any goblinoid race:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Blue:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Eiremian:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Elan:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Elves:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Forgeborn:  Add +1/5 to the mystic's arcane defense bonus. \n Gnome:  Add +1/4 of a maneuver known from theShattered MirrororSolar Winddisciplines. \n Half-elf:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Halfling:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Half-orc:  Gain a +1/4 bonus on damage rolls when using strikes that deal acid, cold, electricity, or fire damage. \n Human:  Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat. \n Maenad:  Add +1/4 of a maneuver known from theElemental FluxorMithral Currentdiscipline. \n Tiefling:  Add +1/4 of a maneuver known from theElemental FluxorShattered Mirrordisciplines. \n Xeph:  Add +1/4 of a maneuver known from theMithral CurrentorRiven Hourglassdisciplines. Archetypes [ ] Aurora Soul Bloodstained Scion Gunsmoke Mystic Knight-chandler",
    "aasimar:": "Add +1/5 to the mystic's arcane defense bonus.",
    "any goblinoid race:": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "blue: ": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "eiremian: ": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "elan:": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "elves: ": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "forgeborn:": "Add +1/5 to the mystic's arcane defense bonus.",
    "gnome: ": "Add +1/4 of a maneuver known from theShattered MirrororSolar Winddisciplines.",
    "half-elf: ": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "halfling:": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "half-orc: ": "Gain a +1/4 bonus on damage rolls when using strikes that deal acid, cold, electricity, or fire damage.",
    "human:": "Add +1/4 point of animus to the mystic's starting animus pool at the beginning of combat.",
    "maenad: ": "Add +1/4 of a maneuver known from theElemental FluxorMithral Currentdiscipline.",
    "tiefling:": "Add +1/4 of a maneuver known from theElemental FluxorShattered Mirrordisciplines.",
    "xeph: ": "Add +1/4 of a maneuver known from theMithral CurrentorRiven Hourglassdisciplines."
  },
  "Stalker": {
    "adventures:": "Stalkers adventure for many reasons, but most do so either as part of a guild of fellow stalkers on a mission, for money and profit, or for deeper, often darker purposes of the heart. Some adventure for the test of their skill, but this is slightly rarer; whatever the reason, the path of the stalker is often a self-absorbed one.",
    "characteristics:": "Stalkers universally are very introspective people, they rely so heavily upon their intuitive reactions to situations and their heightened reflexes through athletic skill that they usually have an air of detachment. Some are braggarts, but many are quiet and calm, paying close attention to their surroundings should they need to use their lethal skills.",
    "alignment:": "Any. Stalkers do not lean to any particularalignmenttrend, running the gamut of all walks of life.",
    "religion:": "Some stalkers are deeply religious, finding solace in their meditations to gods of night, death, travels, or revelry. Other stalkers find no use for gods, for if the gods protected and cared for their flock, then they wouldn't make their followers so easy to kill.",
    "background:": "Stalkers often arise from the poor and underprivileged who live in city slums, trained from their youth to be unfeeling killers. Others are trained in remote areas in a more monastic fashion, taught to be warriors who strike from the shadows. The training of stalkers can also be an individual thing, each master teaching a student in their own way, the way they were taught.",
    "races:": "Humansand outcast races tend to be drawn to the path of the stalker.Half-orcsandhalf-elvesmake up a majority of the non-human stalkers, with goblinoids coming in next.",
    "other classes:": "Stalkers get on well withroguesandrangersdue to having complementary roles. Paladins andclericsoften chafe when partied with stalkers, as their reputation as killers (rightly or wrongly) often sours opinions of them. Other classes generally have a neutral opinion of stalkers, unless that stalker has come for them.",
    "role:": "Striker. In the party, the stalker follows the heavily armoredfighterinto combat, using them as shields and distractions so they can inflict maximum damage on their foes. In addition, the stalker can serve quite well as the party scout, finding danger and warning the party before they stumble upon it.",
    "abilities:": "DexterityandWisdomare prime attributes for stalkers, as many of their skills are governed by these abilities and their combat capabilities areaugmentedby them as well.Wisdomis the primary initiating attribute for stalker.Strengthis valuable for damage, but can fall behindConstitutionfor endurance in battle.",
    "starting wealth": ": 4d6 x 10 gp (average 140 gp).",
    "starting age:": "Trained",
    "hit die:": "d8",
    "class skills:": "The stalker's class skills (and the key ability for each skill) are: Acrobatics (Dex), Appraise (Int), Bluff (Cha), Climb (Str), Craft (Int), Disable Device (Dex), Disguise (Cha), Escape Artist (Dex), Heal (Wis), Intimidate (Cha), Knowledge (local) (Int), Knowledge (martial) (Int), Knowledge (nature) (Int), Knowledge (religion) (Int), Perception (Wis), Profession (Wis), Sense Motive (Wis), and Stealth (Dex).",
    "skill ranks per level:": "6 +Int modifier",
    "weapon and armor proficiency": "Stalkers are proficient with all simple and martial weapons, and with light armor. Stalkers are not proficient with shields of any kind.",
    "maneuvers": "A stalker begins his career with knowledge of six martial maneuvers. The disciplines available to him are Broken Blade , Solar Wind , Steel Serpent , Thrashing Dragon , Veiled Moon , andeither Riven Hourglass or Tempest Gale . If he does not have that discipline's associated skill as a class skill, he gains it as a class skill. Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Stalkers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it. Once he knows a maneuver, he must ready it before he can use it (see Maneuvers Readied, below). A maneuver usable by stalkers is considered an extraordinary ability unless otherwise noted in its description. His maneuvers are not affected byspell resistance, and he does not provokeattacks of opportunitywhen he initiates one. He learns additional maneuvers at higher levels, as shown above. The stalker must meet a maneuver's prerequisite to learn it. See the Systems and Use chapter. Upon reaching initiator level 4th, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the stalker can choose to learn a new maneuver in place of one he already knows. In effect, the stalker loses the old maneuver in exchange for the new one. The stalker need not replace the old maneuver with a maneuver of the same level. He can choose a new maneuver of any level he likes, as long as he observes his restriction on the highest-level maneuvers he knows. The stalker can swap only a single maneuver at any given level. A stalker's initiator modifier isWisdom.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Unquiet Grave :  Stalkers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "unquiet grave:": "Stalkers may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "maneuvers readied": "A stalker can ready four of his six starting maneuvers, but as he advances in level and learns more maneuvers, he must choose which maneuvers to ready. He readies his maneuvers by meditating and focusing his ki for 10 minutes. The maneuvers he chooses remainreadieduntil he decides to repeat this again and change them. Stalkers do not need to sleep or be well rested to ready their maneuvers; any time he spends 10 minutes in meditation, he can change hisreadiedmaneuvers. He may not ready any individual maneuver more than once. He begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times he may have already used them since he chose them. When the stalker initiates a maneuver, he expends it for the current encounter, so each of hisreadied maneuvers can be used once per encounter (until they are recovered, see below). Stalkers may recover their maneuvers in one of two ways. The stalker may either center his awareness of the combat momentarily as astandard actionand recover a single expended maneuver of his choice. Alternately, he may recover hisstalker initiation modifier in expended maneuvers (min of 2) as a full round action that does not provokeattacks of opportunity, centering his spirit completely to re-align his perceptions of the battle and change his place in it. When recovering his maneuvers in this way, he may move up to his base speed and adds a +4insight bonus to hisArmor Classas his ki defends his form while he re-centers himself. In addition, the next attack he makes this encounter adds hisdeadly strike damage if it hits.",
    "stances known": "Stalkers begin play with knowledge of one stance from any discipline open to stalkers. At the indicated levels (see class table), the stalker selects an additional new stance. Unlike maneuvers, stances are not expended and he does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the stalker cannot learn a new stance at higher levels in place of one he already knows.",
    "ki pool (su)": "At 1st level, a stalker gains a pool of ki points,supernaturalenergy he can use to accomplish amazing feats. The number of points in the stalker's ki  poolis equal to 1/2 her stalker level + his stalker initiation modifier (minimum of 1). At 1st level, the stalker may spend 1 point of ki to grant himself a +4insight bonusto a singlePerceptionorSense Motivecheck as animmediate action, as he uses his ki to feel out the vibrations of others and their hidden motives. At 5th level, the stalker may use his deadly strikes in conjunction with his combat insight to \"read\" his opponent's defenses and deliver devastating blows beyond his foe's guard. The stalker spends one point of ki as aswift actionto read his target opponent, and may apply hisdeadly striketo all martial strikes initiated by the stalker for a number of rounds equal to hisstalker initiation modifier against this target. If the stalker scores a successfulcritical hitagainst the target while this ability is active, then he activates deadly strike as normal. At 7th level, the stalker may spend 1 point from his ki poolto gain a +4insight bonuson a saving throw as animmediate action. At 9th level, the stalker can delve into his subconscious in battle and remember key lessons from his training. The stalker envisions potential scenarios where martial abilities he has notreadiedcome into play and gains a momentary burst of martial insight. A number of times per day equal to his stalker initiation modifier, the stalker can spend one ki point as aswift actionand trade onereadiedmaneuver for another maneuver known of the same level or lower. The new maneuver is immediatelyreadiedand accessible for use. The character may initiate this maneuver and recover it as if he had prepared at the beginning of the day (or when ever the stalkerreadiedhis maneuvers last) until the end of the combat encounter. The ki poolis replenished each day after 8 hours of rest and meditation; these hours do not need to be consecutive. If the stalker possesses levels in another class that grants points to a ki pool, stalker levels stack with the levels of that class to determine the total number of ki points in the combined pool, but only one ability score modifier is added to the total. The choice of which score to use is made when the second class ability is gained, and once made, the choice is set. The stalker can now use ki  points from this pool to power the abilities of every class he possesses that grants a ki pool.",
    "deadly strike (ex)": "The stalker is capable of maximizing his deadliness whenever he lands a critical blow upon his opponent, opening his target up for future punishment as the stalker becomes attuned to his prey. Whenever the stalker scores a successfulcritical hitagainst a creature, his deadly strike ability activates against that creature for a number of rounds equal to his stalker initiation modifier. Deadly strike inflicts extra damage, to only this target creature, on all of the stalker's attacks. This extra damage is 1d6 at 1st level, and increases by 1d6 for every four stalker levels thereafter. When the stalker scores acritical hit, this extra damage is not multiplied, it is simply added to the damage. If the stalker scores a successfulcritical hitduring the time his deadly strike is active, the duration of this ability is extended by one round (no more than one extension can be made per round). Ranged attacks can count as deadly strikes only if the target is within 30-ft.. Deadly strike is more effective with weapons with higher critical multipliers, such as scythes and battle axes. Weapons with a x3 critical multiplier inflict damage with deadly strikes using a d8 instead of a d6, and weapons with a critical multiplier of x4 use d10's. Damage multipliers higher than x4 use d10's for deadly strikes damage. Deadly strike may not be used with weapons that inflict non-lethal damage. The stalker must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. Creatures immune to critical hits or precision damage cannot be targeted by a deadly strike. A stalker cannot deadly strike while attacking a creature who hasconcealment.",
    "stalker arts": "As a stalker gains experience, he learns a number of arts that aid him and confound his foes. Starting at 1st level, a stalker gains one art; he gains an additional art at 3rd level and new arts every four class levels attained after 3rd level. A stalker cannot select an individual art more than once (unless noted). ( Stalker Arts can be found here )",
    "combat insight (su)": "At 2nd level, the keen senses and awareness of the stalker delivers him a sort of sixth sense. This insight performs as an intuitive alarm, alerting him of danger. Through his rigorous practice and learning to trust his instincts and intuition to an unearthly level, the senses of the stalker are unusually sharp. At 2nd level, the stalker's combat sense opens his third eye, granting him defensive reflexes that protect him in combat. The stalker may add hisstalker initiation modifier to hisinitiativescore and toReflexsaving throws as aninsight bonus. At 4th level, the heightened perceptions of the stalker allow him to know when his prey could get the jump on him, granting him theuncanny dodgeclass feature (seerogueclass for details). At 8th level, the killer's instinct in the stalker is honed to a razor's fine edge, allowing him to add hisstalker initiation modifier as acompetence bonusto confirm critical hits. This ability counts as if the character possessed theCritical Focusfeat, and for the purposes of taking critical feats that the character qualifies for. The character may not select theCritical Focusfeat once he has this ability, and should he have it before he gains this ability, he loses theCritical Focusfeat and may select acritical featin its place. At 12th level, the stalker's insight allows him to funnel the ki of his foes into his form with his deadly attacks. The character can recover a single expended maneuver when he scores a successfulcritical hitagainst a living creature. This ability does not function againstconstructs,undead, or creatures with under 1/2 HD. At 18th level, the heightened precognitive abilities of the stalker manifest in his ability to sense things around him that others cannot, granting himblindsightof 30-ft.. This is a supernatural ability.",
    "dodge bonus (ex)": "The stalker's heightened perception of danger allows him to defend himself from attacks as they are made against him, anticipating the attacks as they come. A stalker gains a +1dodge bonusto hisArmor Class at 2nd level, which improves by an additional +1 every four stalker levels thereafter. When recovering maneuvers as a full round action, the character may add his stalker initiation modifier to his AC as an additionaldodge bonus; his defensive precognition being heightened by centering his ki through maneuver recovery.",
    "blending (su)": "At 6th level the stalker's natural attunement to the flow of ki in other people grants him insight in reading others and avoiding their notice. The character gains a +2insight bonustoPerception,Sense MotiveandStealthchecks. At 16th level, the stalker's abilities improve further, and the character is permanently under the effects of a pass without trace  spell.",
    "dual strike (ex)": "Once per day at 10th level, the stalker's deadly skill in combat improves, allowing him to initiate two martial strikes as a full round action. The strikes the stalker initiates must have an initiation action of onestandard action, and he must have both strikesreadied. Boosts may not be applied to a dual strike due to the need to concentrate on two separate martial movements. When a dual strike is used, the action must be declared beforehand when used, both strikes are resolved separately and are expended. At 14th level the character may use dual strike twice per day, and three times per day at 18th level.",
    "retributive ki (su)": "At 20th level, the stalker's mystical ki power allows for him to generate a powerful burst of energy to gain retribution on those who would injure him. When the stalker is harmed by an attack, spell, or ability of an enemy, as animmediate actionhe may spend two ki points to initiate a martial strike that he hasreadied(with an initiation action of onestandard action) in retaliation against that attack. He uses the range of the attacker's ability as the range of his strike, creating a phantom echo of himself with his ki (as with the phantom reach art) that rushes out and strikes his attacker if they are outside of the stalker's normal reach. Use of this ability expends his strike as normal, and the strike functions as normal otherwise. Favored Class Bonuses [ ] Aellar: Gain 1/6 of a new stalker art. \n Any goblinoid race:  Gain 1/4 of a stalker art. \n Atstreidi:  Gain 1/6 of a stalker art. \n Blinkling:  +1/4 ki point per level. \n Blue:  Gain 1/4 of a stalker art. \n Dreige:  Add 1/6 of a new stalker art. \n Dromite:  Add +1/4 to insight bonus to AC when the stalker recovers maneuvers. \n Duergar:  Add +1/2 point to the stalker's ki pool. \n Dwarves:  Add +1/4 to insight bonus to AC when the stalker recovers maneuvers. \n Elves:  Gain a +1/5 dodge bonus to AC. \n Gnome:  Gain 1/4 of a stalker art. \n Half-elf:  Gain 1/4 of a stalker art. \n Half-gnoll:  Add +1/4 of a d6 to deadly strike damage. \n Half-goblin:  Add +1/6 of a new stalker art. \n Half-orc:  Add +1/4 of a maneuver known from theBroken BladeorSteel Serpentdisciplines. \n Half-sahuagin:  Add +1/6 of a d6 of the stalker's deadly strike. \n Halfling:  Gain a +1/5 dodge bonus to AC. \n Houri:  Add +1/3  ki  point. \n Human:  Add +1/2 point to the stalker's ki pool. \n Kestrel:  Add +1/2 racial bonus on Stealth checks. \n Kijin:  Gain +1/6 of a new stalker art. \n Lasher:  Gain +1/6 of a new stalker art. \n Lurker:  Add +1/6 of an extra Deadly Strike die. \n Merg:  Add +1/6 of a new Deadly Strike die. \n Murk:  Add +1/6 of an extra deadly strikes die. \n Oggr:  Add +1/4 maneuvers known from the Broken Blade or Thrashing Dragon disciplines. These maneuvers must be at least one level below the highest level of maneuvers the stalker can learn. \n Ophiduan:  Add +1/4 of a maneuver known from theSteel SerpentorVeiled Moondisciplines. \n Rana:  Add +1/4 racial bonus to Stealth checks. \n Spring Child:  Add +1/2 to the stalker's  ki  pool. \n Sthein:  +1/4 maneuver known of the Steel Serpent or Thrashing Dragon disciplines. These maneuvers must be at least one level below the highest level of maneuvers the stalker can learn. \n Tiefling:  Gain 1/4 of a stalker art. \n Wulfkin:  Gain 1/6 of a new stalker art. Archetypes [ ] Brutal Slayer Bushi Judge Privateer Soul Hunter Vigilante",
    "aellar:": "Gain 1/6 of a new stalker art.",
    "any goblinoid race:": "Gain 1/4 of a stalker art.",
    "atstreidi: ": "Gain 1/6 of a stalker art.",
    "blinkling:": "+1/4 ki point per level.",
    "blue:": "Gain 1/4 of a stalker art.",
    "dreige:": "Add 1/6 of a new stalker art.",
    "dromite:": "Add +1/4 to insight bonus to AC when the stalker recovers maneuvers.",
    "duergar:": "Add +1/2 point to the stalker's ki pool.",
    "dwarves:": "Add +1/4 to insight bonus to AC when the stalker recovers maneuvers.",
    "elves:": "Gain a +1/5 dodge bonus to AC.",
    "gnome:": "Gain 1/4 of a stalker art.",
    "half-elf:": "Gain 1/4 of a stalker art.",
    "half-gnoll: ": "Add +1/4 of a d6 to deadly strike damage.",
    "half-goblin: ": "Add +1/6 of a new stalker art.",
    "half-orc:": "Add +1/4 of a maneuver known from theBroken BladeorSteel Serpentdisciplines.",
    "half-sahuagin: ": "Add +1/6 of a d6 of the stalker's deadly strike.",
    "halfling:": "Gain a +1/5 dodge bonus to AC.",
    "houri: ": "Add +1/3 ki point.",
    "human:": "Add +1/2 point to the stalker's ki pool.",
    "kestrel: ": "Add +1/2 racial bonus on Stealth checks.",
    "kijin: ": "Gain +1/6 of a new stalker art.",
    "lasher: ": "Gain +1/6 of a new stalker art.",
    "lurker:": "Add +1/6 of an extra Deadly Strike die.",
    "merg: ": "Add +1/6 of a new Deadly Strike die.",
    "murk: ": "Add +1/6 of an extra deadly strikes die.",
    "oggr: ": "Add +1/4 maneuvers known from the Broken Blade or Thrashing Dragon disciplines. These maneuvers must be at least one level below the highest level of maneuvers the stalker can learn.",
    "ophiduan:": "Add +1/4 of a maneuver known from theSteel SerpentorVeiled Moondisciplines.",
    "rana: ": "Add +1/4 racial bonus to Stealth checks.",
    "spring child: ": "Add +1/2 to the stalker's ki pool.",
    "sthein: ": "+1/4 maneuver known of the Steel Serpent or Thrashing Dragon disciplines. These maneuvers must be at least one level below the highest level of maneuvers the stalker can learn.",
    "tiefling:": "Gain 1/4 of a stalker art.",
    "wulfkin: ": "Gain 1/6 of a new stalker art."
  },
  "Warder": {
    "adventures:": "Warders adventure to further their employer's missions, to serve on battlefields as protectors and champions, or to protect those that they care about. Some warders adventure to forge kingdoms of their own, battle tyranny, fight others of their kind for honor, or to live simply and by their own code.",
    "characteristics:": "Warders are always protective of people they deem in their care, be it a superior, their friends, or fellow soldiers of fortune. Many warders are proud, intelligent individuals who study tactics and maps as well while training daily with their associates to better suit their style towards their defense.",
    "alignment:": "Any, but most are lawful; the moral portion of theiralignment is either up to them or their inclusion in their sect.",
    "religion:": "Many warders are religious, often following gods of war, chivalry, and sacrifice. Some follow gods of tyranny or justice, and others follow gods that stand for the good of their race.",
    "background:": "Warders find their place in their society based upon their line of adventuring. Some warders are regarded with great respect as leaders and guardians while others are feared and hated for their tyrannical ways. Many are respected and treated well in the hopes that if trouble comes, the warder will come to help those who showed them kindness.",
    "races:": "Nearly allhumanoidraces have warders amongst them.Dwarves,half-orcs, andhumansmake up the larger majority of warders in more civilized society, but there are a minority ofhalflingsandgnomesthat guard their kind from harm. Whileelvespossess the tactical prowess to make great warders, their fragile bodies are often not enough for the physical rigors of the profession. While some warders are restrictive to whom they'll share their secrets, it's largely agreed that the more monstrous races tend to be excluded. Hobgoblins, of the monstrous races, are by far the largest exception to that stereotype.",
    "other classes:": "Warders get on well with those of a more orderly and martial bent, naturally befriendingpaladins,monks, andfighters. Rogues and warders don't exactly see eye to eye, whilerangersandsorcerers might find a warder's presence restrictive. Wizards and warders appreciate many of their shared facets in learning, and warders widely recognize the importance ofclericsin both martial and spiritual matters.",
    "role:": "Defender. Warders are natural guardians and protectors of the weaker members of the party, and are the ones who can take the most damage on the front line. They also double as being coordinators on the battlefield, helping their teammates and providing support for them both defensively and offensively.",
    "abilities:": "StrengthandConstitutionare prime attributes for warders, ruling over the majority of their combat prowess.Intelligencealso plays a big role in their day to day life, as it is both their primary initiation attribute and aids in their more mundane skills.",
    "starting wealth": ": 5d6 x 10 gp (average 175 gp).",
    "starting age:": "Self-Taught",
    "hit die:": "d12",
    "class skills: ": "The warder's class skills (and the key ability for each skill) are: Acrobatics (Dex), Bluff (Cha), Climb (Str), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Intimidate (Cha), Knowledge (history) (Int), Knowledge (martial) (Int), Knowledge (nobility and royalty) (Int), Profession (Wis), Ride (Dex), Survival (Wis), and Swim (Str).",
    "skill ranks per level:": "4 +Int modifier",
    "weapon and armor proficiency": "Warders are proficient with all simple and martial melee weapons, with all armor, and with shields (including tower shields).",
    "maneuvers": "A warder begins her career with knowledge of five martial maneuvers. The disciplines available to her are Broken Blade , Golden Lion , Iron Tortoise , Primal Fury , and either Eternal Guardian or Piercing Thunder to her list of available disciplines. If she does not have that discipline's associated skill as a class skill, she gains it as a class skill. Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Brutal Crocodile :  Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill. Once she knows a maneuver, she must ready it before she can use it (see Maneuvers Readied, below). A maneuver usable by warders is considered an extraordinary ability unless otherwise noted in its description. Her maneuvers are not affected byspell resistance, and she does not provokeattacks of opportunitywhen she initiates one. She learns additional maneuvers at higher levels, as shown on Table: The Warder. The warder must meet a maneuver's prerequisites to learn it. See the Systems and Use chapter. Upon reaching initiator level 4th, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the warder can choose to learn a new maneuver in place of one she already knows. In effect, the warder loses the old maneuver in exchange for the new one. The warder need not replace the old maneuver with a maneuver of the same level. She can choose a new maneuver of any level she likes, as long as she observes her restriction on the highest-level maneuvers she knows. The warder can swap only a single maneuver at any given level. A warder's initiation modifier isIntelligence.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Brutal Crocodile :  Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "brutal crocodile:": "Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill.",
    "leaden hyena:": "Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill.",
    "maneuvers readied": "A warder can ready three of her five starting maneuvers, but as she advances in level and learns more maneuvers, she must choose which maneuvers to ready. She readies her maneuvers by going over battle tactics, through weapon drills, or spending time meditating inprayerfor 10 minutes. The maneuvers she chooses remainreadieduntil she decides to repeat this again and change them. Any given maneuver may only bereadiedonce. Warders do not need to sleep or be well rested to ready their maneuvers; any time they spend 10 minutes in practice or meditation, they can change theirreadiedmaneuvers. She begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times she may have already used them since she chose them. When the warder initiates a maneuver, she expends it for the current encounter, so each of herreadiedmaneuver can be used once per encounter (until they are recovered, see below). For a warder to recover expended maneuvers, she must take stock of her situation to plan for her next movement. By focusing entirely on a defensive position to prepare her next move, she is able to regain maneuvers expended to assist her to victory. By taking a full round action to plan her next move (activating her defensive focus class feature, see below), she recovers a number of expended maneuvers equal to herwarder initiation modifier (minimum of 2). Alternately, she may take a brief pause in battle and recover a single maneuver of her choosing by spending astandard actionon her turn.",
    "stances known": "Warders begin play with knowledge of one stance from any discipline open to warders. At the indicated levels (see class table), the warder selects an additional new stance. Unlike maneuvers, stances are not expended, and she does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the warder cannot learn a new stance at higher levels in place of one she already knows.",
    "defensive focus (ex)": "At 1st level, the defensive prowess of the warder is second to none, allowing her to focus her actions purely on defending himself and her allies in ways that cannot be replicated. The warder gains theCombat Reflexesfeat as a bonus feat, using herwarder initiation modifier in place of herDexteritymodifier to determine the number of additionalattacks of opportunityshe may make each round. When recovering warder maneuvers as a full round action, the warder sets up a defensive perimeter around herself to defend her allies, increasing herthreatenedarea by 5 feet + 5 feet for every five initiator levels she possesses. Until the beginning of her next turn, she may makeattacks of opportunityagainst any opponent in thisthreatenedarea that provokesattacks of opportunity. She may move as part of theseattacks of opportunity, provided her total movement before her next turn does not exceed her speed (his movement provokesattacks of opportunityas normal). Additionally, while using defensive focus, the warder adds her warder initiation modifier plus her class level to herCMDfor the purposes of defending against enemies trying to use theAcrobaticsskill to prevent her from gettingattacks of opportunityagainst them. At 10th level, her defensive focus improves further. While her reach is increased by this ability, opponents treat her threatened area as difficult terrain. If a foe tries to move through a space within her reach, the movement through those squares costs double (x2). Additionally, while using her defensive focus to make anattack of opportunity, her movement does not provokeattacks of opportunity.",
    "aegis (ex)": "At 1st level, the warder's defensive prowess extends to those who choose to stay near to him. Allies who are within 10 ft. of the warder's position gain a +1morale bonustoArmor Classand toWillsaves under the warder's defensive aegis, her presence bolstering and shepherding the defenses of her allies. This bonus improves to +2 at 5th level (+3 at 9th level, +4 at 13th level, and +5 at 17th level). The warder does not receive this bonus, but may receive the benefits of this ability from another warder. If the ally cannot see or hear the warder, then the ally does not gain the benefits of this ability (such as if the warder is concealed orinvisible). At 6th level, her aegis' range increases its effective area, growing to a 20 ft. radius. At 12th level, this increases again to 30 ft..",
    "armiger's mark (ex)": "At 2nd level, a warder is trained in how best to control her enemies and how they behave in battle, urging them to throw their all against the warder's indomitable armor and unyielding shield. With a sharp blade, a clever taunt, or something that otherwise attracts her foe, the warder can direct the attention of enemies towards himself. Whenever the warder attacks a foe in combat and inflict at least 1 point of damage, as afree actionshe may mark them as her foe (he may even mark a foe during anattack of opportunityand may make thefree actionto do so, even though it is not her turn) and attempt to continue to force them to engage the warder only. The target is aware of being marked, and the mark remains for a number of rounds equal to her warder initiation modifier (minimum of 1). Marked targets suffer a -4 penalty toattack rollsagainst foes that are not the warder, and arcane spellcasters suffer an increase in arcane spell failure of 10% + 1% per two warder levels until the mark expires. The warder may only maintain a number of marks equal to 3 + her warder initiation modifier at a time, and she may make a number of marks per day equal to 1/2 warder level +warder initiation modifier. At 8th level, this penalty increases to -6, and it increases again to -8 at 16th level. This ability functions on creatures with anIntelligencescore of 1 or more, allowing her to markanimalsand other beasts as well as sentient beings, but not mindless creatures such asskeletons. Multiple armiger's marks overlap (do not stack). At 9th level, the warder may expend two uses of her armiger's mark to make a grand challenge to all enemies within a 30 ft. radius and mark them with her words alone. Creatures affected must make aWillsave (DC 10 + 1/2 warder level + warder initiation modifier) against the warder's mark ability or suffer the penalties of being marked for a number of rounds equal to her warder initiation modifier. This does not count against her normal marking limit. This is alanguage-dependentability and does not effect creatures of less than 1Intelligence. At 16th level, the armiger's mark improves to allow her to recover an expended maneuver whenever she reduces a marked opponent'shit pointsto 0 or less (this can only trigger once per marked opponent).",
    "bonus feat": "At 3rd level and every 5th level thereafter, a warder receives a bonuscombatorteamworkfeat. She must meet all prerequisites for these feats.",
    "tactical acumen (ex)": "At 4th level, the combat training that the warder has received hones her reflexes. Through her knowledge of tactics, training manuals, and lessons in the histories of war, her wits aid her when her agility may be impaired by her heavy armor. The warder may add her warder initiation modifier to herReflexsaves and to herinitiativein place of herDexteritymodifier (using the higher of the two bonuses).",
    "extended defense (ex)": "Upon reaching 5th level, the warder becomes ever more skilled at adapting to the flow of combat. Once per day, the warder mayactivate Extended Defense as animmediate action. When she does, the character chooses a counter she hasreadied; she may initiate that counter as afree action(even on another's turn) at will until the beginning of her next turn. At the beginning of her next turn, the chosen counter is expended. Every three levels beyond this (8th, 11th, 14th, and 17th levels), she may use this ability an additional time per day. This ability can only be used with counters that negate attacks or allow the warder to use another roll in place of a saving throw.",
    "clad in steel (ex)": "Having improved her skill with her armor, the warder is a more capable combatant in it when protecting her allies or cause. The warder may subtract her aegis bonus from her total armor check penalty and increase the maximumDexteritybonus on her armor by 1 at 6th level, and by 2 at 12th level.",
    "adaptive tactics (ex)": "A warrior can attempt to plan for everything, but no plan stands against the heat of battle if there is no room for adaptation. At 7th level, the warder can expend one use of her armiger's mark ability as afull-round actionto expend up to her warder initiation modifier inreadied maneuvers, then instantly ready an equal amount of maneuvers. The warder may not replace expended maneuvers using this ability; any maneuver she is re-preparing with this ability must be unexpended to be exchanged. She may choose from any of her known maneuvers.",
    "stalwart (ex)": "At 12th level, a warder can use mental and physical resiliency to avoid certain attacks. If she makes a successfulFortitudeorWillsaving throw against an attack that has a reduced effect on a successful save, she instead avoids the effect entirely. Ahelplesswarder does not gain the benefit of the stalwart ability.",
    "steel defense (ex)": "At 15th level, the warder is capable of turning an otherwise lethal blow and continue the fight. When an attack that inflicts hit point damage from anatural attack, melee weapon, or ranged weapon would reduce the warder to 0 or fewerhit points, she can make aFortitudesave (DC the attacker'sattack roll) to deflect the attack to her armor or shield (light, heavy, or tower shields only), causing it to suffer the damage in her place (apply itemhardnessas normal). If this would break the character's armor, it gains thebrokencondition until it is repaired. The warder cannot use this ability withbrokenarmor or abrokenshield. The warder must be wearing armor or a shield to use this ability.",
    "born of steel (ex)": "At 19th level, the warder is so at home in her armor that it is like a second skin, protecting her with its familiar embrace. When wearing medium or heavy armor, the warder is more resistant to critical hits. When a critical threat is rolled against him, the warder may add herwarder initiation modifier to her AC against the critical confirmation roll.",
    "deathless defenses (ex)": "At 20th level, the warder can indefinitely hold a position to protect her allies, even if it may cost her her life. The warder must expend two uses of her armiger's mark ability as animmediate actiontoactivateher deathless defenses. While this ability is active, the warder is capable of maintaining her defensive focus as amove action(but recovers no maneuvers unless she spends a full round to recover) but gains the full bonuses of her defensive focus. Additionally, she receives the benefits of her aegis ability as well. She is unable to die from hit point damage while this effect is in use. She may maintain the use of this ability each round at the cost of one use of her armiger's mark ability, or she may end it as afree action. Abilities or effects that don't inflict hit point damage, such asenergy drainorability damage, can still kill the warder. While this effect is in use, she is immune tomind-affectingabilities, as her focus prevents any from tampering with her mind. Once this ability ends, either voluntarily or if the character runs out uses of armiger's mark (assuming she is notdead), the warder isexhaustedand must rest a full 8 hours to recover. Favored Class Bonuses [ ] Aasimar:  Add 1/4 of a maneuver known from theGolden LionorSilver Cranedisciplines. \n Aellar (hawkguard): GetFlyas a class skill and +1/3 bonus toPerceptionchecks. \n Decataur:  +1/3 additional use of armiger's mark. \n Dromite:  Add +1/2 to the number of uses per day of the warder's armiger's mark ability. \n Dwarves:  Add +1/4 to the bonus to AC granted by the warder's aegis. \n Eiremian:  Add +1/5 to the number of uses per day of the warder's extended defense ability. \n Elan:  Add +1/4 to the bonus to AC granted by the warder's aegis. \n Elves:  Increase the maximum dexterity bonus of worn armor by +1/4. \n Ethumion:  Reduce the armor check penalty of worn armor by +1/5. \n Forgeborn:  Add +1/4 to the bonus to AC granted by the warder's aegis. \n Gnome:  Increase the maximum dexterity bonus of worn armor by +1/4. \n Half-bugbear:  Add +1/4 of a use of armiger's mark. \n Half-elf:  Add +1/4 to the number of additional extra attacks of opportunity when using Defensive focus. \n Half-giant:  Add +1/5 to the number of uses per day of the warder's extended defense ability. \n Halfling:  Add +1/5 to the bonus on Will saves granted by the warder's aegis. \n Half-orc:  Add +1/4 of a maneuver known from theBroken BladeorPrimal Furydisciplines. \n Human:  Add +1/2 to the number of uses per day of the warder's armiger's mark ability. \n Kestrel:  Gain +1/5 of a new bonus combat feat. \n Maenad:  Gain a +1/4 bonus on damage rolls when making attacks of opportunity while using the warder's defensive focus. \n Tiefling:  Gain a +1/4 bonus on damage rolls when making attacks of opportunity while using the warder's defensive focus. \n Watcher:  Gain +1/3 additional use of armiger's mark. Archetypes [ ] Bushi Dervish Defender Excruciator Fiendbound Marauder Hawkguard Hussar Ordained Defender Sworn Protector Zweihander Sentinel",
    "aasimar:": "Add 1/4 of a maneuver known from theGolden LionorSilver Cranedisciplines.",
    "aellar (hawkguard):": "GetFlyas a class skill and +1/3 bonus toPerceptionchecks.",
    "decataur:": "+1/3 additional use of armiger's mark.",
    "dromite:": "Add +1/2 to the number of uses per day of the warder's armiger's mark ability.",
    "dwarves:": "Add +1/4 to the bonus to AC granted by the warder's aegis.",
    "eiremian: ": "Add +1/5 to the number of uses per day of the warder's extended defense ability.",
    "elan:": "Add +1/4 to the bonus to AC granted by the warder's aegis.",
    "elves:": "Increase the maximum dexterity bonus of worn armor by +1/4.",
    "ethumion: ": "Reduce the armor check penalty of worn armor by +1/5.",
    "forgeborn:": "Add +1/4 to the bonus to AC granted by the warder's aegis.",
    "gnome:": "Increase the maximum dexterity bonus of worn armor by +1/4.",
    "half-bugbear: ": "Add +1/4 of a use of armiger's mark.",
    "half-elf:": "Add +1/4 to the number of additional extra attacks of opportunity when using Defensive focus.",
    "half-giant:": "Add +1/5 to the number of uses per day of the warder's extended defense ability.",
    "halfling:": "Add +1/5 to the bonus on Will saves granted by the warder's aegis.",
    "half-orc:": "Add +1/4 of a maneuver known from theBroken BladeorPrimal Furydisciplines.",
    "human:": "Add +1/2 to the number of uses per day of the warder's armiger's mark ability.",
    "kestrel: ": "Gain +1/5 of a new bonus combat feat.",
    "maenad:": "Gain a +1/4 bonus on damage rolls when making attacks of opportunity while using the warder's defensive focus.",
    "tiefling:": "Gain a +1/4 bonus on damage rolls when making attacks of opportunity while using the warder's defensive focus.",
    "watcher: ": "Gain +1/3 additional use of armiger's mark."
  },
  "Warlord": {
    "adventures:": "Warlords adventure for many reasons, but one reason that will always be prominent is the desire to test their skill against the world's most dangerous opponents, to show their strength to themselves and to the world. Others may do this for profit, others for fun, others for revenge, but it is always certain that a warlord seeks the glory and honor only a battle well-fought can bring.",
    "characteristics:": "Brash arrogance and an irrepressible nature are hallmarks of the warlord. A devil-may-care warrior, many warlords are as fearless as they are fierce, and they both love life and live their lives to the fullest. Hedonists in some extreme cases, the warlord is drawn to combat as a moth to the flame.",
    "alignment:": "Any. Warlords can come from any and all ethical backgrounds, though they do tend more towards a chaoticalignment. Lawfully aligned warlords are rarer, and tend to compose their impulses through strict discipline.",
    "religion:": "While not overly religious, some warlords follow gods of war and battle with temperaments similar to their own.",
    "background:": "Warlords come from families with strong warrior traditions, from barbaric tribes and from academies that produce the strongest warriors. One thing that sets them apart is their reckless nature and the inspirational presence they possess.",
    "races:": "Humansandhalf-elvesare prominent warlord races due to both possessing an impetuous nature.Half-orcsbecome very fearsome warlords in their own right, anddwarvesare known for their ferocity when defending their homes.",
    "other classes:": "Warlords get on well withfighters,rangers, andbarbarians as their martial nature makes them amicable, butpaladinsand warders tend to chafe under their recklessness. Wizards and especiallybardsandsorcerersget on quite well with them, andclericsfind them to be tolerable.",
    "role:": "Striker. As a very aggressive class, the warlord seeks to bring martial power to the field in the form of overwhelming force and ferocity. Additionally, warlords make excellent leaders, as they provide some passive benefits from their class features as well as active benefits from discipline choices and their gambits.",
    "abilities:": "StrengthandCharismaare incredibly important to a warlord, as withoutStrengththe warlord is weaker in combat and withoutCharisma many of his abilities will not function, asCharismais the warlord's primary initiation attribute.Constitutionis important for vitalhit points.IntelligenceandDexteritytake up the bottom of importance, for both skill points and defense (or ranged combat).",
    "hit die:": "d10",
    "starting wealth": ": 5d6 x 10 gp (average 175 gp).",
    "starting age:": "Self-Taught",
    "class skills:": "The warlord's class skills (and the key ability for each skill) are: Acrobatics (Dex), Climb (Str), Craft (Int), Diplomacy (Cha), Handle Animal (Cha), Intimidate (Cha), Knowledge (engineering) (Int), Knowledge (history) (Int), Knowledge (martial) (Int), Perception (Wis), Profession (Wis), Ride (Dex), Sense Motive (Wis), Survival (Wis), Swim (Str).",
    "skill ranks per level:": "4 +Int modifier",
    "weapon and armor proficiency": "Warlords are proficient with all simple weapons and martial weapons, and with light and medium armor, and with shields.",
    "maneuvers": "A warlord begins his career with knowledge of six martialmaneuvers. The disciplines available to him are Golden Lion , Primal Fury , Scarlet Throne , Solar Wind , Thrashing Dragon , and either Piercing Thunder or Tempest Gale . If he does not have that discipline's associated skill as a class skill, he gains it as a class skill. Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Brutal Crocodile :  Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill. \n Unquiet Grave :  Warlords may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it. Once he knows a maneuver, he must ready it before he can use it (see Maneuvers Readied, below). A maneuver usable by warlords is considered an extraordinary ability unless otherwise noted in its description. His maneuvers are not affected byspell resistance, and he do not provokeattacks of opportunitywhen he initiates one. He learns additional maneuvers at higher levels, as shown on Table 1-3: The Warlord. The warlord must meet a maneuver's prerequisite to learn it. See the Systems and Use chapter for more information. Upon reaching initiator level 4th, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the warlord can choose to learn a new maneuver in place of one he already knows. In effect, the warlord loses the old maneuver in exchange for the new one. He can choose a new maneuver of any level he likes, as long as he observes his restriction on the highest-level maneuvers he knows. The warlord need not replace the old maneuver with a maneuver of the same level. The warlord can swap only a single maneuver at any given level. A warlord's initiation modifier isCharisma.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Brutal Crocodile :  Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill. \n Unquiet Grave :  Warlords may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "brutal crocodile:": "Any character of any class which has access to Primal Fury may gain Brutal Crocodile in exchange for one martial discipline they possess. They gain Climb as a class skill.",
    "leaden hyena:": "Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill.",
    "unquiet grave:": "Warlords may exchange access to one of their martial disciplines for access to the Unquiet Grave discipline. They gain Knowledge (religion) as a class skill if they didn't already have it.",
    "maneuvers readied": "A warlord can ready four of his six starting maneuvers, but as he advances in level and learns more maneuvers, he must choose which maneuvers to ready. He readies his maneuvers by going through weapon drills for 10 minutes. The maneuvers he chooses remainreadieduntil he decides to repeat this again and change them. Warlords do not need to sleep or rest for any long period of time to ready their maneuvers; any time he spends 10 minutes in practice, he can change hisreadiedmaneuvers. He may not ready any individual maneuver more than once. He begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times he may have already used them since he chose them. When the warlord initiates a maneuver, he expends it for the current encounter, so each of hisreadiedmaneuver can be used once per encounter (until they are recovered, see below). For a warlord to recover expended maneuvers, he must perform one of two types of actions: a gambit action in which he gambles on his performance in battle (see Warlord's Gambit below), or he may spend astandard actionto recover a singlereadiedmaneuver of his choosing.",
    "stances known": "Warlords begin play with knowledge of one stance from any discipline open to warlords. At the indicated levels (see class table), the warlord selects an additional new stance. Unlike maneuvers, stances are not expended and he does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the warlord cannot learn a new stance at higher levels in place of one he already knows.",
    "warlord's gambit (ex)": "At his core, the warlord is a warrior who relies on both skill and daring; without this he is but any other combatant. By setting himself to danger, does his true skill shine, or so the motto of the warlord goes. At 1st level, a warlord selects two gambits from the gambits available to warlords. At 4th level and every four levels thereafter, a warlord selects an additional gambit to learn. Any gambit that would normally use the warlord's Charisma modifier to determine its effects instead uses his warlord initiation modifier, if it is a different ability. These gambits allow the warlord to recover maneuvers. Due to their reliance on the stresses of combat to bring out the best of the warlord, gambits cannot be used outside combat. A gambit has two aspects: a risk and a reward. A gambit's risk describes an action the warlord must take in order to play the gambit. The warlord begin a gambit as aswift action, then performs the gambit's risk action. He may add half his warlord initiation modifier as aluck bonuson any d20 rolls made while performing this action (such as theAcrobaticscheck of an acrobatic gambit, or theattack rollof a brave gambit). The warlord only gets this bonus if he spent theswiftorimmediate actionrequired to begin the gambit; if taking the actions normally, he gains no additional benefits. If the warlord initiates a maneuver as part of a gambit, he cannot recover that maneuver when the gambit is completed (even if it's his only expended maneuver). If the warlord succeeds at his gambit's risk, he recovers a number of expended maneuvers equal to his warlord initiation modifier (minimum 2) and gains the reward listed in the gambit's description. Allies who would gain a benefit from the gambit's reward must be within 60 feet of the warlord and able to see him perform the gambit's risk. If the warlord fails his gambit (such as missing the charge attack of a brave gambit, or failing the saving throw of an unbreakable gambit), he suffers the gambit's rake, recovering only a single expended maneuver and taking a 2 penalty on all d20 rolls for one round. Warlord gambits can be found here.",
    "bonus feat": "At 1st level and at 6th level, and then every four levels after, the warlord gains a bonuscombatfeat orteamworkfeat of his choosing. The warlord must qualify for the feat before selecting it.",
    "tactical presence (ex)": "At 2nd level, the warlord's innate charisma allows his very presence to aid and assist not only himself but his allies as well, just by his being around. Adopting a presence is a move-equivalent action, and only one presence may be maintained at any given time. At 7th level, the warlord is capable of adopting a presence as afree action. Indomitable Presence : At 2nd level, the warlord shines as a beacon to his allies on the field of battle, inspiring them to fight with him to their last breath. All allies within 30-ft. of his position gain the benefits of the Die Hard feat, and may add hiswarlord initiation modifier toFortitude saves versus death effects,fatigueorexhaustioneffects, orpoison effects as amorale bonus. \n Rallying Presence : The sight of a warlord on the battlefield is enough to strengthen the hearts and wills of those who fight beside him in battle. At 5th level, the warlord may add his warlord initiation modifier as amorale bonustoWillsaves versusfear, death effect, orcompulsion effects to all allies within 30-ft. of his position. If the warlord maintaining this presence becomes cowed, frightened, panickedor falls prey to a hostilemind-affectingability (such as one that would stun ordazehim),compulsionor death effect, this presence immediately ends. \n Victorious Presence : The preternatural skill at arms that a warlord of at this level possesses is enough to win any battle. At 9th level, any foe that the warlord brings to 0 or fewerhit pointsin battle immediately fuels his hunger for the win, granting him and his allies within 30-ft. of his position the character's class level plus his warlord initiation modifier intemporary hit points. Thesehit pointsendure until they are lost or until the end of the encounter, whichever occurs first. Damage inflicted on the warlord is deducted from histemporary hit pointsfirst before being deducted from his normal hit point total. New Tactical Presences   When a warlord gains a new tactical presence (including by taking the Extra Presence feat), he can gain select of the following instead: Warning Presence: The instructions given by the wary warlord help his allies defend themselves against sudden surprises. Allies within 30 feet of the warlord gain a bonus equal to the warlord's initiation modifier onReflexsaves against traps and to their AC during asurprise round. In addition, the warlord can designate one of his allies to act in a surprise round, even if they normally would not be able to. A warlord must be at least 2nd level to select this presence. \n Taskmaster's Presence: The warlord is a driving master, be it cruelly with a whip or kindly with encouragement. Allies within 30 feet of the warlord gain the benefits of theEndurancefeat and gain amorale bonuson saving throws againstfatigue,disease,compulsioneffects, and sleep effects equal to the warlord's initiation modifier. If the warlord is participating in a Craft or Profession check made by one of his allies, he can add his warlord initiation modifier as amorale bonus on that check. A warlord must be at least 5th level to select this presence. \n Gladiator's Presence: The warlord has seen some scraps in his day, and he knows how to inspire his allies through some tough moments too. Allies within 30 feet of the warlord gain amorale bonuson combat maneuver checks and to theirCMDequal to the warlord's initiation modifier. In addition, those allies do not provoke attacks of opportunity when making combat maneuver attempts. A warlord must be at least 9th level to select this presence.",
    "new tactical presences": " When a warlord gains a new tactical presence (including by taking the Extra Presence feat), he can gain select of the following instead:",
    "warleader": "The warlord excels in the theater of war because he knows how best to work with his allies. At 3rd level, the warlord becomes an ever more capable commander and may share tactics with his allies. First, the warlord gains a teamwork feat as a bonus feat (he must meet the prerequisites for this feat to select it). As astandard actionthat the warlord performs, the warlord and allies within 30- ft. of him can share teamwork feats that they possess with each other, acting as if they both possessed the teamwork feat that they are sharing. The warlord can only share one teamwork feat at a time, either one of his own (with all allies within 30-ft. of him) or an ally's (in which case only the warlord receives the ability to use the teamwork feat he does not possess). The warlord and allies retain the use of this feat for 3 +his warlord initiation modifier in rounds. The warlord can use this ability a number of times per day equal to 1 + his warlord initiation modifier, plus one additional time per day at 7th level and four warlord levels thereafter.",
    "force of personality (ex)": "At 3rd level, the warlord's forceful personality and bold, headstrong nature assist him in resisting the influence of others. Where others use personal serenity, awareness of the world around them, or plain old sensibility, the warlord gets by with endless nerve. The warlord may add hiswarlord initiation modifier in addition to hisWisdommodifier to determine hisWillsave bonus. If the character is ever able to add hiswarlord initiation modifier to hisWillsave through use of another ability (for example. thepaladin'sdivine grace) he may only add hiswarlord initiation modifier once to hisWillsave.",
    "tactical flanker (ex)": "At 4th level, the warlord is exceptionally gifted at working with his allies to bring down opponents and his skills assist any who ally with him. At the start of the warlord's turn, he chooses a single square adjacent to him. Until the start of his next turn, he and his allies can treat that square as if it was occupied by him for the purposes offlankingopponents.",
    "battle prowess (ex)": "The warlord is a skilled combatant, mixing traditional fighting skills with the skill of his martial discipline training. Choose a discipline, and when the warlord is in a martial stance from this chosen discipline, the character gets the listed bonus (+1 at 5th level, +2 at 12th level, +3 at 19th level) as acompetence bonusto attack and damage rolls,CMBrolls, and to hisCMD. He may select another discipline at 12th level, and third discipline at 19th level.",
    "dual boost (ex)": "Knowledgeable in the ways of making the best of any situation through pluck and verve, the warlord is capable of applying multiple martial principles simultaneously. At 6th level, once per day the warlord may initiate two boost type maneuvers as part of the sameswift action. He may use this an additional time per day at 12th level, and three times per day at 18th level.",
    "tactical assistance (ex)": "At 8th level, the warlord's gift for helping his allies in combat improves. The character may use the aid another action for any single ally within 30-ft. of his position as amove action, and when he successfully uses the aid another action, it affects all allies within 30 feet.",
    "dual tactical presence (ex)": "At 11th level, the sight of the warlord on a field of combat inspires multiple feelings in those around him. He may select and use two presences, activating them together as afree action.",
    "improved warleader": "At 13th level, the warlord's excellence in battle has enabled him to utilize the tactical skills of his allies as well as his own with greater speed. The warlord may now use his warleader class feature as amove action.",
    "warlord's presence (ex)": "At 15th level, the warlord is capable using three of his presences together at the same time, activating them together as afree action.",
    "master warleader": "At 17th level, the warlord's peerless ability in the theater of war has enabled him to utilize the tactical skills of his allies as well as his own with the greatest of speed. The warlord may now use his warleader class feature as aswift action.",
    "dual stance (ex)": "At 20th level, the warlord's ability to use his stances improves, allowing him to gain the benefits of two known stances simultaneously. He must still adopt each stance individually, requiring him to expend oneswift actionfor each stance. Favored Class Bonuses [ ] Aasimar:  Add +2-1/2 feet to the range of the warlord's tactical presence. This option has no effect unless the warlord has selected it twice (or another increment of 2); an aura of 14 feet is effectively the same as a 10-foot aura, for example. \n Alicorn:  Add +1/3racial bonusto the warlord's gambit attempts. \n Any goblinoid race:  Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit. \n Blue:  Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit. \n Decataur:  +1/3 extra maneuver recovered when running a gambit. \n Dreige:  Add a +1/4 bonus to battle prowess \n Dromite:  Add +1/4 to the number of uses per day of the warlord's warleader ability. \n Dwarves:  Add +1/5 to the bonus on saving throws granted by the warlord's tactical presence. \n Elan:  Add +1/4 to the number of uses per day of the warlord's warleader ability. \n Elves:  Gain 1/5 of a new combat feat. \n Entoli:  Add +1/4 of a maneuver known from the Golden Lion or Sleeping Goddess disciplines. \n Ethumion:  Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit. \n Gnome:  Add +1/4 of a maneuver known from theTempest GaleorThrashing Dragondisciplines. \n Grendle:  Add +1/4 maneuvers known from the Golden Lion or Scarlet Throne disciplines. These maneuvers must be at least one level below the highest level of maneuvers the warlord can learn. \n Half-elf:  Add +1/4 to the number of uses per day of the warlord's warleader ability. \n Half-giant:  Add +1/4 of a maneuver known from theGolden LionorPrimal Furydisciplines. \n Half-gnoll:  +1/4 racial bonus on saves vs fear. \n Half-hobgoblin:  The warlord gains 1/6 of a new warlord gambit. \n Halfling:  Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit. \n Half-orc:  Gain 1/5 of a new combat feat. \n Human:  Gain 1/6 of a new combat feat. \n Kijin:  Add +1/5 bonus to the warlord's battle prowess. \n Kijin:  Gain +1/5 of a new gambit. \n Maenad:  Gain 1/5 of a new combat feat. \n Merg:  Gain +1/5 of a new gambit. \n Murk:  +1/4 bonus to battle prowess. \n Xeph:  Gain 1/5 of a new combat feat. Archetypes [ ] Bannerman Bushi Desperado Hussar Privateer Steelfist Commando Vanguard Commander Veiled Lord",
    "aasimar:": "Add +2-1/2 feet to the range of the warlord's tactical presence. This option has no effect unless the warlord has selected it twice (or another increment of 2); an aura of 14 feet is effectively the same as a 10-foot aura, for example.",
    "alicorn:": "Add +1/3racial bonusto the warlord's gambit attempts.",
    "any goblinoid race:": "Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit.",
    "blue: ": "Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit.",
    "decataur:": "+1/3 extra maneuver recovered when running a gambit.",
    "dreige:": "Add a +1/4 bonus to battle prowess",
    "dromite:": "Add +1/4 to the number of uses per day of the warlord's warleader ability.",
    "dwarves:": "Add +1/5 to the bonus on saving throws granted by the warlord's tactical presence.",
    "elan:": "Add +1/4 to the number of uses per day of the warlord's warleader ability.",
    "elves:": "Gain 1/5 of a new combat feat.",
    "entoli: ": "Add +1/4 of a maneuver known from the Golden Lion or Sleeping Goddess disciplines.",
    "ethumion: ": "Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit.",
    "gnome:": "Add +1/4 of a maneuver known from theTempest GaleorThrashing Dragondisciplines.",
    "grendle: ": "Add +1/4 maneuvers known from the Golden Lion or Scarlet Throne disciplines. These maneuvers must be at least one level below the highest level of maneuvers the warlord can learn.",
    "half-elf:": "Add +1/4 to the number of uses per day of the warlord's warleader ability.",
    "half-giant:": "Add +1/4 of a maneuver known from theGolden LionorPrimal Furydisciplines.",
    "half-gnoll: ": "+1/4 racial bonus on saves vs fear.",
    "half-hobgoblin: ": "The warlord gains 1/6 of a new warlord gambit.",
    "halfling:": "Gain a +1/4 circumstance bonus on all d20 rolls made during a warlord's gambit.",
    "half-orc:": "Gain 1/5 of a new combat feat.",
    "human:": "Gain 1/6 of a new combat feat.",
    "kijin: ": "Gain +1/5 of a new gambit.",
    "maenad:": "Gain 1/5 of a new combat feat.",
    "merg: ": "Gain +1/5 of a new gambit.",
    "murk: ": "+1/4 bonus to battle prowess.",
    "xeph:": "Gain 1/5 of a new combat feat."
  },
  "Zealot": {
    "adventures:": "Zealots live in pursuit of a passion or cause. Each zealot has a purpose they intimately understand, from protecting their country, to spreading their religion, to hunting down every last one of the assassins who murdered their master.",
    "characteristics:": "Zealots typically have intense personalities-despite their commitment to one cause, if one fire cools, another will ignite. This fervency is what draws in their allies and sets them apart: What some might believe on an intellectual level in a vague, apathetic way, the zealot embraces and knows like a lover.",
    "alignment:": "Any. Zealots have a strict devotion to an ideal that they follow with reckless abandon. While zealots often allow the ends to justify the means, they also put the needs of something greater than themselves beyond their own needs. These conflicting motivations create zealots of every conceivable stripe. Though zealots do not changealignmentmore frequently than other classes, a zealot who changes alignments fights for his new ideals with the same intensity as the one he left behind.",
    "religion:": "Many zealots are religious, but their personal beliefs often clash with established dogma. Zealots often live at the extremes of a given religion-its most brutal enforcers, its most devout preachers, its first followers, its greatest defenders, and its most despised heretics. This purity of drive leads zealots to frequently found their own religions, philosophies, and cults.",
    "background:": "Zealots are found most frequently in times of uncertainty and places of conflict, though whether this is because these situations are ideal for creating zealots, zealots are drawn to these areas, or zealots create these situations is uncertain.",
    "races:": "Zealots are most commonly found inhumansand other shorter-lived races, because zealots often live short and burn bright. Sadly, there may be just as manydwarvenpatriots asgoblinfanatics, but the dwarves who follow less impassioned lives will typically live much longer ones. Half-breeds likehalf-orcs,half-giants, andtieflingsare common zealots, as they are often born in areas of conflict and are forced into allying with one side of their heritage or another.Dromitesand other highly-organized races can produce excellent zealots, as their culture helps instill them with a unique sense of purpose.",
    "other classes:": "Zealots often mesh best with others who will fight for their cause, regardless of their allies' motivations, a pragmaticstalkerwho can be counted on to perform a task for a few coins might be a more trusted ally to a zealot than a piousclericwho raises moral arguments against the zealot's methods. Zealots sometimes clash withsorcerers,paladins, and others with strong personalities (a natural consequence of too many leaders and not enough followers), but thoughtful classes likeinquisitors,oracles, andrangerscan channel the zealot's ardor against the proper targets. Zealots do not inherently get along well, and there are often zealots on all sides of a conflict.",
    "role:": "Leader. A zealot inspires the hearts and minds of those he fights alongside through pure passion, bringing his allies to heights they never thought possible. With proper feat and maneuver choices, zealots can also become masters of battlefield control.",
    "abilities:": "A zealot relies most heavily on hisCharisma, which is his initiation modifier and grants bonus power points to fuel its class features. A highConstitutionscore aids him in soaking up damage for his allies, and investing in a decentStrengthscore is necessary for reliably striking foes and attemptingcombat maneuvers.",
    "starting age:": "Self-taught.",
    "starting wealth:": "5d6 x 10 gp (average 175 gp). In addition, each character begins play with an outfit worth 10 gp or less.",
    "hit die:": "d10.",
    "class skills: ": "The zealot's class skills are Autohypnosis (Wis), Bluff (Cha), Craft (Int), Diplomacy (Cha), Heal (Wis), Intimidate (Cha), Knowledge (history) (Int), Knowledge (martial) (Int), Knowledge (nobility) (Int), Knowledge (psionics) (Int), Knowledge (religion) (Int), Perception (Wis), Profession (Wis), and Sense Motive (Wis).",
    "skill ranks per level:": "4 + Int modifier.",
    "weapon and armor proficiency": "A zealot is proficient with all simple and martial weapons and with all armor (heavy, light, and medium) and shields (except tower shields).",
    "maneuvers": "A zealot begins his career with knowledge of five martial maneuvers. The disciplines available to him are Eternal Guardian , Golden Lion , Piercing Thunder , Sleeping Goddess , and Solar Wind . Editor's Note: Discipline Exchanges \n Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill. Once the zealot knows a maneuver, he must ready it before he can use it (see Maneuvers Readied, below). A maneuver usable by zealot is considered an extraordinary ability unless otherwise noted in it or its discipline's description. A zealot's maneuvers are not affected byspell resistance, and he does not provokeattacks of opportunitywhen he initiates one. The zealot learns additional maneuvers at higher levels, as indicated on Table: Zealot. A zealot must meet a maneuver's prerequisite to learn it. SeeSystems and Usefor more details on how maneuvers are used. Upon reaching initiator level 4th, and at every even numbered initiator level thereafter (6th, 8th, 10th, and so on), the zealot can choose to learn a new maneuver in place of one he already knows. In effect, he loses the old maneuver in exchange for the new one. He can choose a new maneuver of any level he likes, as long as he observes the restriction on the highest-level maneuvers he knows; the zealot need not replace the old maneuver with a maneuver of the same level. He can swap only a single maneuver at any given level. A zealot's initiation modifier isCharisma.",
    "discipline exchanges": "Fool's Errand ,  Mangled Gear ,  Radiant Dawn ,  Roaring Mouse ,  Surging Shark :  Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill. \n Leaden Hyena :  Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill.",
    "fool's errand": ",",
    "mangled gear": ",",
    "radiant dawn": ",",
    "roaring mouse": ",",
    "surging shark:": "Any character of any class can access any of these disciplines by trading one of their available disciplines for one of the listed disciplines. If they do, they gain its associated skill as a class skill.",
    "leaden hyena:": "Any character of any class which has access to Golden Lion may gain Leaden Hyena in exchange for one martial discipline they possess. They gain Bluff as a class skill.",
    "maneuvers readied": "A zealot can ready three of his five maneuvers known at 1st level, and as he advances in level and learns more maneuvers, he is able to ready more, but must still choose which maneuvers to ready. A zealot must always ready his maximum number of maneuvers readied. He readies his maneuvers by meditating for ten minutes. The maneuvers he chooses remain readied until he decides to meditate again and change them. The zealot does not need to sleep or rest for any long period of time in order to ready his maneuvers; any time he spends ten minutes in contemplation, he can change his readied maneuvers. A zealot begins an encounter with all his readied maneuvers unexpended, regardless of how many times he might have already used them since he chose them. When he initiates a maneuver, he expends it for the current encounter, so each of his readied maneuvers can be used once per encounter (unless he recovers them, as described below). In order for the zealot to recover maneuvers, he must activate his zeal class feature by using theAid Anotheraction. Using theAid Another action in this way is amove action, and when he does so, he recovers a number of expended maneuvers equal to his zealot initiation modifier (minimum 2), regardless of whether or not theAid Anotherattempt was successful. Maneuvers initiated during the zealot's current turn cannot be recovered in this way. Using theAid Anotheraction as any other action (such as with theBodyguardfeat or the battlesense power) does not allow the zealot to recover maneuvers. Alternately, the zealot may focus inwards, meditating and recovering a single maneuver as astandard action.",
    "stances known": "A zealot begins his career with knowledge of one stance from any discipline open to zealots. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, he can select an additional stance to learn. Unlike maneuvers, stances are not expended and the zealot does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently maintaining as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description. Unlike with maneuvers, a zealot cannot learn a new stance at higher levels in place of one he already knows.",
    "power points": "A zealot's ability to augment some of his abilities is limited by the power points he has available. His base daily allotment of power points is given on Table: Zealot. In addition, he receives bonus power points per day if he has a highCharismascore (see Table:Ability Modifiers and Bonus Power Points), treating his class level as his effective manifester level for the purposes of bonus power points. His race may also provide bonus power points per day, as may certain feats and items. This effective manifester level does not make a zealot eligible for feats and prestige classes requiring a manifester level.",
    "collective (su)": "A zealot learns to use psionic power to connect willing minds through an internal network that strengthens their psychic bonds. As astandard action, a zealot can join any number of willing targets into his collective (up to his limit, see below). The zealot must have line of sight to each target, each target must have aWisdomscore of at least 1, and all targets must be within medium range (100 feet + 10 feet per zealot level). The collective can contain up to his zealot initiation modifier or half his zealot level (minimum 1), whichever is higher, plus the intensity of hiszeal. The zealot is always considered a member of his own collective, and does not count against the maximum number of creatures in the collective. The zealot can choose to remove a member as a free action on his turn, and any member can voluntarily leave the collective as afree actionon their turn. Any member whoseWisdomdrops to zero or who moves out of range of the collective is automatically removed. If a member enters a null psionics field, the connection to the collective is suppressed until the member leaves the field. A member who leaves the collective for any reason immediately loses any and all benefits they may have gained from being a member. A zealot is aware of the status of his collective and can, roughly, sense the presence of each member, although beyond telling if such a creature is still a member, this has no mechanical benefit until higher levels (seetelepathy). A zealot can initiate certain maneuvers through his collective. If a zealot maneuver specifies one or more willing targets (or is harmless) and has a range greater than personal, he can initiate this maneuver on a member of his collective regardless of the range of the actual maneuver. All other non-range restrictions still apply. If he is capable of manifesting powers, casting spells, or initiating maneuvers from a different class (as is the case for a multiclass zealot), any compatible spell, power, or maneuver with a range greater than touch can also be used through the collective. He may manifest any power with the Network descriptor this way, regardless of their actual ranges or targets. If a member of the collective dies, the member is removed from the collective and the zealot must make aFortitudesave (DC 15) or lose 1 power point for everyHit Dieof the fallen member or besickenedfor an equal number of rounds. At 15th level, a zealot's collective range is limitless on the same plane as the zealot. At 19th level, a zealot's range reaches even across other planes and dimensions.",
    "compartmentalized aid (ex)": "A zealot can mentally divide a fraction of himself to objectively analyze his actions, allowing him to use theAid Anotheraction on himself to grant himself a bonus to anattack rollor AC and recover maneuvers (and activating the zealot'szealclass feature). When he does so, the bonus applies to an attack that comes before the end of his next turn. In addition, he can use theAid Anotheraction with a ranged attack as long as he is within his weapon's first range increment.",
    "zeal (su)": "The zealot's martial competence and inspiring exhortations give his collective the courage to fight no matter the odds. Whenever a zealot successfully hits an opponent with a strike maneuver, all allies in his collective (including him) gain a +1morale bonusonattack rollsfor one round. This bonus increases by +1 at 5th level and every five levels thereafter. A zealot's zeal is also activated when he uses theAid Anotheraction as to recover maneuvers (regardless of whether or not the Aid Another attempt was successful). In addition, when he uses theAid Anotheraction to grant an ally a bonus on a skill check or to their AC, he adds the intensity of his zeal to the bonus granted. In addition, the zealot's ardor for his beliefs draws others to follow and support him. The zealot adds the intensity of his zeal to the maximum number of creatures he may have in his collective.",
    "burning contemplation (ex)": "Starting at 2nd level, a zealot's inner fire allows him to unlock latent psionic potential within himself. For the purpose of qualifying for psionic feats, he may use hisCharismascore instead of hisWisdomscore.",
    "conviction": "In addition to his purpose and plans, a zealot champions minor beliefs and practices. At 2nd level and every four levels thereafter, a zealot gains a conviction from the following list. Unless otherwise noted, a zealot cannot select an individual conviction more than once. Some convictions can only be taken if the zealot meets certain prerequisites first, as noted in the individual conviction's description. Zealot convictions can be found here.",
    "martyrdom (su)": "At 2nd level, the zealot learns to share the immense pain and suffering his allies must face to fulfill their calling. Once per round, when a willing member of the zealot's collective other than himself takes hit point damage, the zealot can redirect up to 5 points of damage per zealot level to himself as afree action, even if it isn't his turn. Effects other than hit point damage (such aspoison,stunning, orability damage) are not reduced or transferred. Damage the zealot redirects to himself with this ability ignores any form ofdamage reduction, resistance, immunityorregenerationthe zealot may possess. When the zealot activates this ability, he can pay up to 1 power point per zealot level to negate 3 points of the damage redirected to him per power point spent (to a minimum of 1 point of damage taken). Starting at 7th level, if one of the zealot's allies takesability damage, the zealot may choose to take up to 1 point of thatability damageper three zealot levels in place of the ally. When the zealot activates this ability, he can pay up to 1 power point per zealot level to negate 1 point of thisability damageredirected to him per 2 power points spent. In addition, he now negates 4 points of redirected hit point damage per power point spent. Starting at 12th level, the zealot can use his martyrdom ability on each creature in his collective once per round, and he now negates 5 points of redirected hit point damage per power point spent. Starting at 17th level, the zealot automatically negates the first 10 points of damage redirected each time he uses this ability (to a minimum of 1 point of damage taken), and negates 6 points of redirected hit point damage per power point spent.",
    "commitment (su)": "The fervor a zealot ignites in his allies does not end at the limits of his physical body. As his allies internalize his beliefs, they increasingly feel the zealot's presence beside them even in the harshest circumstances. Starting at 3rd level, a zealot can use theAid Anotheraction on any member of his collective, regardless of distance.",
    "telepathy (su)": "When a zealot reaches 3rd level, all willing members of his collective (including the zealot himself) can communicate with each other telepathically, even if they do not share a common language. Psionic creatures who are willing members in a zealot's collective (including the zealot himself) may manifest unknown powers from powers known by another willing psionic creature in the collective as if they were making physical contact.",
    "echoes of steel (su)": "As a zealot continues to mold the hearts and minds of those around them, his collective begins to copy his words and his deeds, working to advance his cause. At 4th level, this manifests in the ability to temporarily psychically transfer the zealot's techniques. When the zealot initiates a maneuver at least one level below his maximum maneuver level known, he can spend 1 power point per maneuver level to grant another member of his collective the ability to initiate that maneuver one time within 1 minute or until the zealot chooses to recover the maneuver. This is not considered an augment and does not count against the maximum amount of power points the zealot can spend on the maneuver. The maneuver becomes a known and readied maneuver for that ally, using the zealot's initiator level and initiation modifier. After the zealot's ally initiates the maneuver or 1 minute passes, it is expended and the echo ends. This does not cause the creature to unlearn a maneuver it knows from other sources. If the zealot recovers the granted maneuver, this ability ends immediately and the maneuver is removed from the ally. This ability does not allow a creature to have two of the same maneuver readied. The zealot can only have one echoed maneuver at a time; using this ability ends any previous use. A creature can only have an echoed maneuver from one zealot at a time, but a creature may end any echoed maneuver on them as afree action(even if it isn't their turn). At 11th level, the zealot can grant up to two echoed maneuvers at a time. Any given creature may still only know one echoed maneuver at one time. Granting another echoed maneuver while the zealot already has two maneuvers echoed causes the oldest echoed maneuver to be expended and removed from the creature benefiting from it.",
    "mission (su)": "The zealot is defined by his cause. Zealots might pray for guidance on what mission to choose, receive orders through dark, mysterious whispers, decide for themselves after careful analysis, or simply pursue the task that fate puts before them. At 4th level, the zealot chooses a mission, granting him a benefit when he is psionically focused and an ability that can be used by expending his psionic focus. Starting at 8th level, a zealot's mission grants him the ability to augment his maneuvers by spending power points (see below for a full list of missions and their granted abilities). A zealot can spend a maximum number of power points augmenting a maneuver equal to one plus one additional power point for every four initiator levels he possesses (up to a maximum of 6 at 20th level). If the zealot has the ability to augment his maneuvers in other ways, such as from another class feature or the maneuver itself, this cannot be combined with the augments granted by his mission; he must choose which augmentation type to use when initiating the maneuver. Zealot Active Energy Types \n Every psionic character, regardless of whether or not they can manifest powers, has an active energy type (cold, electricity, fie, or sonic) that they choose when they become psionically focused. See Chapter 4 of  Ultimate Psionics  for more details. ( Zealot Missions can be found here )",
    "zealot active energy types": "Every psionic character, regardless of whether or not they can manifest powers, has an active energy type (cold, electricity, fie, or sonic) that they choose when they become psionically focused. See Chapter 4 of  Ultimate Psionics  for more details.",
    "defiance (su)": "At 5th level, the zealot learns to continue supporting his allies while hanging on to his last breath. The zealot gainsDiehardas a bonus feat (even if he do not meet the prerequisites), and does not take damage for using theAid Anotheraction while at or below 0hit points. In addition, the zealot does not die until he reaches negativehit pointsequal to his zealot level plus hisConstitutionscore.",
    "unshakable will (su)": "At 9th level, the zealot is able to maintain his concentration even after dire setbacks. The zealot automatically succeed on theFortitudesave when a member of his collective dies, and automatically succeeds onAid Anotherchecks to grant a member of his collective a bonus toattack rolls or AC.",
    "stalwart (su)": "Starting at 13th level, a zealot can use mental and physical resiliency to avoid certain attacks. If he makes a successfulFortitudeorWillsaving throw against an attack that has a reduced effect on a successful save, he instead avoids the effect entirely. Ahelplesszealot does not gain the benefit of the stalwart ability.",
    "metaphysical transcendence (su)": "At 16th level, the zealot breaks the limitations between ideals and existence; as a word lasts beyond the life the one who spoke it, so the zealot and his allies persist beyond their own mortality. As long as their visions are still carried out, the zealot and his collective can not truly be destroyed. When a member of his collective dies, the creature's soul merges with his collective for up to one day per zealot level. During this time, it can be affected by psionic revivify ,raise deadand similar abilities as if it died within 1 round, without need for the creature's corpse. The creature still counts towards the maximum number of creatures in his collective while merged. If the zealot dies, the creature's soul departs, killing it. At 20th level, when the zealot dies, he can choose to merge with his own collective. While he is merged with his collective, his collective continues to function and he can continue to use theAid Anotheraction, add creatures to his collective, remove creatures from his collective, and merge souls with his collective. Only if all other members of the zealot's collective die does the zealot die. Favored Class Bonuses [ ] Alicorn:  Add +1/3 conviction point to the zealot's pool. \n Blue:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Decataur:  Add +1/4 to the zealot's conviction pool. \n Dromite:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Duergar:  Gain 1/4 of a new zealot conviction. \n Dwarves:  Gain 1/4 of a new zealot conviction. \n Elan:  Add +1/4 of a maneuver known from theSleeping Goddess orEternal Guardiandisciplines. \n Elves:  Gain 1/4 of a new zealot conviction. \n Entoli:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Forgeborn:  Increase the forgeborn'snatural armor bonusby + 1/4. \n Gnome:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Half-elf:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Half-giant:  Gain 1/4 of a new zealot conviction. \n Halfling:  Gain 1/4 of a new zealot conviction. \n Half-orc:  Gain 1/4 of a new zealot conviction. \n Human:  Gain an additional power point per day. \n Maenad:  Add +1/4 of a maneuver known from theElemental FluxorSleeping Goddessdisciplines. \n Ophiduan:  Add +1/2 to the maximum number of creatures in the zealot's collective. \n Rana:  +1 power point per level. \n Thrallspawn:  +1 power point per level. \n Watcher:  Gain +1/6 of a new conviction. \n Xeph:  Add +1/4 of a maneuver known from theSleeping Goddess orEternal Guardiandisciplines. Archetypes [ ] Discordant Crusader Excruciator Void Prophet",
    "alicorn:": "Add +1/3 conviction point to the zealot's pool.",
    "blue:": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "decataur:": "Add +1/4 to the zealot's conviction pool.",
    "dromite:": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "duergar:": "Gain 1/4 of a new zealot conviction.",
    "dwarves:": "Gain 1/4 of a new zealot conviction.",
    "elan:": "Add +1/4 of a maneuver known from theSleeping Goddess orEternal Guardiandisciplines.",
    "elves:": "Gain 1/4 of a new zealot conviction.",
    "entoli: ": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "forgeborn:": "Increase the forgeborn'snatural armor bonusby + 1/4.",
    "gnome:": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "half-elf:": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "half-giant:": "Gain 1/4 of a new zealot conviction.",
    "halfling:": "Gain 1/4 of a new zealot conviction.",
    "half-orc:": "Gain 1/4 of a new zealot conviction.",
    "human:": "Gain an additional power point per day.",
    "maenad:": "Add +1/4 of a maneuver known from theElemental FluxorSleeping Goddessdisciplines.",
    "ophiduan:": "Add +1/2 to the maximum number of creatures in the zealot's collective.",
    "rana: ": "+1 power point per level.",
    "thrallspawn: ": "+1 power point per level.",
    "watcher: ": "Gain +1/6 of a new conviction.",
    "xeph:": "Add +1/4 of a maneuver known from theSleeping Goddess orEternal Guardiandisciplines."
  }
}