{
  "Epilektoi": {
    "Roles": "Like an oracle, an epilektoi (the term is both singular and plural) is a mortal imbued with divine power. However, where an oracle is a master of divine magic, an epilektoi focuses their attention on martial prowess. Though rare, epilektoi are instantly recognizable on the battlefield, as they are often the warriors still standing after taking so many blows theyre more wound than flesh, or stuck with so many arrows they look like a macabre pincushion. These unstoppable adepts are the epitome of the term chosen one.",
    "HD": "d12",
    "bab": "H",
    "Class Features": "An epilektoi is proficient with all simple and martial weapons, and with all armor and shields (including tower shields). Epilektoi are also proficient with the favored weapon of their deity (gaining the Improved Unarmed Strike feat if their deitys favored weapon is an unarmed strike, as normal). Additionally, the favored weapon of their deity is always considered an associated weapon for any maneuvers from disciplines they gain access to from this class.",
    "Weapon and Armor Proficiency": "An epilektoi is proficient with all simple and martial weapons, and with all armor and shields (including tower shields). Epilektoi are also proficient with the favored weapon of their deity (gaining the Improved Unarmed Strike feat if their deitys favored weapon is an unarmed strike, as normal). Additionally, the favored weapon of their deity is always considered an associated weapon for any maneuvers from disciplines they gain access to from this class.",
    "Aura (Ex)": "An epilektoi of a chaotic, evil, good, or lawful deity has a particularly powerful aura corresponding to the deity's alignment (see thedetect evilspell for details).",
    "Maneuvers": "An epilektoi begins their career with knowledge of six martial maneuvers. The disciplines available to them are determined by their deitys alignment. Each aspect of their deitys alignment grants them a choice of two disciplines out of the following list:",
    "Maneuvers Readied/Granted": "An epilektoi can ready four of their six starting maneuvers, and as they advance in level and learn more maneuvers, they are able to ready more, but must still choose which maneuvers to ready. They ready their maneuvers by praying for 10 minutes. The maneuvers they choose remain readied until they decide to repeat this again and change them. Epilektoi do not need to sleep or rest for any long period of time to ready their maneuvers; any time they spend 10 minutes praying, they can change their readied maneuvers. They may not ready any individual maneuver more than once.",
    "Stances Known": "An epilektoi begins their career with knowledge of one stance from any discipline open to them. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, they can select an additional stance to learn. Unlike maneuvers, stances are not expended and the epilektoi does not have to ready them. All the stances they know are available to them at all times, and they can change the stance they are currently maintaining as a swift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description.",
    "Battle Prayer (Su)": "When an epilektoi requires more strength, or is left with few options, they may take a moment to pray, bolstering themself through faith. As a full-round action, an epilektoi may grant themself all of their remaining withheld maneuvers, then immediately expend them in a show of divine force. As there are no remaining maneuvers to be granted, a new set of maneuvers is granted to the epilektoi at the end of their turn, as normal.",
    "Delayed Damage Pool (Ex)": "At 1st level, an epilektoi gains the divine patience of a warrior saint, fortifying their body against attacks. They gain a delayed damage pool. When an encounter begins, the pool starts at 0. The maximum number of points the pool can hold is equal to 1/4 the epilektois maximum hit points (rounded up). Whenever the epilektoi takes damage, a portion of this damage is added to the pool instead of being subtracted from their hit points, and delayed until the end of their next turn. Delaying damage does not require an action, and happens automatically.",
    "Bonus Feat": "At 3rd level and every 4 levels thereafter, the epilektoi gains a bonus combat feat. They must meet the prerequisites for these feats as normal.",
    "Implacability": "At 2nd level and every 2 levels thereafter (up to 18th level), an epilektoi advances upon their journey to become an unstoppable force. They gain an implacability of their choice. Unless otherwise noted, an epilektoi cannot select an individual implacability more than once. Some implacabilities can only be gained if the epilektoi has met certain prerequisites first, such as gaining other implacabilities. The DC of any saving throw called for by an implacability is equal to 10 + 1/2 the epilektois level + the epilektois initiation modifier.",
    "Aligned Disciplines (Ex)": "At 3rd level, an epilektoi discovers a link between two of their disciplines, combining them into a single flawless style. They may choose two of their available disciplines which are not linked to opposed alignments (such as Silver Crane and Cursed Razor, or Golden Lion and Primal Fury). From now on, the epilektoi may treat these two disciplines as one. Their associated weapons are combined, their maneuvers count towards each ones prerequisites for the other, feats which grant a bonus to one grant it to the other, etc. When the epilektoi makes a skill check with the associated skill of one aligned discipline, they may make the check with the bonus of the other aligned disciplines skill instead.",
    "Will of the Gods (Su)": "At 3rd level, an epilektoi adds their initiation modifier (if any) as a bonus on Fortitude and Reflex saves. This does not stack with similar abilities, such as a paladins divine grace.",
    "Patient Counterpoint (Ex)": "At 5th level, an epilektoi reaches a new level of inspiration, returning a measure of the pain inflicted by their foes. During their turn, they gain an insight bonus to damage rolls equal to their initiation modifier whenever their delayed damage pool has points in it.",
    "Aligned Defense (Ex)": "At 9th level, whenever they ready their maneuvers, the epilektoi may choose one counter from each of their aligned disciplines. The epilektoi may expend any granted maneuver of equal or higher level to initiate these counters, even if they are not readied or granted.",
    "Intervention (Su)": "At 13th level, an epilektoi can request aid from their deity, and be answered, after a fashion. Once per encounter as a free action, the epilektoi can expend one of their granted maneuvers and replace it with any one of their known maneuvers from their aligned disciplines. This maneuver is immediately readied and granted.",
    "Deific Counter (Ex)": "At 17th level, an epilektoi may use their aligned defense counters even on natural 20 attacks.",
    "Deific Implacability": "At 20th level, the epilektoi comes as close to godhood as a mortal can be. They immediately learn two normal implacabilities, but also learn a third implacability chosen from the list of deific implacabilities, representing their spark of divinity becoming a roaring flame. Additionally, all of their maneuvers are considered to come from a mythic source."
  },
  "medic": {
    "Roles": "While everyone would love the opportunity to receive the healing magics of the great churches, genius alchemists or noble paladins, the service of such heroes is a rare and valuable thing. Not everyone can afford the cost of such potent magics. For the rest of the world, natural healers great and small service those who are in need of care. On the battlefield, where wounds, disease and death run rampant, the ones who answer this call are known as medics. These brave warriors possess a keen wisdom and insight into the healing arts, which they use to aid their brothers on the field of combat. Though a medics hands can heal, they are no slouches in combat, and their strength in arms can rival any warrior.",
    "HD": "d8",
    "bab": "M",
    "Class Features": "The following are the class features of the medic.",
    "Weapon and Armor Proficiency": "A medic is proficient with all simple and martial weapons, with light and medium armor, and with shields (except for tower shields).",
    "Maneuvers": "A medic begins her career with knowledge of five martial maneuvers. The disciplines available to her areBroken Blade,Iron Tortoise,Golden Lion,Steel Serpent, andTempest Gale.",
    "Maneuvers Readied": "A medic can ready three of her five maneuvers known at 1st level, and as she advances in level and learns more maneuvers, she is able to ready more, but must still choose which maneuvers to ready. A medic must always ready her maximum number of maneuvers readied. She readies her maneuvers by meditating or studying for ten minutes. The medic does not need to sleep or rest for any long period of time in order to ready her maneuvers; any time she spends ten minutes studying or meditating, she can change her readied maneuvers. A medic begins an encounter with all her readied maneuvers unexpended, regardless of how many times she might have already used them since she chose them. When she initiates a maneuver, she expends it for the current encounter, so each of her readied maneuvers can be used once per encounter (unless she recovers them, as described below).",
    "Stances Known": "A medic begins her career with knowledge of one stance from any discipline open to medics. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, she can select an additional stance to learn. Unlike maneuvers, stances are not expended and the medic does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently maintaining as a swift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description. Unlike with maneuvers, a medic cannot learn a new stance at higher levels in place of one she already knows.",
    "Medics Training (Ex)": "Early on in her career, a medic quickly learns to assess the battlefield in order to prioritize the needs of her allies against the dangers that her enemies present. Once per round as a free action (even if it is not her turn) the medic can assess the health of her allies. The medic is able to determine their current hit points, any conditions (including poisons or diseases) affecting them, and the duration of these conditions. As part of using this ability, the medic may also make a Heal check to assess the current health and condition of her opponents. She rolls her Heal check once and uses it for each opponent, comparing it to a DC of 10 + the opponent in question's CR. Failing this check against an opponent prevents the medic from assessing that opponent's health for one round.",
    "Triage (Ex)": "A medic must be able to react immediately to any danger that threatens her allies. At 1st level, a medic gains the ability to perform a triage as a swift action. When she does, she can move up to her speed, so long as she ends her movement adjacent to an ally. That ally is healed for a number of hit points equal to three times the medics initiator level. This increases to four times her initiator level at 7th level and five times her initiator level at 14th level. In addition, she can apply the effects of one of her medic's expertises (see page X) to the ally, if applicable. The medic can also perform a triage on herself; she does not move when she does so. A medic can use this ability three times per encounter at 1st level, plus one additional time per encounter at 4th level and every three levels thereafter.",
    "Medics Expertise (Ex)": "As the medic gains experience, she picks up various useful tricks to help her be more effective at the job of saving her friends. At first level, the medic learns two expertises, and she learns a new expertise at second level and every even numbered level thereafter. Medics expertise that apply to her use of her triage ability are marked with an asterisk *.Medic Expertises can be found here.",
    "Improved Treatment (Ex)": "Starting at 2nd level, when the medic treats deadly wounds, the creature she treats recovers hit points and ability score damage as if it had rested for a full day and she no longer needs a healers kit to perform these actions. At 6th level, the medic can treat deadly wounds or provide long term care to a number of creatures equal to her initiation modifier at the same time. In addition, when the medic treats a creatures deadly wounds it recovers hit points as if it had rested for a full day with long term care. At 11th level, when the medic treat deadly wounds, the creature recovers hit point and ability damage as if it had rested for 3 days.",
    "Cura Te Ipsum (Ex)": "Starting at 3th level, the medics martial training enhances her ability to defend herself while she ensures the health and safety of her allies. Whenever the medic initiates a strike maneuver she gains a +1 insight bonus on Reflex and Will saves until the start of her next turn. This bonus increases by +1 at 7th level and again at every four levels thereafter.",
    "Improved Triage (Ex)": "At 5th level, the medic can apply the effect of two medics expertises of her choice to any use of her Triage ability. At 10th level, she may apply the effect of a third medics expertise, and at 15th level, a fourth.",
    "Guardian of Life (Su)": "The medics dedication to the health and wellbeing of her allies is translated into an aggressive defense of their lives. Starting at 6th level, once per day the medic can initiate a counter as a free action (even if it is not her turn) in defense of her ally. This counter can only be used to protect an ally within 30 feet of the medic. The ally is treated as if they had initiated the counter in response to the attack, but uses any relevant modifiers (initation modifier, base attack bonus, skill bonus, and the like) from the medic instead of the ally. She may only use this ability once per round. The medic can use this ability one additional time per day at 12th and 18th level.",
    "Resuscitation (Ex)": "Starting at 9th level, the medics ability to treat severe wounds allows her to bring allies back from the very brink of death. The medic can use her triage ability to heal allies that have died within 1 round. If the healed creature's hit point total is at a negative amount less than its Constitution score, it comes back to life and stabilizes at its new hit point total. If the creature's hit point total is at a negative amount equal to or greater than its Constitution score, the creature remains dead. Creatures slain by death effects cannot be saved by resuscitation.",
    "Improved Resuscitation (Sp)": "At 14th level, the medics ability to stave off the death of her allies broaches on the supernatural. Once per week, she can use raise dead as a spell-like ability, with a caster level equal to her medic initiator level.",
    "Greater Resuscitation (Sp)": "At 17th level, the medics skill at treating wounds is so great she can perform truly spectacular feats of medicine. Once per month, she can use true resurrection as a spell-like ability, with a caster level equal to her medic initiator level.",
    "Master Medic (Ex)": "At 20th level, the medic is such an expert of the healing arts that she can apply any number of medics expertise that she knows to her triage ability."
  },
  "mystic": {
    "Roles": "Born with an untamed magical power buried deep within his soul, the mystic is a warrior who, much like a sorcerer, is filled with untapped energies. This power however, is too primal and unstable, and is difficult to be formed effectively into a spell. By following a martial medium to tame this energy, the mystic is able to shape his wild power into martial maneuvers and this allows him to discover the deeper mysteries of his own inborn power.",
    "HD": "d8",
    "bab": "M",
    "Class Features": "All of the following are class features of the Mystic.",
    "Weapon and Armor Proficiency": "A mystic is proficient with all simple and martial weapons, katanas and wakizashis, and with light armor and shields (except tower shields).",
    "Maneuvers": "A mystic begins her career with knowledge of seven martial maneuvers. The disciplines available to her areElemental Flux,Mithral Current,Riven Hourglass,Shattered Mirror,Solar Wind, andVeiled Moon.",
    "Maneuvers Readied/Granted": "A mystic can ready five of her seven maneuvers known at 1st level, and as she advances in level and learns more maneuvers, she is able to ready more, but must still choose which maneuvers to ready. A mystic must always ready her maximum number of maneuvers readied. She readies her maneuvers by meditating for ten minutes. The maneuvers she chooses remain readied until she decides to meditate again and change them. The mystic does not need to sleep or rest for any long period of time in order to ready her maneuvers; any time she spends ten minutes in meditation, she can change her readied maneuvers.",
    "Stances Known": "A mystic begins her career with knowledge of one stance from any discipline open to mystics. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, she can select an additional stance to learn. Unlike maneuvers, stances are not expended and the mystic does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently maintaining as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description.",
    "Animus (Su)": "A mystics martial prowess is in part fueled by a reservoir of roiling, turbulent energy within her soul, and the passion and danger of combat causes this arcane energy to overflow outwards. This power, called animus, waxes and wanes with a mystics use of her maneuvers in battle. Outside combat, a mystic has no animus to spend, but her inner power can still be used for more subtle arcane arts. Her levels in mystic count as arcane spellcaster levels for the purposes of qualifying for prerequisites (such as those ofitem creationfeats or theArcane Strikefeat), and if a mystic ever develops arcane spellcasting from another class, she may add her mystic level to her levels in that class to determine her overallcaster levelfor the purposes ofitem creationfeats.",
    "Elemental Attunement (Su)": "A mystic contains incredible elemental power within her body, surging energies that constantly flow through her blood and muscle. Bringing these energies to bear is as easy as breathing for a mystic, shifting the flow of power with the subtle movements of her martial stances. When a mystic readies her maneuvers, she may select one of the following elements (and associated energy type) to be heractive element: air (electricity), earth (acid), fire (fire), and water (cold).",
    "Blade Meditation (Su)": "When a mystic finds that her martial power is beginning to wane or that few options remain available for use, she can pause in battle, drawing on her inner well of animus to reinvigorate her body and mind. As afull-round action, a mystic can spend one point of animus to grant herself all her remaining withheld maneuvers, then immediately expend them in a raging cadence of arcane power. As there are no remaining maneuvers to be granted, a new set of maneuvers is granted to the mystic at the end of her turn, as normal.",
    "Bonus Feat": "At 2nd level and every five levels thereafter, a mystic gain a bonuscombat oritem creationfeat. She must meet the prerequisites for these feats as normal.",
    "Arcane Defense (Ex)": "Starting at 2nd level, the sorcerous power within a mystics body makes her resilient to the supernatural. These energies defend her from magical and psionic powers, granting her a +1insightbonus to her AC and saving throws against psionic powers, psi-like abilities, spells, andspell-like abilities. This bonus increases by +1 at 6th level, and again at 11th level, 16th level, and 20th level.",
    "Elemental Glyph (Su)": "Starting at 3rd level, a mystic learns to aid her friends with the arcane power of the elements. Although at first this surging energy was raw and unformed, she has begun to master this ability, and can use it to empower her allies, granting them benefits in combat. As amove action, the mystic can spend one point of animus to apply an elemental glyph to a number of allies equal to her mystic initiation modifier modifier within her sight. The effect of this glyph depends on the element it is associated with, but all glyphs last for a number of rounds equal to 1 + the mystics initiation modifier. A mystic is not limited to casting glyphs of heractive element(as darkness, illumination, and metal have no elemental type). Allies may only be affected by one of her glyphs at a time, with new glyphs ending the current glyph in effect and replacing it on the affected ally. The benefits of these glyphs are cumulative (for example, an 8th level mystic grants both the 3rd level and 8th level benefits to her allies). Different glyphs from different mystics may apply to the same target. Glyphs aresupernaturalabilities and not subject to spells or effects likedispel magic but do not function within anantimagic fieldor similar effect.",
    "Mystic Artifice (Su)": "Starting at 4th level, a mystic is able to channel her animus into her craft, substituting primal arcane energies in place of more ordinary spells. When crafting an item, the mystic uses her initiator level as hercaster levelto determine how potent a creation she can and for the purposes of meetingcaster levelprerequisites. In order to create a spell trigger or spell completion item, the mystics initiator must be at least the minimum required to cast the spell or spells in question. When attempting to create a magical item for which she does not possess a prerequisite spell, the mystic can attempt to replicate the spell through her innate power with aSpellcraftcheck (DC 15 + the level of the spell being replicated). If successful, she can create the item as if she had cast the prerequisite spell. The mystic must possess any material components necessary for casting the spell that she is replicating. If the item being created requires multiple spells, she must make this check for each spell she intends to replicate. If she fails the skill check, she may not try again for that spell while creating that itemthe item creation DC increases as normal for the creation of an item without a prerequisite spell in such a case.",
    "Withstand Spell (Su)": "Starting at 5th level, the mystics natural instincts with magic work to protect her, guiding her reactions against offensive spells cast by her enemies and allowing her to siphon off a small amount of that energy for her own use. If the mystic is targeted by a spell,spell-like ability, psionic power, or psi-like ability that normally would have a lesser effect (such as a partial effect) on a successfulFortitudeorReflexsaving throw, she may make aWillsaving throw instead of the effects normal save. If thatWill saving throw is successful, she is completely unaffected by the spell or power, taking no damage and suffering no ill effects. If she fails the saving throw, she suffers the effect as normal, and adds one point of animus to her animus pool.",
    "Instant Enlightenment (Ex)": "Starting at 6th level, a mystic is capable of drawing deep on her training to channel the untapped energies within her, granting her an infinitesimal moment of perfect clarity. Once per day as afree action, the mystic may expend one granted maneuver and instantly replace it with another maneuver she knows. This maneuver is added to her currently granted maneuvers and readied for use, replacing the previous maneuver. At 10th level and every four levels thereafter, the mystic can use this ability one additional time per day.",
    "Quell Magic (Su)": "Starting at 9th level, a mystic can channel her animus to act as a sort of null-magic energy, smothering active magical effects with its flow. In order to use this ability, the mystic must have identified an ongoing spell or power through aSpellcraftcheck or other method. As astandard action, she can spend a number of points of animus equal to that spell or powers level to suppress (as if by anantimagic fieldspell) that spell or power for a number of rounds equal to her mystic initiation modifier. Time spent suppressed counts against the suppressed spell or powers duration. This ability can only be used on effects within 30 feet, although the mystic does not need to identify the effect while it is within that range, and it remains suppressed even if it leaves that range.",
    "Font of Animus (Su)": "At 15th level, a mystic gains the ability to draw in energy from the world around her, converting it into animus to fuel her own primal power. As amove action, the mystic can add a number of points of animus to her animus pool equal to 1d6 + her mystic initiation modifier. Unlike other animus abilities, this may be used outside of combat to generate a small pool of animus that persists for one minute outside of combat. A mystic cannot use this ability multiple times to accumulate animus; additional attempts only reset her animus pool to 1d6 + her mystic initiation modifier. The mystic may use this a number of times per day equal to her mystic initiation modifier + 1 (minimum of 1).",
    "Glyph Mastery (Su)": "At 20th level, a mystics control over her elemental powers are strong enough that she can manifest two elemental glyphs at the same time. As amove action, the mystic may spend two points of animus and manifest an elemental glyph of any two elements, regardless of heractive element. These glyphs otherwise function as her elemental glyphs class feature."
  },
  "parasite": {
    "Roles": "Warfare constantly evolves, and so too must those who practice it. The most dangerous soldiers areoften the ones who indulge in the constant escalation of battle, altering themselves in body and mind to accommodate the shifting tides of misery so that they may champion it. Thriving off the misery of others, these beings known as parasites immerse themselves in carnage and disarray in order to emerge from the crucible like steel from the forge.",
    "HD": "d8",
    "bab": "M",
    "Class Features": "The following are the class features of the parasite.",
    "Weapon and Armor Proficiency": "A parasite is proficient with all simple and martial weapons, with light armor, and with shields (except tower shields).",
    "Maneuvers": "A parasite begins their career with knowledge of seven martial maneuvers. The disciplines available to them areElemental Flux,Cursed Razor,Leaden Hyena,Steel Serpent,Shattered Mirror, andVeiled Moon. Undead and other parasites healed by negative energy can exchange one of these disciplines forUnquiet Graveinstead.",
    "Maneuvers Readied/Granted": "A parasite can ready five of their seven maneuvers known at 1st level, and as they advance in level and learns more maneuvers, they is able to ready more, but must still choose which maneuvers to ready. A parasite must always ready their maximum number of maneuvers readied. They ready their maneuvers by meditating for ten minutes. The maneuvers they choose remain readied until they decide to meditate again and change them. The parasite does not need to sleep or rest for any long period of time in order to ready their maneuvers; any time they spend ten minutes in meditation, she can change her readied maneuvers.",
    "Stances Known": "A parasite begins their career with knowledge of one stance from any discipline open to him. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, they can select an additional stance to learn. Unlike maneuvers, stances are not expended and the parasite does not have to ready them. All the stances they know are available to them at all times, and they can change the stance they are currently maintaining as a swift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description.",
    "Animus (Su)": "A parasites power shifts and twists with the flow of battle. This power, called animus, waxes and wanes with a parasites use of their maneuvers in battle. Outside combat, a parasite has no animus to spend, but can spend time outside of combat to replicate animus-based abilities in a process that requires 1 minute per point of animus that would have been spent.",
    "Renewal (Su)": "When a parasites martial power is beginning to waver or that few options remain available for use, they can pause to draw upon the new experiences of the conflict, formulating new strategies and adaptations while repairing himself. As a full-round action, a parasite can spend one point of animus to grant himself all their remaining withheld maneuvers, then immediately expend them. As there are no remaining maneuvers to be granted, a new set of maneuvers is granted to the parasite at the end of their turn, as normal. When the parasite does this, the parasite recovers 1d6 hit points for every remaining point of animus in their pool.",
    "Siphon (Su)": "As their opponents struggle, a parasite grows in power, harvesting energy from their weakness. When a parasite affects a creature with a strike, counter, or boost-affected attack, they gain 1 point of animus and the affected creature takes a -1 penalty on attack rolls for a number of rounds equal to the parasites initiation modifier (minimum 2). This ability can be used once per round at 1st level, and this penalty does not stack with itself.",
    "Mutation": "At 2nd level and every 2 levels thereafter, the parasite alters themself in some way to amplify their abilities. They select one mutation at each of these levels, but cannot select an individual mutation more than once unless the mutation specifies otherwise.",
    "Crippling Siphon (Su)": "At 3rd level, the parasites siphon ability becomes more tenacious, afflicting the target with an additional negative effect for the duration of the siphon. The parasite chooses one effect at 3rd level and every 4 levels thereafter. Whenever they affect a creature with siphon, they may apply one crippling siphon effect they know to the target as well. Any penalty a crippling siphon inflicts is equal in value to the attack penalty imposed by siphon. These penalties do not stack with themselves, but a target can be affected by any number of crippling siphons. If the crippling siphon was triggered as part of an attack, the effects of the crippling siphon are not applied to any damage or saving throws that are part of the triggering attack.",
    "Phages Resilience (Ex)": "As a parasite matures, their physiology adapts to better defend against various hazards. At 5th level and every 4 levels thereafter, a parasite gains a new method of defending against oncoming attacks.",
    "Dual Siphon (Ex)": "At 11th level, the parasites siphon ability grows more potent, afflicting the foe in numerous ways. When the parasite use siphon on a creature, the parasite may apply two crippling siphons on the target rather than 1.",
    "Animus Well": "At 16th level, a parasite gains the ability to draw in energy from the world around them, converting it into animus to fuel their own primal power. As a move action, the parasite can add a number of points of animus to their animus pool equal to 1d6 + their parasite initiation modifier. Unlike other animus abilities, this may be used outside of combat to generate a small pool of animus that persists for one minute outside of combat. A parasite cannot use this ability multiple times to accumulate animus; additional attempts only reset their animus pool to 1d6 + their parasite initiation modifier. The parasite may use this a number of times per day equal to their parasite initiation modifier + 1 (minimum of 1).",
    "Ascendant Abomination (Ex)": "At 20th level, the parasite transforms into a potent and nigh-invulnerable entity capable of adapting to most any circumstance. Whenever the parasite meditates to change their readied maneuvers, they may exchange one of their mutations for another which they meet the prerequisites for. In addition, if the parasite is slain, they are automatically restored to life after 24 hours as pertrue resurrectionunless awish,miracle, or similar effect is used on their corpse to terminate their existence."
  },
  "rajah": {
    "Roles": "King. Pharaoh. Empress. Ruler. These are the natural aliases of the Rajah. Rising above their peers on both the battlefield and off, the rajah blends their Akashic might with martial prowess to control the tide of battle. No single mortal can win a war, and the rajah knows this better than anyone. With their unique akashic gifts, they bring out the potential of their allies, turning even the most inexperienced soldier into a dervish of steel and death. These few marked by fate are destined to be remembered by historyeither as benevolent kings, or conquering tyrants.",
    "HD": "d6",
    "bab": "L",
    "Class Features": "The following are the rajahs class features. Some rajah class features refer to entitled creatures; an entitled creature is one with one or more of the rajahs titles shaped onto them. Unless otherwise noted, these class features only refer to creatures the rajah herself has entitled, not those entitled by other veilweavers.",
    "Weapon and Armor Proficiencies": "A rajah is proficient with all simple and martial weapons, with light armor, and with shields (except tower shields).",
    "Maneuvers": "A rajah begins her career with knowledge of five martial maneuvers. The disciplines available to her areGolden Lion,Radiant Dawn,Scarlet Throne,Solar Wind, and one discipline of the initiators choice.",
    "Maneuvers Readied": "A rajah can ready three of her five maneuvers known at 1st level, and as she advances in level and learns more maneuvers, she is able to ready more, but must still choose which maneuvers to ready. A rajah must always ready her maximum number of maneuvers readied. She readies her maneuvers by meditating over her akashic might and her duties as a ruler for ten minutes. The maneuvers she chooses remain readied until she decides to meditate again and change them. The rajah does not need to sleep or rest for any long period of time in order to ready her maneuvers; any time she spends ten minutes in communion with her akashic power, she can change her readied maneuvers.",
    "Stances Known": "A rajah begins her career with knowledge of one stance from any discipline open to rajahs. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, she can select an additional stance to learn. Unlike maneuvers, stances are not expended and the rajah does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently maintaining as a swift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description.",
    "Veilweaving": "A rajahs presence on the battlefield is marked not only by her martial skill, but also by her ability to shape the magical essence known as akasha into powerful veils and bindings. The rajah knows and can shape any veil from therajah veil list. The DC for a saving throw against a veils abilities is 10 + the number of points of essence invested in the veil + the rajahs initiation modifier. The rajah can only shape a limited number of veils per day, as listed on Table 1-1: Rajah. Veils are constructs of pure magic and, as such are suppressed while in the area of anantimagic fieldor similar effect. Title veils are described in full detail on page 10.",
    "Royal Mandate (Su)": "With a word, the rajah spurs on her allies, creating an opportunity to recover her strength. As a standard action, a rajah can issue a command to one of her allies within close range (25 feet plus 5 feet per two rajah levels) that can perceive her. When she does so, she chooses one of the following orders to issue, and the affected ally may obey the command as a free action (even if it isnt their turn).",
    "Vassalage (Su)": "When the rajah grants a title to one of her allies, her akashic essence lingers on the entitled. As long as the entitled remain under her watchful eye, none may strike them without fear of retaliation. This akashic essence takes many forms, from an akashic aura to a condensed akashic insignia, but the threat and its origin is unmistakable.",
    "The Crossroads (Ex)": "With sword in hand, the rajah cuts a path that follows ways only known to her. At 1st level, she chooses one of the following benefits; once this choice is made, it cannot later be changed.",
    "House of Servants (Su)": "A rajah has no need to personally attend to mundane matters. At 2nd level, as a free action, the rajah can surround herself with a number of nearly-intangible servants equal to her rajah initiation modifier. These servants function as if they were created by theunseen servantspell, except that they have an effective Strength score equal to 4 + the rajahs initiation modifier and they cannot take the aid another action. A servant who strays farther than close range (25 feet + 5 feet per two rajah levels) winks out, but can be recreated as a free action; these servants otherwise last indefinitely so long as they remain within that range and within the rajahs line of effect. The rajah can also dismiss her servants as a free action. Unlike normalunseen servants,a rajahs servants have a unique appearance determined by the rajah, and can talk (although being mindless, they only say what theyre told to say). They remember orders and their appearances, even if dismissed and resummoned at a later time. The details vary from rajah to rajah, but the servants are always partially transparent and obviously not creatures. Theseunseen servantscan castprestidigitationan unlimited number of times per day as a spell-like ability, when directed to do so by the rajah. A rajah can also make her servants invisible (or return them to visibility) as a free action. Veils cannot be shaped ontounseen servants. Finally,unseen servantscreated through this class feature gain any additional movement modes that the rajah may have (such as a fly speed or swim speed) at the same speed as the rajah. Should the rajah lose or acquire new movement modes, her unseen servants lose or gain these movement modes respectively.",
    "Heraldry": "Not all wars can be won on the battlefield, a lesson that many rajahs fail to learn. At 3rd level and every two levels thereafter, the rajah gains a heraldry from the following list. Unless otherwise noted, a rajah can only select an individual heraldry once. Heraldries that grant the rajah or her unseen servants spell-like abilities use the rajahs class level as their caster level, and use the rajahs initiation modifier to determine their saving throw DCs and the bonus the rajah and her servants use on concentration checks. Heraldries share their daily uses across all unseen servants, even if they are all dismissed and re-summoned.",
    "Empowered Titles (Su)": "At 4th level, a rajahs mastery over akasha enables her to bind titles for greater effects. The rajah can bind title veils she has shaped onto her allies to the Belt, Body, Chest, Feet, Hands, Head, Headband, Neck, Shoulders, and Wrists slots, even if she cannot normally bind veils to those slots. The rajah, however, is limited in how many titles she can have bound at once, as noted by Table 1-1: Rajah. This limit only applies to veils gained from the rajahs Veilweaving class feature; veils gained through feats or through another class follow their own rules. More information about titles can be found on page 10.",
    "Warrior of the Court (Ex)": "A rajah is a warrior of both steel and words. At 4th level, the rajah selects two of her class skills, gaining a +2 bonus to these skills. These chosen skills become the rajahs courtly skills.",
    "Indomitable (Ex)": "At 6th level, a rajahs mind is an iron fortress. Whenever she makes a Will save against a mind-affecting effect, she may roll two d20s and take the higher result (even if she isnt aware of the effect in question).",
    "Regality (Su)": "At 10th level, a rajah rises above the concerns of the mortal body and mind. She becomes immune to fear effects, and the essence capacity of all of her veils and class feature essence receptacles increases by one (This does not affect akashic items, maneuvers, or other non-listed receptacles). The rajah may invest essence in this ability as if it were a veil, gaining an insight bonus on saving throws equal to the amount of essence invested into this ability.",
    "Divine Mandate (Su)": "At 12th level, a rajah can invoke the latent akasha in other beings, bolstering their natural abilities. By spending one hour blessing an ally other than herself, she can grant them a +2 inherent bonus to one of their ability scores. Unlike other inherent bonuses, this stacks with any other inherent bonus they may already have, up to a maximum bonus of +5. She may have a maximum number of allies blessed in this way equal to her rajah initiation modifier, and may rescind her blessing as a free action, regardless of the distance separating her and the blessed ally. She treats any creature she has blessed as if she had cast thestatusspell on them. At 18th level, the bonus granted by this ability increases to +4, though it may still only stack with other inherent bonuses up to a maximum of +5. A creature can only benefit from a single divine mandate at any one time; a rajah cannot place a blessing onto an ally who already is benefiting from a divine mandate.",
    "Symbol of Authority (Su)": "With a grand gesture, the rajah extends her indomitable will to her allies. Starting at 14th level, a rajah can grant one of her allies the effect of her indomitable class feature for a single Will save against a mind-affecting effect. She can only do so once per round, and activating this ability is a free action that can be taken even if it isnt her turn.",
    "Earthbound Immortal (Su)": "At 20th level, the essence that flows through the rajah fills her with immortal power. She no longer takes penalties to her physical ability scores due to aging, and does not die of old age when she normally would. If she is already taking such penalties, they are removed at at this time. When she would die or would be destroyed, her soul instead escapes its mortal limits, becoming for a brief moment a near-infinite source of akasha. During this time, her soul cannot be attacked or targeted by spells or similar effects, and any penalties that she had while she was alive do not carry over. Otherwise, she may continue to move and act normally. After a number of rounds equal to the rajahs initiation modifier have passed, this effect ends, and she passes on as normal for when she is killed or destroyed. Additionally, during this time, each point of essence invested in her receptacles grants twice its usual benefit."
  },
  "stalker": {
    "Roles": "An effective warrior wielding both skill and stealth, the stalker is a martial disciple who battles in the deep shadows and the hidden underworld of night. Through rigorous training and deep, intuitive instincts, the stalker is a trained killer whose very art is considered illegal in some places. Part mystic, part warrior, and part assassin, the stalkers arts are varied, but always deadly.",
    "HD": "d8",
    "bab": "M",
    "Class Features": "All of the following are class features of the stalker.",
    "Weapon and Armor Proficiency": "Stalkers are proficient with all simple and martial weapons, and with light armor. Stalkers are not proficient with shields of any kind.",
    "Maneuvers": "A stalker begins his career with knowledge of six martial maneuvers. The disciplines available to him areBroken Blade,Solar Wind,Steel Serpent,Thrashing Dragon,Veiled Moon, andeitherRiven HourglassorTempest Gale. If he does not have that disciplines associated skill as a class skill, he gains it as a class skill.",
    "Maneuvers Readied": "A stalker can ready four of his six starting maneuvers, but as he advances in level and learns more maneuvers, he must choose which maneuvers to ready. He readies his maneuvers by meditating and focusing hiskifor 10 minutes. The maneuvers he chooses remainreadieduntil he decides to repeat this again and change them. Stalkers do not need to sleep or be well rested to ready their maneuvers; any time he spends 10 minutes in meditation, he can change hisreadiedmaneuvers. He may not ready any individual maneuver more than once. He begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times he may have already used them since he chose them. When the stalker initiates a maneuver, he expends it for the current encounter, so each of hisreadied maneuvers can be used once per encounter (until they are recovered, see below).",
    "Stances Known": "Stalkers begin play with knowledge of one stance from any discipline open to stalkers. At the indicated levels (see class table), the stalker selects an additional new stance. Unlike maneuvers, stances are not expended and he does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the stalker cannot learn a new stance at higher levels in place of one he already knows.",
    "Ki Pool (Su)": "At 1st level, a stalker gains a pool ofkipoints,supernaturalenergy he can use to accomplish amazing feats. The number of points in the stalkerskipoolis equal to 1/2 her stalker level + his stalker initiation modifier (minimum of 1).",
    "Deadly Strike (Ex)": "The stalker is capable of maximizing his deadliness whenever he lands a critical blow upon his opponent, opening his target up for future punishment as the stalker becomes attuned to his prey. Whenever the stalker scores a successfulcritical hitagainst a creature, his deadly strike ability activates against that creature for a number of rounds equal to his stalker initiation modifier. Deadly strike inflicts extra damage, to only this target creature, on all of the stalkers attacks. This extra damage is 1d6 at 1st level, and increases by 1d6 for every four stalker levels thereafter. When the stalker scores acritical hit, this extra damage is not multiplied, it is simply added to the damage. If the stalker scores a successfulcritical hitduring the time his deadly strike is active, the duration of this ability is extended by one round (no more than one extension can be made per round). Ranged attacks can count as deadly strikes only if the target is within 30-ft.. Deadly strike is more effective with weapons with higher critical multipliers, such as scythes and battle axes. Weapons with a x3 critical multiplier inflict damage with deadly strikes using a d8 instead of a d6, and weapons with a critical multiplier of x4 use d10s. Damage multipliers higher than x4 use d10s for deadly strikes damage.",
    "Stalker Arts": "As a stalker gains experience, he learns a number of arts that aid him and confound his foes. Starting at 1st level, a stalker gains one art; he gains an additional art at 3rd level and new arts every four class levels attained after 3rd level. A stalker cannot select an individual art more than once (unless noted).",
    "Combat Insight (Su)": "At 2nd level, the keen senses and awareness of the stalker delivers him a sort of sixth sense. This insight performs as an intuitive alarm, alerting him of danger. Through his rigorous practice and learning to trust his instincts and intuition to an unearthly level, the senses of the stalker are unusually sharp.",
    "Dodge Bonus (Ex)": "The stalkers heightened perception of danger allows him to defend himself from attacks as they are made against him, anticipating the attacks as they come. A stalker gains a +1dodge bonusto hisArmor Class at 2nd level, which improves by an additional +1 every four stalker levels thereafter. When recovering maneuvers as a full round action, the character may add his stalker initiation modifier to his AC as an additionaldodge bonus; his defensive precognition being heightened by centering hiskithrough maneuver recovery.",
    "Blending (Su)": "At 6th level the stalkers natural attunement to the flow ofkiin other people grants him insight in reading others and avoiding their notice. The character gains a +2insight bonustoPerception,Sense MotiveandStealthchecks. At 16th level, the stalkers abilities improve further, and the character is permanently under the effects of apass without tracespell.",
    "Dual Strike (Ex)": "Once per day at 10th level, the stalkers deadly skill in combat improves, allowing him to initiate two martial strikes as a full round action. The strikes the stalker initiates must have an initiation action of onestandard action, and he must have both strikesreadied. Boosts may not be applied to a dual strike due to the need to concentrate on two separate martial movements. When a dual strike is used, the action must be declared beforehand when used, both strikes are resolved separately and are expended. At 14th level the character may use dual strike twice per day, and three times per day at 18th level.",
    "Retributive Ki (Su)": "At 20th level, the stalkers mysticalkipower allows for him to generate a powerful burst of energy to gain retribution on those who would injure him. When the stalker is harmed by an attack, spell, or ability of an enemy, as animmediate actionhe may spend twokipoints to initiate a martial strike that he hasreadied(with an initiation action of onestandard action) in retaliation against that attack. He uses the range of the attackers ability as the range of his strike, creating a phantom echo of himself with hiski(as with the phantom reach art) that rushes out and strikes his attacker if they are outside of the stalkers normal reach. Use of this ability expends his strike as normal, and the strike functions as normal otherwise."
  },
  "voltaic": {
    "Roles": "I am the storm, lightning is my blade, and thunder echoes in my steps.",
    "HD": "d10",
    "bab": "H",
    "Class Features": "The following are the class features of the voltaic.",
    "Weapon and Armor Proficiency": "A voltaic is proficient with all simple and martial weapons and with all armor (heavy, light, and medium) and shields (including tower shields).",
    "Martial Flexibility": "A voltaic can take a move action to gain the benefit of a combat feat they dont possess. This effect lasts for 1 minute. The voltaic must meet all the feats prerequisites. They may use this ability a number of times per day equal to 3+1/2 their voltaic level (minimum 1).",
    "Spark of Inspiration": "A voltaic gainsSpark of Inspirationas a bonus feat at 1st level. A character cannot take levels in the voltaic class if they do not meet the prerequisites for Spark of Inspiration.",
    "Learn Stance": "At 2nd level, a voltaic gainsLearn Stanceas a bonus feat. They gains Learn Stance again as an additional bonus feat at 5th, 9th, 13th, and 17th level, choosing a new stance each time. Whenever the voltaic gains Learn Stance as a bonus feat, they may immediately retrain any earlier instances of the feat to gain access to a new stance they qualify for. A voltaic cannot retrain a stance that was used as a prerequisite for another feat, maneuver, prestige class, or other ability.",
    "High Voltage (Su)": "Starting at 3rd level, the voltaics entire being begins to crackle with electric energy as their body and mind respond to the call of combat. The voltaics natural attacks, unarmed strikes, and any manufactured weapon they wield deals an additional 1d4 points of electricity damage; this stacks with electricity damage gained from other sources, such as theshockweapon property.",
    "Path of the Storm": "At 4th level, the voltaic must commit to one of the of the following Paths:",
    "Static Shield (Su)": "From 14th level on, the first time each round that a voltaic deals electricity damage to an opponent with their high voltage ability, they add the number rolled on their high voltage die as a deflection bonus to their AC for 1 round. At 18th level, they also add this value as an insight bonus to their saving throws for the same duration. Electricity damage that is reduced to 0, such as by resistance or immunity to electricity damage, does not trigger this effect."
  },
  "warder": {
    "Roles": "Protective and disciplined warriors, warders are fighting men and women who use their knowledge of warfare, tactics, and strategy combined with superior combat training to accomplish their goals in defending others. Their intellect guides them through battle, and their skill at arms achieves their success.",
    "HD": "d12",
    "bab": "H",
    "Class Features": "All of the following are class features of the warder.",
    "Weapon and Armor Proficiency": "Warders are proficient with all simple and martial melee weapons, with all armor, and with shields (including tower shields).",
    "Maneuvers": "A warder begins her career with knowledge of five martial maneuvers. The disciplines available to her areBroken Blade,Golden Lion,Iron Tortoise,Primal Fury, and eitherEternal GuardianorPiercing Thunderto her list of available disciplines. If she does not have that disciplines associated skill as a class skill, she gains it as a class skill.",
    "Maneuvers Readied": "A warder can ready three of her five starting maneuvers, but as she advances in level and learns more maneuvers, she must choose which maneuvers to ready. She readies her maneuvers by going over battle tactics, through weapon drills, or spending time meditating inprayerfor 10 minutes. The maneuvers she chooses remainreadieduntil she decides to repeat this again and change them. Any given maneuver may only bereadiedonce. Warders do not need to sleep or be well rested to ready their maneuvers; any time they spend 10 minutes in practice or meditation, they can change theirreadiedmaneuvers. She begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times she may have already used them since she chose them. When the warder initiates a maneuver, she expends it for the current encounter, so each of herreadiedmaneuver can be used once per encounter (until they are recovered, see below).",
    "Stances Known": "Warders begin play with knowledge of one stance from any discipline open to warders. At the indicated levels (see class table), the warder selects an additional new stance. Unlike maneuvers, stances are not expended, and she does not have to ready them. All the stances she knows are available to her at all times, and she can change the stance she is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the warder cannot learn a new stance at higher levels in place of one she already knows.",
    "Defensive Focus (Ex)": "At 1st level, the defensive prowess of the warder is second to none, allowing her to focus her actions purely on defending himself and her allies in ways that cannot be replicated. The warder gains theCombat Reflexesfeat as a bonus feat, using herwarder initiation modifier in place of herDexteritymodifier to determine the number of additionalattacks of opportunityshe may make each round.",
    "Aegis (Ex)": "At 1st level, the warders defensive prowess extends to those who choose to stay near to him. Allies who are within 10 ft. of the warders position gain a +1morale bonustoArmor Classand toWillsaves under the warders defensive aegis, her presence bolstering and shepherding the defenses of her allies. This bonus improves to +2 at 5th level (+3 at 9th level, +4 at 13th level, and +5 at 17th level). The warder does not receive this bonus, but may receive the benefits of this ability from another warder. If the ally cannot see or hear the warder, then the ally does not gain the benefits of this ability (such as if the warder is concealed orinvisible).",
    "Armigers Mark (Ex)": "At 2nd level, a warder is trained in how best to control her enemies and how they behave in battle, urging them to throw their all against the warders indomitable armor and unyielding shield. With a sharp blade, a clever taunt, or something that otherwise attracts her foe, the warder can direct the attention of enemies towards himself. Whenever the warder attacks a foe in combat and inflict at least 1 point of damage, as afree actionshe may mark them as her foe (he may even mark a foe during anattack of opportunityand may make thefree actionto do so, even though it is not her turn) and attempt to continue to force them to engage the warder only. The target is aware of being marked, and the mark remains for a number of rounds equal to her warder initiation modifier (minimum of 1). Marked targets suffer a -4 penalty toattack rollsagainst foes that are not the warder, and arcane spellcasters suffer an increase in arcane spell failure of 10% + 1% per two warder levels until the mark expires. The warder may only maintain a number of marks equal to 3 + her warder initiation modifier at a time, and she may make a number of marks per day equal to 1/2 warder level +warder initiation modifier. At 8th level, this penalty increases to -6, and it increases again to -8 at 16th level. This ability functions on creatures with anIntelligencescore of 1 or more, allowing her to markanimalsand other beasts as well as sentient beings, but not mindless creatures such asskeletons. Multiple armigers marks overlap (do not stack).",
    "Bonus Feat": "At 3rd level and every 5th level thereafter, a warder receives a bonuscombatorteamworkfeat. She must meet all prerequisites for these feats.",
    "Tactical Acumen (Ex)": "At 4th level, the combat training that the warder has received hones her reflexes. Through her knowledge of tactics, training manuals, and lessons in the histories of war, her wits aid her when her agility may be impaired by her heavy armor. The warder may add her warder initiation modifier to herReflexsaves and to herinitiativein place of herDexteritymodifier (using the higher of the two bonuses).",
    "Extended Defense (Ex)": "Upon reaching 5th level, the warder becomes ever more skilled at adapting to the flow of combat. Once per day, the warder mayactivate Extended Defense as animmediate action. When she does, the character chooses a counter she hasreadied; she may initiate that counter as afree action(even on anothers turn) at will until the beginning of her next turn. At the beginning of her next turn, the chosen counter is expended. Every three levels beyond this (8th, 11th, 14th, and 17th levels), she may use this ability an additional time per day. This ability can only be used with counters that negate attacks or allow the warder to use another roll in place of a saving throw.",
    "Clad in Steel (Ex)": "Having improved her skill with her armor, the warder is a more capable combatant in it when protecting her allies or cause. The warder may subtract her aegis bonus from her total armor check penalty and increase the maximumDexteritybonus on her armor by 1 at 6th level, and by 2 at 12th level.",
    "Adaptive Tactics (Ex)": "A warrior can attempt to plan for everything, but no plan stands against the heat of battle if there is no room for adaptation. At 7th level, the warder can expend one use of her armigers mark ability as afull-round actionto expend up to her warder initiation modifier inreadied maneuvers, then instantly ready an equal amount of maneuvers. The warder may not replace expended maneuvers using this ability; any maneuver she is re-preparing with this ability must be unexpended to be exchanged. She may choose from any of her known maneuvers.",
    "Stalwart (Ex)": "At 12th level, a warder can use mental and physical resiliency to avoid certain attacks. If she makes a successfulFortitudeorWillsaving throw against an attack that has a reduced effect on a successful save, she instead avoids the effect entirely. Ahelplesswarder does not gain the benefit of the stalwart ability.",
    "Steel Defense (Ex)": "At 15th level, the warder is capable of turning an otherwise lethal blow and continue the fight. When an attack that inflicts hit point damage from anatural attack, melee weapon, or ranged weapon would reduce the warder to 0 or fewerhit points, she can make aFortitudesave (DC the attackersattack roll) to deflect the attack to her armor or shield (light, heavy, or tower shields only), causing it to suffer the damage in her place (apply itemhardnessas normal). If this would break the characters armor, it gains thebrokencondition until it is repaired. The warder cannot use this ability withbrokenarmor or abrokenshield. The warder must be wearing armor or a shield to use this ability.",
    "Born of Steel (Ex)": "At 19th level, the warder is so at home in her armor that it is like a second skin, protecting her with its familiar embrace. When wearing medium or heavy armor, the warder is more resistant to critical hits. When a critical threat is rolled against him, the warder may add herwarder initiation modifier to her AC against the critical confirmation roll.",
    "Deathless Defenses (Ex)": "At 20th level, the warder can indefinitely hold a position to protect her allies, even if it may cost her her life. The warder must expend two uses of her armigers mark ability as animmediate actiontoactivateher deathless defenses. While this ability is active, the warder is capable of maintaining her defensive focus as amove action(but recovers no maneuvers unless she spends a full round to recover) but gains the full bonuses of her defensive focus. Additionally, she receives the benefits of her aegis ability as well. She is unable to die from hit point damage while this effect is in use. She may maintain the use of this ability each round at the cost of one use of her armigers mark ability, or she may end it as afree action. Abilities or effects that dont inflict hit point damage, such asenergy drainorability damage, can still kill the warder. While this effect is in use, she is immune tomind-affectingabilities, as her focus prevents any from tampering with her mind. Once this ability ends, either voluntarily or if the character runs out uses of armigers mark (assuming she is notdead), the warder isexhaustedand must rest a full 8 hours to recover."
  },
  "warlord": {
    "Roles": "Dynamos on the field of combat, warlords walk the line of victory and ruin through their determination to achieve glory. Where some may talk tactics, the warlord dives in. Where some may fight in strategic units, the warlord shines alone as an inspirational beacon on the field of combat; to be a warlord is to be a lord of war.",
    "HD": "d10",
    "bab": "H",
    "Class Features": "All of the following are class features of the warlord.",
    "Weapon and Armor Proficiency": "Warlords are proficient with all simple weapons and martial weapons, and with light and medium armor, and with shields.",
    "Maneuvers": "A warlord begins his career with knowledge of six martialmaneuvers. The disciplines available to him areGolden Lion,Primal Fury,Scarlet Throne,Solar Wind,Thrashing Dragon, and eitherPiercing ThunderorTempest Gale. If he does not have that disciplines associated skill as a class skill, he gains it as a class skill.",
    "Maneuvers Readied": "A warlord can ready four of his six starting maneuvers, but as he advances in level and learns more maneuvers, he must choose which maneuvers to ready. He readies his maneuvers by going through weapon drills for 10 minutes. The maneuvers he chooses remainreadieduntil he decides to repeat this again and change them. Warlords do not need to sleep or rest for any long period of time to ready their maneuvers; any time he spends 10 minutes in practice, he can change hisreadiedmaneuvers. He may not ready any individual maneuver more than once. He begins an encounter with allreadiedmaneuvers unexpended, regardless of how many times he may have already used them since he chose them. When the warlord initiates a maneuver, he expends it for the current encounter, so each of hisreadiedmaneuver can be used once per encounter (until they are recovered, see below).",
    "Stances Known": "Warlords begin play with knowledge of one stance from any discipline open to warlords. At the indicated levels (see class table), the warlord selects an additional new stance. Unlike maneuvers, stances are not expended and he does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently using as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance description. Unlike with maneuvers, the warlord cannot learn a new stance at higher levels in place of one he already knows.",
    "Warlords Gambit (Ex)": "At his core, the warlord is a warrior who relies on both skill and daring; without this he is but any other combatant. By setting himself to danger, does his true skill shine, or so the motto of the warlord goes. At 1st level, a warlord selects two gambits from the gambits available to warlords. At 4th level and every four levels thereafter, a warlord selects an additional gambit to learn. Any gambit that would normally use the warlords Charisma modifier to determine its effects instead uses his warlord initiation modifier, if it is a different ability. These gambits allow the warlord to recover maneuvers. Due to their reliance on the stresses of combat to bring out the best of the warlord, gambits cannot be used outside combat.",
    "Bonus Feat": "At 1st level and at 6th level, and then every four levels after, the warlord gains a bonuscombatfeat orteamworkfeat of his choosing. The warlord must qualify for the feat before selecting it.",
    "Tactical Presence (Ex)": "At 2nd level, the warlords innate charisma allows his very presence to aid and assist not only himself but his allies as well, just by his being around. Adopting a presence is a move-equivalent action, and only one presence may be maintained at any given time. At 7th level, the warlord is capable of adopting a presence as afree action.",
    "Warleader": "The warlord excels in the theater of war because he knows how best to work with his allies. At 3rd level, the warlord becomes an ever more capable commander and may share tactics with his allies. First, the warlord gains a teamwork feat as a bonus feat (he must meet the prerequisites for this feat to select it). As astandard actionthat the warlord performs, the warlord and allies within 30- ft. of him can share teamwork feats that they possess with each other, acting as if they both possessed the teamwork feat that they are sharing. The warlord can only share one teamwork feat at a time, either one of his own (with all allies within 30-ft. of him) or an allys (in which case only the warlord receives the ability to use the teamwork feat he does not possess). The warlord and allies retain the use of this feat for 3 +his warlord initiation modifier in rounds. The warlord can use this ability a number of times per day equal to 1 + his warlord initiation modifier, plus one additional time per day at 7th level and four warlord levels thereafter.",
    "Force of Personality (Ex)": "At 3rd level, the warlords forceful personality and bold, headstrong nature assist him in resisting the influence of others. Where others use personal serenity, awareness of the world around them, or plain old sensibility, the warlord gets by with endless nerve. The warlord may add hiswarlord initiation modifier in addition to hisWisdommodifier to determine hisWillsave bonus. If the character is ever able to add hiswarlord initiation modifier to hisWillsave through use of another ability (for example. thepaladinsdivine grace) he may only add hiswarlord initiation modifier once to hisWillsave.",
    "Tactical Flanker (Ex)": "At 4th level, the warlord is exceptionally gifted at working with his allies to bring down opponents and his skills assist any who ally with him. At the start of the warlords turn, he chooses a single square adjacent to him. Until the start of his next turn, he and his allies can treat that square as if it was occupied by him for the purposes offlankingopponents.",
    "Battle Prowess (Ex)": "The warlord is a skilled combatant, mixing traditional fighting skills with the skill of his martial discipline training. Choose a discipline, and when the warlord is in a martial stance from this chosen discipline, the character gets the listed bonus (+1 at 5th level, +2 at 12th level, +3 at 19th level) as acompetence bonusto attack and damage rolls,CMBrolls, and to hisCMD. He may select another discipline at 12th level, and third discipline at 19th level.",
    "Dual Boost (Ex)": "Knowledgeable in the ways of making the best of any situation through pluck and verve, the warlord is capable of applying multiple martial principles simultaneously. At 6th level, once per day the warlord may initiate two boost type maneuvers as part of the sameswift action. He may use this an additional time per day at 12th level, and three times per day at 18th level.",
    "Tactical Assistance (Ex)": "At 8th level, the warlords gift for helping his allies in combat improves. The character may use the aid another action for any single ally within 30-ft. of his position as amove action, and when he successfully uses the aid another action, it affects all allies within 30 feet.",
    "Dual Tactical Presence (Ex)": "At 11th level, the sight of the warlord on a field of combat inspires multiple feelings in those around him. He may select and use two presences, activating them together as afree action.",
    "Improved Warleader": "At 13th level, the warlords excellence in battle has enabled him to utilize the tactical skills of his allies as well as his own with greater speed. The warlord may now use his warleader class feature as amove action.",
    "Warlords Presence (Ex)": "At 15th level, the warlord is capable using three of his presences together at the same time, activating them together as afree action.",
    "Master Warleader": "At 17th level, the warlords peerless ability in the theater of war has enabled him to utilize the tactical skills of his allies as well as his own with the greatest of speed. The warlord may now use his warleader class feature as aswift action.",
    "Dual Stance (Ex)": "At 20th level, the warlords ability to use his stances improves, allowing him to gain the benefits of two known stances simultaneously. He must still adopt each stance individually, requiring him to expend oneswift actionfor each stance."
  },
  "zealot": {
    "Roles": "A warhawk politician grimly but eloquently calls for the destruction of a hated enemy. A loyal guard lays down his life for his homeland without hesitation. A cultist is driven to greater and greater ecstasies of blood to satisfy the wicked whispers that fill his mind day and night. All believe that if they sacrifice enough for their dreams, even the impossible can be realized. These dreams are enough to shape those around themand, if realizedthe world",
    "HD": "d10",
    "bab": "H",
    "Class Features": "All of the following are class features of the zealot.",
    "Weapon and Armor Proficiency": "A zealot is proficient with all simple and martial weapons and with all armor (heavy, light, and medium) and shields (except tower shields).",
    "Maneuvers": "A zealot begins his career with knowledge of five martial maneuvers. The disciplines available to him areEternal Guardian,Golden Lion,Piercing Thunder,Sleeping Goddess, andSolar Wind.",
    "Maneuvers Readied": "A zealot can ready three of his five maneuvers known at 1st level, and as he advances in level and learns more maneuvers, he is able to ready more, but must still choose which maneuvers to ready. A zealot must always ready his maximum number of maneuvers readied. He readies his maneuvers by meditating for ten minutes. The maneuvers he chooses remain readied until he decides to meditate again and change them. The zealot does not need to sleep or rest for any long period of time in order to ready his maneuvers; any time he spends ten minutes in contemplation, he can change his readied maneuvers.",
    "Stances Known": "A zealot begins his career with knowledge of one stance from any discipline open to zealots. At 2nd, 5th, 9th, 11th, 15th, and 18th levels, he can select an additional stance to learn. Unlike maneuvers, stances are not expended and the zealot does not have to ready them. All the stances he knows are available to him at all times, and he can change the stance he is currently maintaining as aswift action. A stance is an extraordinary ability unless otherwise stated in the stance or discipline description.",
    "Power Points": "A zealots ability to augment some of his abilities is limited by the power points he has available. His base daily allotment of power points is given on Table: Zealot. In addition, he receives bonus power points per day if he has a highCharismascore (see Table:Ability Modifiers and Bonus Power Points), treating his class level as his effective manifester level for the purposes of bonus power points. His race may also provide bonus power points per day, as may certain feats and items. This effective manifester level does not make a zealot eligible for feats and prestige classes requiring a manifester level.",
    "Collective (Su)": "A zealot learns to use psionic power to connect willing minds through an internal network that strengthens their psychic bonds. As astandard action, a zealot can join any number of willing targets into his collective (up to his limit, see below). The zealot must have line of sight to each target, each target must have aWisdomscore of at least 1, and all targets must be within medium range (100 feet + 10 feet per zealot level). The collective can contain up to his zealot initiation modifier or half his zealot level (minimum 1), whichever is higher, plus the intensity of hiszeal. The zealot is always considered a member of his own collective, and does not count against the maximum number of creatures in the collective.",
    "Compartmentalized Aid (Ex)": "A zealot can mentally divide a fraction of himself to objectively analyze his actions, allowing him to use theAid Anotheraction on himself to grant himself a bonus to anattack rollor AC and recover maneuvers (and activating the zealotszealclass feature). When he does so, the bonus applies to an attack that comes before the end of his next turn. In addition, he can use theAid Anotheraction with a ranged attack as long as he is within his weapons first range increment.",
    "Zeal (Su)": "The zealots martial competence and inspiring exhortations give his collective the courage to fight no matter the odds. Whenever a zealot successfully hits an opponent with a strike maneuver, all allies in his collective (including him) gain a +1morale bonusonattack rollsfor one round. This bonus increases by +1 at 5th level and every five levels thereafter.",
    "Burning Contemplation (Ex)": "Starting at 2nd level, a zealots inner fire allows him to unlock latent psionic potential within himself. For the purpose of qualifying for psionic feats, he may use hisCharismascore instead of hisWisdomscore.",
    "Conviction": "In addition to his purpose and plans, a zealot champions minor beliefs and practices. At 2nd level and every four levels thereafter, a zealot gains a conviction from the following list. Unless otherwise noted, a zealot cannot select an individual conviction more than once. Some convictions can only be taken if the zealot meets certain prerequisites first, as noted in the individual convictions description.",
    "Martyrdom (Su)": "At 2nd level, the zealot learns to share the immense pain and suffering his allies must face to fulfill their calling. Once per round, when a willing member of the zealots collective other than himself takes hit point damage, the zealot can redirect up to 5 points of damage per zealot level to himself as afree action, even if it isnt his turn. Effects other than hit point damage (such aspoison,stunning, orability damage) are not reduced or transferred. Damage the zealot redirects to himself with this ability ignores any form ofdamage reduction, resistance, immunityorregenerationthe zealot may possess. When the zealot activates this ability, he can pay up to 1 power point per zealot level to negate 3 points of the damage redirected to him per power point spent (to a minimum of 1 point of damage taken).",
    "Commitment (Su)": "The fervor a zealot ignites in his allies does not end at the limits of his physical body. As his allies internalize his beliefs, they increasingly feel the zealots presence beside them even in the harshest circumstances. Starting at 3rd level, a zealot can use theAid Anotheraction on any member of his collective, regardless of distance.",
    "Telepathy (Su)": "When a zealot reaches 3rd level, all willing members of his collective (including the zealot himself) can communicate with each other telepathically, even if they do not share a common language. Psionic creatures who are willing members in a zealots collective (including the zealot himself) may manifest unknown powers from powers known by another willing psionic creature in the collective as if they were making physical contact.",
    "Echoes of Steel (Su)": "As a zealot continues to mold the hearts and minds of those around them, his collective begins to copy his words and his deeds, working to advance his cause. At 4th level, this manifests in the ability to temporarily psychically transfer the zealots techniques.",
    "Mission (Su)": "The zealot is defined by his cause. Zealots might pray for guidance on what mission to choose, receive orders through dark, mysterious whispers, decide for themselves after careful analysis, or simply pursue the task that fate puts before them. At 4th level, the zealot chooses a mission, granting him a benefit when he is psionically focused and an ability that can be used by expending his psionic focus.",
    "Defiance (Su)": "At 5th level, the zealot learns to continue supporting his allies while hanging on to his last breath. The zealot gainsDiehardas a bonus feat (even if he do not meet the prerequisites), and does not take damage for using theAid Anotheraction while at or below 0hit points. In addition, the zealot does not die until he reaches negativehit pointsequal to his zealot level plus hisConstitutionscore.",
    "Unshakable Will (Su)": "At 9th level, the zealot is able to maintain his concentration even after dire setbacks. The zealot automatically succeed on theFortitudesave when a member of his collective dies, and automatically succeeds onAid Anotherchecks to grant a member of his collective a bonus toattack rolls or AC.",
    "Stalwart (Su)": "Starting at 13th level, a zealot can use mental and physical resiliency to avoid certain attacks. If he makes a successfulFortitudeorWillsaving throw against an attack that has a reduced effect on a successful save, he instead avoids the effect entirely. Ahelplesszealot does not gain the benefit of the stalwart ability.",
    "Metaphysical Transcendence (Su)": "At 16th level, the zealot breaks the limitations between ideals and existence; as a word lasts beyond the life the one who spoke it, so the zealot and his allies persist beyond their own mortality. As long as their visions are still carried out, the zealot and his collective can not truly be destroyed. When a member of his collective dies, the creatures soul merges with his collective for up to one day per zealot level. During this time, it can be affected bypsionic revivify,raise deadand similar abilities as if it died within 1 round, without need for the creatures corpse. The creature still counts towards the maximum number of creatures in his collective while merged. If the zealot dies, the creatures soul departs, killing it."
  }
}