{
  "MagicRings": {
    "Dungeon Ringprisoner's": {
      "source": "Ultimate Equipment pg. 166 , Advanced Player's Guide pg. 292",
      "aura": "moderate divination",
      "cl": "8th",
      "slot": "ring;",
      "price": "250 gp (prisoner's), 16,000 gp (jailer's);",
      "weight": "— Description A jailer's dungeon ring is worked gold, set with carnelians. The ring is magically attuned to one or more iron prisoner's dungeon rings . When the wearer of a jailer's ring places a prisoner's ring on a subject, the prisoner cannot remove the ring without the use of a remove curse , limited wish , miracle , or wish spell. The wearer of the jailer's ring can also remove a linked prisoner's ring at any time. The jailer is aware of any wearer of a linked prisoner's ring as per a constant status spell. Additionally, all wearers of linked prisoner's rings count as familiar to the jailer for the purposes of spells such as scrying and teleport Construction",
      "requirements": "Forge Ring, scrying , status ;",
      "cost": "125 gp (prisoner's), 8,000 gp (jailer's)"
    },
    "Ironbound RingMinion": {
      "source": "Adventurer's Guide pg. 36",
      "aura": "faint abjuration and enchantment",
      "cl": "5th",
      "slot": "ring;",
      "price": "500 gp (Minion), 8,000 gp (Master);",
      "weight": "— Description While holding one or more minion's ironbound rings , the wearer of a master's ironbound ring can impart instructions of 50 words or fewer to each minion's ironbound rings . The wearer of a minion's ironbound ring can recall the instructions at will and is aware of any action that would cause him to act against those instructions. The DC of any skill check attempted to force the wearer to abandon, misinterpret, or consciously fail the instructions increases by 5, such as for Bluff checks to trick the wearer or Intimidate checks to interrogate him. The wearer gains a +3 resistance bonus on Will saves to resist spells and effects that would force him to act against the instructions, such as dominate person and suggestion Construction",
      "requirements": "Forge Ring, resistance, suggestion ;",
      "cost": "4,000 gp"
    },
    "Fool's Malady": {
      "source": "Villain Codex pg. 33",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "900 gp;",
      "weight": "— Description This simple lead ring is carved with a twisting face. When worn, the ring causes a wearer to develop a single deformity over the course of 1 minute. The exact malformation is determined when the ring is forged and can't be changed. It modifies the wearer's appearance rather than changing it entirely; those familiar with her normal appearance can easily recognize her in the modified form. Many of these rings mimic the symptoms of terrible diseases, while others mimic birth conditions, extensive scarring, or tattoos. If the creature wearing a fool's malady already has the deformity the ring mimics, the ring instead removes all visual traces of the condition. The ring does not remove any pain or penalties associated with the condition. Construction",
      "requirements": "Forge Ring, alter self ;",
      "cost": ""
    },
    "Kyton Ring": {
      "source": "Horror Adventures pg. 216",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,000 gp;",
      "weight": "— Description This rusty iron ring looks like a twisted chain. On command, the ring can produce a rusty, clanky length of iron chain (hardness 10, 5 hp, break DC 26). The ring can create no more than 100 feet of chain in this way. This total length can be split among many uses, but must be spent in 10-foot increments. When the ring's daily allotment of chain is renewed, any previously conjured chain rusts away. Once per day as a standard action, the user can shoot a chain from the ring as though it were a grappling hook, except the range increment is 50 feet. Whatever length of chain she shoots out counts against ring's daily allotment. Construction",
      "requirements": "Forge Ring, major creation ;",
      "cost": "500 gp"
    },
    "Ring of Arcane Signets": {
      "source": "Ultimate Equipment pg. 167 , Advanced Player's Guide pg. 292",
      "aura": "faint universal",
      "cl": "8th",
      "slot": "ring;",
      "price": "1,000 gp;",
      "weight": "— Description The approximately 1-inch-diameter pentagon of emerald green crystal that dominates this otherwise plain silver ring forms itself into a specific rune, sigil, or similar identifying marker each time a person first puts it on. If the wearer expects this to occur, she can cause the crystal to adopt any shape she wishes. If the wearer does not expect this to occur, the crystal instead molds itself into an image that symbolizes the wearer or some dominant facet of her personality. Once the crystal assumes this initial form, it always takes that form whenever the same wearer puts on the ring. The wearer can, as a standard action, embed this image on any object (as if using arcane mark ) simply by pressing the ring against it. The wearer may choose the color and other cosmetic features of the image each time she uses the ring. The brand is otherwise permanent unless removed by dispel magic , erase , or a more powerful spell. Construction",
      "requirements": "Forge Ring, arcane mark ;",
      "cost": "500 gp"
    },
    "Ring of Inurement": {
      "source": "Ire of the Storm pg. 51",
      "aura": "faint abjuration",
      "cl": "1st",
      "slot": "ring;",
      "price": "1,000 gp;",
      "weight": "— Description This humble ring is crafted from smooth red and blue porcelain and wrapped with threads of copper. Each morning, the ring's wearer must select either hot or cold, and for the next 24 hours the ring of inurement affords basic protection from the selected condition as if she were using endure elements and superficially alters the wearer's clothing to better accommodate her, growing fur linings and extra layers in frigid environs or lightening fabric in response to high temperatures. The ring protects only the wearer who determined its properties for the day, and its protection immediately ends for the day if it is removed. Construction",
      "requirements": "Forge Ring, endure elements , prestidigitation ;",
      "cost": "500 gp"
    },
    "Ring of the Faithful Dead": {
      "source": "Inner Sea Temples pg. 42",
      "aura": "faint evocation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "1,000 gp;",
      "weight": "— Description This spiraling silver ring glows briefly when a living creature puts it on. If its wearer of a ring of the faithful dead is slain by a creature with the create spawn ability, the wearer does not rise as an undead creature, even if the ring is later removed. If a corpse is wearing a ring of the faithful dead , any attempts to create an undead creature from the corpse (such as via animate dead ) automatically fail, though simply removing the ring ends this protection. Construction",
      "requirements": "Forge Ring, sanctify corpse UM ;",
      "cost": "500 gp"
    },
    "Riverclub Ring": {
      "source": "People of the River pg. 29",
      "aura": "faint conjuration",
      "cl": "1st",
      "slot": "ring;",
      "price": "1,000 gp;",
      "weight": "— Description Popular among Riverfolk who prefer to work their waterway unarmed, this simple bronze band can transform into a handy weapon in a pinch. When the wearer of a riverclub ring plunges her hand into at least 1 gallon of water as a move action, she can pull forth a club made of animated water. The weapon maintains the shape, solidity, and statistics of a masterwork club of the wielder's size so long as she holds it, dealing damage as normal, except that it deals 1 additional point of damage against creatures with the fire subtype. The club turns back into a puddle of water again as soon as the wielder loosens her grip around it. Construction",
      "requirements": "Forge Ring, icicle dagger ( Pathfinder RPG Ultimate Magic 224);",
      "cost": "500 gp"
    },
    "Ring of Serene Contortions": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,200 gp;",
      "weight": "— Description This simple copper ring bears the image of a blue enamel hand. It grants the wearer a +2 bonus on Escape Artist checks. At will, the wearer may create the sound of a peaceful chime, small gong, or temple bell. Once per day, the wearer may also use true strike Construction",
      "requirements": "Forge Ring, ghost sound , true strike , creator must have 5 ranks in Escape Artist;",
      "cost": "600 gp"
    },
    "Ring of Torag": {
      "source": "Hollow's Last Hope pg. 16",
      "aura": "faint abjuration",
      "cl": "3rd",
      "slot": "ring;",
      "price": "1,200 gp;",
      "weight": "— Description This simple golden ring has a large red gemstone set into it that sparkles with an inner fire. The wearer of the ring gains fire resistance 10 against the first fire attack that hits him that day. This protection renews itself every morning at dawn. In addition, the wearer receives a +1 resistance bonus on saves made against fire spells and effects. The ring must be worn for 24 hours to have any effect. Construction",
      "requirements": "Forge Ring, resist energy ;",
      "cost": "600 gp, 48 XP"
    },
    "Dark Life Ring": {
      "source": "Champions of Corruption pg. 30",
      "aura": "faint necromancy",
      "cl": "3rd",
      "slot": "ring;",
      "price": "1,250 gp;",
      "weight": "— Description Mortal blacksmiths residing in the Gebbite city of Graydirge created the first dark life rings . Too often had these living unfortunates suffered collateral damage from the negative energy effects used daily in the streets of the undead-ruled city, so they forged these rings in hopes of mitigating at least some of the harm their unliving rulers carelessly inflicted upon them. Before the Blood Lords at Mechitar could punish the insolent smiths of Graydirge, the dark life rings and their imitators made their way into the wider world. A dark life ring grants its wearer a +2 profane bonus on Will saving throws against channeled negative energy and inflict spells (any spell with “inflict” in its name). In addition, anytime the wearer takes damage from channeled negative energy or an inflict spell, she subtracts 5 from the damage taken (calculated after the wearer has rolled her Will save against the effect), to a minimum of 0 points of damage. Construction",
      "requirements": "Forge Ring, death ward ;",
      "cost": "625 gp"
    },
    "Ring of Resistance1": {
      "source": "Pathfinder #123: The Flooded Cathedral pg. 44",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp (+1), 6,000 gp (+2), 13,500 gp (+3), 24,000 gp (+4), 37,500 gp (+5);",
      "weight": "— Description Protective symbols adorn this magic ring. It functions as a cloak of resistance with an equivalent bonus. Construction",
      "requirements": "Forge Ring , resistance , creator's caster level must be at least three times the ring's bonus;",
      "cost": "750 gp (+1), 3,000 gp (+2), 6,750 gp (+3), 12,000 gp (+4), 17,750 gp (+5)"
    },
    "Deadeye's Spotter Ring": {
      "source": "Inner Sea Gods pg. 258",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp;",
      "weight": "— Description This ring is carved from a single, thick antler and fashioned into the shape of a regal elk's head. The wearer gains a +2 competence bonus on Perception and Survival checks. Once per day, the wearer can use animal messenger Construction",
      "requirements": "Forge Ring, animal messenger , creator must have 2 ranks in Perception and Survival;",
      "cost": "750 gp"
    },
    "Ring of Spell Knowledgetype I": {
      "source": "Ultimate Equipment pg. 174",
      "aura": "moderate or strong (no school)",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,500 gp (type I), 6,000 gp (type II), 13,500 gp (type III), 24,000 gp (type IV);",
      "weight": "— Description This ring comes in four types: ring of spell knowledge I , ring of spell knowledge II , ring of spell knowledge III , and ring of spell knowledge IV . All of them are useful only to spontaneous arcane spellcasters. Through study, the wearer can gain the knowledge of a single spell in addition to those allotted by her class and level. A ring of spell knowledge I can hold 1st-level spells only, a ring of spell knowledge II 1st- or 2nd-level spells, a ring of spell knowledge III spells of 3rd level or lower, and a ring of spell knowledge IV up to 4th-level spells. A ring of spell knowledge is only a storage space; the wearer must still encounter a written, active, or cast version of the spell and succeed at a DC 20 Spellcraft check to teach the spell to the ring. Thereafter, the arcane spellcaster may cast the spell as though she knew the spell and it appeared on her class' spell list. Arcane spells that do not appear on the wearer's class list are treated as one level higher for all purposes (storage and casting). Construction",
      "requirements": "Forge Ring, creator must be able to cast spells of the spell level to be granted;",
      "cost": "750 gp (type I), 3,000 gp (type II), 6,750 gp (type III), 12,000 gp (type IV)"
    },
    "Ring of Balanced Grip": {
      "source": "Adventurer's Armory 2 pg. 23",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,600 gp;",
      "weight": "— Description This sturdy ring allows the user to ignore the nonproficiency penalty for using a particular type of improvised weapon, such as a crowbar or pitchfork, and grants a +1 enhancement bonus on attack rolls with that item as though it were a masterwork weapon. Construction",
      "requirements": "Forge Ring, masterwork transformation UM ;",
      "cost": "800 gp"
    },
    "Ring of Starlight": {
      "source": "Merchant's Manifest pg. 12",
      "aura": "faint evocation",
      "cl": "1st",
      "slot": "ring;",
      "price": "1,600 gp;",
      "weight": "— Description This smooth mithral ring glimmers with light, and a close look reveals the reflection of a starry night sky within the silvery metal. The wearer of a ring of starlight can cause portions of her body or items in her possession to glow with colorful light, as per faerie fire , by waving the hand adorned with the ring over the item or body part as a swift action. This glow lasts for 1 hour, until dismissed as a free action, or until the ring is removed. This duration need not be used all at once, but must be used in 10-minute increments. (Each time an increment of duration is used, the wearer can choose the portion of her body or item in her possession that glows.) In addition, wearing the ring allows the caster to use dancing lights on command three times per day as a standard action. Construction",
      "requirements": "Forge Ring, dancing lights , faerie fire ;",
      "cost": "800 gp"
    },
    "Ring of Protection1": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description This ring offers continual magical protection in the form of a deflection bonus of +1 to +5 to AC. Construction",
      "requirements": "Forge Ring, shield of faith , caster must be of a level at least three times higher than the bonus of the ring;",
      "cost": "1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)"
    },
    "Bloodletting Thimble": {
      "source": "Monster Codex pg. 237 , Blood of the Night pg. 31",
      "aura": "faint enchantment",
      "cl": "3rd",
      "slot": "ring;",
      "price": "2,000 gp;",
      "weight": "— Description This platinum thimble, intricately crafted in the shape of an animal claw, is worn on one finger. A vampire wearer can use the thimble to inflict a tiny wound as part of the use of a blood drain, energy drain, or drain chi ability; use of the thimble in this way isn't an action. This wound deals no additional damage, but it turns the target's pain to pleasure. The target must succeed at a DC 14 Will save or become fascinated by the wearer and make no attempt to resist the draining on that round and the following 2 rounds. At the end of this time, the creature's senses return and it can react accordingly. Construction",
      "requirements": "Forge Ring, enthrall ;",
      "cost": "1,000 gp"
    },
    "Ring of Lingering Blood Magic": {
      "source": "Advanced Class Guide pg. 217",
      "aura": "moderate transmutation",
      "cl": "11th",
      "slot": "ring;",
      "price": "2,000 gp;",
      "weight": "— Description When the wearer of this ring is bloodraging, he can expend 1 round of bloodrage to extend the duration of a beneficial spell affecting him with a duration of 1 round per level or greater by 2 rounds. This is a free action the wearer can take once per round. Construction",
      "requirements": "Endurance, Extend Spell, Forge Ring, creator must have the bloodrage class feature;",
      "cost": "1,000 gp"
    },
    "Ring of the Grasping Grave": {
      "source": "Ultimate Equipment pg. 176",
      "aura": "faint necromancy",
      "cl": "1st",
      "slot": "ring;",
      "price": "2,000 gp;",
      "weight": "— Description The wearer of this ring can make a melee touch attack against an undead creature no more than one size category larger than himself, cutting off that creature from undying energy. The wearer never suffers any ill effects that might normally occur from coming into physical contact with an undead creature touched in this way. On a successful hit, the undead cannot be healed or aided by the effects of negative energy for 1d4 rounds. During this duration, positive energy affects the undead creature normally. Construction",
      "requirements": "Forge Ring, sculpt corpse ( Advanced Player's Guide );",
      "cost": "1,000 gp"
    },
    "Ring of the Sublime": {
      "source": "Taldor, Echoes of Glory pg. 27",
      "aura": "faint abjuration",
      "cl": "1st",
      "slot": "ring;",
      "price": "2,000 gp;",
      "weight": "— Description This ornate gold ring is set with a single round sapphire and platinum stems. When worn, the ring of the sublime protects its wearer from fear effects as if constantly under the effects of remove fear . Wearers of rings of the sublime in Taldor often believe the ring's ability to combat fear also removes social anxiety, making the wearer a more confident and self-assured member of high society. Construction",
      "requirements": "Forge Ring, remove fear ;",
      "cost": "1,000 gp, 80 XP"
    },
    "Ring of Emancipation": {
      "source": "Second Darkness Player's Guide pg. 25",
      "aura": "faint transmutation and moderate evocation",
      "cl": "7th",
      "slot": "ring;",
      "price": "2,100 gp;",
      "weight": "— Description This single thick iron band makes for a rather ugly ring. Rust pits the surface of the ring in places and the item seems on the brink of falling apart. Occasionally, these rings bear a tiny chain link or dented tankard symbol. While wearing a ring of emancipation , you gain a +2 competence bonus on all Open Lock and Escape Artist checks, in addition to all attack rolls made to sunder. Also, the ring has three charges, which can be expended at any time to cast shatter as a spell-like ability with a caster level equal to your character level. Each time a charge is expended, the ring becomes more rusted and marred. Upon the third charge being expended, the ring is destroyed. Construction",
      "requirements": "Forge Ring, cat's grace , shatter ;",
      "cost": "1,050 gp, 84 XP"
    },
    "Ring of Feather Falling": {
      "source": "Ultimate Equipment pg. 170 , PRPG Core Rulebook pg. 479",
      "aura": "faint transmutation",
      "cl": "1st",
      "slot": "ring;",
      "price": "2,200 gp;",
      "weight": "— Description This ring is crafted with a feather pattern all around its edge. It acts exactly like a feather fall spell, and activates immediately if the wearer falls more than 5 feet. Construction",
      "requirements": "Forge Ring, feather fall ;",
      "cost": "1,100 gp"
    },
    "Ring of Climbing": {
      "source": "Ultimate Equipment pg. 168 , PRPG Core Rulebook pg. 479",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,500 gp;",
      "weight": "— Description This magic ring has the deceptively simple appearance of a plain leather cord that wraps securely around a finger. The ring continually grants the wearer a +5 competence bonus on Climb checks. Construction",
      "requirements": "Forge Ring, creator must have 5 ranks in the Climb skill;",
      "cost": "1,250 gp"
    },
    "Ring of Jumping": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint transmutation",
      "cl": "2nd",
      "slot": "ring;",
      "price": "2,500 gp;",
      "weight": "— Description This ring continually allows the wearer to leap about, providing a +5 competence bonus on all her Acrobatics checks made to make high or long jumps. Construction",
      "requirements": "Forge Ring, creator must have 5 ranks in Acrobatics;",
      "cost": "1,250 gp"
    },
    "Ring of Sustenance": {
      "source": "Ultimate Equipment pg. 175 , PRPG Core Rulebook pg. 479",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,500 gp;",
      "weight": "— Description This ring continually provides its wearer with life-sustaining nourishment. The ring also refreshes the body and mind; its wearer only needs to sleep 2 hours per day to gain the benefit of 8 hours of sleep. This allows a spellcaster that requires rest to prepare spells to do so after only 2 hours, but does not allow a spellcaster to prepare spells more than once per day. The ring must be worn for a full week before it begins to work. If it is removed, the owner must wear it for another week to reattune it to himself. Construction",
      "requirements": "Forge Ring, create food and water ;",
      "cost": "1,250 gp"
    },
    "Ring of Swimming": {
      "source": "Ultimate Equipment pg. 175 , PRPG Core Rulebook pg. 479",
      "aura": "faint transmutation",
      "cl": "2nd",
      "slot": "ring;",
      "price": "2,500 gp;",
      "weight": "— Description This silver ring usually has fishlike designs and motifs etched into the band. It continually grants the wearer a +5 competence bonus on Swim checks. Construction",
      "requirements": "Forge Ring, creator must have 5 ranks in Swim;",
      "cost": "1,250 gp"
    },
    "Droskar's Guiding Ring": {
      "source": "Inner Sea Gods pg. 258 , Gods and Magic pg. 56",
      "aura": "faint enchantment",
      "cl": "3rd",
      "slot": "ring;",
      "price": "2,600 gp;",
      "weight": "— Description This gold ring is misshapen and uncomfortable to wear for long periods of time; inscribed on it is a crude symbol of a fire burning under an arch. Once per day, the wearer may use charm person . If Droskar is the wearer's patron deity, any time the wearer crafts a magic item, she may choose to pay half of the item's construction cost instead of the full cost. The wearer spends time working on the item normally, but at the time of completion there is a 50% chance that the item turns out nonmagical and worthless. For example, if creating a magic bracer that normally costs 1,000 gp to craft, the wearer may craft it for only 500 gp, but there is a 50% chance the wearer's shortcuts and cheap materials result in a valueless, nonfunctional item. Construction",
      "requirements": "Craft Wondrous Item, charm person , fabricate ;",
      "cost": "1,300 gp"
    },
    "Ring of Natural Attunement (Leshy)": {
      "source": "Advanced Class Guide pg. 217",
      "aura": "faint conjuration",
      "cl": "3rd",
      "slot": "ring;",
      "price": "2,800 gp;",
      "weight": "— Description This ring is made of thin but strong vines braided together in an elegant weave. If the wearer can cast summon nature's ally spells, the wearer adds leaf leshy B3 to the 1st-level list of monsters he can summon with those spells, adds gourd leshy B3 to the 2nd-level list, adds fungus leshy B3 the 3rd-level list, and adds seaweed leshy B3 to the 4th-level list. Also, once per day on command the wearer can use this ring to summon a leaf leshy, as if by the summon nature's ally I spell. Construction",
      "requirements": "Forge Ring, plant growth , summon nature's ally I ;",
      "cost": "1,400 gp"
    },
    "Knight-Inheritor's Ring": {
      "source": "Pathfinder #103: The Hellfire Compact pg. 73 , Inner Sea Gods pg. 258",
      "aura": "faint enchantment and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description This simple gold band is engraved with the holy symbol of Iomedae. It functions as a ring of protection +1 . In addition, the wearer can cast bless weapon and wartrain mount UM each once per day. At will, the wearer can make himself presentable as if using prestidigitation to clean up his clothing, skin, hair, and armor. Construction",
      "requirements": "Forge Ring, bless weapon , prestidigitation , shield of faith , wartrain mount UM , creator must be at least 3rd level;",
      "cost": "1,500 gp"
    },
    "Profane Seal Signet": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration, enchantment, and universal",
      "cl": "5th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description This ring is made of red gold with a single ruby cut into a pentagon shape. It functions as a ring of protection +1 . In addition, the wearer may use arcane mark at will, but only on objects and willing creatures. Once per day, the wearer may use wrath APG Construction",
      "requirements": "Forge Ring, arcane mark , shield of faith , wrath APG , creator must be at least 3rd level;",
      "cost": "1,500 gp"
    },
    "Ring of Austere Majesty": {
      "source": "Merchant's Manifest pg. 19",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description A dozen tiny gemstones line the outer edges of this golden ring. As long as one or more creatures can see it, the ring grants its wearer a +2 circumstance bonus on Diplomacy and Intimidate checks to influence those creatures. In addition, the wearer can allow a willing creature to inspect the ring as a full-round action. If she does, for the following 3 rounds the creature and the wearer can speak while the ring's power obfuscates the details of the conversation. To every other creature able to hear the creature and the wearer's words during this time, the conversation sounds like a continued back-and-forth exchange of exaltations about the ring's artistry. Construction",
      "requirements": "Forge Ring, aphasia , eagle's splendor ;",
      "cost": "1,500 gp"
    },
    "Ring of Ferocious Action": {
      "source": "Ultimate Equipment pg. 170 , Advanced Race Guide pg. 58",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description This ring allows its wearer to persevere through physical or mental trauma that hampers his actions. Once per day, when the wearer gains the staggered condition from an enemy's attack, she can ignore that condition for up to 5 rounds. This does not prevent her from gaining the staggered condition again, and it does not protect her if she gained the staggered condition multiple times. Construction",
      "requirements": "Forge Ring, haste , stabilize ;",
      "cost": "1,500 gp"
    },
    "Ring of Powerful Blood Magic": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description When the wearer of this ring is bloodraging and casts a spell, as a swift action he can increase the save DC of the spell by 1. The wearer can do this a maximum of three times per day. This has no effect on spells that do not require saving throws. Construction",
      "requirements": "Forge Ring, Spell Focus, creator must have the bloodrage class feature;",
      "cost": "1,500 gp"
    },
    "Tyrant's Friend": {
      "source": "Pathfinder Society Field Guide pg. 54",
      "aura": "faint divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "3,000 gp;",
      "weight": "— Description A slender copper band, a tyrant's friend is thin enough to be hidden beneath another ring (although it still counts against the limit of magic rings a character can wear). The ring grows noticeably warmer whenever the hand wearing it touches a poisoned or poisonous object or creature (including containers holding poison), warning the wearer of potential danger. Construction",
      "requirements": "Forge Ring , detect poison ;",
      "cost": "1,500 gp"
    },
    "Ring of Eloquence": {
      "source": "Advanced Class Guide pg. 217",
      "aura": "faint divination",
      "cl": "3rd",
      "slot": "ring;",
      "price": "3,500 gp;",
      "weight": "— Description Fine etchings spell out the alphabets of four languages around the inside of this finely crafted silver band. The wearer gains the ability to speak and understand the four languages whose alphabets are inscribed on the ring. Normally the languages are Common, Dwarven, Elven, and Gnome. Less often, such rings are attuned to Giant, Goblin, Orc, and Undercommon, and rings with different sets of languages might also exist. The wearer retains the ability to speak in these languages even if she assumes a form normally unable to do so (such as a druid wild shaped into a wolf). The ring also makes it easier for the wearer to find the correct words to express herself, granting a +2 competence bonus on Bluff, Diplomacy, Intimidate, and Perform (oratory) checks. Also, if the wearer is deafened and attempts to cast a spell with a verbal component, the chance of spell failure is reduced to 10%. Construction",
      "requirements": "Forge Ring, comprehend languages ;",
      "cost": "1,750 gp"
    },
    "Ring of Stairs and Stars": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint evocation, illusion, and transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "3,820 gp;",
      "weight": "— Description A stair-step pattern of stars wraps around the outside of this dark blue ring. In addition to the powers of a ring of feather falling , a ring of stairs and stars allows the wearer to use magic missile once per day, with the missiles taking the shape of shooting stars. As a standard action, the wearer may create an illusory butterfly that flits about within the wearer's square for 1 minute before fading away. Construction",
      "requirements": "Forge Ring, feather fall , magic missile , silent image ;",
      "cost": "1,910 gp"
    },
    "Ring of Ancestral Blood Magic": {
      "source": "Advanced Class Guide pg. 216",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "ring;",
      "price": "4,000 gp;",
      "weight": "— Description While the wearer is bloodraging, he can cast a bonus spell gained from his bloodrager bloodline without expending a spell slot. He can do this three times per day, and must expend a number of rounds of bloodrage equal to the level of the spell to be cast. The wearer must meet all the other requirements for spellcasting. Construction",
      "requirements": "Endurance, Extend Spell, Forge Ring, creator must have the bloodrage class feature;",
      "cost": "2,000 gp"
    },
    "Ring of Counterspells": {
      "source": "Ultimate Equipment pg. 168 , PRPG Core Rulebook pg. 479",
      "aura": "moderate evocation",
      "cl": "11th",
      "slot": "ring;",
      "price": "4,000 gp;",
      "weight": "— Description Upon first examination, this ring seems to be a ring of spell storing . However, while it allows a single spell of 1st through 6th level to be cast into it, that spell cannot be cast out of the ring again. Instead, should that spell ever be cast upon the wearer, the spell is immediately countered, as a counterspell action, requiring no action (or even knowledge) on the wearer's part. Once so used, the spell cast within the ring is gone. A new spell (or the same one as before) may be placed into it again. Construction",
      "requirements": "Forge Ring, imbue with spell ability ;",
      "cost": "2,000 gp"
    },
    "Ring of Planar Focus": {
      "source": "Planar Adventures pg. 49",
      "aura": "strong divination",
      "cl": "15th",
      "slot": "ring;",
      "price": "4,000 gp;",
      "weight": "— Description This large silver ring has a massive setting for a cloudy white crystal about an inch in diameter. Once per week as a standard action, the wearer can tap the ring with a forked rod attuned to a specific plane (the focus for a plane shift spell). When tapped, the crystal transforms into a rough topographical map of the plane in question for 1 minute. The wearer can manipulate the crystal to focus on a single specific location within the plane, although the topographical elements remain rough and display only large or well-known features around the desired location. If the wearer has been to that location personally, she can focus the crystal on the location in 1 full round. Otherwise, she can attempt a DC 15 Knowledge (planes) check to focus on a location of her choice as a full-round action. This location must be a public or well-known area, such as a public plaza in the Common Quarter in the City of Brass. Obscure locations (such as Calistria's private Garden of Hidden Fruits) or locations controlled by a divinity cannot be focused on—in all cases, the GM has final say on whether a region can be focused upon. If the wearer casts plane shift to travel to the focused location while the map is active, she arrives without error at the site, rather than 5d% miles away. Once a ring of planar focus is used to aid a casting of plane shift , it becomes inactive for 24 hours. Construction",
      "requirements": "Forge Ring, discern location ;",
      "cost": "2,000 gp"
    },
    "Ring of Seven Lovely Colors": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration and illusion",
      "cl": "7th",
      "slot": "ring;",
      "price": "4,000 gp;",
      "weight": "— Description This golden ring, set with seven brightly colored gems, functions as a ring of protection +1 . In addition, seven times per day, the wearer can use beast shape IV to transform into a songbird for 10 minutes (use statistics for a raven). Construction",
      "requirements": "Forge Ring, beast shape IV , shield of faith , creator must be at least 3rd level;",
      "cost": "2,000 gp"
    },
    "Saltspray Ring": {
      "source": "Pathfinder #121: The Lost Outpost pg. 54",
      "aura": "faint conjuration and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "4,500 gp;",
      "weight": "— Description This mithral ring is engraved with a pattern of rolling waves that encircles the entire band. The saltspray ring is immune to rust, both from natural oxidation and rust caused by magical effects. Upon command, the ring causes a thick vapor to continuously surround its owner as per obscuring mist , except the mist has a 10-foot radius from the wearer and the area of effect moves with the wearer. This mist is exceedingly wet and extinguishes all nonmagical fires within its area. Magical fires and creatures with the fire subtype are not dispelled or adversely affected by the mist, though such creatures find being in the fog to be an uncomfortable experience. The mist does not permit aquatic creatures without the amphibious special quality to breathe out of water, but creatures that must remain wet or suffer a negative effect or condition have that requirement satisfied by the ring's effect. This effect can be dismissed as a standard action. The ring has no effect whatsoever underwater. Construction",
      "requirements": "Forge Ring , obscuring mist , quench ;",
      "cost": "2,250 gp"
    },
    "Red Hound Ring": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration, conjuration, and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "4,700 gp;",
      "weight": "— Description This white gold ring is engraved with the images of a mastiff and a thundercloud. It functions as a ring of protection +1 . In addition, once per day, the wearer may use summon monster I to summon a red mastiff (use statistics for a celestial dog). Additionally, once per day the wearer may use beast shape I to transform into a Small red mastiff. Construction",
      "requirements": "Forge Ring, beast shape I , shield of faith , summon monster I , creator must be at least 3rd level;",
      "cost": "2,350 gp"
    },
    "Ring of Delayed Doom1 stone": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Gluttonous Feasting Ring": {
      "source": "Inner Sea Gods pg. 258",
      "aura": "faint necromancy and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "5,000 gp;",
      "weight": "— Description This ring is carved from the flat part of a human skull and inscribed along the edge with images of skeletons at a banquet. Any food the wearer eats or drinks is automatically cleansed as if by purify food and drink . Once per day after eating an extravagant meal (typically one worth at least 10 gp), the wearer gains the benefit of false life Construction",
      "requirements": "Forge Ring, false life , purify food and drink ;",
      "cost": "2,500 gp"
    },
    "Ring of Maniacal Devices": {
      "source": "Ultimate Equipment pg. 172 , Advanced Player's Guide pg. 292",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "5,000 gp;",
      "weight": "— Description This elaborately decorated ring is crafted with the design of a fierce dragon wrapped greedily around a shining gemstone. It grants the wearer a +5 competence bonus on all Craft (traps) and Disable Device checks. Even if he has no ranks in these skills, the wearer may make Craft (traps) and Disable Device checks as if he were trained in them. Construction",
      "requirements": "Forge Ring, fox's cunning , creator must have 5 ranks in the relevant skill;",
      "cost": "2,500 gp"
    },
    "Ring of Rat Fangs": {
      "source": "Ultimate Equipment pg. 172 , Advanced Race Guide pg. 155",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "5,000 gp;",
      "weight": "— Description This bone ring is the shape of an elongated rat biting its own tail. The wearer gains a bite attack as a primary natural attack. This attack deals 1d4 points of piercing damage for a Medium wearer or 1d3 points of damage for a Small wearer. After about a week of wearing the ring, the wearer's appearance becomes more ratlike, though she still looks like a member of her original race (for example, a human might gain prominent teeth). Construction",
      "requirements": "Forge Ring, magic fang , polymorph ;",
      "cost": "2,500 gp"
    },
    "Glorious Flame Ring": {
      "source": "Inner Sea Gods pg. 258",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "ring;",
      "price": "5,400 gp;",
      "weight": "— Description This richly colored, burnished brass ring appears to be crimson red, sunset orange, or golden yellow depending on how it is held. Clerics of Sarenrae prize glorious flame rings as facets through which they may channel their deity's divine will. Once per day, the wearer may speak the ring's command word to create a 5-foot-radius burst of flame centered on herself. This burst of flame deals 1d6 points of damage to any adjacent creatures (Reflex DC 14 halves), though the wearer is safe from this effect. If the wearer is capable of channeling positive energy, she may as a standard action expend one use of channeled energy to activate the ring's burst of flame, even if she has already spoken the ring's command word for the day. If the wearer also has the Selective Channeling feat, she may select a number of allies equal to her Charisma modifier to exclude from the burst of flame; these allies are not affected by the flame. This effect is otherwise identical to creating the ring's burst of flame by speaking the command word. Construction",
      "requirements": "Forge Ring, Selective Channeling, elemental aura (fire) , creator must be able to channel positive energy;",
      "cost": "2,700 gp"
    },
    "Ring of Vengeful Blood Magic": {
      "source": "Advanced Class Guide pg. 220",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "5,400 gp;",
      "weight": "— Description This claw ring is made of red metal tinged with orange, and a long nail made of obsidian extends from the tip. It allows its wearer to cast a spell as an attack of opportunity. Three time per day, if the wearer is bloodraging and a foe provokes an attack of opportunity from him, the wearer can cast a spell with a casting time of 1 standard action or less as the attack of opportunity. The spell must target the creature that provoked the attack or include it in the spell's area, and must be no higher than 3rd level. This counts as one of the wearer's attacks of opportunity for the round; casting this spell does not itself provoke an attack of opportunity. Construction",
      "requirements": "Combat Reflexes, Forge Ring, Quicken Spell;",
      "cost": "17,500 gp"
    },
    "Ring of Resistance2": {
      "source": "Pathfinder #123: The Flooded Cathedral pg. 44",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp (+1), 6,000 gp (+2), 13,500 gp (+3), 24,000 gp (+4), 37,500 gp (+5);",
      "weight": "— Description Protective symbols adorn this magic ring. It functions as a cloak of resistance with an equivalent bonus. Construction",
      "requirements": "Forge Ring , resistance , creator's caster level must be at least three times the ring's bonus;",
      "cost": "750 gp (+1), 3,000 gp (+2), 6,750 gp (+3), 12,000 gp (+4), 17,750 gp (+5)"
    },
    "Communique Rings": {
      "source": "Ultimate Intrigue pg. 241",
      "aura": "moderate transmutation",
      "cl": "6th",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description Created in pairs, these simple golden rings allow for short-range communication between the wearers. The listed price and cost are for both rings. As long as the wearers are within 1 mile of one another, they can communicate by whispering, causing the other ring to whisper the words to the recipient. Words spoken into or recited by a communique ring can be heard by nearby creatures if the wearer speaks too loudly. A communique ring transmits sound only while worn, and a wearer can remove the ring if she needs to be silent. Only magical silence or distance will block this communication, and wearers can speak through walls and other obstructions normally. The rings pick up only sound directly spoken into them by the wearer with the intent to transmit, not ambient sounds or the voices of other creatures. Construction",
      "requirements": "Forge Ring, message ;",
      "cost": "3,000 gp"
    },
    "Ring of Far Strike": {
      "source": "Ranged Tactics Toolbox pg. 29",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description This unassuming black ring changes color to a silver pearlescent sheen when held near a fire. Once per day as a standard action, the wearer can make a melee weapon attack or unarmed strike attack against any opponent within 30 feet. The wearer must be otherwise capable of performing the attack to use this ability. Construction",
      "requirements": "Forge Ring, mage hand , spectral hand ;",
      "cost": "3,000 gp"
    },
    "Ring of Return": {
      "source": "Qadira, Jewel of the East pg. 9 , Ultimate Equipment pg. 173",
      "aura": "strong conjuration",
      "cl": "13th",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description The imperial intelligence agency, the Hatharat, entrusts rings of return to agents within Taldor and other hostile regions. When a transport command word is spoken (a standard action), a ring of return whisks the wearer to the nearest imperial administration building within Kelesh's borders, as if via greater teleport . If anyone attempts to remove a ring of return from the wearer's finger without speaking a removal command word (a standard action that provokes an attack of opportunity), the attempt triggers the effect, transporting both the wearer and the person attempting to remove the ring. A successful DC 20 Will save allows a character to resist the teleportation, but in any event, a ring of return can be used only once; after its single charge is expended, it becomes an ordinary, nonmagical ring. Construction",
      "requirements": "Forge Ring, greater teleport ;",
      "cost": "3,000 gp"
    },
    "Ring of Sacred Mistletoe": {
      "source": "Ultimate Equipment pg. 173",
      "aura": "faint transmutation",
      "cl": "1st",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description This tiny ring of living mistletoe coils about the wearer's finger of its own accord. The wearer gains a +2 competence bonus on Handle Animal, Knowledge (nature), and wild empathy checks, and a wearer with the woodland stride ability can move effortlessly, without harm or impediment, even through magically created or manipulated plants. This does not allow the wearer to move through solid objects or creatures. Furthermore, the wearer can use shillelagh once per day. Construction",
      "requirements": "Forge Ring, pass without trace , shillelagh ;",
      "cost": "3,000 gp"
    },
    "Ring of Sundering Metals": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description This iron ring's head is shaped like a gilded anvil. In addition to the usual powers of a ring of ferocious action UE , the wearer can expend 1 charge from a ring of sundering metals to magically imbue a single wielded metal melee weapon with cold iron or silver. For 1 minute, the imbued weapon can bypass either DR/cold iron or DR/silver. Construction",
      "requirements": "Forge Ring, haste , magic weapon , stabilize ;",
      "cost": "3,000 gp"
    },
    "Ring of Swarming Stabs": {
      "source": "Ultimate Equipment pg. 175 , Advanced Race Guide pg. 155",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "6,000 gp;",
      "weight": "— Description This ring is crafted of hardened leather strips, into which bits of fur, feathers, bone, and ivory have been woven. Twice per day, when the wearer is flanking an opponent, he can as a swift action deal an additional 1d6 points of damage on a successful melee attack against that opponent. This is a sneak attack for any effects that reduce or negate such damage. Construction",
      "requirements": "Forge Ring, guidance , creator must be able to sneak attack;",
      "cost": "3,000 gp"
    },
    "Ring of Spell Knowledgetype II": {
      "source": "Ultimate Equipment pg. 174",
      "aura": "moderate or strong (no school)",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,500 gp (type I), 6,000 gp (type II), 13,500 gp (type III), 24,000 gp (type IV);",
      "weight": "— Description This ring comes in four types: ring of spell knowledge I , ring of spell knowledge II , ring of spell knowledge III , and ring of spell knowledge IV . All of them are useful only to spontaneous arcane spellcasters. Through study, the wearer can gain the knowledge of a single spell in addition to those allotted by her class and level. A ring of spell knowledge I can hold 1st-level spells only, a ring of spell knowledge II 1st- or 2nd-level spells, a ring of spell knowledge III spells of 3rd level or lower, and a ring of spell knowledge IV up to 4th-level spells. A ring of spell knowledge is only a storage space; the wearer must still encounter a written, active, or cast version of the spell and succeed at a DC 20 Spellcraft check to teach the spell to the ring. Thereafter, the arcane spellcaster may cast the spell as though she knew the spell and it appeared on her class' spell list. Arcane spells that do not appear on the wearer's class list are treated as one level higher for all purposes (storage and casting). Construction",
      "requirements": "Forge Ring, creator must be able to cast spells of the spell level to be granted;",
      "cost": "750 gp (type I), 3,000 gp (type II), 6,750 gp (type III), 12,000 gp (type IV)"
    },
    "Ring of Unquenchable Passions": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "faint abjuration and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "6,500 gp;",
      "weight": "— Description This gold ring bears three dagger-shaped marks. It functions as a ring of protection +1 . In addition, it grants a +5 competence bonus on Acrobatics checks and a +2 resistance bonus on saving throws against disease. Construction",
      "requirements": "Forge Ring, resistance , shield of faith , creator must have 5 ranks in Acrobatics, creator must be at least 3rd level;",
      "cost": "3,250 gp"
    },
    "Ring of Grit Mastery": {
      "source": "Ultimate Equipment pg. 171",
      "aura": "faint abjuration and evocation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "6,840 gp;",
      "weight": "— Description This ring is made out of fused firearm bullets, making it a chunky but overall impressive ring. Twice per day, as a free action, when the wearer regains grit, she can choose to store it in the ring of grit mastery instead of regaining the grit point. She can store up to 2 grit points within the ring in this way. She can spend the grit points stored in the ring either of the following ways. Once per day, without the need to take an action to do so, the wearer can spend 1 grit point stored in the ring to grant herself a +2 insight bonus to initiative. Once per day, as a standard action, the wearer of the ring can spend 2 grit points stored within the ring to activate a bullet shield as the spell ( Ultimate Combat ). Any grit points stored in the ring disappear at the start of each day. Construction",
      "requirements": "Forge Ring, anticipate peril , bullet shield , creator must have the grit class feature;",
      "cost": "3,420 gp"
    },
    "Ring of Summoning Affinity (Archon)": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "faint conjuration [good, law]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,000 gp;",
      "weight": "— Description This ring is made of hammered steel. If the wearer can cast summon monster spells, the wearer adds harbringers B3 to the 3rd-level list of monsters he can summon with those spells, adds legion archon B3 to the 6th-level list, and adds shield archon B2 to the 7th-level list. Also, once per day on command the wearer can use this ring to summon a harbinger, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be neutral good;",
      "cost": "3,500 gp"
    },
    "Ring of Summoning Affinity (Angel)": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "faint conjuration [good]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,200 gp;",
      "weight": "— Description This ring is cut from transparent crystal. If the wearer can cast summon monster spells, the wearer adds cassian B2 to the 3rd-level list of monsters she can summon with those spells, adds movanic deva B2 to the 7th-level list, and adds monadic deva B2 to the 8th-level list. Also, once per day on command the wearer can use this ring to summon a cassian, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be good;",
      "cost": "3,600 gp"
    },
    "Ring of Summoning Affinity (Protean)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration [chaos]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,200 gp;",
      "weight": "— Description This ring is made from an opalescent material that is never the same color twice. If the wearer can cast summon monster spells, the wearer adds voidworm B2 to the 3rd-level list of monsters she can summon with those spells, adds naunet B2 to the 6th-level list, and adds imentesh B2 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a voidworm, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be chaotic neutral;",
      "cost": "3,600 gp"
    },
    "Ring of Summoning Affinity (Kyton)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration [evil, law]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,300 gp;",
      "weight": "— Description This iron ring has several sharp barbs. If the wearer can cast summon monster spells, the wearer adds augur B3 to the 3rd-level list of monsters he can summon with those spells, adds sacristan B4 to the 7th-level list, and adds interlocutor B3 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon an augur, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be lawful evil;",
      "cost": "3,650 gp"
    },
    "Ring of the Stone Sibling": {
      "source": "Second Darkness Player's Guide pg. 29",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "7,400 gp;",
      "weight": "— Description This gray ring looks like stone, but the material is soft and flexible. Once per day, as a standard action, you can touch a stone wall with your hand to create a stone duplicate of yourself. Immediately upon activating the ring of the stone sibling , your double steps out of the wall. It appears to be a stone statue carved in an exact likeness of you. The stone double stands 10 feet away from you and mimics your movements, as if reflected in a mirror. As a move-equivalent action, you can mentally command the stone sibling to move to a new location, but it must remain within 30 feet of you at all times. The stone sibling has hardness 8 and 50 hit points. It can take no actions other than to aid you, which it does every round on your turn. The stone sibling makes a +5 aid another check each round, either to aid your attack rolls or your Armor Class, as you command. It continues to render the same aid indefinitely until you command it otherwise (which requires a move action). The stone sibling lasts for 10 minutes, until it is destroyed, or until you dismiss it (a standard action), whichever comes first. Construction",
      "requirements": "Forge Ring, mirror image , stone shape ;",
      "cost": "3,700 gp, 296 XP"
    },
    "Ring of Summoning Affinity (Asura)": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "faint conjuration [evil, law]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,600 gp;",
      "weight": "— Description This ring is made of intricately marked brass. If the wearer can cast summon monster spells, the wearer adds tripurasura B3 to the 3rd-level list of monsters he can summon with those spells, adds adhukait B3 to the 6th-level list, adds upasunda B3 to the 7th-level list, and adds aghasura B3 to the 8th-level list. Also, once per day on command the wearer can use this ring to summon a tripurasura, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be lawful evil;",
      "cost": "3,800 gp"
    },
    "Ring of Summoning Affinity (Psychopomp)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,600 gp;",
      "weight": "— Description This silver ring is marked with a skull emblem. If the wearer can cast summon monster spells, the wearer adds nosoi B4 to the 3rd-level list of monsters he can summon with those spells, adds catrina B4 to the 4th-level list, adds vanth B4 to the 6th-level list, and adds morrigna B4 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a nosoi, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be neutral with no other alignment components;",
      "cost": "3,800 gp"
    },
    "Ring of Summoning Affinity (Agathion)": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "faint conjuration [good]",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,700 gp;",
      "weight": "— Description This ring is forged from electrum and inlaid with runes. If the wearer can cast summon monster spells, the wearer adds silvanshee B2 to the 3rd-level list of monsters she can summon with those spells, adds vulpinal B2 to the 5th-level list, adds avoral B2 to the 7th-level list, and adds leonal B2 to the 8th-level list. Also, once per day on command the wearer can use this ring to summon a silvanshee, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be neutral good;",
      "cost": "3,850 gp"
    },
    "Ring of Culturemeld": {
      "source": "Bastards of Golarion pg. 5",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "ring;",
      "price": "7,800 gp;",
      "weight": "— Description This ornately carved ironwood ring is sometimes gifted to half-elves leaving their elven communities so as to ease transition into human culture. A ring of culturemeld slightly alters the wearer's words to be more appropriate to the listener's culture and expectations, granting the wearer a +5 competence bonus on language-based Diplomacy checks. If worn by a half-elf, a ring of culturemeld grants the wearer the ability to speak and understand an additional language dependent on the local area. If the wearer spends 1 day in a settlement the size of a village or larger, the ring becomes attuned to any dominant language spoken there other than Common (such as Hallit, Skald, or Vudrani). After the ring is attuned, the wearer gains that language as a bonus language (if she didn't already know it), though she can only speak and understand it. After 4 more days of attunement, the wearer gains the ability to read the language as well, though not the ability to write that language, and gains a +5 competence bonus on opposed Sense Motive checks against speakers of the attuned language. These benefits expire once the wearer has been out of contact with people who speak the attuned language for longer than 1 day or when the ring becomes attuned to a new language. Construction",
      "requirements": "Forge Ring, comprehend languages ;",
      "cost": "3,900 gp"
    },
    "Ring of Natural Attunement (Kami)": {
      "source": "Advanced Class Guide pg. 217",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,800 gp;",
      "weight": "— Description This ring carved from a single piece of cherry wood bears an inscription written in Tien. If the wearer can cast summon nature's ally spells, the wearer adds shikigami B3 to the 3rd-level list of monsters he can summon with those spells, adds kodama B3 to the 5th-level list, adds zuishin B3 to the 7th-level list, and adds toshigami B3 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a shikigami, as if by the summon nature's ally III spell. Construction",
      "requirements": "Forge Ring, commune with nature , summon nature's ally III ;",
      "cost": "3,900 gp"
    },
    "Ring of Summoning Affinity (Aeon)": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "7,800 gp;",
      "weight": "— Description This ring is forged from black iron and shining silver. If the wearer can cast summon monster spells, he adds paracletus B2 to the 3rd-level list of monsters he can summon, adds theletos B2 to the 6th-level list, and adds akhana B2 to the 9th-level list. Also, once per day the wearer summon a paracletus, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be neutral with no other alignment components;",
      "cost": "3,900 gp"
    },
    "Ring of the Godless1": {
      "source": "People of the Sands pg. 29",
      "aura": "faint abjuration and divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp (+1), 17,000 gp (+2), 27,000 gp (+3), 38,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description These rings are said to have first been forged in Rahadoum by the Council of Elders to help root out the hidden faithful and other practitioners of the divine. A ring of the godless grants a luck bonus on saving throws against divine spells. This bonus does not apply to spell-like or supernatural abilities unless they are class abilities of a divine spellcasting class, such as channel energy or domain powers, or unless they are used by a creature that has been called, created, or summoned by divine magic. The wearer's spell resistance (if any) increases by an amount equal to the ring's luck bonus, though this increase applies only against divine spells (and spell-like abilities as described above). A ring of the godless also allows the wearer to use detect magic at will, though it detects only divine magic. In addition, the wearer can use a specialized form of arcane sight a number of times per day equal to the ring's luck bonus. This ability can be activated as a swift action, its effect lasts until the end of the wearer's turn, and it detects only divine magic or divine spellcasting ability. Construction",
      "requirements": "Forge Ring, arcane sight , detect magic , spell resistance , creator cannot be a divine spellcaster, creator must be of a level at least three times higher than the bonus of the ring;",
      "cost": "4,000 gp (+1), 8,500 gp (+2), 13,500 gp (+3), 19,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Protection2": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description This ring offers continual magical protection in the form of a deflection bonus of +1 to +5 to AC. Construction",
      "requirements": "Forge Ring, shield of faith , caster must be of a level at least three times higher than the bonus of the ring;",
      "cost": "1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)"
    },
    "Maintenance Overseer's Ring": {
      "source": "Heroes of the Streets pg. 15",
      "aura": "faint divination",
      "cl": "4th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description This tarnished signet is marked as belonging to a specific city no smaller than a large town, though it functions in any settlement of at least that size. After spending 5 days in a settlement with the maintenance overseer's ring equipped, its wearer learns a great deal about the schematics of any sewers, tunnels, basements, and passages beneath the settlement. This knowledge is not necessarily absolute, but allows the wearer to act as though trained in Knowledge (dungeoneering) when answering questions about the settlement's underground with a +5 bonus on all such checks. A maintenance overseer's ring also grants the wearer an automatic Perception check to notice secret doors within 10 feet in any area beneath street level of a city to which the ring is attuned. A wearer who already receives a Perception check to perceive a secret door (such as a dwarf using stonecunning) rolls her Perception check twice and takes the better result. Construction",
      "requirements": "Forge Ring, create treasure map APG ;",
      "cost": "4,000 gp"
    },
    "Ironbound RingMaster": {
      "source": "Adventurer's Guide pg. 36",
      "aura": "faint abjuration and enchantment",
      "cl": "5th",
      "slot": "ring;",
      "price": "500 gp (Minion), 8,000 gp (Master);",
      "weight": "— Description While holding one or more minion's ironbound rings , the wearer of a master's ironbound ring can impart instructions of 50 words or fewer to each minion's ironbound rings . The wearer of a minion's ironbound ring can recall the instructions at will and is aware of any action that would cause him to act against those instructions. The DC of any skill check attempted to force the wearer to abandon, misinterpret, or consciously fail the instructions increases by 5, such as for Bluff checks to trick the wearer or Intimidate checks to interrogate him. The wearer gains a +3 resistance bonus on Will saves to resist spells and effects that would force him to act against the instructions, such as dominate person and suggestion Construction",
      "requirements": "Forge Ring, resistance, suggestion ;",
      "cost": "4,000 gp"
    },
    "Ring of Forcefangs": {
      "source": "Ultimate Equipment pg. 171 , Advanced Player's Guide pg. 292",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description This band negates any force spell or force spell-like ability targeted at the wearer. Doing so gives the ring a number of charges equal to the spell level of the incoming force effect. The ring can hold a maximum of 9 charges. If an incoming force attack would charge the ring beyond this limit, the ring does not negate the attack or gain charges, and the attack affects the wearer normally. On command, the wearer can use the ring's charges to cast magic missile , unleashing one missile (1d4+1 force damage) per charge but no more than five missiles per round. Construction",
      "requirements": "Forge Ring, Heighten Spell, magic missile ;",
      "cost": "4,000 gp"
    },
    "Ring of Heroes": {
      "source": "Advanced Player's Guide pg. 325",
      "aura": "moderate (no school)",
      "cl": "7th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description Sculpted in the shape of two noble looking bronze lions charging toward a centrally placed garnet, this ring grants the wearer the Luck of Heroes feat. The ring must be worn for 24 hours before it takes effect. The wearer can also call upon the ring's power to gain a hero point that must be used immediately, although this causes the ring to lose its powers permanently. Construction",
      "requirements": "Forge Ring, Luck of Heroes;",
      "cost": "4,000 gp"
    },
    "Ring of Mind Shielding": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "3rd",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description This ring is usually of fine workmanship and wrought from heavy gold. The wearer is continually immune to detect thoughts , discern lies , and any attempt to magically discern her alignment. Construction",
      "requirements": "Forge Ring, nondetection ;",
      "cost": "4,000 gp"
    },
    "Ring of Strength Sapping": {
      "source": "Ultimate Equipment pg. 174",
      "aura": "moderate necromancy",
      "cl": "7th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description This ring is made of black steel and is eerily cold to the touch. Once per day as a swift action, when the wearer hits a living creature with an unarmed attack, the target must succeed at a DC 20 Fortitude saving throw or take 1d4 point of Strength damage in addition to the attack's normal damage. If the target of the attack takes any Strength damage from this attack, the ring's wearer gains a +2 enhancement bonus to her Strength for 1 minute. Construction",
      "requirements": "Forge Ring, bull's strength , ray of enfeeblement ;",
      "cost": "4,000 gp"
    },
    "Ring of the Beast": {
      "source": "Pathfinder Society Field Guide pg. 53",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description Three types of rings of the beast exist; all three appear as yellowed bone carved in the shapes of wild beasts devouring their own tails. The type of beast depicted on each ring depends on the ring's nature, but could be a wolf ( ring of the relentless beast ), a rhinoceros ( ring of the savage beast ), or a tiger ( ring of the swift beast ). Once per day, a ring of the beast can be activated as a standard action to unleash the primal spirit hidden inside even the most peaceful creatures. When the ring is activated, the wearer gains a bonus to a single physical attribute and a penalty to a single mental attribute for 10 minutes, as determined by the type of ring. A ring of the relentless beast grants a +4 enhancement bonus to Constitution and a –2 penalty to Charisma. A ring of the savage beast grants a +4 enhancement bonus to Strength and a –2 penalty to Intelligence. A ring of the swift beast grants a +4 enhancement bonus to Dexterity and a –2 penalty to Wisdom. As long as the effects of this ring are active, the wearer also gains a +2 enhancement bonus to his natural armor bonus. Construction",
      "requirements": "Forge Ring, barkskin and either bear's endurance ( ring of the relentless beast ), bull's strength ( ring of the savage beast ), or cat's grace ( ring of the swift beast );",
      "cost": "4,000 gp"
    },
    "Society Ring": {
      "source": "Villain Codex pg. 201",
      "aura": "faint abjuration, divination, illusion, and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description The flat bezel of this signet ring is typically set with a semiprecious gem. If the wearer of the ring is successfully inducted into a group or organization through an initiation ritual, the ring becomes attuned to that organization and wearer. A suitable initiation ritual takes at least 10 minutes and at the very least involves a pledge of allegiance to the group or organization, but it can take a variety of forms. The crest or symbol of the organization appears engraved on the gem, and the ring becomes invisible (as per invisibility ) and hidden from scrying effects (as per obscure object ) to all except those who also wear society rings attuned to the same organization (referred to below as “similar rings”). Creatures that are capable of seeing invisible objects, such as via see invisibility , can still perceive a society ring Once attuned, the society ring's wearer can communicate with wearers of similar rings within 150 feet (as per message ). It also grants +10 competence bonuses on Bluff checks to pass secret messages to members of the attuned organization and Sense Motive checks to receive secret messages from them. In addition, if the wearer touches his society ring to a similar ring, for the following hour, the wearer can sense the direction and distance to that ring, as well as any conditions affecting its wearer (as per status ). Only one ring at a time can be linked in this way; if the wearer touches his ring to another similar ring within the duration of the effect, the status effect switches to the most recently touched ring. If a society ring is worn or carried by a creature other than the attuned wearer, the ring silently alerts attuned ring wearers from the same organization within 1 mile (as per alarm ), does not display the crest or symbol of the attuned organization, and glows with a red aura visible only to wearers of similar rings. A new owner can end this effect by becoming initiated into any organization, at which point the ring attunes to the new wearer and organization. Construction",
      "requirements": "Forge Ring, alarm, hidden speech APG , invisibility , message , obscure object , status , creator must have at least 10 ranks in both Bluff and Sense Motive;",
      "cost": "4,000 gp"
    },
    "Soultether Ring": {
      "source": "Planar Adventures pg. 49",
      "aura": "strong necromancy",
      "cl": "17th",
      "slot": "ring;",
      "price": "8,000 gp;",
      "weight": "— Description When the wearer of this delicate platinum ring dies, his soul remains adrift in the River of Souls and does not proceed to its final judgment in the Boneyard. Until the soultether ring is removed from the corpse, the time limit for restoring the creature to life via spells such as raise dead or resurrection is suspended. This ring has no effect if it is placed upon a corpse; it must be worn at the time the creature dies to tether its soul. Psychopomps and other followers of Pharasma consider soultether rings to be sacrilegious, and the creatures destroy the rings whenever possible. Construction",
      "requirements": "Forge Ring; soul bind or true resurrection ;",
      "cost": "4,000 gp"
    },
    "Ring of Summoning Affinity (Inevitable)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration [law]",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,100 gp;",
      "weight": "— Description This ring resembles a gear or cog. If the wearer can cast summon monster spells, the wearer adds arbiter B2 to the 3rd-level list of monsters she can summon with those spells, adds zelekhut B2 to the 7th-level list, adds kolyarut B2 to the 8th-level list, and adds marut B2 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon an arbiter, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be lawful neutral;",
      "cost": "4,050 gp"
    },
    "Band of Toxic Nullification": {
      "source": "Potions and Poisons pg. 30",
      "aura": "moderate necromancy",
      "cl": "9th",
      "slot": "ring;",
      "price": "8,500 gp;",
      "weight": "— Description This platinum band has a smoky quartz set neatly into it. Once per day, the wearer can speak a command word and place the quartz on her skin as a full-round action to siphon a single dose of poison from her body and into the quartz, rendering the poison inert. This effect can be used only after the wearer has been poisoned. Construction",
      "requirements": "Craft Wondrous Item, absorb toxicity ;",
      "cost": "4,250 gp"
    },
    "Contract Rings": {
      "source": "Cohorts and Companions pg. 29",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "ring;",
      "price": "8,500 gp;",
      "weight": "— Description Contract rings are crafted in pairs (the price is for both rings), establishing a connection between the wearers. Each wearer must wear their ring for 24 hours before they begin to work. Contract rings grant a +10 competence bonus on Sense Motive checks made against the other wearer, and creatures wearing linked contract rings can understand each other's language. Once per day, Contract rings can seal a contract. The two wearers join hands and willingly state what each is agreeing to. Once both agree, each wearer accepts a lesser geas (no save) to fulfill the terms of the contract. This function does not occur if either character is under a mind-affecting effect or threat that forces her agreement. This compulsion lasts 7 days, starting immediately. While the lesser geas remains in effect, neither wearer can remove her ring, and neither ring can establish another lesser geas . If either ring is destroyed, the effects of any active lesser geas remain for both creatures, but the surviving ring becomes nonfunctional once the lesser geas expires until the missing ring is repaired or replaced. If one wearer's lesser geas is broken, the other wearer's is removed. Construction",
      "requirements": "Forge Ring, detect thoughts , lesser geas , share language APG ;",
      "cost": "4,250 gp"
    },
    "Ring of Force Shield": {
      "source": "Ultimate Equipment pg. 171 , PRPG Core Rulebook pg. 479",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "ring;",
      "price": "8,500 gp;",
      "weight": "— Description This ring generates a shield-sized (and shield-shaped) wall of force that stays with the ring and can be wielded by the wearer as if it were a heavy shield (+2 AC). This special creation has no armor check penalty or arcane spell failure chance since it is weightless and encumbrance-free. It can be activated and deactivated at will as a free action. Construction",
      "requirements": "Forge Ring, wall of force ;",
      "cost": "4,250 gp"
    },
    "Ring of Summoning Affinity (Qlippoth)": {
      "source": "Advanced Class Guide pg. 220",
      "aura": "faint conjuration [chaos, evil]",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,600 gp;",
      "weight": "— Description This ring has an odd, disquieting texture that always reveals greater layers of complexity the more closely it is examined. If the wearer can cast summon monster spells, the wearer adds cythnigot B2 to the 3rd-level list of monsters he can summon with those spells, adds shoggti B2 to the 6th-level list, adds nyogoth B2 to the 7th-level list, adds chernobue B2 to the 8th-level list, and adds augnagar B2 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a cythnigot, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be chaotic evil;",
      "cost": "4,300 gp"
    },
    "Ring of the Ram": {
      "source": "Ultimate Equipment pg. 176 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "8,600 gp;",
      "weight": "— Description A ring of the ram has a setting crafted to resemble a ram's head. The wearer can command the ring to give forth a ramlike force, manifested by a vaguely discernible shape that resembles the head of a ram or a goat. This force strikes a single target, dealing 1d6 points of damage if 1 charge is expended, 2d6 points if 2 charges are used, or 3d6 points if 3 charges (the maximum) are used. Treat this as a ranged attack with a 50-foot maximum range and no penalties for distance. The force of the blow is considerable, and those struck by the ring are subject to a bull rush if within 30 feet of the ring wearer. The ram is Large and uses the ring's caster level as its base attack bonus, with a Strength of 25. This gives the ram a Combat Maneuver Bonus of +17. The ram gains a +1 bonus on the bull rush attempt if 2 charges are expended, or +2 if 3 charges are expended. In addition to its attack mode, the ring of the ram also has the power to open doors as if it were a character with a Strength score of 25. This usage expends 1 charge. If 2 charges are expended, the effect is equivalent to a character with a Strength score of 27. If 3 charges are expended, the effect is that of a character with Strength score of 29. A newly created ring has 50 charges. When all the charges are expended, the ring becomes a nonmagical item. Construction",
      "requirements": "Forge Ring, bull's strength , telekinesis ;",
      "cost": "4,300 gp"
    },
    "Scholar's Ring": {
      "source": "Ultimate Equipment pg. 177",
      "aura": "moderate conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,700 gp;",
      "weight": "— Description A scholar's ring grants complete understanding of any written text or spoken language, even one that the wearer has never encountered before (as the comprehend languages spell), as well as a +5 competence bonus on Knowledge (history) checks. In addition, once every 5 days the wearer can invoke a legend lore spell related to a subject that she has been studying in the previous week, if she has attempted a Knowledge (history) check aided by the ring. Construction",
      "requirements": "Forge Ring, comprehend languages , legend lore ;",
      "cost": "4,350 gp"
    },
    "Ring of Protected Life": {
      "source": "Undead Slayer's Handbook pg. 29",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "9,000 gp;",
      "weight": "1 lb. Description This silver ring features arboreal motifs, and is set with a small but brilliant sapphire. If the wearer has the channel energy class feature, the radius of his channeled energy increases by 5 feet. Additionally, when the wearer channels energy, he may choose to exempt one creature from the effects of his channeling. If the wearer has the Selective Channeling feat, the ring of protected life increases the number of creatures he may normally exempt by one. Finally, once per day the wearer may channel energy as a swift action that does not provoke attacks of opportunity; doing so renders the ring of protected life inert for 24 hours, during which time it does not confer any benefits. Construction",
      "requirements": "Forge Ring, Selective Channeling, creator must have the channel energy class feature;",
      "cost": "4,500 gp"
    },
    "Rings of Friend-Finding": {
      "source": "Cohorts and Companions pg. 29",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "ring;",
      "price": "9,000 gp;",
      "weight": "— Description These specialized rings are sold in pairs and help allies find one another. Each of the wearers must wear the rings for 24 hours before they function, after which each wearer can activate her ring of friend-finding as a standard action, enabling her to determine the direction, distance, and general condition of the wearer of the other ring as a status spell. Construction",
      "requirements": "Forge Ring, detect thoughts , status ;",
      "cost": "4,500 gp"
    },
    "Ring of Summoning Affinity (Div)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration [chaos, evil]",
      "cl": "5th",
      "slot": "ring;",
      "price": "9,100 gp;",
      "weight": "— Description This ring is shaped to resemble a snake consuming its own tail. If the wearer can cast summon monster spells, the wearer adds doru B3 to the 3rd-level list of monsters he can summon with those spells, adds aghash B3 to the 4th-level list, adds pairaka B3 to the 6th-level list, adds ghawwas B3 to the 7th-level list, adds shira B3 to the 8th-level list, and adds sepid B3 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a doru, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be chaotic evil;",
      "cost": "4,550 gp"
    },
    "Band of Efficacious Death": {
      "source": "Potions and Poisons pg. 28",
      "aura": "faint necromancy",
      "cl": "3rd",
      "slot": "ring;",
      "price": "9,250 gp;",
      "weight": "— Description This golden ring is set with a large, almost gaudy onyx that can open to reveal a hidden compartment with just enough room for a single dose of powdered poison. This ring provides a +2 competence bonus on Sleight of Hand checks to conceal this poison on the wearer's body. In addition, the ring contains four charges that recharge each day. When drawing a poison from the band of efficacious death , the wearer can tap the onyx up to four times to increase the frequency of the poison by 1 increment per tap. For example, if the poison's frequency were 1/round for 2 rounds, by touching the onyx once, the frequency would become 1/round for 3 rounds. Construction",
      "requirements": "Craft Wondrous Item, pernicious poison ;",
      "cost": "4,625 gp"
    },
    "Splendorous Ring": {
      "source": "Chronicle of the Righteous pg. 53",
      "aura": "faint illusion",
      "cl": "3rd",
      "slot": "ring;",
      "price": "9,900 gp;",
      "weight": "— Description A splendorous ring is composed of six white and yellow\r gemstones faceted in a platinum band. Three times per day,\r the wearer of a splendorous ring can twist the ring to cloak\r himself in an aura of glory. He appears both radiant and terrible,\r glowing with the might of the heavens. Anyone within 10 feet\r of the ring when it is activated must succeed at a DC 13 Will\r save or be fascinated by the wearer's form as if affected by hypnotic pattern . 2d4+3 Hit Dice worth of creatures are affected\r in this way. The fascinating effect of the ring lasts for 3 rounds. During\r that time and for 5 rounds after, the ring's wearer gains a +2\r sacred bonus on any Charisma checks or Charisma-based skill\r checks to influence any good-aligned creatures affected by the\r ring's hypnotic pattern effect, and a –2 penalty on any Charisma\r checks or Charisma-based skill checks to influence any evilaligned\r creatures affected by the hypnotic pattern effect. Construction",
      "requirements": "Forge Ring, eagle's splendor , hypnotic pattern , creator must be good-aligned;",
      "cost": "4,950 gp"
    },
    "Ring of Delayed Doom2 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ring of Revelationlesser": {
      "source": "Ultimate Equipment pg. 173 , Advanced Player's Guide pg. 293",
      "aura": "moderate varies",
      "cl": "11th",
      "slot": "ring;",
      "price": "10,000 gp (lesser), 16,000 gp (greater), 24,000 gp (superior);",
      "weight": "— Description A ring of revelation is a divine item attuned to a particular oracular mystery and containing a revelation associated with that mystery (see the oracle class description). While wearing the ring, an oracle has access to that revelation and may use it as if she had it as a normal class feature. The oracle must have the appropriate mystery to use the ring, and must meet the level requirements (if any) of the revelation itself; for example, a ring of revelation (combat healer) is only usable by an oracle of at least 7th level with the battle mystery. If the oracle already has that revelation and the revelation gives an ability with a limited number of uses per day, the oracle can use that ability one additional time per day. The ring has no effect if worn by a non-oracle, and Use Magic Device doesn't allow a character to gain a revelation from this ring. A lesser ring of revelation contains a revelation that has no level prerequisite or a prerequisite that is less than 6th level. A greater ring of revelation contains a revelation that requires the oracle to be 7th level or higher. A superior ring of revelation contains a revelation that requires the oracle to be 11th level or higher. Construction",
      "requirements": "Forge Ring, creator must be an oracle with the desired revelation;",
      "cost": "5,000 gp (lesser), 8,000 gp (greater), 12,000 gp (superior)"
    },
    "Ring of Climbing (improved)": {
      "source": "Ultimate Equipment pg. 168 , PRPG Core Rulebook pg. 479",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This ring functions as a ring of climbing , except it grants a +10 competence bonus on its wearer's Climb checks. Construction",
      "requirements": "Forge Ring, creator must have 10 ranks in the Climb skill;",
      "cost": "5,000 gp"
    },
    "Ring of Curing": {
      "source": "Ultimate Equipment pg. 168",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This simple copper ring is a boon to those who spend their lives healing others. Whenever the wearer of a ring of curing casts a conjuration spell of the healing subschool, all maximums to the level-dependent healing provided by that spell increase by 2. For example, cure light wounds would provide a maximum healing of 1d8 + 7 (at 7th caster level), while heal would cure a maximum of 170 points of damage. This ring does not increase the wearer's actual caster level, nor the amount of level-dependent healing provided by any such spell. Construction",
      "requirements": "Forge Ring, Heighten Spell, consecrate ;",
      "cost": "5,000 gp"
    },
    "Ring of Foe Focus": {
      "source": "Ultimate Equipment pg. 170",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This ring of jagged steel gives the impression that it was salvaged from a suit of armor and then crudely bent into a circle. The wearer of the ring can, at will, designate any one opponent she can see as a particularly dangerous foe. She gains a +2 bonus to her AC and saving throws against attacks made by that opponent until she designates a new enemy. Construction",
      "requirements": "Forge Ring, shield ;",
      "cost": "5,000 gp"
    },
    "Ring of Jumping (improved)": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This ring functions as a ring of jumping , except it grants the wearer a +10 competence bonus all her Acrobatics checks made to make high or long jumps. Construction",
      "requirements": "Forge Ring, creator must have 10 ranks in Acrobatics;",
      "cost": "5,000 gp"
    },
    "Ring of Ki Mastery": {
      "source": "Ultimate Equipment pg. 172",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This ring is half onyx and half clear-white crystal, magically fused together and hardened to the strength of steel. It allows a wearer with a ki pool to store up to 2 ki points in the ring as a swift action. These points remain in the ring until used. The wearer can use the ki points normally, or can gain the following benefits when he has ki points stored in the ring. As long as there is at least one ki point stored in the ring, the wearer gains a +2 bonus to CMD against grapple, reposition, and trip attempts. As long as there are at least 2 ki points stored in the ring, the wearer reduces the number of ki points needed to use a ninja trick or ki ability by 1 (minimum 1 ki point). Construction",
      "requirements": "Forge Ring, ki leech , the creator must be able to use ki ;",
      "cost": "5,000 gp"
    },
    "Ring of Seven Virtues": {
      "source": "Pathfinder #39: The City of Seven Spears pg. 56",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description This bronze band is covered in geometric shapes and studded with tiny pearls. The wearer of the ring gains a constant endure elements effect and a +5 competence bonus on Survival checks made in jungles. In Saventh-Yhi, the wearer also enjoys the active benefits of one of that city's seven spears for as long as she is in that spear's district. The wearer loses the benefits of a particular spear if she leaves that spear's district, but gains new active benefits if she enters a new spear's district. The ring's wearer can only gain the benefits of a single spear at any one time. Construction",
      "requirements": "Forge Ring, Self-Sufficient, endure elements ;",
      "cost": "5,000 gp"
    },
    "Ring of Swimming (improved)": {
      "source": "Ultimate Equipment pg. 175 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "10,000 gp;",
      "weight": "— Description As a ring of swimming , except it grants a +10 competence bonus on its wearer's Swim checks. Construction",
      "requirements": "Forge Ring, creator must have 10 ranks in Swim;",
      "cost": "5,000 gp"
    },
    "Ring of Summoning Affinity (Daemon)": {
      "source": "Advanced Class Guide pg. 219",
      "aura": "faint conjuration [evil]",
      "cl": "5th",
      "slot": "ring;",
      "price": "10,600 gp;",
      "weight": "— Description This ring is carved from bone. If the wearer can cast summon monster spells, the wearer adds cacodaemon B2 to the 3rd-level list of monsters she can summon with those spells, adds ceustodaemon B2 to the 5th-level list, adds hydrodaemon B2 to the 6th-level list, adds luekodaemon B2 and piscodaemon B2 to the 7th-level list, adds derghodaemon B2 and meladaemon B2 to the 8th level list, and adds thanadaemon B2 to the 9thlevel list. Also, once per day on command the wearer can use this ring to summon a cacodaemon, as if by the summon monster III spell. Construction",
      "requirements": "Forge Ring, planar ally or planar binding , creator must be neutral evil;",
      "cost": "5,300 gp"
    },
    "Ring of Animal Friendship": {
      "source": "Ultimate Equipment pg. 166 , PRPG Core Rulebook pg. 479",
      "aura": "faint enchantment",
      "cl": "3rd",
      "slot": "ring;",
      "price": "10,800 gp;",
      "weight": "— Description A ring of animal friendship always bears some sort of animal-like design in its craftsmanship. On command, this ring affects an animal as if the wearer had cast charm animal , causing the animal to regard the wearer as a trusted friend. Construction",
      "requirements": "Forge Ring, charm animal ;",
      "cost": "5,400 gp"
    },
    "Ring of the Iron Skull": {
      "source": "Pathfinder #57: Tempest Rising pg. 59",
      "aura": "faint divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "10,800 gp;",
      "weight": "— Description Crudely cut amethysts and a single engraved skull decorate the band of this thick iron ring. The ring grants its wearer a +5 competence bonus on Appraise checks to determine the most valuable item in a treasure hoard and a +5 competence bonus on Heal checks to ascertain details of a dead creature's demise. Once per day as a standard action, the wearer can touch the ring to a corpse or piece of a corpse to learn the dead creature's name, gender, race, and profession or role, as well as the manner of the creature's death. The wearer also becomes aware of the location of other pieces of the corpse if they're within 1,200 feet. If the body part comes from a creature that's still alive or undead, the wearer gains no information. The ring of the iron skull must be worn for 24 hours before it starts to function for the wearer. Construction",
      "requirements": "Forge Ring, blood biography ( Advanced Player's Guide 206), locate object ;",
      "cost": "5,400 gp"
    },
    "Ring of Transposition": {
      "source": "Ultimate Equipment pg. 176",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "10,800 gp;",
      "weight": "— Description On command, the wearer of this ring can touch it to another ring, magical or mundane, and bind it to the ring of transposition. Once per day, the wearer of the ring of transposition can speak a command word to exchange places with the creature wearing the bonded ring, which must be within 800 feet, as though using a dimension door spell against a willing target. In the process, the ring of transposition trades places with the ring on the other creature's hand, and the bond between the rings is broken. The bonding property of the ring of transposition can be used as often as desired, breaking any existing bond each time it is used. An existing bond can be broken by a successful dispel check against the caster level of the ring. Construction",
      "requirements": "Forge Ring, dimension door ;",
      "cost": "5,400 gp"
    },
    "Holdout Ring": {
      "source": "Inner Sea Combat pg. 59",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "11,000 gp;",
      "weight": "— Description Made of aged bronze and steel, this ring looks like it should have a gem set in it, but instead has an empty circular hole. The hole in the ring holds a single firearm bullet; if one is placed inside (as a full-round action), it merges seamlessly into the ring. While a bullet is merged into the ring, the wielder can fire the bullet as though she were using a +1 pistol UE that can't misfire. Once the bullet has been fired from the ring, a new bullet can't be placed inside for 24 hours. Each holdout ring is created with two +1 ammunition special abilities and one +2 ammunition special ability. If the wearer has the grit class feature, she can expend grit (maximum 4 grit points) to imbue bullets merged with the gun with one or more of these abilities. Imbuing a bullet with a +1 special ability costs 1 grit point; imbuing one with a +2 special ability costs 2 grit points. Each ring's special abilities are established upon the item's creation and can't be changed. If a special ability has multiple versions, as does bane , the specific version must be set at that time (e.g., dragon bane ). A typical holdout ring has the flaming , seeking , and shocking burst UE special abilities. Construction",
      "requirements": "Forge Ring, magic weapon , telekinesis , creator must meet the requirements for the ammunition special abilities that can be imbued by the ring;",
      "cost": "5,500 gp"
    },
    "Ring of Tactical Precision": {
      "source": "Ultimate Equipment pg. 175",
      "aura": "moderate transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "11,000 gp;",
      "weight": "— Description This steel ring is inlaid with adamantine swords and shields. The wearer gains a +5 competence bonus on Profession (soldier) checks, and anytime the wearer gives or receives a numeric bonus from a teamwork feat or the aid another action, that bonus increase by +1. By wearing the ring for 1 hour, a creature may imbue it with a teamwork feat he knows for 24 hours. During this time, any creature wearing the ring may use that feat when cooperating with the creature that imbued it, but not with other creatures even if they possess the same teamwork feat. If the ring is imbued with a new teamwork feat, it replaces the previous feat. Construction",
      "requirements": "Forge Ring, creator must have 5 ranks of Profession (soldier) and at least one teamwork feat;",
      "cost": "5,500 gp"
    },
    "Ring of the Sophisticate": {
      "source": "Ultimate Equipment pg. 176 , Advanced Race Guide pg. 48",
      "aura": "moderate transmutation and divination",
      "cl": "8th",
      "slot": "ring;",
      "price": "11,000 gp;",
      "weight": "— Description Often worn on the little finger, this ring grants its wearer a +4 competence bonus on Sense Motive and Knowledge (local) checks. Also, once per day on command, the wearer can use the ring to cast either locate creature or locate object (the wearer's choice). Furthermore, on command and at will, the wearer can instantly know the direction from herself to the nearest tavern, pub, or similar watering hole as long as that establishment is in a settlement whose population is equivalent to that of a village or greater ( GameMastery Guide 203) and that is within 20 miles of the wearer. Construction",
      "requirements": "Forge Ring, know direction , locate creature , locate object , creator must have at least 4 ranks in both Sense Motive and Knowledge (local);",
      "cost": "5,500 gp"
    },
    "Decoy Ring": {
      "source": "Ultimate Equipment pg. 166",
      "aura": "moderate illusion",
      "cl": "11th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description This ring is a thick loop of mirrorlike metal. Whenever the wearer of this ring takes the withdraw action or becomes helpless (including falling unconscious), it instantly makes her invisible for 3 rounds and creates four illusory duplicates that either run off in opposite directions or perform other plausible actions that could draw enemy attention away from her. The duplicates last for 3 rounds before disappearing, but they instantly pop out of existence if struck by an attack (AC 10) and can be disbelieved (Will DC 19). Allies of the wearer always know her true location and can freely provide aid or assistance to her. Construction",
      "requirements": "Forge Ring, mislead ;",
      "cost": "6,000 gp"
    },
    "Ring of Energy Resistanceminor": {
      "source": "Ultimate Equipment pg. 170 , PRPG Core Rulebook pg. 479",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "12,000 gp (minor), 28,000 gp (major), 44,000 gp (greater);",
      "weight": "— Description Rings of this type come in a wide variety of designs and colorations, typically related to the types of energy they defend against. These rings continually protect their wearers from damage from one type of energy—acid, cold, electricity, fire, or sonic (chosen by the creator of the item; determine randomly if found as part of a treasure hoard). Each time the wearer would normally take such damage, subtract the ring's resistance value from the damage dealt. A minor ring of energy resistance grants 10 points of resistance. A major ring of energy resistance grants 20 points of resistance. A greater ring of energy resistance grants 30 points of resistance. Construction",
      "requirements": "Forge Ring, resist energy ;",
      "cost": "6,000 gp (minor), 14,000 gp (major), 22,000 gp (greater)"
    },
    "Ring of Blood Calling": {
      "source": "Pathfinder #106: For Queen and Empire pg. 18",
      "aura": "moderate conjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description This iron ring is set with a polished bloodstone. When created, a ring of blood calling creates a link between a single mortal creature devoted to Asmodeus and a specific devil with no more than 12 Hit Dice who willingly agrees to be bound by the item. Once per day as a standard action, the ring's wearer can place a drop of his own blood on the ring's gem (provoking attacks of opportunity) to immediately call the devil linked to the ring to any space within 30 feet. While the wearer does not control the devil, most wearers make agreements with the devil linked to the ring for protection or some other service when called. The called devil remains for 1 hour, or the wearer can dismiss the devil as a free action. If the devil linked to the ring is killed, the ring crumbles to dust. If wearer linked to the ring is killed, a new wearer can summon the linked devil, but can compel the devil to perform only one service, as per planar binding, which severs the devil's link to the ring when the task is completed unless the new wearer makes his own deal with the devil, reestablishing the link between the wearer, the devil, and the ring. Nicolo Alazario's ring of blood calling is linked to a bone devil named Xanthut. If Nicolo is killed, the PCs will need to make their own arrangements with Xanthut to link themselves to the ring to call the devil. Construction",
      "requirements": "Forge Ring, planar binding ;",
      "cost": "6,000 gp"
    },
    "Ring of Craft Magic": {
      "source": "Ultimate Equipment pg. 168 , Advanced Race Guide pg. 38",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description A ring of craft magic always bears some sort of tool-like design in its craftsmanship. The wearer of the ring sees spells as similar to crafts, and vice versa. The wearer may make a Craft check in place of a Spellcraft check to identify an item that could be created with that Craft skill. The wearer may also expend a spell slot or prepared spell to gain an enhancement bonus equal to the level of the expended spell on a single Craft or Profession check (regardless of the amount of time needed to make the check). Construction",
      "requirements": "Forge Ring, creator must have the obsession racial trait;",
      "cost": "6,000 gp"
    },
    "Ring of Ectoplasmic Invigoration": {
      "source": "Ultimate Equipment pg. 169",
      "aura": "moderate conjuration",
      "cl": "6th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description A summoner wearing a ring of ectoplasmic invigoration can use his maker's call class feature to absorb his eidolon (dismissing it in the process) instead of bringing it to his side. He gains 2 temporary hit points per Hit Die of the eidolon and the benefits of a lesser restoration spell. T he eidolon must still be within range of his maker's call ability. Any temporary hit points gained fade after 1 hour or when the eidolon is summoned again. A wearer with the transposition ability can transport himself to the eidolon's square (still absorbing and dismissing it) rather than calling the eidolon to him. Construction",
      "requirements": "Forge Ring, the creator must be able to summon an eidolon and have the maker's call class feature;",
      "cost": "6,000 gp"
    },
    "Ring of Immolation": {
      "source": "Curse of the Crimson Throne (PFRPG) pg. 435 , Pathfinder #11: Skeletons of Scarwall pg. 42",
      "aura": "moderate evocation (fire)",
      "cl": "10th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description A ring of immolation is made of pumice and hardened ash but is as strong as metal. As a free action, the wearer can activate the ring to create a fire shield (warm) on himself. The wearer of a ring of immolation can activate a fire shield on himself for up to 10 rounds each day (these rounds need not be used consecutively). If the wearer would take magical cold damage and any rounds of duration remain, the ring automatically activates for 1 round and protects the wearer from the cold damage as per fire shield Construction",
      "requirements": "Forge Ring , fire shield ;",
      "cost": "6,000 gp"
    },
    "Ring of Retreat": {
      "source": "Adventurer's Guide pg. 115",
      "aura": "strong conjuration",
      "cl": "12th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description Each of these silver-and-gemstone rings is attuned to a specific aiudara , or elf gate. The ring must be created at the aiudara in question, and its gemstone always matches the gate's portal-key. On command once per week, the ring teleports its wearer back to that gate, as per word of recall . Theoretically, a ring of retreat could be crafted instead to transport the wearer to a specific site of import, such as a temple or stronghold, but to date, these rings have been crafted only with elf gates in mind. Construction",
      "requirements": "Forge Ring, word of recall ;",
      "cost": "6,000 gp"
    },
    "Ring of the Troglodyte": {
      "source": "Ultimate Equipment pg. 176",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description Two times per day on command, the wearer of this ring can produce a horrific smell affecting all living creatures other than the wearer within a 10-foot radius. Once created, the smell remains, centered on the wearer, until she dismisses it as a free action. This is a poison effect. Any creature affected by the disgusting aroma produced by the ring must succeed at a DC 14 Fortitude saving throw when it starts its turn in the ring's stench radius. Those that fail a saving throw become sickened for 1 round. If they are already sickened, they become nauseated for 1 round instead. Construction",
      "requirements": "Forge Ring, stinking cloud ;",
      "cost": "6,000 gp"
    },
    "Steelhand Circle": {
      "source": "Ultimate Equipment pg. 177",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "ring;",
      "price": "12,000 gp;",
      "weight": "— Description When this ring is worn, the wielder's skin attains a barely perceptible sheen. In practical terms, the wearer ignores the first 5 points of an object's hardness when performing a sunder combat maneuver or when smashing an object. She also does not take the standard –4 penalty for making a combat maneuver check to disarm while unarmed. Additionally, the ring's wearer can focus all of the ring's power, possibly repelling a devastating blow. Once per day, when a critical hit or sneak attack is scored on the wearer, there is a 50% chance that the critical hit or sneak attack is negated and damage is instead rolled normally. Using this ability is an immediate action, and the wearer must decide to use it before the critical hit or sneak attack damage is rolled. Construction",
      "requirements": "Forge Ring, stone fist , stoneskin ;",
      "cost": "6,000 gp"
    },
    "Ring of Chameleon Power": {
      "source": "Ultimate Equipment pg. 168 , PRPG Core Rulebook pg. 479",
      "aura": "faint illusion",
      "cl": "3rd",
      "slot": "ring;",
      "price": "12,700 gp;",
      "weight": "— Description As a free action, the wearer of this ring can gain the ability to magically blend in with her surroundings. This provides a +10 competence bonus on her Stealth checks. As a standard action, she can also use the spell disguise self as often as she wants. Construction",
      "requirements": "Forge Ring, disguise self , invisibility ;",
      "cost": "6,350 gp"
    },
    "Ring of Natural Attunement (Drake)": {
      "source": "Advanced Class Guide pg. 217",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "12,880 gp;",
      "weight": "— Description This coiling band is made of jade carved into the shape of a sea drake. If the wearer can cast summon nature's ally spells, the wearer adds forest drake B2 and shadow drake B4 to the 4th-level list of monsters he can summon with those spells, adds flame drake B2 to the 5th-level list, adds frost drake B2 to the 6th-level list, and adds desert drake B3 to the 9th-level list. Also, once per day on command the wearer can use this ring to summon a shadow drake, as if by the summon nature's ally IV spell. Construction",
      "requirements": "Forge Ring, greater magic fang , summon nature's ally IV ;",
      "cost": "6,440 gp"
    },
    "Ghost Battling Ring": {
      "source": "Inner Sea Gods pg. 258",
      "aura": "faint illusion, necromancy, and transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "13,000 gp;",
      "weight": "— Description This silver ring is engraved with a skull flanked by twin hourglasses. It functions as a ring of the grasping grave UE . In addition, the wearer can use ghostly disguise UM and haste each once per day. Construction",
      "requirements": "Forge Ring, ghostly disguise UM , haste , sculpt corpse APG ;",
      "cost": "6,500 gp"
    },
    "Ring of Resistance3": {
      "source": "Pathfinder #123: The Flooded Cathedral pg. 44",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp (+1), 6,000 gp (+2), 13,500 gp (+3), 24,000 gp (+4), 37,500 gp (+5);",
      "weight": "— Description Protective symbols adorn this magic ring. It functions as a cloak of resistance with an equivalent bonus. Construction",
      "requirements": "Forge Ring , resistance , creator's caster level must be at least three times the ring's bonus;",
      "cost": "750 gp (+1), 3,000 gp (+2), 6,750 gp (+3), 12,000 gp (+4), 17,750 gp (+5)"
    },
    "Ring of Spell Knowledgetype III": {
      "source": "Ultimate Equipment pg. 174",
      "aura": "moderate or strong (no school)",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,500 gp (type I), 6,000 gp (type II), 13,500 gp (type III), 24,000 gp (type IV);",
      "weight": "— Description This ring comes in four types: ring of spell knowledge I , ring of spell knowledge II , ring of spell knowledge III , and ring of spell knowledge IV . All of them are useful only to spontaneous arcane spellcasters. Through study, the wearer can gain the knowledge of a single spell in addition to those allotted by her class and level. A ring of spell knowledge I can hold 1st-level spells only, a ring of spell knowledge II 1st- or 2nd-level spells, a ring of spell knowledge III spells of 3rd level or lower, and a ring of spell knowledge IV up to 4th-level spells. A ring of spell knowledge is only a storage space; the wearer must still encounter a written, active, or cast version of the spell and succeed at a DC 20 Spellcraft check to teach the spell to the ring. Thereafter, the arcane spellcaster may cast the spell as though she knew the spell and it appeared on her class' spell list. Arcane spells that do not appear on the wearer's class list are treated as one level higher for all purposes (storage and casting). Construction",
      "requirements": "Forge Ring, creator must be able to cast spells of the spell level to be granted;",
      "cost": "750 gp (type I), 3,000 gp (type II), 6,750 gp (type III), 12,000 gp (type IV)"
    },
    "Ring of Rulership": {
      "source": "Villain Codex pg. 153",
      "aura": "strong enchantment",
      "cl": "12th",
      "slot": "ring;",
      "price": "14,000 gp;",
      "weight": "— Description This garish signet ring is worth 1,500 gp for its materials and workmanship alone. Like the user of a rod of rulership , the ring's wearer can command the fealty of creatures, but only if she is a member by blood of the family whose symbol is displayed on the ring and only if those creatures are citizens or vassals of the family's holdings (though it works on disaffected, disloyal, and even traitorous subjects). On command, the wearer can use the ring to target a single humanoid creature within 50 feet that meets those qualifications. This effect is automatically successful if the creature has an Intelligence of 9 or lower. A creature with a higher Intelligence must succeed a DC 14 Will save or obey the ring's wearer's commands as if she were its absolute sovereign; a successful save renders that creature immune to that ring's effects for 24 hours. This is a mind-affecting enchantment (compulsion) effect and counts as 3rd-level spell for the purpose of break enchantment . If the ring's wielder gives a command that is contrary to the nature of a ruled creature, that creature receives another saving throw to shake off the effect. Even if the ruled creature fails the saving throw and remains ruled, it can still refuse that particular command. The GM is the final arbiter of what constitutes a command that is contrary to the nature of a ruled creature, and for most creatures, if the ring's wearer coopts their every moment, the creature can attempt a save every day. A creature is ruled until one of the following happens: it shakes off the effect after being given a command against its nature, an outside source (such as break enchantment ) removes the compulsion, the wearer removes the ring of rulership , the wearer commands the ring to release the creature (a standard action that need not take place in the creature's presence), or another member of the ruler's family rules the creature using a different ring of rulership , whichever comes first. The power of the ring can rule no more than three creatures at a time; to rule a new creature, the ring's wearer must first release one of the three ruled creatures. Construction",
      "requirements": "Forge Ring, mass suggestion ;",
      "cost": "7,750 gp"
    },
    "Ring of the Sea Strider": {
      "source": "Ultimate Equipment pg. 176",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "14,000 gp;",
      "weight": "— Description This ring is made of a single piece of deep blue crystal. The ring grants its wearer a swim speed of 30 feet, as well as +8 racial bonus on swim checks for having a swim speed. Furthermore, once per day as a swift action, as long as the wearer is in contact with liquid, he can use dimension door as the spell, but its starting and ending points must be connected by a contagious mass of liquid. Construction",
      "requirements": "Forge Ring, dimension door , touch of the sea ;",
      "cost": "7,000 gp"
    },
    "Duxotar's Signet": {
      "source": "Pathfinder #108: Hell Comes to Westcrown pg. 38",
      "aura": "moderate abjuration and illusion",
      "cl": "6th",
      "slot": "ring;",
      "price": "14,500 gp;",
      "weight": "— Description This ornate ring of protection +2 is emblazoned with the winged Eye of Aroden in ruby and jet. The wearer of a duxotar's signet projects an air of commanding authority that affects large groups; the wearer does not treat crowds as difficult terrain and gains a +5 competence bonus on Diplomacy or Intimidate checks to direct or influence crowds ( Pathfinder RPG Core Rulebook 436–437). The wearer can also cast magic mouth at will, but the message trigger must be “upon seeing a creature wearing the Eye of Aroden” (which triggers the magic mouth for any dottari in uniform). Construction",
      "requirements": "Forge Ring, eagle's splendor , magic mouth , shield of faith ;",
      "cost": "7,750 gp"
    },
    "Ring of Delayed Doom3 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ophidian Coil": {
      "source": "Down the Blighted Path pg. 62",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description This small wooden ring resembles a serpent with tiny gemstone eyes coiling around the wearer's finger. If worn for 24 hours, it causes its wearer to manifest many serpentine traits. The wearer's skin develops a faint, diamond-shaped pattern, and the pupils of her eyes elongate. The wearer grows a pair of fangs, gaining a bite attack as a primary natural attack that deals 1d4 points of piercing damage for a Medium wearer or 1d3 points of damage for a Small wearer. Three times per day as a free action, the wearer of the ring may cause her fangs to drip with venom, making her bite attack poisonous for 1 round. The save DC of this poison is equal to 10 + 1/2 the wearer's Hit Dice + the wearer's Constitution modifier, but otherwise acts as black adder venom. If the wearer rolls a natural 1 on an attack with her poisonous bite, she is exposed to the poison. Once per day as a standard action, the wearer may command her tongue to lengthen and become forked for 1 minute, gaining the scent special ability. While this ability is active, the wearer has a 20% chance of failure when casting any spell with a verbal component, as the tongue makes it difficult to speak. The ring makes its wearer more sensitive to cold. She takes a –2 penalty to saves against spells with the cold descriptor and the effects of cold weather. Additionally, if the wearer is successfully affected by a spell with the cold descriptor, she is slowed for 1 round. Construction",
      "requirements": "Forge Ring, beast shape I , poison ;",
      "cost": "7,500 gp"
    },
    "Ring of Adept Maneuvers": {
      "source": "Inner Sea Combat pg. 62",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description This variant ring of ki mastery UE is made of a lock of hair held together by small bands to form a ring. The ring allows a wearer with a ki pool to store up to 2 ki points in the ring as a swift action. These points remain in the ring until used. The wearer can use the ki points normally, but gains the following benefits when ki points are stored in the ring. As long as at least 1 ki point is stored in the ring, the wearer gains a +2 bonus on combat maneuver checks to bull rush, disarm, or trip opponents. If at least 2 ki points are stored in the ring, the wearer takes only a –1 penalty on attack rolls when making a flurry of blows instead of a –2 penalty. Construction",
      "requirements": "Forge Ring, ki leech UM , the creator must have the ki pool class feature;",
      "cost": "7,500 gp"
    },
    "Ring of Resilience": {
      "source": "Advanced Class Guide pg. 218",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description This tarnished copper band sheds its patina when worn by anyone with panache or grit. Whenever the wearer regains a panache or grit point through her actions (not just a daily refresh), she can try to end a single ongoing condition affecting her, attempting a new saving throw against the original DC. The effect must be one that allowed a saving throw, can be removed by either dispel magic or heal , and be an effect against which the wearer failed her initial saving throw. If the wearer succeeds at the new save, the effect is removed even if succeeding at the save would normally have other consequences, and even if the effect normally requires multiple saves to remove. If the effect allowed more than one type of saving throw, use the type and DC for the first saving throw the wearer failed for the effect. The wearer can use the ring only once for each ongoing condition. As the wearer must regain a panache or grit point to reroll a save, the ring provides no benefit if she hasn't used any grit or panache. Construction",
      "requirements": "Forge Ring, restoration , creator must be a grit or panache user;",
      "cost": "7,500 gp"
    },
    "Ring of Retribution": {
      "source": "Ultimate Equipment pg. 173 , Advanced Player's Guide pg. 292",
      "aura": "strong evocation",
      "cl": "13th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description Once per day, the wearer of this charred bone ring may, as an immediate action, cause it to detonate in a 30-footradius burst that deals 10d6 points of fire damage (Reflex DC 14 half). If the wearer is killed by the detonation, all magical equipment he carries must also save or take fire damage, and all nonmagical equipment takes this damage with no saving throw. This explosion never destroys the ring. Construction",
      "requirements": "Forge Ring, Quicken Spell, fireball ;",
      "cost": "7,500 gp"
    },
    "Ring of the Cacodaemon": {
      "source": "Book of the Damned pg. 197",
      "aura": "moderate necromancy",
      "cl": "8th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description Sculpted into the intricate form of a golden cacodaemon, this ring features a decorative wide-open mouth and can hold a soul gem braced between its horns. The ring allows its wearer to tap into the residual memories of the mangled soul it contains. Once per day, the wearer can interrogate the soul in the gem, as per speak with dead , except the soul answers telepathically. Once per day, the bearer can project the soul's last tormented moments before it was consumed and bound, creating a cone of terror as per fear Construction",
      "requirements": "Craft Wondrous Item, fear, speak with dead ;",
      "cost": "7,500 gp"
    },
    "Ring of Water Walking": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description This ring is often made of coral or bluish metal decorated with motifs depicting rolling waves of water. The ring allows the wearer to continually utilize the effects of the spell water walk Construction",
      "requirements": "Forge Ring, water walk ;",
      "cost": "7,500 gp"
    },
    "Scavenger's Ring": {
      "source": "Magical Marketplace pg. 9",
      "aura": "moderate abjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "15,000 gp;",
      "weight": "— Description This polished iron band allows the wearer to walk along the ocean floor as easily as on dry land. The wearer of a scavenger's ring sinks to the bottom of any large body of water at a rate of 30 feet per round. Once on the body of water's floor, the wearer can move and act as though she were on land, allowing her to jump, roll, attack, and run as normal, although she cannot swim (nor can she control her ascent or descent underwater) as long as she wears the ring. As soon as the wearer removes the ring, she may swim as normal and is subject to all the normal penalties associated with underwater action. A scavenger's ring does not confer the ability to breathe while underwater. Construction",
      "requirements": "Forge Ring, freedom of movement ;",
      "cost": "7,500 gp"
    },
    "Ring of Revelationgreater": {
      "source": "Ultimate Equipment pg. 173 , Advanced Player's Guide pg. 293",
      "aura": "moderate varies",
      "cl": "11th",
      "slot": "ring;",
      "price": "10,000 gp (lesser), 16,000 gp (greater), 24,000 gp (superior);",
      "weight": "— Description A ring of revelation is a divine item attuned to a particular oracular mystery and containing a revelation associated with that mystery (see the oracle class description). While wearing the ring, an oracle has access to that revelation and may use it as if she had it as a normal class feature. The oracle must have the appropriate mystery to use the ring, and must meet the level requirements (if any) of the revelation itself; for example, a ring of revelation (combat healer) is only usable by an oracle of at least 7th level with the battle mystery. If the oracle already has that revelation and the revelation gives an ability with a limited number of uses per day, the oracle can use that ability one additional time per day. The ring has no effect if worn by a non-oracle, and Use Magic Device doesn't allow a character to gain a revelation from this ring. A lesser ring of revelation contains a revelation that has no level prerequisite or a prerequisite that is less than 6th level. A greater ring of revelation contains a revelation that requires the oracle to be 7th level or higher. A superior ring of revelation contains a revelation that requires the oracle to be 11th level or higher. Construction",
      "requirements": "Forge Ring, creator must be an oracle with the desired revelation;",
      "cost": "5,000 gp (lesser), 8,000 gp (greater), 12,000 gp (superior)"
    },
    "Heavenly Aegis Ring": {
      "source": "Horror Adventures pg. 216",
      "aura": "moderate evocation [good]",
      "cl": "10th",
      "slot": "ring;",
      "price": "16,000 gp;",
      "weight": "— Description The surface of this silver ring never tarnishes, but when an evil creature is wearing it, its luster diminishes. Whenever the wearer takes the total defense action, he can activate the ring, creating a magic circle against evil effect centered on him. This effect lasts 10 rounds per day, though the rounds don't need to be spent consecutively. Once activated, the effect expends rounds until the user ends it as a move action or the rounds run out. s a standard action while the magic circle is active, the wearer can release the protective circle's energy as a violent blast. This functions as holy smite centered on the wearer, but the wearer can exclude a 10-foot-radius area from the center of the affected area. Releasing the energy expends all the ring's remaining rounds and can be done only if at least 5 rounds remain. The ring's power renews each day at dawn. Construction",
      "requirements": "Forge Ring, holy smite, magic circle against evil ;",
      "cost": "8,000 gp"
    },
    "Dungeon Ringjailer's": {
      "source": "Ultimate Equipment pg. 166 , Advanced Player's Guide pg. 292",
      "aura": "moderate divination",
      "cl": "8th",
      "slot": "ring;",
      "price": "250 gp (prisoner's), 16,000 gp (jailer's);",
      "weight": "— Description A jailer's dungeon ring is worked gold, set with carnelians. The ring is magically attuned to one or more iron prisoner's dungeon rings . When the wearer of a jailer's ring places a prisoner's ring on a subject, the prisoner cannot remove the ring without the use of a remove curse , limited wish , miracle , or wish spell. The wearer of the jailer's ring can also remove a linked prisoner's ring at any time. The jailer is aware of any wearer of a linked prisoner's ring as per a constant status spell. Additionally, all wearers of linked prisoner's rings count as familiar to the jailer for the purposes of spells such as scrying and teleport Construction",
      "requirements": "Forge Ring, scrying , status ;",
      "cost": "125 gp (prisoner's), 8,000 gp (jailer's)"
    },
    "Ring of Perfect Sizing": {
      "source": "Giant Hunter's Handbook pg. 33",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "ring;",
      "price": "16,000 gp;",
      "weight": "— Description This lustrous gold ring is highly malleable and always fits perfectly. After being worn for 24 hours, the ring allows the wearer to resize one weapon or suit of armor to her size. The ring can affect any item that is no more than two size categories too big or too small and that weighs no more than 125 pounds. The size change lasts until 1 round after the item leaves the wearer's possession. A new item can be resized after it has been in the wearer's possession for 24 hours, causing the previously resized item to return to its normal size. The resizing otherwise functions as the resize item spell. Construction",
      "requirements": "Forge Ring, resize item ;",
      "cost": "8,000 gp"
    },
    "Sigil of Kraggodan": {
      "source": "Pathfinder #118: Siege of Stone pg. 41",
      "aura": "moderate abjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "16,000 gp;",
      "weight": "— Description This adamantine band is capped with a stone sigil of the first clan to settle the Sky Citadel of Kraggodan. This ring is keyed to interact with several devices and traps within the vaults—storehouses of ancient history and family wealth—of the Sky Citadel. The ring grants its wearer acid resistance 10. Three times per day as a swift action, the wearer can make himself undetectable by crafted and magical traps and creatures of the construct type for the following minute. This functions like greater invisibility within these limits and also prevents the character's weight or presence from triggering traps. Construction",
      "requirements": "Forge Ring, resist energy , sanctuary ;",
      "cost": "8,000 gp"
    },
    "Ring of Entropy and Order": {
      "source": "Planar Adventures pg. 49",
      "aura": "moderate abjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "16,200 gp;",
      "weight": "— Description This gold ring resembles tiny angel wings folded around a clear crystal. Once per day, the wearer can target herself with a protection from chaos or protection from law effect that lasts for 10 minutes. However, if the wearer uses the ring of entropy and order to gain protection from chaos while on a plane with the mildly chaos-aligned or strongly chaos-aligned trait, or to gain protection from law while on a plane with the mildly law-aligned or strongly law-aligned trait, the effect instead lasts for 1 hour. If the wearer fails a saving throw against a charm or compulsion effect while on a plane with the mildly chaos-aligned, mildly law-aligned, strongly chaos-aligned, or strongly law-aligned traits, she can activate the effect as an immediate action. Construction",
      "requirements": "Forge Ring, contingency , protection from chaos , protection from law ;",
      "cost": "8,100 gp"
    },
    "Ring of the Godless2": {
      "source": "People of the Sands pg. 29",
      "aura": "faint abjuration and divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp (+1), 17,000 gp (+2), 27,000 gp (+3), 38,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description These rings are said to have first been forged in Rahadoum by the Council of Elders to help root out the hidden faithful and other practitioners of the divine. A ring of the godless grants a luck bonus on saving throws against divine spells. This bonus does not apply to spell-like or supernatural abilities unless they are class abilities of a divine spellcasting class, such as channel energy or domain powers, or unless they are used by a creature that has been called, created, or summoned by divine magic. The wearer's spell resistance (if any) increases by an amount equal to the ring's luck bonus, though this increase applies only against divine spells (and spell-like abilities as described above). A ring of the godless also allows the wearer to use detect magic at will, though it detects only divine magic. In addition, the wearer can use a specialized form of arcane sight a number of times per day equal to the ring's luck bonus. This ability can be activated as a swift action, its effect lasts until the end of the wearer's turn, and it detects only divine magic or divine spellcasting ability. Construction",
      "requirements": "Forge Ring, arcane sight , detect magic , spell resistance , creator cannot be a divine spellcaster, creator must be of a level at least three times higher than the bonus of the ring;",
      "cost": "4,000 gp (+1), 8,500 gp (+2), 13,500 gp (+3), 19,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Protection3": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description This ring offers continual magical protection in the form of a deflection bonus of +1 to +5 to AC. Construction",
      "requirements": "Forge Ring, shield of faith , caster must be of a level at least three times higher than the bonus of the ring;",
      "cost": "1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Inner Fortitudeminor": {
      "source": "Ultimate Equipment pg. 171",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "18,000 gp (minor), 42,000 gp (major), 66,000 gp (greater);",
      "weight": "— Description Alternating diamonds and rubies stud this band of white gold. A minor ring of fortitude reduces ability damage or temporary ability penalties the wearer takes by 2 points and ability drain by 1 point. If an effect targets multiple ability scores (for example, exhaustion, fatigue, or touch of idiocy ), the ring reduces the damage, drain, or penalty for all ability scores. A major ring of inner fortitude reduces ability damage or temporary penalties by 4 points and reduces ability drain by 2 points. A greater ring of inner fortitude reduces ability damage or temporary penalties by 6 points and reduces ability drain by 3 points. Wearing a ring of inner fortitude ring does not make the wearer immune to conditions such as fatigued or exhausted even if the wearer ignores all ability damage, drain, or penalties from the condition. If the ring prevents any damage, drain, or penalty that are associated with a beneficial effect, it also negates the beneficial effect. Construction",
      "requirements": "Forge Ring, restoration ;",
      "cost": "9,000 gp (minor), 21,000 gp (major), 33,000 gp (greater)"
    },
    "Ring of Spell Storing (minor)": {
      "source": "Ultimate Equipment pg. 174 , PRPG Core Rulebook pg. 479",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "ring;",
      "price": "18,000 gp;",
      "weight": "— Description As the ring of spell storing , except it holds up to 3 levels of spells. Construction",
      "requirements": "Forge Ring, imbue with spell ability ;",
      "cost": "9,000 gp"
    },
    "Ring of Stony Flesh": {
      "source": "Pathfinder #83: The Slave Trenches of Hakotep pg. 63",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "18,000 gp;",
      "weight": "— Description A ring of stony flesh gives the wearer's skin the appearance of flexible stone. Once per day, the wearer can expend a charge as a standard action to gain the benefits of stoneskin . While under this effect, the wearer gains the earth glide ability, allowing her to move through unworked stone or earth as easily as a fish swims through water. The wearer cannot move through stone composed of multiple blocks—such as the walls of a tomb or castle—with this ability, only through solid masses of stone. In addition, a ring of stony flesh automatically nullifies any petrification effect that targets the wearer by expending 2 charges, provided the ring has at least 2 charges remaining. The ring's protection effect activates before the wearer attempts a saving throw against the petrification attempt. A ring of stony flesh has 10 charges when created. Construction",
      "requirements": "Forge Ring, stone to flesh , stoneskin ;",
      "cost": "9,000 gp"
    },
    "Ring of the Clean Hands": {
      "source": "Magic of Thassilon (Web Enhancement) pg. 4",
      "aura": "strong transmutation",
      "cl": "9th",
      "price": "18,000 gp;",
      "weight": "— Description This delicate ring of forged bronze is formed into the shape of two hands, which do not quite touch as they meet at the top of the wearer's finger. A ring of the clean hands grants use of telekinesis as a standard action and has 10 charges. These charges return at the start of the next day. The ring's charges can be expended to create the following effects: Combat maneuver : This effect costs 3 charges for each round it is active, but otherwise functions as described by the spell telekinesis . The force created by this effect has a +9 base attack bonus, and is considered to have Strength 20 and Dexterity 20. Force lash : This effect costs 3 charges, striking out as if with an invisible whip. One target within 60 feet must make a DC 17 Will save or be struck for 4d6 points of nonlethal damage. This attack does not affect targets with a +3 or higher natural armor bonus, or a +1 or higher armor bonus. Sustained force : This effect costs 1 charge for each round it is active, but otherwise functions as described by the spell telekinesis , making it capable of lifting 225 lbs. Violent thrust : This effect costs 5 charges, but otherwise functions as described by the spell telekinesis , allowing you to throw up to 9 creatures or objects up to 90 feet, with a total weight of 225 lbs. The attack roll has a +9 modifier. The Will save is DC 17. Construction",
      "requirements": "Forge Ring, telekinesis ;",
      "cost": "9,000 gp, 720 XP"
    },
    "Rings of Bondage": {
      "source": "Ultimate Intrigue pg. 242",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "ring;",
      "price": "18,200 gp;",
      "weight": "— Description These rings are forged in pairs, establishing a mental connection between the two creatures wearing them, designating one as the master and the other as the servant. The listed price and cost are for both rings. Creatures wearing rings of bondage can understand one another's speech. The wearer of the master ring gains a +6 competence bonus on Sense Motive checks against the servant and is continuously aware of the location and general condition of the wearer of the servant ring, as the status spell. In addition, once per day, the wearer of the master ring of bondage can impose her will upon the wearer of the servant ring, compelling the servant to perform or refrain from an action as if subjected to a lesser geas (Will DC 16 negates). Alternatively, this effect can be executed as a contract between the wearers: as long as the wearer of the master ring is a valid target for lesser geas , she can accept a lesser geas dictated by the wearer of the servant ring. In such an event, neither wearer is entitled to a saving throw and both are compelled by the lesser geas to fulfill the terms of the agreement. If the wearer of the servant ring is unwilling to agree to such a contract, she can always select a lesser geas such as “remove the lesser geas from me.” As long as a lesser geas imposed by a ring of bondage remains in effect, neither ring can be removed. If either ring is destroyed, the effects of the lesser geas remain in place, but the surviving ring can't create a new lesser geas until the missing ring is repaired or replaced. If a mutual lesser geas is accepted and one lesser geas is ended, both lesser geas effects end simultaneously. A target can have a ring of bondage forcibly placed on its finger, but only if that creature is helpless. Construction",
      "requirements": "Forge Ring, detect thoughts, lesser geas, sanctuary, share language APG , status ;",
      "cost": "9,100 gp"
    },
    "Ring of Energy Shroud": {
      "source": "Ultimate Equipment pg. 170",
      "aura": "strong abjuration",
      "cl": "13th",
      "slot": "ring;",
      "price": "19,500 gp;",
      "weight": "— Description A ring of energy shroud always appears to be glass or crystal in construction, tinted in a red, green, blue, or yellow hue. Closer inspection reveals a small band of metal within the glass or crystal. Treasured by frontline fighters and anyone with a trusted evoker ally, rings of energy shroud normally function as a minor ring of energy resistance . However, once per day as an immediate action, the ring's wearer can negate the damage of an incoming acid, cold, electricity, or fire energy effect for himself (but not for other creatures affected by the spell or effect), transforming that damage into a shroud of energy that wreathes the wearer's body acting as if under the effects of the elemental aura spell ( Advanced Player's Guide ). The elemental aura effect has the same energy type of the damage negated. Construction",
      "requirements": "Forge Ring, elemental aura , resist energy ;",
      "cost": "9,750 gp"
    },
    "Ring of Delayed Doom4 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Nethysian Ring of Minor Spell Storing": {
      "source": "Inner Sea Gods pg. 259",
      "aura": "moderate abjuration and transmutation [chaotic, evil, good, lawful]",
      "cl": "5th",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description This ring is made of several metals hammered together into a mottled pattern, with Nethys's holy symbol stamped on one end. It functions as a ring of minor spell storing , except domain spells from Nethys's domains (see page 100) count as 1 spell level lower (minimum 1st level) for the purpose of storing them in the ring. Construction",
      "requirements": "Forge Ring, imbue with spell ability ;",
      "cost": "10,000 gp"
    },
    "Ring of Arcane Mastery": {
      "source": "Ultimate Equipment pg. 167",
      "aura": "strong abjuration and evocation",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description This ring is a thin but sturdy piece of forged steel crafted to resemble a serpent swallowing its tail, and is magically imbued to reveal the secrets of arcane mastery to its wearer. The ring allows a wearer with an arcane pool to store up to 4 points from his arcane pool in the ring as a swift action. These points remain in the ring until used. A wearer can spend arcane pool points stored in the ring as if they were his own, or can spend them in each of the following ways. As a free action, the wearer can expend 1 arcane pool point stored in the ring to gain a +2 bonus on Concentration checks for 1 round. As a standard action, the wearer can expend 1 arcane pool point stored in the ring to use the pool strike magus arcana ( Ultimate Magic  12) using his own magus level to determine the effect. As an immediate action, the wearer can expend up to 4 arcane pool points stored in the ring to use the reflection magus arcana ( Ultimate Magic  12). Construction",
      "requirements": "Forge Ring, imbue with spell ability , spell turning ;",
      "cost": "10,000 gp"
    },
    "Ring of Invisibility": {
      "source": "Ultimate Equipment pg. 171 , PRPG Core Rulebook pg. 479",
      "aura": "faint illusion",
      "cl": "3rd",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description By activating this simple silver ring, the wearer can benefit from invisibility , as the spell. Construction",
      "requirements": "Forge Ring, invisibility ;",
      "cost": "10,000 gp"
    },
    "Ring of Phrenic Prowess": {
      "source": "Psychic Anthology pg. 8",
      "aura": "moderate abjuration and divination",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description This ring is made of rough iron and is set with four amethysts. It allows a wearer with a phrenic pool to store up to 4 points from her phrenic pool in the ring as a swift action. These points remain in the ring until used. A wearer can spend points stored in the ring as if they were in her phrenic pool, in addition to the following uses. As a free action, the wearer can expend 1 point stored in the ring to gain a +2 bonus on concentration checks for 1 round. As a standard action, the wearer can expend 1 point stored in the ring to attempt to flood a target with raw psychic power. The wearer makes a melee touch attack charged with psychic energy. If the touch attack hits, it deals 3d6 points of nonlethal damage and the target is stunned for 1 round. If the attack misses, the charge dissipates. As an immediate action, the wearer can expend up to 4 points stored in the ring to gain the benefit of spell turning for 1 round. The number of spell levels she can turn is equal to the number of points expended. Construction",
      "requirements": "Forge Ring, spell turning, telepathic bond ;",
      "cost": "10,000 gp"
    },
    "Ring of Plagues": {
      "source": "Champions of Corruption pg. 31",
      "aura": "moderate necromancy",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description This silver ring is set with a black opal. Once per day, when the wearer is reduced to half or fewer of her maximum hit point total, whoever dealt the activating blow to the wearer is immediately subjected to a major curse UM with unlimited range. A successful DC 19 Will saving throw is needed to negate the spell. Rather than one of the listed curse effects, the curse imposes a –4 penalty on the victim's saving throws and causes the victim to contract a disease chosen by the wearer from the contagion list without a save. The cursed disease has no onset time, but the attacker is allowed the normal saving throw to avoid its effects. It can be cured only by successfully casting both remove curse and remove disease within 1 minute of each other. Those exposed to the cursed attacker thereafter must save against the mundane version of the disease or become infected (though they are not cursed). Once per day, if the wearer is killed or reduced to negative hit points, a plague of curses is unleashed. The attacker and the attacker's five nearest allies or immediate blood relatives become the targets of the curse described above. If the wearer is restored to at least 1 hit point, these curses end, allowing surviving victims to recover naturally. Construction",
      "requirements": "Forge Ring, contagion , major curse UM , spite APG ;",
      "cost": "10,000 gp"
    },
    "Ring of Terrible Cost": {
      "source": "Cheliax, Empire of Devils pg. 21",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "20,000 gp;",
      "weight": "— Description These rings once displayed the smiling face of King Gaspodar, and were forged in limited quantities to celebrate the end of his reign. After Aroden's death, the rings were cast aside or lost. Recently, several resurfaced, but changed by unknown means— Gaspodar's face now bears a sorrowful expression, and flames loom behind him. As a standard action, you may charge the ring with a +1 profane bonus by sacrificing 2 of your hit points. These hit points remain lost and cannot be healed by any means until the ring's power is expended. You may do this multiple times, up to a maximum of a +5 profane bonus stored in the ring. As an immediate action, you can add the stored profane bonus to any single attack roll, damage roll, skill check, or saving throw, which expends the charged energy from the ring. You must declare this use after rolling the die but before you learn the result of the roll. You must expend all the ring's power at once. Once the charge is expended, you can heal your lost hit points normally. Expending this charge does not ruin the ring, and you may charge it again by sacrificing more hit points. The charge in the ring can come from multiple donors, but none of the donors can regain their sacrificed hit points until the ring's charge is spent or the ring is destroyed. For this reason, owners of a ring of terrible cost guard the item carefully. Construction",
      "requirements": "Forge Ring, aid , resistance , vampiric touch ;",
      "cost": "10,000 gp"
    },
    "Ring of Wizardrytype I": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (type I), 40,000 gp (type II), 70,000 gp (type III), 100,000 gp (type IV);",
      "weight": "— Description This special ring comes in four varieties, all of them useful only to arcane spellcasters. The wearer's arcane spells per day are doubled for one specific spell level. A ring of wizardry I doubles 1stlevel spells, a ring of wizardry II doubles 2nd-level spells, a ring of wizardry III doubles 3rd-level spells, and a ring of wizardry IV doubles 4th-level spells. Bonus spells from high ability scores or school specialization are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (type I), 20,000 gp (type II), 35,000 gp (type III), 50,000 gp (type IV)"
    },
    "Ring of MysticismType I": {
      "source": "Psychic Anthology pg. 8",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (Type I), 40,000 gp (Type II), 70,000 gp (Type III), 100,000 gp (Type IV);",
      "weight": "— Description This ring of bone fused with crystal comes in four varieties, all of them useful only to psychic spellcasters. The wearer's number of psychic spells per day is doubled for one specific spell level. A ring of mysticism I doubles 1st-level spells, a ring of mysticism II doubles 2nd-level spells, a ring of mysticism III doubles 3rd-level spells, and a ring of mysticism IV doubles 4th-level spells. Bonus spells from high ability scores are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (Type I), 20,000 gp (Type II), 35,000 gp (Type III), 50,000 gp (Type IV)"
    },
    "Ring of Resistance4": {
      "source": "Pathfinder #123: The Flooded Cathedral pg. 44",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp (+1), 6,000 gp (+2), 13,500 gp (+3), 24,000 gp (+4), 37,500 gp (+5);",
      "weight": "— Description Protective symbols adorn this magic ring. It functions as a cloak of resistance with an equivalent bonus. Construction",
      "requirements": "Forge Ring , resistance , creator's caster level must be at least three times the ring's bonus;",
      "cost": "750 gp (+1), 3,000 gp (+2), 6,750 gp (+3), 12,000 gp (+4), 17,750 gp (+5)"
    },
    "Ring of Revelationsuperior": {
      "source": "Ultimate Equipment pg. 173 , Advanced Player's Guide pg. 293",
      "aura": "moderate varies",
      "cl": "11th",
      "slot": "ring;",
      "price": "10,000 gp (lesser), 16,000 gp (greater), 24,000 gp (superior);",
      "weight": "— Description A ring of revelation is a divine item attuned to a particular oracular mystery and containing a revelation associated with that mystery (see the oracle class description). While wearing the ring, an oracle has access to that revelation and may use it as if she had it as a normal class feature. The oracle must have the appropriate mystery to use the ring, and must meet the level requirements (if any) of the revelation itself; for example, a ring of revelation (combat healer) is only usable by an oracle of at least 7th level with the battle mystery. If the oracle already has that revelation and the revelation gives an ability with a limited number of uses per day, the oracle can use that ability one additional time per day. The ring has no effect if worn by a non-oracle, and Use Magic Device doesn't allow a character to gain a revelation from this ring. A lesser ring of revelation contains a revelation that has no level prerequisite or a prerequisite that is less than 6th level. A greater ring of revelation contains a revelation that requires the oracle to be 7th level or higher. A superior ring of revelation contains a revelation that requires the oracle to be 11th level or higher. Construction",
      "requirements": "Forge Ring, creator must be an oracle with the desired revelation;",
      "cost": "5,000 gp (lesser), 8,000 gp (greater), 12,000 gp (superior)"
    },
    "Ring of Spell Knowledgetype IV": {
      "source": "Ultimate Equipment pg. 174",
      "aura": "moderate or strong (no school)",
      "cl": "7th",
      "slot": "ring;",
      "price": "1,500 gp (type I), 6,000 gp (type II), 13,500 gp (type III), 24,000 gp (type IV);",
      "weight": "— Description This ring comes in four types: ring of spell knowledge I , ring of spell knowledge II , ring of spell knowledge III , and ring of spell knowledge IV . All of them are useful only to spontaneous arcane spellcasters. Through study, the wearer can gain the knowledge of a single spell in addition to those allotted by her class and level. A ring of spell knowledge I can hold 1st-level spells only, a ring of spell knowledge II 1st- or 2nd-level spells, a ring of spell knowledge III spells of 3rd level or lower, and a ring of spell knowledge IV up to 4th-level spells. A ring of spell knowledge is only a storage space; the wearer must still encounter a written, active, or cast version of the spell and succeed at a DC 20 Spellcraft check to teach the spell to the ring. Thereafter, the arcane spellcaster may cast the spell as though she knew the spell and it appeared on her class' spell list. Arcane spells that do not appear on the wearer's class list are treated as one level higher for all purposes (storage and casting). Construction",
      "requirements": "Forge Ring, creator must be able to cast spells of the spell level to be granted;",
      "cost": "750 gp (type I), 3,000 gp (type II), 6,750 gp (type III), 12,000 gp (type IV)"
    },
    "Ring of Delayed Doom5 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ring of Evasion": {
      "source": "Ultimate Equipment pg. 170 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "25,000 gp;",
      "weight": "— Description This ring continually grants the wearer the ability to avoid damage as if she had evasion. Whenever she makes a Reflex saving throw to determine whether she takes half damage, a successful save results in no damage. Construction",
      "requirements": "Forge Ring, jump ;",
      "cost": "12,500 gp"
    },
    "Ring of X-Ray Vision": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate divination",
      "cl": "6th",
      "slot": "ring;",
      "price": "25,000 gp;",
      "weight": "— Description On command, this ring gives its wearer the ability to see into and through solid matter. Vision range is 20 feet, with the viewer seeing as if he were looking at something in normal light even if there is no illumination. X-ray vision can penetrate 1 foot of stone, 1 inch of common metal, or up to 3 feet of wood or dirt. Thicker substances or a thin sheet of lead blocks the vision. Using the ring is exhausting, causing the wearer 1 point of Constitution damage per minute after the first 10 minutes of use in a single day. The ring must be used in 1-minute increments. Construction",
      "requirements": "Forge Ring, true seeing ;",
      "cost": "12,500 gp"
    },
    "Witness Hunter's Ring": {
      "source": "Inner Sea Intrigue pg. 56",
      "aura": "moderate divination",
      "cl": "7th",
      "slot": "ring;",
      "price": "25,200 gp;",
      "weight": "— Description This ring's deep red stone hides the image of an eye within an eye or the symbol of a secret society, since many secret societies create these rings to protect their most important agents and leaders. By concentrating on the ring as a move action, the wearer learns whether he is being observed and whether it is by one or by more than one creature. Once per day, the wearer can use locate creature on command to target creatures that are currently observing him. In addition, the wearer can cast detect scrying once per day on command. Construction",
      "requirements": "Forge Ring, detect scrying, locate creature ;",
      "cost": "12,600 gp"
    },
    "Swarmwalker's Ring": {
      "source": "Ultimate Intrigue pg. 242",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "26,000 gp;",
      "weight": "— Description This shining, ash-white ring of bone is crafted to look like countless interlocking rat fangs, set with a dozen dark, garnet eyes like those of albino sewer-hunters. The wearer of this ring can utter a command word to call forth 1d3 rat swarms within 40 feet. These swarms each act immediately and vanish after 7 rounds. They are independent and not under the wearer's control, though the wearer is immune to the effects and attacks of any swarm created through use of this ring. Alternatively, upon command, the ring's wearer can use dimension door . This magical transportation must begin and end in a square that includes a swarm summoned by use of this ring. This ring's abilities can be used a total of three times per day, in any combination. An urban druid ( Pathfinder RPG Advanced Player's Guide 101 ) wearing this ring can gain one additional use per day by expending three daily uses of her wild shape ability. Construction",
      "requirements": "Forge Ring, dimension door, summon swarm ;",
      "cost": "13,000 gp"
    },
    "The Bloodflame Ring": {
      "source": "Clash of the Kingslayers pg. 29",
      "aura": "strong transmutation",
      "cl": "15th",
      "slot": "ring;",
      "price": "26,000 gp;",
      "weight": "— Description This beautiful adamantine ring is warm to the touch. Artful pictures etched inside it tell the tale of its creation; the imagery claims that this ring was one of the first items crafted by employing heat to coerce metal into shape. When worn, it transforms your blood into pure molten iron, which does not harm you, and provides certain benefits: you gain the fire subtype. Any creature striking you with its body or a handheld weapon deals normal damage, but at the same time the attacker takes 1d6 points of fire damage. Creatures that drain blood (such as stirges and vampires) take the standard fire damage for attacking you and you do not suffer any effects of their blood drain special ability. you count as a ferrous creature for the purpose of rusting grasp and similar effects. Construction",
      "requirements": "Forge Ring, fire shield , iron body ;",
      "cost": "13,000 gp, 1,040 XP"
    },
    "Ring of the Godless3": {
      "source": "People of the Sands pg. 29",
      "aura": "faint abjuration and divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp (+1), 17,000 gp (+2), 27,000 gp (+3), 38,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description These rings are said to have first been forged in Rahadoum by the Council of Elders to help root out the hidden faithful and other practitioners of the divine. A ring of the godless grants a luck bonus on saving throws against divine spells. This bonus does not apply to spell-like or supernatural abilities unless they are class abilities of a divine spellcasting class, such as channel energy or domain powers, or unless they are used by a creature that has been called, created, or summoned by divine magic. The wearer's spell resistance (if any) increases by an amount equal to the ring's luck bonus, though this increase applies only against divine spells (and spell-like abilities as described above). A ring of the godless also allows the wearer to use detect magic at will, though it detects only divine magic. In addition, the wearer can use a specialized form of arcane sight a number of times per day equal to the ring's luck bonus. This ability can be activated as a swift action, its effect lasts until the end of the wearer's turn, and it detects only divine magic or divine spellcasting ability. Construction",
      "requirements": "Forge Ring, arcane sight , detect magic , spell resistance , creator cannot be a divine spellcaster, creator must be of a level at least three times higher than the bonus of the ring;",
      "cost": "4,000 gp (+1), 8,500 gp (+2), 13,500 gp (+3), 19,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Blinking": {
      "source": "Ultimate Equipment pg. 168 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "27,000 gp;",
      "weight": "— Description On command, this ring makes the wearer blink, as the blink spell. Construction",
      "requirements": "Forge Ring, blink ;",
      "cost": "13,500 gp"
    },
    "Ring of Energy Resistancemajor": {
      "source": "Ultimate Equipment pg. 170 , PRPG Core Rulebook pg. 479",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "12,000 gp (minor), 28,000 gp (major), 44,000 gp (greater);",
      "weight": "— Description Rings of this type come in a wide variety of designs and colorations, typically related to the types of energy they defend against. These rings continually protect their wearers from damage from one type of energy—acid, cold, electricity, fire, or sonic (chosen by the creator of the item; determine randomly if found as part of a treasure hoard). Each time the wearer would normally take such damage, subtract the ring's resistance value from the damage dealt. A minor ring of energy resistance grants 10 points of resistance. A major ring of energy resistance grants 20 points of resistance. A greater ring of energy resistance grants 30 points of resistance. Construction",
      "requirements": "Forge Ring, resist energy ;",
      "cost": "6,000 gp (minor), 14,000 gp (major), 22,000 gp (greater)"
    },
    "Ring of the Ecclesiarch": {
      "source": "Ultimate Equipment pg. 175",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "ring;",
      "price": "28,500 gp;",
      "weight": "— Description This ornate ring of sanctified silver is engraved with a golden signet that incorporates the holy symbol of the wearer's deity after being worn for 24 hours. The ring can be used to seal parchments or to mark any surface as the arcane mark spell at will. The wearer is marked as a scholarly leader of the faith and gains a +5 competence bonus on Diplomacy and Knowledge (religion) checks. If the wearer has the Leadership feat, she may attract double the normal number of followers, and her followers' zealous devotion grants them a +4 morale bonus on Will saves against enchantment spells and effects. Once per day, the wearer of the ring can use prayer and enter image ( Advanced Player's Guide ), often using the latter power to speak and observe through portraits, statues, and even minted coinage bearing their likeness. Construction",
      "requirements": "Forge Ring, arcane mark , enter image , enthrall , prayer , creator must have 5 ranks of Diplomacy and Knowledge (religion) and the ability to cast divine spells;",
      "cost": "14,250 gp"
    },
    "Ring of Delayed Doom6 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Elemental Ring": {
      "source": "Cohorts and Companions pg. 11",
      "aura": "strong conjuration",
      "cl": "15th",
      "slot": "ring;",
      "price": "30,000 gp;",
      "weight": "1 lb. Description This ornate ring has a thick iron band covered in sigils of calling, and is set with a large glowing gemstone that appears to be an elemental gem . The ring serves as a gateway for a specific elder elemental (25% chance each for air, earth, fire, or water) that performs a narrow range of services when called. When activated with a command word, the elemental is called (as by greater planar ally ) and demands to know what service it is to perform. It can only be commanded to protect a specific creature or object, attack a specific creature, damage a specific object, or answer questions about its home plane. The wearer of the ring is able to communicate with the elder elemental as if they shared a common language. The elder elemental serves for no more than 24 hours, after which it returns to its home plane and the ring become a valueless hunk of lead. Construction",
      "requirements": "Forge Ring, planar ally , planar binding ;",
      "cost": "15,000 gp"
    },
    "Planefarer's Band": {
      "source": "Planes of Power pg. 9",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "ring;",
      "price": "30,000 gp;",
      "weight": "— Description Once per day, the wearer of this ring can attune it to one of the four Elemental Planes for 24 hours. While on that plane, the ring grants the wearer the corresponding benefits below. Once per day on command, the wearer can gain these benefits even when on a different plane, but the effects last only 10 minutes.",
      "plane of air": ": The wearer gains a fly speed of 20 feet (average) and gains a +4 insight bonus on Wisdom checks to change the direction of gravity in an area with the subjective gravity planar trait.",
      "plane of earth": ": The wearer gains darkvision with a range of 60 feet, and she can walk across rock, metal, and other earthen surfaces as if under the effects of spider climb",
      "plane of fire": ": The wearer gains fire resistance 20 and is able to walk atop lava, bubbling tar, and other dangerously hot surfaces as if under the effects of water walk",
      "plane of water": ": The wearer can breathe underwater and gains a swim speed of 40 feet. Construction",
      "requirements": "Forge Ring, planar adaptation APG ;",
      "cost": "15,000 gp"
    },
    "Ring of Transcendent Spells": {
      "source": "Mythic Adventures pg. 156",
      "aura": "strong universal",
      "cl": "13th",
      "slot": "ring;",
      "price": "30,000 gp;",
      "weight": "— Description This jade ring is carved in the shape of an ouroboros. Three times per day, the wearer can use it to empower a spell she casts. This grants her a +2 bonus on caster level checks to overcome spell resistance, and increases the save DC of the spell (if any) by 2. While enhancing a spell this way, the caster can expend one use of mythic power plus an additional use per two spell levels (minimum two uses), to instead cast the mythic version of her spell (though not an augmented version of the mythic spell) as if she knew the mythic version of that spell. This has no effect if the spell doesn't have a mythic version. The save DC increase for being a potent mythic spell (see page 80) stacks with the save DC increase granted by using the ring's power. For example, if the wearer enhances fireball with this ring, she can expend two uses of mythic power to cast mythic fireball instead (one use plus one use for a 3rd-level spell). Construction",
      "requirements": "Forge Ring, Mythic Crafter, limited wish , mnemonic enhancer ;",
      "cost": "15,000 gp"
    },
    "Rings of Alien Geometries": {
      "source": "Horror Adventures pg. 216",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "30,000 gp;",
      "weight": "— Description A short silver chain joins these two crystal rings together. When worn on two adjacent fingers of the same hand, the two rings occupy a single ring slot. Once per day as a standard action, the wearer of a pair of rings of alien geometries can create two shimmering portals, each 5 feet in diameter and surrounded by a 4-inch-thick ring of force. Only one side of each portal functions as a gateway; the other side is blocked (as if by a wall of force ). Each portal must be oriented vertically and be within 30 feet of the wearer at the time of creation. Medium or smaller creatures can move through either portal as easily as moving to an adjacent square, stepping out of the other portal. Large creatures can squeeze through but can't end movement halfway through a portal. Any creature farther than 5 feet away from a portal has no line of sight or line of effect through it to the other portal, but a creature adjacent to one of the portals can attack through it as though the square directly in front of the other portal were adjacent to the creature. Both of the portals vanish after 10 rounds. Destroying a portal is possible only with spells or attacks that can destroy a wall of force . Destroying one portal causes the other portal to immediately collapse. Construction",
      "requirements": "Forge Ring, dimension door, wall of force ;",
      "cost": "15,000 gp"
    },
    "Ring of Resumption": {
      "source": "Healer's Handbook pg. 30",
      "aura": "moderate conjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "30,800 gp;",
      "weight": "— Description This adamantine ring contains a moving, notched golden circle that whirs with healing energy when activated. Once per day when the wearer takes hit point damage by any means, she can activate the ring as an immediate action. This immediately allows a living wearer to regain 5 hit points per round and recover from an equal amount of nonlethal damage. The wearer regenerates a total number of hit points equal only to the damage taken when the ring was activated, and only a single attack (or another single instance) can activate the ring. If the wearer sustains damage from multiple sources simultaneously, she must pick which source activates the ring. When either all of this damage is healed or the wearer's hit points reach her hit point maximum (whichever comes first), the hit point regeneration ceases. In addition, the wearer is immune to bleed damage while the ring's regeneration is active. If the wearer lost a limb, an organ, or any other body part as a result of the effect she used to activate the ring, the ring regenerates it as per regenerate . As with the spell, if the severed members are not present and touching the creature, this regenerate effect takes 2d10 rounds (this may cause the regenerate effect affecting a lost limb or organ to last longer than the hit point regeneration). Construction",
      "requirements": "Forge Ring, regenerate ;",
      "cost": "15,400 gp"
    },
    "Ring of Energy Dampening": {
      "source": "Mythic Adventures pg. 156",
      "aura": "moderate abjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "31,500 gp;",
      "weight": "— Description When the wearer is about to take acid, cold, electricity, or fire damage, this band of braided copper and silver writhes like a snake. It provides resistance 5 to acid, cold, electricity, and fire. The wearer can expend one use of mythic power as an immediate action when taking damage of one of these types to upgrade the resistance to immunity for that attack or effect only. Also, once per day when the wearer takes damage of one of these types, the wearer can grant resistance 5 to the energy type damaging him to all allies within 20 feet. This resistance lasts for 1 minute. Construction",
      "requirements": "Forge Ring, Mythic Crafter, protection from energy , shield other ;",
      "cost": "15,750 gp"
    },
    "Ring of Protection4": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description This ring offers continual magical protection in the form of a deflection bonus of +1 to +5 to AC. Construction",
      "requirements": "Forge Ring, shield of faith , caster must be of a level at least three times higher than the bonus of the ring;",
      "cost": "1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Refusal": {
      "source": "Inner Sea Monster Codex pg. 29",
      "aura": "strong conjuration and transmutation",
      "cl": "13th",
      "slot": "ring;",
      "price": "32,500 gp;",
      "weight": "— Description Powerful gillmen who suspect they harbor unwitting allegiance to hidden masters use rings of refusal to resist such bonds. The wearer of a ring of refusal gains a +2 bonus on saving throws against enchantment spells and effects. When the wearer is targeted by break enchantment or a similar effect that ends an enchantment, the caster gains a +2 bonus on caster level checks to resolve the effect. The wearer can also activate the ring once per day as an immediate action to gain spell resistance 25 against a single enchantment spell or effect. Construction",
      "requirements": "Forge Ring, break enchantment , spell resistance ;",
      "cost": "16,250 gp"
    },
    "Ring of Delayed Doom7 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Sihedron Ring": {
      "source": "Rise of the Runelords Anniversary Edition pg. 426 , Pathfinder #6: Spires of Xin-Shalast pg. 37",
      "aura": "moderate abjuration and illusion",
      "cl": "9th",
      "slot": "ring;",
      "price": "35,000 gp;",
      "weight": "— Description This otherwise plain ring is adorned with a tiny Sihedron rune. These rings were given to agents and allies of the runelords as badges of office and tokens of appreciation for their work—sometimes, they were given as bribes to those a runelord was attempting to win to his cause. Like the more common Sihedron medallion , runelords have special links to Sihedron rings that aid in scrying and observation of the world around the wearer of the ring. A Sihedron ring grants a +3 deflection bonus to AC, a +3 resistance bonus on all saving throws, and protects the wearer with a constant endure elements effect. At will, as a standard action, the wearer can use the Sihedron ring to change the appearance of his clothing or armor into any other kind of clothing or armor. The actual clothing and armor worn retain all their properties (including weight) when glamered. Only true seeing or similar magic reveals the true nature of the adornments. Construction",
      "requirements": "Forge Ring, endure elements , resistance , shield ;",
      "cost": "17,500 gp"
    },
    "Ring of Resistance5": {
      "source": "Pathfinder #123: The Flooded Cathedral pg. 44",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "1,500 gp (+1), 6,000 gp (+2), 13,500 gp (+3), 24,000 gp (+4), 37,500 gp (+5);",
      "weight": "— Description Protective symbols adorn this magic ring. It functions as a cloak of resistance with an equivalent bonus. Construction",
      "requirements": "Forge Ring , resistance , creator's caster level must be at least three times the ring's bonus;",
      "cost": "750 gp (+1), 3,000 gp (+2), 6,750 gp (+3), 12,000 gp (+4), 17,750 gp (+5)"
    },
    "Ring of the Godless4": {
      "source": "People of the Sands pg. 29",
      "aura": "faint abjuration and divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp (+1), 17,000 gp (+2), 27,000 gp (+3), 38,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description These rings are said to have first been forged in Rahadoum by the Council of Elders to help root out the hidden faithful and other practitioners of the divine. A ring of the godless grants a luck bonus on saving throws against divine spells. This bonus does not apply to spell-like or supernatural abilities unless they are class abilities of a divine spellcasting class, such as channel energy or domain powers, or unless they are used by a creature that has been called, created, or summoned by divine magic. The wearer's spell resistance (if any) increases by an amount equal to the ring's luck bonus, though this increase applies only against divine spells (and spell-like abilities as described above). A ring of the godless also allows the wearer to use detect magic at will, though it detects only divine magic. In addition, the wearer can use a specialized form of arcane sight a number of times per day equal to the ring's luck bonus. This ability can be activated as a swift action, its effect lasts until the end of the wearer's turn, and it detects only divine magic or divine spellcasting ability. Construction",
      "requirements": "Forge Ring, arcane sight , detect magic , spell resistance , creator cannot be a divine spellcaster, creator must be of a level at least three times higher than the bonus of the ring;",
      "cost": "4,000 gp (+1), 8,500 gp (+2), 13,500 gp (+3), 19,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of Delayed Doom8 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ring of Freedom of Movement": {
      "source": "Ultimate Equipment pg. 171 , PRPG Core Rulebook pg. 479",
      "aura": "moderate abjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "40,000 gp;",
      "weight": "— Description This gold ring allows the wearer to act as if continually under the effect of a freedom of movement spell. Construction",
      "requirements": "Forge Ring, freedom of movement ;",
      "cost": "20,000 gp"
    },
    "Ring of MysticismType II": {
      "source": "Psychic Anthology pg. 8",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (Type I), 40,000 gp (Type II), 70,000 gp (Type III), 100,000 gp (Type IV);",
      "weight": "— Description This ring of bone fused with crystal comes in four varieties, all of them useful only to psychic spellcasters. The wearer's number of psychic spells per day is doubled for one specific spell level. A ring of mysticism I doubles 1st-level spells, a ring of mysticism II doubles 2nd-level spells, a ring of mysticism III doubles 3rd-level spells, and a ring of mysticism IV doubles 4th-level spells. Bonus spells from high ability scores are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (Type I), 20,000 gp (Type II), 35,000 gp (Type III), 50,000 gp (Type IV)"
    },
    "Ring of Wizardrytype II": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (type I), 40,000 gp (type II), 70,000 gp (type III), 100,000 gp (type IV);",
      "weight": "— Description This special ring comes in four varieties, all of them useful only to arcane spellcasters. The wearer's arcane spells per day are doubled for one specific spell level. A ring of wizardry I doubles 1stlevel spells, a ring of wizardry II doubles 2nd-level spells, a ring of wizardry III doubles 3rd-level spells, and a ring of wizardry IV doubles 4th-level spells. Bonus spells from high ability scores or school specialization are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (type I), 20,000 gp (type II), 35,000 gp (type III), 50,000 gp (type IV)"
    },
    "Ring of Inner Fortitudemajor": {
      "source": "Ultimate Equipment pg. 171",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "18,000 gp (minor), 42,000 gp (major), 66,000 gp (greater);",
      "weight": "— Description Alternating diamonds and rubies stud this band of white gold. A minor ring of fortitude reduces ability damage or temporary ability penalties the wearer takes by 2 points and ability drain by 1 point. If an effect targets multiple ability scores (for example, exhaustion, fatigue, or touch of idiocy ), the ring reduces the damage, drain, or penalty for all ability scores. A major ring of inner fortitude reduces ability damage or temporary penalties by 4 points and reduces ability drain by 2 points. A greater ring of inner fortitude reduces ability damage or temporary penalties by 6 points and reduces ability drain by 3 points. Wearing a ring of inner fortitude ring does not make the wearer immune to conditions such as fatigued or exhausted even if the wearer ignores all ability damage, drain, or penalties from the condition. If the ring prevents any damage, drain, or penalty that are associated with a beneficial effect, it also negates the beneficial effect. Construction",
      "requirements": "Forge Ring, restoration ;",
      "cost": "9,000 gp (minor), 21,000 gp (major), 33,000 gp (greater)"
    },
    "Rings of Bondage, Greater": {
      "source": "Ultimate Intrigue pg. 242",
      "aura": "moderate enchantment",
      "cl": "11th",
      "slot": "ring;",
      "price": "42,000 gp;",
      "weight": "— Description These specialized rings function as rings of bondage , but a command imposed by the wearer of the master ring (including a mutual agreement affecting both wearers) takes 10 minutes to activate, is permanent, and functions as geas/quest , except a DC 16 Will save still negates it. In addition, the wearer of the master ring gains a continuous sanctuary (DC 16) effect against the wearer of the servant ring, with a save required for every attack the servant makes against the master (including area attacks, but no save is required when directing allies or controlled creatures to attack the wearer); a failed save prevents only that single attack. Each time the servant successfully attacks the master, he must succeed at a second DC 16 Will save or be affected as bestow curse Construction",
      "requirements": "Forge Ring, bestow curse, detect thoughts, geas/quest, sanctuary, share language APG , status ;",
      "cost": "21,000 gp"
    },
    "Ring of Energy Resistancegreater": {
      "source": "Ultimate Equipment pg. 170 , PRPG Core Rulebook pg. 479",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "ring;",
      "price": "12,000 gp (minor), 28,000 gp (major), 44,000 gp (greater);",
      "weight": "— Description Rings of this type come in a wide variety of designs and colorations, typically related to the types of energy they defend against. These rings continually protect their wearers from damage from one type of energy—acid, cold, electricity, fire, or sonic (chosen by the creator of the item; determine randomly if found as part of a treasure hoard). Each time the wearer would normally take such damage, subtract the ring's resistance value from the damage dealt. A minor ring of energy resistance grants 10 points of resistance. A major ring of energy resistance grants 20 points of resistance. A greater ring of energy resistance grants 30 points of resistance. Construction",
      "requirements": "Forge Ring, resist energy ;",
      "cost": "6,000 gp (minor), 14,000 gp (major), 22,000 gp (greater)"
    },
    "Ring of Delayed Doom9 stones": {
      "source": "Advanced Player's Guide pg. 292",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "5,000 gp (1 stone), 10,000 gp (2 stones), 15,000 gp (3 stones), 20,000 gp (4 stones), 25,000 gp (5 stones), 30,000 gp (6 stones), 35,000 gp (7 stones), 40,000 gp (8 stones), 45,000 gp (9 stones);",
      "weight": "— Description This band has nine garnets embedded along its exterior. Whenever the wearer's mind or body first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed, for example, neutralize poison cast on the wearer while he delays the effect of a poisonous bite removes the poison effect. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ring of Delayed Doom": {
      "source": "Ultimate Equipment pg. 169",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "ring;",
      "price": "45,000 gp;",
      "weight": "— Description Whenever the mind or body of this ring's wearer first becomes subject to any harmful effect that allows a saving throw to resist or mitigate it, he may, as an immediate action, choose to delay the onset of that effect for 1 minute, after he fails the saving throw but before its effects occur. This activation causes one of the ring's nine garnets to turn to powder. When that minute passes, the wearer may continue to delay the onset of this harmful effect an additional minute as an immediate action by willing the ring to do so, which destroys another garnet, thus repeating the cycle for another minute. The delayed harmful effect occurs when the wearer falls unconscious, when the ring is removed, or 1 minute after the last time the ring's power activated; rounds spent delaying the effect do not count toward the effect's duration (for example, a curse that lasts 5 rounds takes effect for a full 5 rounds, even if the wearer delayed its effect several minutes). Effects that protect against or negate the harmful effect work normally while it is delayed. The price of the ring is reduced by 5,000 gp for each of its garnets that has been destroyed. Construction",
      "requirements": "Forge Ring, heal , time stop ;",
      "cost": "22,500 gp"
    },
    "Ring of Fear Reflection": {
      "source": "Dragonslayer's Handbook pg. 31",
      "aura": "moderate abjuration and necromancy",
      "cl": "7th",
      "slot": "ring;",
      "price": "48,000 gp;",
      "weight": "— Description This simple silver ring has a fear rune etched into its\r hammered apex. The ring provides a morale bonus versus\r fear effects. This bonus starts at +0 and can advance no\r higher than +5. Every time the wearer succeeds at a Will save versus a fear\r affect, the ring's bonus increases by +1. Should the wearer\r fail a Will save versus fear, the ring's bonus immediately falls\r to +0. If the bonus is +5 and the wearer is affected by a fear\r effect and succeeds at her Will save, the ring automatically\r reflects the fear effect back to its source. If the source is a\r creature not immune to fear, it must succeed at a Will save at\r the DC made by the ring's wearer or be affected by the fear\r effect. Only the source of an area fear effect is targeted by\r such a reflected spell. Construction",
      "requirements": "Forge Ring, fear , remove fear , resistance ;",
      "cost": "24,000 gp"
    },
    "Ring of Protection5": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "ring;",
      "price": "2,000 gp (+1), 8,000 gp (+2), 18,000 gp (+3), 32,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description This ring offers continual magical protection in the form of a deflection bonus of +1 to +5 to AC. Construction",
      "requirements": "Forge Ring, shield of faith , caster must be of a level at least three times higher than the bonus of the ring;",
      "cost": "1,000 gp (+1), 4,000 gp (+2), 9,000 gp (+3), 16,000 gp (+4), 25,000 gp (+5)"
    },
    "Ring of the Godless5": {
      "source": "People of the Sands pg. 29",
      "aura": "faint abjuration and divination",
      "cl": "5th",
      "slot": "ring;",
      "price": "8,000 gp (+1), 17,000 gp (+2), 27,000 gp (+3), 38,000 gp (+4), 50,000 gp (+5);",
      "weight": "— Description These rings are said to have first been forged in Rahadoum by the Council of Elders to help root out the hidden faithful and other practitioners of the divine. A ring of the godless grants a luck bonus on saving throws against divine spells. This bonus does not apply to spell-like or supernatural abilities unless they are class abilities of a divine spellcasting class, such as channel energy or domain powers, or unless they are used by a creature that has been called, created, or summoned by divine magic. The wearer's spell resistance (if any) increases by an amount equal to the ring's luck bonus, though this increase applies only against divine spells (and spell-like abilities as described above). A ring of the godless also allows the wearer to use detect magic at will, though it detects only divine magic. In addition, the wearer can use a specialized form of arcane sight a number of times per day equal to the ring's luck bonus. This ability can be activated as a swift action, its effect lasts until the end of the wearer's turn, and it detects only divine magic or divine spellcasting ability. Construction",
      "requirements": "Forge Ring, arcane sight , detect magic , spell resistance , creator cannot be a divine spellcaster, creator must be of a level at least three times higher than the bonus of the ring;",
      "cost": "4,000 gp (+1), 8,500 gp (+2), 13,500 gp (+3), 19,000 gp (+4), 25,000 gp (+5)"
    },
    "Band of Triumph": {
      "source": "Pathfinder #131: The Reaper's Right Hand pg. 35",
      "aura": "strong enchantment and evocation",
      "cl": "13th",
      "slot": "ring;",
      "price": "50,000 gp;",
      "weight": "— Description This white-gold ring bears the relief image of a roaring lion. Once per day on command, the wearer can point the ring and mentally designate one or more creatures or objects in a 60-foot cone as enemies, after which the ring roars triumphantly. Selected targets in the area are affected by shout (Fortitude DC 20). All other objects in the area are unharmed, and all other creatures in the area receive the benefits of the inspire courage bardic performance as performed by a 7th-level bard for 3 rounds. When activating the ring, the wearer can expend 1 round of her bardic performance ability to use her own bard level to calculate the performance's effect. In addition, the ring grants the wearer a +4 enhancement bonus to Charisma; treat this as a temporary ability bonus for the first 24 hours the ring is worn. Construction",
      "requirements": "Forge Ring , eagle's splendor , good hope , shout ;",
      "cost": "25,000 gp"
    },
    "Ring of Friend Shield": {
      "source": "Ultimate Equipment pg. 171 , PRPG Core Rulebook pg. 479",
      "aura": "moderate abjuration",
      "cl": "10th",
      "slot": "ring;",
      "price": "50,000 gp;",
      "weight": "— Description These curious rings always come in pairs. A ring of friend shield without its mate is useless. Either wearer of one of a pair of the rings can, at any time, command his ring to cast a shield other spell with the wearer of the mated ring as the recipient. This effect has no range limitation. Construction",
      "requirements": "Forge Ring, shield other ;",
      "cost": "25,000 gp"
    },
    "Ring of Psychic Mastery": {
      "source": "Occult Adventures pg. 252",
      "aura": "strong (no school)",
      "cl": "14th",
      "slot": "ring;",
      "price": "50,000 gp;",
      "weight": "— Description The large sapphire that adorns this platinum ring darkens in hue as its wearer depletes her psychic spellcasting potential. The gem turns black when the wearer's daily spells are exhausted or if the wearer has no ability to cast psychic spells. A ring of psychic mastery grants the caster 1 additional psychic spell per day for each spell level from 1st to 4th that she is capable of casting. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "25,000 gp"
    },
    "Ring of Shooting Stars": {
      "source": "Ultimate Equipment pg. 173 , PRPG Core Rulebook pg. 479",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "ring;",
      "price": "50,000 gp;",
      "weight": "— Description This ring has two modes of operation: one for when the wearer is in dim light or outdoors at night, and a second one when the wearer is underground or indoors at night. At night or in areas of shadow or darkness, the ring of shooting stars can perform the following functions on command. Dancing lights  (once per hour) Light  (twice per night) Ball lightning  (special, once per night) Shooting stars  (special, three per week) The first special function, ball lightning, releases one to four balls of lightning (ring wearer's choice). These glowing globes resemble dancing lights , and the wearer controls them similarly (see the dancing lights spell description). The spheres have a 120-foot range and a duration of 4 rounds. They can be moved at 120 feet per round. Each sphere is about 3 feet in diameter, and any creature who comes within 5 feet of one causes its charge to dissipate, taking electricity damage in the process according to the number of balls created. Number of Balls Damage per Ball   1 lightning ball 4d6 points of electricity damage   2 lightning balls 3d6 points of electricity damage   3 lightning balls 2d6 points of electricity damage   4 lightning balls 1d6 points of electricity damage Once the ball lightning function is activated, the balls can be released at any time before the sun rises. Multiple balls can be released in the same round. The second special function produces three shooting stars that can be released from the ring each week, simultaneously or one at a time. Upon impact, they deal 12 points of damage and spread (as a fireball ) in a 5-foot-radius sphere that deals 24 points of fire damage. Any creature struck by a shooting star takes full damage from the impact plus full fire damage from the spread unless it succeeds at a DC 13 Reflex save. Creatures not struck but within the spread ignore the impact damage and take only half damage from the fire spread on a successful DC 13 Reflex save. The range is 70 feet, at the end of which the shooting star explodes unless it strikes a creature or object before that. A shooting star always follows a straight line, and any creature in its path must make a successful DC 13 Reflex save or be hit by the projectile. Indoors at night, or underground, the ring of shooting stars has the following properties. Faerie fire  (once per day) Spark shower  (special, once per day) The spark shower is a flying cloud of sizzling purple sparks that fan out from the ring for a distance of 20 feet in an arch 10 feet wide. Creatures within this area take 2d8 points of damage each if not wearing metal armor or carrying metal weapons. Any creature wearing metal armor and/or carrying a metal weapon takes 4d8 points of damage. Construction",
      "number of balls": "",
      "damage per ball": "",
      "requirements": "Forge Ring, faerie fire , fireball , light , lightning bolt ;",
      "cost": "25,000 gp"
    },
    "Ring of Spell Storing": {
      "source": "Ultimate Equipment pg. 174 , PRPG Core Rulebook pg. 479",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "ring;",
      "price": "50,000 gp;",
      "weight": "— Description A ring of spell storing contains up to 5 levels of spells (either divine or arcane, or even a mix of both spell types) that the wearer can cast. Each spell has a caster level equal to the minimum level needed to cast that spell. The user need not provide any material components or focus to cast the spell, and there is no arcane spell failure chance for wearing armor (because the ring wearer need not gesture). The activation time for the ring is the same as the casting time for the relevant spell, with a minimum of 1 standard action. For a randomly generated ring, treat it as a scroll to determine what spells are stored in it. If you roll a spell that would put the ring over the five-level limit, ignore that roll; the ring has no more spells in it. A spellcaster can cast any spells into the ring, so long as the total spell levels do not add up to more than 5. Metamagic versions of spells take up storage space equal to their spell level modified by the metamagic feat. A spellcaster can use a scroll to put a spell into the minor ring of spell storing The ring magically imparts to the wearer the names of all spells currently stored within it. Construction",
      "requirements": "Forge Ring, imbue with spell ability ;",
      "cost": "25,000 gp"
    },
    "Ring of Continuation": {
      "source": "Ultimate Equipment pg. 168",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "ring;",
      "price": "56,000 gp;",
      "weight": "— Description This band of braided copper wires throbs ever so slightly in harmony with its wearer's heartbeat. Whenever the wearer of this ring casts a spell with a range of personal and a duration of 10 minutes per level or greater, that spell remains in effect for 24 hours or until the wearer casts another spell with a range of personal (whichever comes first). Spells that usually only affect one specific action (such as making a particular attack) are expended after that action. This does not reduce the duration of spells that normally last longer than 24 hours. Casting a new spell does not eliminate a previous spell if its normal duration is such that it would still be in effect. However, attempts to dispel or otherwise eliminate a spell kept active by the ring work normally and, if successful, remove the spell from the ring, causing the wearer to lose all benefits from that spell. Construction",
      "requirements": "Forge Ring, mnemonic enhancer ;",
      "cost": "28,000 gp"
    },
    "Survivor's Ring": {
      "source": "Inner Sea Intrigue pg. 56",
      "aura": "strong illusion",
      "cl": "18th",
      "slot": "ring;",
      "price": "56,160 gp;",
      "weight": "— Description This ring is shaped like a silver snake with an onyx in its mouth. Once per day, if the wearer would be reduced to 0 or fewer hit points but not be dead, she is instead reduced to 0 hit points and subject to an effect similar to mislead . Her illusory double appears to die or to take on the dying condition in her place, as appropriate for the negated effect. The wearer cannot control the double. In addition, the wearer can touch the ring's stone as a standard action once per day to use dimension door but only while the ring's mislead effect is active. Construction",
      "requirements": "Forge Ring, death ward, dimension door, mislead ;",
      "cost": "25,080 gp"
    },
    "Ring of Inner Fortitudegreater": {
      "source": "Ultimate Equipment pg. 171",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "ring;",
      "price": "18,000 gp (minor), 42,000 gp (major), 66,000 gp (greater);",
      "weight": "— Description Alternating diamonds and rubies stud this band of white gold. A minor ring of fortitude reduces ability damage or temporary ability penalties the wearer takes by 2 points and ability drain by 1 point. If an effect targets multiple ability scores (for example, exhaustion, fatigue, or touch of idiocy ), the ring reduces the damage, drain, or penalty for all ability scores. A major ring of inner fortitude reduces ability damage or temporary penalties by 4 points and reduces ability drain by 2 points. A greater ring of inner fortitude reduces ability damage or temporary penalties by 6 points and reduces ability drain by 3 points. Wearing a ring of inner fortitude ring does not make the wearer immune to conditions such as fatigued or exhausted even if the wearer ignores all ability damage, drain, or penalties from the condition. If the ring prevents any damage, drain, or penalty that are associated with a beneficial effect, it also negates the beneficial effect. Construction",
      "requirements": "Forge Ring, restoration ;",
      "cost": "9,000 gp (minor), 21,000 gp (major), 33,000 gp (greater)"
    },
    "Spiritualist Rings": {
      "source": "Ultimate Equipment pg. 177",
      "aura": "strong necromancy",
      "cl": "12th",
      "slot": "ring;",
      "price": "70,000 gp;",
      "weight": "— Description These four garish and gaudy rings must be worn on one hand, though they take up only a single ring slot. They grant the wearer the ability to commune with and affect the dead in the following ways. The wearer can use  speak with dead , as the spell, three times per day. It takes 10 minutes to use this ability. The wearer can use  spectral hand , as the spell, three times per day. The wearer's weapons gain the  ghost touch  weapon special ability while the wearer is wielding the weapons. The wearer gains a +4 sacred or profane bonus on saving throws against positive and negative energy effects. The bonus depends on the wearer's alignment—good-aligned wearers gain a sacred bonus, whereas evil-aligned wearers gain a profane bonus. Neutral-aligned wearers pick either a sacred or profane bonus when the ring is first put on, which cannot be changed later . Construction",
      "requirements": "Forge Ring, speak with dead , spectral hand , plane shift ;",
      "cost": "45,000 gp"
    },
    "Ring of Wizardrytype III": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (type I), 40,000 gp (type II), 70,000 gp (type III), 100,000 gp (type IV);",
      "weight": "— Description This special ring comes in four varieties, all of them useful only to arcane spellcasters. The wearer's arcane spells per day are doubled for one specific spell level. A ring of wizardry I doubles 1stlevel spells, a ring of wizardry II doubles 2nd-level spells, a ring of wizardry III doubles 3rd-level spells, and a ring of wizardry IV doubles 4th-level spells. Bonus spells from high ability scores or school specialization are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (type I), 20,000 gp (type II), 35,000 gp (type III), 50,000 gp (type IV)"
    },
    "Ring of MysticismType III": {
      "source": "Psychic Anthology pg. 8",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (Type I), 40,000 gp (Type II), 70,000 gp (Type III), 100,000 gp (Type IV);",
      "weight": "— Description This ring of bone fused with crystal comes in four varieties, all of them useful only to psychic spellcasters. The wearer's number of psychic spells per day is doubled for one specific spell level. A ring of mysticism I doubles 1st-level spells, a ring of mysticism II doubles 2nd-level spells, a ring of mysticism III doubles 3rd-level spells, and a ring of mysticism IV doubles 4th-level spells. Bonus spells from high ability scores are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (Type I), 20,000 gp (Type II), 35,000 gp (Type III), 50,000 gp (Type IV)"
    },
    "Ring of Telekinesis": {
      "source": "Ultimate Equipment pg. 175 , PRPG Core Rulebook pg. 479",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "ring;",
      "price": "75,000 gp;",
      "weight": "— Description This ring, knotted with metallic tendrils encasing a setting of red and amber gemstones, allows the caster to use the spell telekinesis on command, lifting and manipulating objects at a distance using only her mind. Construction",
      "requirements": "Forge Ring, telekinesis ;",
      "cost": "37,500 gp"
    },
    "Ring of Regeneration": {
      "source": "Ultimate Equipment pg. 172 , PRPG Core Rulebook pg. 479",
      "aura": "strong conjuration",
      "cl": "15th",
      "slot": "ring;",
      "price": "90,000 gp;",
      "weight": "— Description This white gold ring is generally set with a large green sapphire. When worn, the ring continually allows a living wearer to heal 1 point of damage per round and an equal amount of nonlethal damage. In addition, the wearer is immune to bleed damage while wearing a ring of regeneration . If the wearer loses a limb, an organ, or any other body part while wearing this ring, the ring regenerates it as the spell regenerate . In either case, only damage taken while wearing the ring is regenerated. Construction",
      "requirements": "Forge Ring, regenerate ;",
      "cost": "45,000 gp"
    },
    "Ring of Spell Turning": {
      "source": "Ultimate Equipment pg. 174 , PRPG Core Rulebook pg. 479",
      "aura": "strong abjuration",
      "cl": "13th",
      "slot": "ring;",
      "price": "100,000 gp;",
      "weight": "— Description Up to three times per day on command, this simple platinum band automatically reflects the next nine levels of spells cast at the wearer, exactly as if spell turning had been cast upon him. Construction",
      "requirements": "Forge Ring, spell turning ;",
      "cost": "50,000 gp"
    },
    "Ring of MysticismType IV": {
      "source": "Psychic Anthology pg. 8",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (Type I), 40,000 gp (Type II), 70,000 gp (Type III), 100,000 gp (Type IV);",
      "weight": "— Description This ring of bone fused with crystal comes in four varieties, all of them useful only to psychic spellcasters. The wearer's number of psychic spells per day is doubled for one specific spell level. A ring of mysticism I doubles 1st-level spells, a ring of mysticism II doubles 2nd-level spells, a ring of mysticism III doubles 3rd-level spells, and a ring of mysticism IV doubles 4th-level spells. Bonus spells from high ability scores are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (Type I), 20,000 gp (Type II), 35,000 gp (Type III), 50,000 gp (Type IV)"
    },
    "Ring of Wizardrytype IV": {
      "source": "Ultimate Equipment pg. 177 , PRPG Core Rulebook pg. 479",
      "aura": "moderate (no school)",
      "cl": "11th",
      "slot": "ring;",
      "price": "20,000 gp (type I), 40,000 gp (type II), 70,000 gp (type III), 100,000 gp (type IV);",
      "weight": "— Description This special ring comes in four varieties, all of them useful only to arcane spellcasters. The wearer's arcane spells per day are doubled for one specific spell level. A ring of wizardry I doubles 1stlevel spells, a ring of wizardry II doubles 2nd-level spells, a ring of wizardry III doubles 3rd-level spells, and a ring of wizardry IV doubles 4th-level spells. Bonus spells from high ability scores or school specialization are not doubled. Construction",
      "requirements": "Forge Ring, limited wish ;",
      "cost": "10,000 gp (type I), 20,000 gp (type II), 35,000 gp (type III), 50,000 gp (type IV)"
    },
    "Ring of the Shadow Victim": {
      "source": "Ultimate Intrigue pg. 241",
      "aura": "moderate illusion",
      "cl": "7th",
      "slot": "ring;",
      "price": "101,000 gp;",
      "weight": "— Description This smooth, lusterless gray ring is crafted of dark glass and has the image of a body carved into its band. Once per day, the wearer of this ring can perform a complex mental and verbal ritual, repeatedly whispering the ring's command word, while touching any humanoid corpse that has been dead for less than 1 week. The creature must have had 7 Hit Dice or fewer in life. This ritual can be as short as 1 round or could last up to 24 hours. It requires both total focus and constant contact between the ring, the wearer, and the target corpse. Interruption of any kind spoils the ritual, requiring the wearer to begin anew. The wearer of the ring chooses how long this ritual will last, but that decision must be made before she begins the ritual. On the ritual's completion, an illusory duplicate of the creature touched—partially real and formed of animate ice cloaked in magical shadow—springs into existence. This functions as lesser simulacrum in all ways unless stated otherwise. The wearer of this ring gains a +10 bonus on the Disguise check when performing this ritual. The shadow creature appears in all ways to be hearty and full of life, equipped with all of the gear and clothing that was carried or worn by the corpse throughout the ritual. At the same moment the shadow creature is completed, the targeted corpse and all of its attendant equipment vanishes, melting away like snow. The false creature brought into existence by the ring of the shadow victim has the same base ability scores, type, and subtype as the targeted corpse. It appears in all ways to be the same individual as the corpse touched, and it retains the general personality, attitude, abilities, and intellect of that creature. However, this duplicate doesn't possess any memories that the wearer of the ring doesn't also possess, has no spell-like or supernatural abilities, can't use activated extraordinary abilities, can't gain the benefits of healing, can't gain levels or increase its abilities, and can't have more than 3 Hit Dice. This false creature behaves much like the target did in life, except it has a starting attitude of helpful toward the ring's wearer and is generally willing to assist the wearer in any endeavor. The shadow creature will take nearly any action to aid the wearer of the ring, including dangerous, foolish or suicidal actions. This semi-illusory creature remains in existence for a duration equal to 7 × the length of the initial ritual that created it, until the wearer removes the ring of the shadow victim , until the wearer activates the ring again, or until the creature is destroyed by violence, whichever comes first. At that time, the duplicate vanishes and the original corpse, unchanged from when the initial ritual was completed, appears in its place. Construction",
      "requirements": "Forge Ring, alter self, gentle repose, lesser simulacrum UM ;",
      "cost": "50,500 gp"
    },
    "Ring of Three Wishes": {
      "source": "Ultimate Equipment pg. 176 , PRPG Core Rulebook pg. 479",
      "aura": "strong universal",
      "cl": "20th",
      "slot": "ring;",
      "price": "120,000 gp;",
      "weight": "— Description This ring is set with three rubies. Each ruby stores a wish spell, activated by the ring. When a wish is used, that ruby disappears. For a randomly generated ring, roll 1d3 to determine the remaining number of rubies. When all the wishes are used, the ring becomes a nonmagical item. Construction",
      "requirements": "Forge Ring, miracle or wish ;",
      "cost": "97,500 gp"
    },
    "Ring of Djinni Calling": {
      "source": "Ultimate Equipment pg. 169 , PRPG Core Rulebook pg. 479",
      "aura": "strong conjuration",
      "cl": "17th",
      "slot": "ring;",
      "price": "125,000 gp;",
      "weight": "— Description This “genie” ring serves as a special gate by means of which a specific djinni (see the Pathfinder RPG Bestiary ) can be called from the Plane of Air. When the ring is rubbed (a standard action), the call goes out, and the djinni appears on the next round. The djinni faithfully obeys and serves the wearer of the ring, but never for more than 1 hour per day. If the djinni of the ring is ever killed, the ring becomes nonmagical and worthless. Construction",
      "requirements": "Forge Ring, gate ;",
      "cost": "62,500 gp"
    },
    "Ring of the Recalled Soul": {
      "source": "Pathfinder #132: The Six-Legend Soul pg. 28",
      "aura": "moderate illusion",
      "cl": "18th",
      "slot": "ring;",
      "price": "150,000 gp;",
      "weight": "— Description The ring of the recalled soul allows the wearer to open a door into a nearby mindscape they are aware of as if using the spell mindscape door , but the targeted creature cannot resist this effect with a Will save. If the ring's wearer connects to the mindscape, he can designate up to 10 other creatures to be able to see and pass through the door as though it were a normal doorway. The ring grants no ability to detect mindscapes, so the wearer must already be aware of its existence via interactions, hearsay, or the detect mindscape spell. Once the ring's wearer has connected to the mindscape, he can open the door to that particular mindscape from anywhere on the same plane, so long as the mindscape still exists. Physical distance poses no barrier to the mindscape. Each time the ring's wearer opens the door to a mindscape he has previously visited, he can alter the designated creatures allowed to pass through the door as if he were opening the door for the first time. The ring's wearer cannot prevent creatures within the mindscape from exiting to the real world so long as the door is open. The ring's wearer can close the door to the mindscape at any time as long as he is not within the mindscape. Construction",
      "requirements": "Forge Ring , mindscape door ;",
      "cost": "75,000 gp"
    },
    "Ring of the Hidden Psyche": {
      "source": "Occult Adventures pg. 252",
      "aura": "strong (no school)",
      "cl": "18th",
      "slot": "ring;",
      "price": "160,000 gp;",
      "weight": "— Description This ring resembles a ring of psychic mastery , but its flawless sapphire serves as a vessel for the wearer's soul. It possesses all the abilities of a ring of psychic mastery in addition to the following effects. The wearer's soul instantly enters the ring upon the wearer's death, even if her body is utterly destroyed. This counts as an object possession spell, except that the possessing soul cannot animate the ring and must instead wait for someone to wear it. From inside the ring, she can attempt a greater possession on anyone who voluntarily wears the ring (Will DC 23 negates). A successful save against the greater possession effect renders the new wearer immune to further such attempts for 24 hours. Dispelling the object possession effect on the ring banishes the soul from the ring to its appropriate afterlife. Otherwise, a soul can remain in the ring indefinitely. While in the ring, the soul knows when a creature has put on the ring. The soul can't otherwise sense the area around it or take actions other than attempting the greater possession effect. A ring of the hidden psyche resists attempts to discern its true nature. Detect magic reveals only the properties of a ring of psychic mastery , though identify or stronger magic can reveal the ring's full powers if the caster succeeds at a DC 23 Will save. Construction",
      "requirements": "Forge Ring, greater possession , magic aura , object possession , wish ;",
      "cost": "80,000 gp"
    },
    "Ring of Splendid Security": {
      "source": "Curse of the Crimson Throne (PFRPG) pg. 435 , Pathfinder #12: Crown of Fangs pg. 60",
      "aura": "strong abjuration",
      "cl": "16th",
      "slot": "ring;",
      "price": "180,000 gp;",
      "weight": "— Description This extravagant ring is heavy with precious jewels. As fashions change (or as the wearer's fancy shifts), the wearer can alter the appearance of her armor, clothing, and even weaponry at will as a standard action; this change is illusory and doesn't affect the actual abilities of gear or weapons (although drastic changes in size are beyond the scope of this ability). A ring of splendid security's primary purpose, though, is to grant the wearer protection from harm. As long as it is worn, the ring grants the wearer a +5 deflection bonus to her AC, a +5 resistance bonus on saving throws, and spell resistance 22. Construction",
      "requirements": "Forge Ring , minor image , resistance , shield or shield of faith ,;",
      "cost": "90,000 gp"
    },
    "Ring of Elemental Command": {
      "source": "Ultimate Equipment pg. 169 , PRPG Core Rulebook pg. 479",
      "aura": "strong conjuration",
      "cl": "15th",
      "slot": "ring;",
      "price": "200,000 gp;",
      "weight": "— Description All four kinds of rings of elemental command are very powerful. Each appears to be nothing more than a lesser magic ring until fully activated (by meeting a special condition, such as single-handedly slaying an elemental of the appropriate type or exposure to a sacred material of the appropriate element), but each has certain other powers as well as the following common properties. Elementals of the plane to which the ring is attuned can't attack the wearer, or even approach within 5 feet of her. If the wearer desires, she may forgo this protection and instead attempt to charm the elemental (as charm monster, Will DC 17 negates). If the charm attempt fails, however, absolute protection is lost and no further attempt at charming can be made. Creatures from the plane to which the ring is attuned that attack the wearer take a –1 penalty on their attack rolls. The ring wearer makes applicable saving throws against the extraplanar creature's attacks with a +2 resistance bonus. She gains a +4 morale bonus on all attack rolls against such creatures. Any weapons he uses bypasses the damage reduction of such creatures, regardless of any qualities the weapon may or may not have. The wearer of the ring is able to converse with creatures from the plane to which her ring is attuned. These creatures recognize that she wears the ring, and show a healthy respect for the wearer if their alignments are similar. If alignments are opposed, creatures fear the wearer if she is strong. If she is weak, they hate and desire to slay her. The possessor of a ring of elemental command takes a saving throw penalty as follows. Element Saving Throw Penalty   Air –2 against earth-based effects   Earth –2 against air- or electricity-based effects   Fire –2 against water- or cold-based effects   Water –2 against fire-based effects In addition to the powers described above, each specific ring gives its wearer the following abilities according to its kind. Ring of Elemental Command (Air) Wind wall  (unlimited use) Feather fall  (unlimited use, wearer only) Resist energy  (electricity) (unlimited use, wearer only) Gust of wind  (twice per day) Air walk  (once per day, wearer only) Chain lightning  (once per week) This ring appears to be a ring of feather falling until a certain condition is met to activate its full potential. It must be reactivated each time a new wearer acquires it. Ring of Elemental Command (Earth) Soften earth and stone  (unlimited use) Meld into stone  (unlimited use, wearer only) Stone shape  (twice per day) Wall of stone  (once per day) Stoneskin  (once per week, wearer only) Passwall  (twice per week) This ring appears to be a ring of meld into stone (allowing the wearer to cast meld into stone at will) until the established condition is met. Ring of Elemental Command (Fire) Resist energy  (fire) (as a  major ring of energy resistance  [fire]) Burning hands  (unlimited use) Flaming sphere  (twice per day) Pyrotechnics  (twice per day) Wall of fire  (once per day) Flame strike  (twice per week) This ring appears to be a major ring of energy resistance (fire) until the established condition is met. Ring of Elemental Command (Water) Create water  (unlimited use) Water breathing  (unlimited use) Water walk  (unlimited use) Wall of ice  (once per day) Ice storm  (twice per week) Control water  (twice per week) This ring appears to be a ring of water walking until the established condition is met. Construction",
      "element": "",
      "saving throw penalty": "",
      "requirements": "Forge Ring, summon monster VI , all appropriate spells;",
      "cost": "100,000 gp"
    },
    "Ring of Spell Storing (major)": {
      "source": "Ultimate Equipment pg. 174 , PRPG Core Rulebook pg. 479",
      "aura": "strong evocation",
      "cl": "17th",
      "slot": "ring;",
      "price": "200,000 gp;",
      "weight": "— Description As the ring of spell storing , except it holds up to 10 levels of spells. Construction",
      "requirements": "Forge Ring, imbue with spell ability ;",
      "cost": "100,000 gp"
    }
  }
}