{
  "Harbinger": {
      
    
    "Crimson_Countess": {
      "parent class:": "Harbinger",
      "crimson claim ": "Starting at 1st level, a crimson countess deals 1d4 damage to each creature Claimed by her at the start of each of her turns. This damage increases to 2d4 at 6th level, 3d4 at 10th level, 4d4 at 14th level, and 5d4 at 18th level. This ability replaces ill tidings.",
      "sanguine empowerment ": "At 2nd level, a crimson countess develops the ability to gain and store Vitae. The crimson countess gains 1 point of Vitae whenever she Claims a creature. At the beginning of each of her turns, she gains Vitae points equal to the number of creatures she has Claimed. The maximum amount of Vitae a crimson countess may have stored is equal to her class level. A crimson countess' Vitae pool resets to 0 after she has spent 1 minute out of combat. The crimson countess gains a morale bonus on attack and damage rolls made as part of a strike or counter equal to 1/2 her stored Vitae points. These bonuses increases by +2 when initiating such maneuvers against a Claimed creatures. In addition, she gains the following abilities as her Vitae pool grows: Drain (Su) : If the crimson countess has at least 1 Vitae point stored, she can deal damage equal to her class level to each creature she has Claimed as a move action. If she has at least 2 Vitae points stored, she also heals 1d6 hp per creature she has Claimed when she uses this ability. Recover (Su) : Starting at 6th level, if the crimson countess has at least 4 Vitae points stored, she can recover one of her expended boosts or counters as a move action. Sacrifice (Su) : Starting at 10th level, if the crimson countess has at least 6 Vitae points stored, she can activate this ability as an immediate action when she would be take hit point or ability damage. If she does, she chooses a creature she has Claimed; that creature must succeed at a Fortitude save (DC 10 + 1/2 the crimson countess' class level + the crimson countess' initiation modifier) or take the damage instead of the crimson countess. On a successful save, the creature takes half the damage (rounded down) and the crimson countess takes the remainder. A crimson countess may only use this ability once per encounter. Sovereignty (Su) : Starting at 14th level, if the crimson countess has at least 8 Vitae points stored, she can activate this ability as a standard action. Each creature she has Claimed must succeed at a Fortitude save (DC 10 + 1/2 the crimson countess' class level + the crimson countess' initiation modifier) or be teleported to an unoccupied space of the crimson countess' choice within 60 feet of her. The crimson countess may not teleport Claimed creatures into spaces that are intrinsically dangerous (such as those filled with lava, spaces underwater, or spaces in the air if the creature cannot fly). Exsanguinate (Su) : Starting at 20th level, if the crimson countess has at least 10 Vitae points stored, she can activate this ability as a standard action, choosing a single creature she has Claimed. That creature must succeed at a Fortitude save (DC 10 + 1/2 the crimson countess' class level + the crimson countess' initiation modifier) or die. On a successful save, the target instead takes 13d6 points of damage. If the target dies from this ability, the crimson countess heals a number of hit points equal to 1/2 her normal hp maximum. This ability is a death effect. A crimson countess may only use this ability once per encounter. This ability replaces dark focus.",
      "grim news ": "Starting at 3rd level, a crimson countess can move up to her speed as a swift action once per encounter. She can use this ability twice per encounter at 9th level, and three times per encounter at 15th level. At 9th level, a crimson countess gains the ability to transform herself and all of her worn and carried items into a pool of blood with a radius of 5 feet per class level. She can change into her pool form or revert to her natural form as a swift action. When the crimson countess reverts to her natural form, she appear in any space that her pool form occupied (this is not a teleportation effect; she re-forms in the chosen space). While in her pool form, she gains a the following benefits and drawbacks: The crimson countess and other creatures can share a space freely. Neither the crimson countess nor these creatures gain any benefit or suffer ill effects from sharing the same space.   The crimson countess does not threaten spaces and cannot make attacks of opportunity.   The crimson countess cannot make melee or ranged attacks (and thus cannot initiate maneuvers that require them).   The crimson countess becomes immune to bludgeoning, piercing, and slashing damage.   The crimson countess gains a climb speed of 10 feet.   The crimson countess does not gain Vitae. At 15th level, a crimson countess gains the ability to turn into a bloody mist in addition to her pool form. While in mist form, she gains all the benefits and drawbacks of her pool form, except that the mist is a sphere with a radius equal to that of her blood pool form, and she gains a fly speed equal to her land speed with perfect maneuverability. In addition, while transformed, opponents treat spaces occupied by the crimson countess' pool or mist forms as difficult terrain. This ability alters and replaces grim news."
    },
    "Edge_Lord": {
      "parent class:": "Harbinger",
      "weapon and armor proficiency": "An edge lord is proficient with all simple weapons, martial melee weapons, and the katana, but not with any type of armor or shield. This ability alters the harbinger's weapon and armor proficiency.",
      "maneuvers": "An edge lord loses access to the Riven Hourglass and Scarlet Throne disciplines and adds  Unquiet Grave  and  Mithral Current  to his list of available disciplines. He otherwise learns, readies, and initiates maneuvers as a standard Harbinger. This ability alters maneuvers.",
      "become so numb ": "At 1st level, an edge lord dons a floor length black or red leather coat formed from their own affected indifference, often displaying clasps or buttons of bismuth crystal. This coat provides a bonus to the edge lord's AC equal to the his Intelligence modifier. In addition, an edge lord gains a +1 dodge bonus to his AC at 3rd level, which increases by a further +1 at 8th level and every five levels thereafter. The edge lord loses both of these bonuses while wearing armor of any kind. This ability replaces accursed will.",
      "quick draw ": "At 1st level, an edge lord gains Quick Draw as a bonus feat, even if he does not meet its prerequisites.",
      "one step closer ": "Starting at 4th level, an edge lord may teleport up to 25 feet plus 5 feet per 2 class levels as part of initiating a strike. This teleportation takes place either immediately before or immediately after resolving the strike; if he teleports before his strike, the edge lord may make any decisions regarding the strike (such as targets or weapon choice) after his teleport finishes. If the edge lord is unable to initiate his strike after teleporting, he may choose another strike with the same initiation action to use. The edge lord can use this ability once per encounter at 4th level, twice per encounter at 10th level, and three times per encounter at 16th level. This ability replaces massacre.",
      "nothing personal ": "Starting at 5th level, an edge lord's affected indifference shields them from unwanted feelings. He becomes immune to emotion effects. This ability replaces elusive shadow.",
      "x-ecutioner style ": "Starting at 7th level, an edge lord's mastery of his favored weapon advances. He gains Mixed Combat and Weapon Focus (Katana) as bonus feats, even if he does not meet their prerequisites. This ability replaces sorcerous deception.",
      "papercut ": "At 8th level, an edge lord's deadly efficiency in combat allows him to increase the critical threat range of any weapon he wields by +1. This bonus is applied after effects such Improved Critical or the  keen  weapon special ability, and cannot be doubled. This ability replaces ill intentions.",
      "hit the floor ": "At 11th level, an edge lord solidifies his mastery of teleportation. Whenever he confirms a critical hit against a creature, that creature must succeed at a Will save (DC 10 + 1/2 the edge lord's class level + the edge lord's initiation modifier) or be teleported to an unoccupied space within 30 feet of the edge lord's choosing. He need not teleport the target to a location that can support them; he can teleport them into the air, into difficult terrain, or into dangerous situations as he sees fit. This ability replaces black omen."
    },
    "Omen_Rider": {
      "parent class:": "Harbinger",
      "rider of ill omens": "An omen rider is gifted with exceptional equestrian knowledge upon taking up this mantle. At 1st level, she gains Medium Armor Proficiency and Mounted Combat as bonus feats, even if she does not meet their prerequisites. In addition, she gains Ride as a class skill. Finally, an omen rider may trade one of her available disciplines for the Piercing Thunder discipline.",
      "spectral steed ": "At 1st level, an omen rider gains the ability to call forth a mount composed of spectral bone, ghostly plasm, and ghoulish sinew. This beast is roughly shaped as a heavy horse, sized appropriately for the harbinger. The omen rider can magically call their mount to their side as a full-round action a number of times per day equal to 3 + the omen rider's initiation modifier. When she does, the mount immediately appears adjacent to the omen rider. The mount can be dismissed as a move action. A spectral steed has insubstantial hooves that make no sound and what seems to be a saddle, bit, and bridle. It does not fight and cannot attack, but other animals shun it and refuse to attack it. The spectral steed's AC is equal to the omen rider's, and it has a number of hit points equal to half her maximum hit points (minimum 10). In addition, it gains the benefits of any miss chances, immunities, and resistances the omen rider has. The spectral steed is not affected by effects that target an area, nor is it vulnerable to effects that do not deal hit point damage. The spectral steed always acts on the omen rider's initiative. If it loses all its hit points, the spectral steed disappears, but a new one may be summoned if the omen rider desires. A spectral steed has a base land speed of 40 feet at 1st level, which increases by 10 feet at 3rd level and every two levels thereafter (up to a maximum of 100 feet). It can bear its rider's weight and up to 50 pounds of other equipment, plus another 10 pounds per omen rider level. The spectral steed gains certain powers according to the omen rider's level. A spectral steed's abilities include those of mounts of lower levels. Starting at 3rd level, the omen rider's spectral steed can ride over sandy, muddy, or even swampy ground without difficulty or decrease in speed.   Starting at 6th level, the omen rider's spectral steed can tread on any liquid as if it were firm ground, as if it were under the effect of a  water walk  spell.   At 9th level, the omen rider's spectral steed gains a fly speed equal to its land speed, with average maneuverability. Its modifier on Fly checks is equal to the omen rider's initiator level + the omen rider's initiation modifier.   Starting at 12th level, the omen rider can conjure her spectral steed beneath her, summoning it and mounting it in the same action. In addition, she can summon her spectral steed as an immediate action. The omen rider and her spectral steed are so in tune with each other that they can work as one when performing maneuvers. Whenever an omen rider is mounted and uses a maneuver with a movement component (such as making a charge attack, or taking an extra move action), the omen rider can have her spectral steed make the appropriate move action in her place. Both the omen rider and spectral steed gain any benefits from the omen rider's maneuvers that would normally apply to the initiator (such as resistances, healing, temporary hit points, and the effects of counters). If the maneuver allows the initiator to make a charge attack, both the spectral steed and omen rider are considered to be charging. This ability replaces ill tidings and grim news.",
      "ethereal rider ": "Starting at 5th level, when moving through battle or charging down a road, the omen rider and their spectral steed inspire ghostly legends of riders made of smoke and darkness. When the omen rider is mounted on their spectral steed, the omen rider and her mount gain a +2 dodge bonus to their AC and on Reflex saves. In any round where the spectral steed moves at least 20 feet, both the omen rider and her mount gain a 20% miss chance against attacks. Ghost touch weapons and effects that can affect incorporeal creatures normally ignore this miss chance. Starting at 10th level, the determination and tireless endurance of the spectral mount resonates and becomes shared to inhuman levels between the omen rider and itself. The omen rider's spectral steed can take the run action without limit, and does not need to make Constitution checks to keep running. In addition, when the omen rider and her steed move at a rull run for at least ten minutes, both of them become immune to fatigue and exhaustion until they stop running, at which point, the mount is immediately dismissed. This ability replaces elusive shadow.",
      "reaper's claim ": "At 8th level, the omen rider is able to drink deep of the ambrosia of a fallen foe and strengthen themselves or their steed. Whenever the omen rider reduces a creature she has Claimed to 0 or fewer hit points, she and her spectral steed gain a number of temporary hit points equal to twice that creature's Hit Dice instead of recovering maneuvers. These temporary hit points last until the end of the encounter. This ability replaces ill intentions.",
      "rumors of war ": "This ability functions normally, even when mounted."
    },
    "Ravenlord": {
      "parent class:": "Harbinger",
      "dark messenger ": "A ravenlord is served by a raven-like bird, known as his dark messenger. The dark messenger functions as a bird animal companion (using the ravenlord's level as his effective druid level) with the following exceptions: The dark messenger's Intelligence score is equal to the ravenlord's. The ravenlord does not need to use the Handle Animal skill to handle or direct it; it can act normally for a creature of its intelligence.   The dark messenger always acts on the same initiative count as the ravenlord.   The ravenlord may communicate telepathically with his dark messenger provided the two are within one mile of each other. The dark messenger always obeys the ravenlord's orders to the best of its ability, and will exercise its own initiative to promote the ravenlord's interests and safety.   When slain, the dark messenger deals 1d6 points of Constitution damage to the ravenlord, then re-forms 24 hours later, reappearing on its master's shoulder with full hit points.   The dark messenger does not gain bonus tricks or the share spells ability. This ability replaces ill tidings.",
      "dark focus ": "Both the ravenlord and his dark messenger gain the benefits of the ravenlord's dark focus class feature, with the exception of the bonus feat gained at 6th level. This ability otherwise functions as normal. This ability alters dark focus.",
      "channel of woe ": "At 3rd level, a ravenlord's dark messenger gains the ability to initiate counters and strikes that the ravenlord has readied (expending them from the ravenlord's readied maneuvers as normal). The dark messenger's initiation modifier is Intelligence, and its initiator level is equal to the ravenlord's initiator level. Only one of the ravenlord or his dark messenger can initiate a strike in a single round (that is, if the dark messenger initiates a strike, the ravenlord may not initiate a strike until the next round, and vice versa). When either the ravenlord or his dark messenger initiates a strike, the other generates a 10-foot-radius sphere of Gloom for one round. The Gloom is stationary and grants concealment to the creature that generated it for as long as that creature is within its area. Starting at 3rd level, opponents within the Gloom become cursed and take a  -2 penalty on skill checks and Reflex saves while within its area. Starting at 9th level, opponents within the Gloom also take a  -4 penalty to their AC and on attack and damage rolls within its area. Starting at 15th level, opponents within the Gloom also take a  -2 penalty on Fortitude and Will saves and may not make attacks of opportunity while within its area. These effects on opponents within the Gloom are considered energy drain effects (which means, among other things, that undead and constructs are not subject to them). This ability replaces grim news.",
      "sorrow's shadow ": "At 4th level, a ravenlord's dark messenger's type changes to magical beast and it gains Toughness as a bonus feat. Do not recalculate its base attack bonus, hit points (except those granted by Toughness), saving throws, or skills. In addition, the dark messenger can change its size once per round as a free action. At 4th level, it can become Small or Medium size, at 10th level, up to Large size, and at 16th level, up to Huge size. The dark messenger cannot use this ability to become smaller than Small size. The dark messenger's ability scores do not change when it uses this ability. This ability replaces massacre.",
      "unwanted missive ": "At 11 level, a ravenlord gains the ability to swap places with his dark messenger once per encounter as an immediate action. In order to use this ability, the ravenlord and his dark messenger must be within long range (400 feet + 40 feet per ravenlord level) of each other. If the ravenlord uses this ability in response to one or more attacks or effects targeting himself or the dark messenger, each becomes the potential target of such effects targeting the other. For example, if the ravenlord is targeted with a charge attack, he can activate this ability to exchange places with his dark messenger. The dark messenger would then be the target of the charge attack. This is a teleportation effect, and if either the ravenlord or his dark messenger are prevented from teleporting for any reason (such as by a  dimensional anchor  spell), the ability fails and its use for the encounter is expended. At 17th level, the ravenlord can use this ability twice per encounter. This ability replaces black omen and rumors of war.",
      "memories of loss ": "Starting at 13th level, the Gloom generated by a ravenlord's channel of woe class feature lasts for a number of rounds equal to his ravenlord initiation modifier modifier. Additionally, opponents within the Gloom become incapable of benefiting from insight or morale bonuses while within its area. This ability replaces dark murmur.",
      "whispers of atrocity ": "Both the ravenlord and his dark messenger gain the benefits of the ravenlord's whispers of atrocity class feature. This ability otherwise functions as normal. This ability alters whispers of atrocity."
    },
    "Rosethorn_Princess": {
      "parent class:": "Harbinger",
      "class skills": "The rosethorn princess adds Appraise and Knowledge (Nature) to her list of class skills, and removes Knowledge (Religion).",
      "weapon and armor proficiency": "The rosethorn princess is proficient with all simple weapons, martial ranged weapons, and light armor, but not with shields. This ability alters the harbinger's weapon and armor proficiencies.",
      "maneuvers": "The rosethorn princess loses access to the Scarlet Throne and Cursed Razor disciplines, and adds  Sagitta Stellaris  to her list of available disciplines, gaining Knowledge (geography) as a class skill. She also adds either Solar Wind or Tempest Gale to her list of available disciplines, gaining Perception or Sleight of Hand as a class skill respectively. She otherwise learns, readies and initiates maneuvers as a standard harbinger. This ability alters maneuvers.",
      "accursed will": "Any attack that receives a bonus to damage from the rosethorn princess' accursed will feature cannot add any of her other positive ability score modifiers to its damage rolls. The rosethorn princess can choose to not apply the damage bonus from accursed will to an attack if she wishes. This modifies accursed will.",
      "in the eye of the beholder": "At 1st level, the rosethorn princess gains Precise Shot as a bonus feat. She is also considered to have the Point- Blank Shot feat for the purposes of prerequisites but does not gain its benefits unless she actually possesses the feat. This replaces ill tidings.",
      "dark claim ": "The range at which a rosethorn princess may Claim a creature is always 60 feet + 5 feet per harbinger level if it would otherwise be shorter, including with feats such as Grasp of Darkness. The rosethorn princess loses the ability to make attacks of opportunity against a Claimed creature using the withdraw action to leave a square she threatens. This modifies dark claim.",
      "woodland stride ": "Starting at 2nd level, a rosethorn princess may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at her normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect her.",
      "kiss from a rose ": "A rosethorn princess imbues her desire for stagnancy into her ammunition as phantasmal seeds, which sprout from the wounds of her enemies into lush flowers and vines. Starting at 3rd level, she gains the ability to inflict a unique condition, bloom, onto her enemies. Bloom is a stacking condition that starts at bloom 1 and gets more severe with repeated applications: for example, a creature suffering from bloom 3 being inflicted with bloom 2 would then have the bloom 5 condition. However, bloom conditions inflicted by multiple rosethorn princesses on the same creature are tracked separately and do not stack with each other: apply only the effects of the highest severity. The rosethorn princess can inflict bloom in the following ways: Whenever she hits a creature with a ranged weapon attack and deals damage, she inflicts [bloom 1]; if it was the first successful attack from a strike maneuver that turn, she instead inflicts [bloom 2].   Enemies Claimed by the rosethorn princess are inflicted with [bloom 1] whenever they start their turn.   If a Claimed creature ends their turn without moving at least 5 feet, they gain [bloom 1]. Each creature can only gain bloom from a specific rosethorn princess once per round per above method. The bloom condition has the following effects: When a creature's bloom is at least 2, thin vines and flower buds wrap their limbs. They move at half speed (rounded up to the nearest 5-foot increment) and are cursed.   Starting at 5th level, the flowers on a creature with bloom 6 flourish, decorating them with a full bouquet of colors. The creature moves at one quarter speed (rounded up to the nearest 5-foot increment), is entangled, and can no longer take 5-foot steps.   Starting at 9th level, a creature at bloom 10 is on the verge of being consumed in a cloak of flowers, to the point their face or body can barely be recognized. The creature's speed is reduced to 5 feet, and they are also staggered, with the exception that they can still use a full-round action to tear blooms off themselves as below.   Starting at 15th level, creatures take a penalty to their highest ability score (before penalties) equal to half the amount of bloom they have. This cannot reduce the ability score to below 1.   A creature can tear all bloom off themselves or a willing ally within their reach. A standard action halves the total bloom on a creature, and a full-round action removes all bloom. Bloom deals 1d4 untyped damage to a creature for each stack of the condition removed from them in this way.   Otherwise, all bloom fades harmlessly after the affected creature has been outside of combat for more than one minute, or if the rosethorn princess dies. Bloom's speed reduction does not stack with any other speed reduction. However, if the rosethorn princess would ever reduce a creature's speed with the entangled condition via any of her other abilities (but not with items like  tanglefoot bags ), she may choose to have that ability inflict [bloom 3] instead of entangled. Bloom is a curse effect: a creature immune to curses is immune to bloom, and the successful use of  break enchantment ,  remove curse , or similar effects removes the bloom condition from the target in addition to their normal effects. If the rosethorn princess gains the w hispers of atrocity  feature at 19th level, her bloom also ignores all of a target's immunities. This replaces grim news and elusive shadow.",
      "in memoriam ": "Once the blooming flowers can fully capture a creature's beauty, the original is no longer needed, and should fade before they sully their legacy. At 4th level, when a creature suffering any bloom from the rosethorn princess dies, or otherwise falls unconscious from hit point loss or nonlethal damage, the cursed plants around them surge and grow into a giant blossom that fills the creature's space, even if the creature did not leave a corpse. If the creature is alive or still has a body, the blossom is linked to them. Creatures with fewer Hit Dice than half the rosethorn princess' character level do not create blossoms. A blossom hovers in position (it does not fall unless the rosethorn princess wants it to), and the linked creature or corpse cannot move or be moved from their space while the blossom exists - if they are teleported, the blossom teleports with them. Blossoms do not impede other creatures' movement or prevent the linked creature from being healed: a blossom fades if the linked creature is able to act again (this includes being recreated as an undead, or similar). Blossoms have one quarter of the rosethorn princess' maximum hit points, an armor class of 10 + her initiation modifier, and share the rosethorn princess' saving throw bonuses when relevant. The rosethorn princess can erase any of her blossoms in range of her Claim ability as a swift action. Otherwise, blossoms last for one minute before crumbling to dust. Once per round when within 5 ft. of a blossom, each ally of the rosethorn princess can use a free action to gain temporary hit points equal to the rosethorn princess' level that last for 1 round. When an enemy is within 5 ft. of a blossom, they are inflicted with [bloom 1], and always considered flanked against melee attacks, no matter where their attacker is. Each enemy can only gain bloom this way once per round. Creatures linked to a blossom can no longer gain additional bloom. This replaces massacre.",
      "the language of flowers ": "At 7th level, the rosethorn princess is under a constant  speak with plants  spell effect. This replaces sorcerous deception.",
      "drifting memories ": "Treasured recollections often shift over time, no longer reflecting what once was. At 8th level, once on each of her turns as a free action, the rosethorn princess can make one of her blossoms in range of her Claim ability move up to 15 feet. If the blossom is linked to a creature or corpse, the creature or corpse moves with it. No movement from this ability provokes attacks of opportunity. A blossom does not inflict bloom on adjacent enemies while moving, but it applies bloom as normal to adjacent enemies after it stops. This replaces ill intentions.",
      "mourning glory ": "At 10th level, enemies within 5-foot of a blossom are automatically sickened for as long as they remain in range of it.",
      "reminiscence ": "At 11th level, the rosethorn princess gains the ability to teleport to any free space adjacent to one of her blossoms in medium range (100 feet + 10 feet per level) as an immediate action once per encounter. This ability replaces black omen.",
      "harvest ": "At 16th level, the rosethorn princess can make attacks of opportunity through her blossoms, spending her own attacks of opportunity to let blossoms attack when a creature would provoke one from them. Her blossoms each threaten an area out to 10 ft. around them, use the attack bonus of the rosethorn princess (including her strength or dexterity modifier, accursed will, and the enhancement bonus of any one weapon she is wielding) and her combat maneuver defense, and on hit deal 4d8 magical piercing damage and inflict the entangled condition for 1 round. The rosethorn princess can make an additional number of attacks of opportunity each round equal to half her intelligence modifier.",
      "cherished moment ": "Starting 18th level, once per encounter as a move action, the rosethorn princess can draw on an idealized memory of a fallen enemy. She erases a blossom in range of her Claim ability, and in its space conjures a phantasmal copy of the creature that was linked to that blossom at full hit points, and with copies of all its equipment except artifacts. The copy is loyal to the rosethorn princess but has no true will of its own. The copy can immediately take a full turn of actions following directions from the rosethorn princess, and then disappears along with all its possessions when its turn ends. However, this copy can only use abilities or personal possessions that the rosethorn princess observed the original creature performing, and the original creature is immune to being directly affected by anything its copy does. This ability replaces voices in the dark. VARIANT: A ROSE BY ANY OTHER NAME [ ] The rosethorn princess is a ranged-attack harbinger archetype that is not centered on the Sagitta Stellaris discipline, but still has high mechanical synergy with it. While beauty of the night sky isn't an uncommon thing for a rosethorn princess to wish to emulate, players may still prefer to not have to reconcile such a distinct pair of thematics on a single character. Here are some official suggestions to adapt one to match the other: Sagitta Floris : The rosethorn princess has a unique way of expressing her Sagitta Stellaris maneuvers: trails are instead paths of floating petals or flowerbeds across the terrain, forced movement is caused by lashing vines, and other effects by magic glittering pollen. This should not be treated as a separate discipline in the campaign setting, merely a personal and perhaps heretical expression of Sagitta Stellaris - thus it is still based on Knowledge (geography), not Knowledge (nature). Princess of Penitence : The rosethorn princess is renamed to 'Princess of Penitence', and is themed around guilt, burdens, avoidance and gravity. The Bloom condition is renamed to Burden, and is represented by semi-corporeal chains that only the afflicted can feel the weight of, as they grow heavier and heavier. Blossoms become 'monuments', creating phantasmal altars or stakes to display the sins of the fallen creature. The princess of penitence loses Knowledge (Nature) as a class skill, but regains Knowledge (religion). Woodland Stride is replaced by  Weight On Your Shoulders (Ex) , which lets her treat her strength score as 4 higher for the purposes of carrying capacity. At 7th level, she gains  shackle  as an at-will spell-like ability instead of a  speak with plants  effect, but can only have a maximum number of restraints summoned at once equal to half her level: summoning another set above this limit causes the oldest existing set to disappear. She uses her initiation modifier as her spellcasting ability modifier for this spell-like ability. Other : Despite their appearance, the bloom and blossom mechanics do not create real plants, and do not interact specifically with abilities that affect plants, so a range of other minor reflavoring options is possible.",
      "sagitta floris": ": The rosethorn princess has a unique way of expressing her Sagitta Stellaris maneuvers: trails are instead paths of floating petals or flowerbeds across the terrain, forced movement is caused by lashing vines, and other effects by magic glittering pollen. This should not be treated as a separate discipline in the campaign setting, merely a personal and perhaps heretical expression of Sagitta Stellaris - thus it is still based on Knowledge (geography), not Knowledge (nature).",
      "princess of penitence": ": The rosethorn princess is renamed to 'Princess of Penitence', and is themed around guilt, burdens, avoidance and gravity. The Bloom condition is renamed to Burden, and is represented by semi-corporeal chains that only the afflicted can feel the weight of, as they grow heavier and heavier. Blossoms become 'monuments', creating phantasmal altars or stakes to display the sins of the fallen creature. The princess of penitence loses Knowledge (Nature) as a class skill, but regains Knowledge (religion). Woodland Stride is replaced by Weight On Your Shoulders (Ex) , which lets her treat her strength score as 4 higher for the purposes of carrying capacity. At 7th level, she gains shackle as an at-will spell-like ability instead of a speak with plants effect, but can only have a maximum number of restraints summoned at once equal to half her level: summoning another set above this limit causes the oldest existing set to disappear. She uses her initiation modifier as her spellcasting ability modifier for this spell-like ability.",
      "other": ": Despite their appearance, the bloom and blossom mechanics do not create real plants, and do not interact specifically with abilities that affect plants, so a range of other minor reflavoring options is possible."
    }
  },
"Mystic":{
  "Aurora_Soul": {
    "parent class:": "Mystic",
    "weapon and armor proficiency": "An aurora soul is proficient with all simple weapons and with light armor, but not with shields. When wearing medium or heavy armor, using a shield, or carrying a medium or heavy load, an aurora soul loses the benefits of her mystic combat and defensive aura class features. This ability replaces the mystic's normal weapon and armor proficiencies.",
    "maneuvers": "The disciplines available to an aurora soul are  Broken Blade ,  Elemental Flux ,  Riven Hourglass ,  Steel Serpent ,  Thrashing Dragon , and  Veiled Moon . An aurora soul gains Heal as a class skill. She otherwise learns, readies, and initiates maneuvers as a standard mystic. This ability alters maneuvers.",
    "mystic combat ": "An aurora soul learns how to passively channel animus through her body, increasing the strength of her bare-handed blows. An aurora soul's unarmed strike is treated as both a manufactured weapon and a natural weapon for the purpose of spells and effects that enhance or improve either manufactured weapons or natural weapons. In addition, she gains the following benefits: At 1st level, an aurora soul gains Improved Unarmed Strike as a bonus feat.   At 3rd level, an aurora soul gains  Greater Unarmed Strike  as a bonus feat, even if she does not meet the prerequisites.   Starting at 7th level, an aurora soul adds her aurora soul initiation modifier as a bonus on damage rolls with unarmed strikes, and her unarmed strikes are treated as magic weapons for the purpose of overcoming damage reduction.   Starting at 12th level, an aurora soul adds her aurora soul initiation modifier as an insight bonus to combat maneuver checks and to her combat maneuver defense when fighting unarmed.   Starting at 17th level, an aurora soul adds her aurora soul initiation modifier as an insight bonus on critical confirmation rolls made with unarmed strikes. This ability replaces bonus feats.",
    "defensive aura ": "Starting at 2nd level, an aurora soul's animus creates a shimmering shield around her body, warding off blows and pulsing with scintillating colors. Whenever the aurora soul has at least one point of animus in her animus pool, she adds her aurora soul initiation modifier to her AC. This bonus to AC applies even against touch attacks or when the aurora soul is flat-footed. Note that the aurora soul's defensive aura comes into being at the start of her first turn in a combat (at the same time as her animus pool); she does not gain this against attacks made before she acts. The defensive aura dissipates after combat, at the same time the aurora soul's animus pool does. This ability replaces mystic artifice."
  },
  "Bloodstained_Scion": {
    "parent class:": "Mystic",
    "potent blood": "Rather than Wisdom, a bloodstained scion uses Charisma as her intiation modifier and for determining the effects of her class abilities.",
    "bloodline": "At 2nd level, a bloodstained scion selects a single bloodrager bloodline, gaining the 1st-level ability of that bloodline. She may select the 4th-level ability of the bloodline in place of a feat or bonus feat starting at 5th level, and may do the same with the 8th-level ability starting at 9th level, the 12th-level ability starting at 13th level, and the 16th-level ability starting at 17th level. At 20th level, the Bloodstained Scion gains the bloodline's 20th-level ability. The bloodstained scion uses her mystic level as her bloodrager level for the purpose of determining the effects of these abilities, and any levels of bloodrager stack with levels of mystic for the purpose of determining what bloodline abilities she can select in place of feats. For the purpose of bloodline abilities, a bloodstained scion is considered to be bloodraging whenever she has at least three points of animus, with this effective bloodrage ending whenever her pool goes below 3 and reactivating when it becomes at least 3 again. This ability replaces glyph mastery and the bonus feat gained at 2nd level.",
    "bonus feats": "A bloodstained scion cannot select item creation feats as bonus feats but may select any of her bloodline feats as bonus feats. This modifies bonus feats but does not make this archetype incompatible with others which modify bonus feats."
  },
  "Gunsmoke_Mystic": {
    "parent class:": "Mystic",
    "weapon and armor proficiency": "A gunsmoke mystic is proficient with all simple weapons and with firearms. She is also proficient with light armor and bucklers. This ability replaces the mystic's standard weapon and armor proficiencies.",
    "maneuvers": "The disciplines available to a gunsmoke mystic are Elemental Flux, Riven Hourglass, Shattered Mirror, Solar Wind, Tempest Gale, and Veiled Moon. In addition, she always treats firearms as discipline weapons for the disciplines available to her as a gunsmoke mystic. A gunsmoke mystic gains Sleight of Hand as a class skill. She otherwise learns, readies, and initiates maneuvers as a standard mystic. This ability alters maneuvers.",
    "magical gunsmith": "At 1st level, a gunsmoke mystic gains her choice of a musket or a pistol. Her starting weapon is battered, and only she knows how to use it properly. All other creatures treat her gun as if it had the brokencondition. If the weapon already has the broken condition, it does not work at all for anyone else trying to use it. This starting weapon can only be sold for scrap (it's worth 4d10 gp when sold). The gunsmoke mystic also gains Gunsmithing as a bonus feat, and can upgrade this gun to masterwork quality for 300gp and one day of work, as if she were a gunslinger.",
    "animus ammunition ": "At 1st level, a gunsmoke mystic learns how to form her animus into ammunition for a firearm. As a free action that does not provoke attacks of opportunity, the gunsmoke mystic can spend one point of animus per piece of ammunition created to reload an empty firearm on her person, filling the gun with with semi-real bullets or pellets and powder. These bullets or pellets are treated as mundane steel with no special abilities or properties, and after one of these bullets or pellets are used for an attack, it vanishes. However, due to the ephemeral nature of these pieces of ammunition, the gunsmoke mystic reduces the misfire value of the firearm by 1 (to a minimum of 1) while making attacks with her semi-real bullets. Firearms with multiple barrels or chambers (such as with a pepperbox or a revolver) must spend one animus per barrel or chamber being loaded (the gunsmoke mystic does not have to load a firearm to full capacity if she chooses). The gunsmoke mystic does not need to have a free hand to reload her firearms, she only needs to be touching the firearm to do so. If the firearm loaded with this ammunition has magical properties, these properties are bestowed upon the ammunition as normal.",
    "the way of the gun": "Gunsmoke mystics form a strong bond with their firearms, perfecting various methods of channeling animus through their shots. Animus Flush (Su) : Starting at 1st level, a gunsmoke mystic can use her animus to flush out her firearm after a misfire. As a move action, she can spend one point of animus to remove the broken condition from a single firearm she is currently wielding. This ability can only repair a firearm that gained the broken condition as a result of a firearm misfire; if the gun was otherwise damaged, it does nothing   Gun-fu (Ex) : Starting at 2nd level, a gunsmoke mystic can use the butt or handle of her firearm as a light melee weapon (regardless of what sort of firearm it is). One-handed firearms deal 1d6 points of damage (1d4 if wielded by a Small creature), and two-handed firearms deal 1d10 points of damage (1d8 if wielded by a Small creature). Regardless of the gunsmoke mystic's size, she threatens a critical hit on a natural roll of 20 and deals double damage on a successful critical hit. While wielding a firearm, the gunsmoke mystic threatens adjacent squares as normal for a melee weapon, and can use the butt or handle of her firearm to make attacks of opportunity. The gunsmoke mystic can attack with the gun in melee or fire it at range interchangeably, even within the same full-attack action (although she still provokes attacks of opportunity if she makes ranged attacks while threatened). In addition, if the firearm she wields has an enhancement bonus, that bonus applies to her melee attacks with the firearm.   Animus-Charged Bullets (Su) : Starting at 3rd level, a gunsmoke mystic may spend one point of animus as a free action to add her gunsmoke mystic initiation modifier to damage rolls with firearms for one round. The gunsmoke mystic can only use this ability once per round.   Focused Aim (Su) : Starting at 7th level, a gunsmoke mystic can take a move action to increase the accuracy of a firearm. After doing so, that firearm's range increment increases by 20 feet for her next attack with it. This ability stacks with all other bonuses to the firearm's range increment.   Ricochet Shot (Su) : Starting at 12th level, when initiating a ranged strike with a single target, the gunsmoke mystic may spend a number of points of animus equal to the level of that strike to target an additional enemy within 20 feet of the initial target. If she does so, she effectively initiates the strike twice, once against each target. The gunsmoke mystic can only use this ability once per round.   Martial Reloading (Su) : Starting at 17th level, whenever the gunsmoke mystic initiates a maneuver with her firearm, she may freely reload the shots used as part of that maneuver as if she had used the animus ammunition class feature, at no animus cost to her. This ability replaces bonus feats.",
    "flowing movements ": "Gunsmoke mystics know that true perfection comes from perfect practice. They train incessantly, mastering their movements to the point that they seemingly draw, fire, and reload their weapons on pure instinct. At 1st level, a gunsmoke mystic gains Rapid Reload as a bonus feat, even if she does not meet the prerequisites, and applies that feat to any firearm she wields. At 5th level, a gunsmoke mystic can reload a two-handed firearm as if it were a one-handed firearm, and a one-handed firearm as if it were a hand or light crossbow. At 9th level, a gunsmoke mystic no longer provokes attacks of opportunity when firing or reloading her firearm. This ability replaces withstand spell and quell magic."
  },
  "Knight-chandler": {
    "parent class:": "Mystic",
    "alignment": "Any non-evil. Knight-chandlers are defined by their concern for others, passionate friendship, and unquenchable hope.",
    "soul candle ": "At 1st level, a knight-chandler creates a flickering ball of energy formed from a combination of arcane power and her own soulstuff, known as her candle. The knight-chandler's candle is a fist-sized mote of light that normally hovers in the knight-chandler's space, and has the following properties: The candle is not a creature or an object and is not subject to attacks of any kind.   The candle sheds bright light out to a distance of 5 feet per point of illumination the knight-chandler has in her illumination pool (see below), and normal light for an equal distance beyond that.   Once per round as a free action, the knight-chandler can will her candle to move up to her speed. The candle's movement is not inhibited in any way by difficult terrain or environmental conditions, although it cannot move through solid objects. The candle remains within one mile of its creator at all times; the knight-chandler may not move the candle beyond that radius, and if she attempts to move further than one mile from her candle, it floats along gently at the limit of its range. If the knight-chandler moves outside this range faster than the candle can follow (for example, by teleportation), the candle appears one round later in a random space precisely one mile from the knight-chandler.   If the candle is in the knight-chandler's space, she can instruct it to move with her; it moves when she does, remaining in her space until directed elsewhere. In addition, the knight-chandler may include her candle in teleportation effects that affect her. If she does so, it arrives in the same space she does.   As a swift action, the knight-chandler may summon her candle to her space from wherever it is.   Allies within 15 feet of the candle gain resistance to the knight-chandler's active element's associated energy type equal to the number of points in the knight-chandler's illumination pool, up to a maximum of the knight-chandler's class level plus her knight-chandler initiation modifier. Unlike other supernatural abilities, a knight-chandler's candle is not completely suppressed when it or the knight-chandler is within an antimagic field or similar effect. If the knight-chandler or her candle enters the area of such an effect, the candle immediately dims, shedding normal light with a radius of 5 feet, rather than its bright light. It loses all other abilities (including those gained through other class features) except for the knight-chandler's ability to direct it to move once per round as a free action. The candle regains its full power once both it and the knight-chandler remove themselves from the area of effect suppressing the ability.",
    "illumination ": "Unlike a normal mystic, a knight-chandler tempers her inner animus into an energy called illumination, fueling her candle and its effects. Outside combat, a knight-chandler has one point of illumination in her illumination pool; she may not gain additional points of illumination outside of combat. When a knight-chandler enters combat, she adds one point of illumination to her illumination pool at the start of her first turn, and one more point of illumination to her illumination pool at the start of each turn thereafter. In addition, a knight-chandler gains one point of illumination whenever she initiates a boost, and she can focus her power as a swift action to add two points of illumination to her pool. A knight-chandler's illumination pool persists for one minute after the last enemy combatant is defeated or the encounter otherwise ends, after which it drops back down to one point. In addition, the knight-chandler gains  Tap Animus  as a bonus feat, even if she does not meet the prerequisites. Her levels in knight-chandler count as arcane spellcaster levels for the purposes of qualifying for prerequisites (such as those of item creation feats or the Arcane Strike feat), and if a knight-chandler ever develops arcane spellcasting from another class, she may add her knight-chandler level to her levels in that class to determine her overall caster level for the purposes of item creation feats. A knight-chandler's inner illumination manifests in both her candle and a powerful enhancement of her body and soul: Starting at 1st level, a knight-chandler can empower her attacks with a brilliant luminescence. Whenever the knight-chandler hits a creature with an attack, she can choose to have her target become outlined as if by a  faerie fire  spell, with a caster level equal to the knight-chandler's initiator level. Successive uses of this ability against the same creature do not stack; instead, they extend the duration.    Starting at 4th level, a knight-chandler deals additional damage equal to her initiator level on any attack she makes as part of a strike against an opponent that threatens one of her allies other than herself.   Starting at 9th level, when a knight-chandler hits a creature outlined by her illumination with an attack, she can choose to snuff out the light affecting that creature to heal herself for a number of hit points equal to 1/2 the damage dealt by her attack. Activating this ability is a free action that can be taken even if it isn't the knight-chandler's turn, although it can only be used once per round. The knight-chandler cannot heal more damage than her target's maximum hit points with this ability.   Starting at 17th level, the knight-chandler can perceive the surroundings of her candle as if she herself were there. She can treat the candle's space as her own for the purposes of determining line of sight, making Perception checks, or the range of any special senses she possesses (such as blindsense). In addition, once per encounter, the knight-chandler can teleport to her candle as a standard action. The knight-chandler does not require line of effect to use this ability, although if her candle's space is occupied by another creature, she is shunted to the nearest unoccupied space. This is a teleportation effect. This ability replaces animus.",
    "candle magic ": "The bright energy that the knight-chandler's candle releases is more than mere light; it is her raw power, infused with her loyalty and devotion. As her illumination builds, the knight-chandler can shape this energy into various effects. At 3rd level, the knight-chandler can project a votive effect from her candle. At 8th level, she can also project a lantern effect from her candle. Finally, at 15th level, the knight-chandler can also project a bonfire effect from her candle. The knight-chandler may change which effects her candle projects as a swift action, though she can never project more than one effect of the same type at a time. All allies within 15 feet of the knight-chandler's candle gain the benefits of the projected effect. Votive Effects: [ ] Affected allies gain a morale bonus to saving throws against mind-affecting abilities equal to the knight-chandler's illumination, up to a maximum bonus equal to her knight-chandler initiation modifier.   Affected allies add energy damage of the knight-chandler's active element's associated energy type equal to the knight-chandler's illumination to their melee and ranged attacks, up to a maximum amount equal to her class level.   Affected allies gain the ability to move 5 feet as a swift action without provoking attacks of opportunity.   Affected allies gain the ability to tap into the candle's energy as a swift action, gaining temporary hit points equal to the knight-chandler's illumination, up to a maximum number of temporary hit points equal to her class level. These temporary hit points do not stack with themselves, and last for up to 1 minute. Lantern Effects : [ ] Affected allies gain the ability to teleport to an unoccupied space adjacent to the knight-chandler as a move action. If there is no such space available, the ally does not spend their move action and does not teleport, instead getting a sense of being impeded. The knight-chandler cannot benefit from this effect when it is projected from her own candle.   Affected allies gain immunity to death effects, and gain a bonus on saving throws against psi-like abilities, psionic powers, spell-like abilities, spells, and supernatural abilities of undead creatures equal to the knight-chandler's illumination, to a maximum bonus equal to the knight-chandler's initiation modifier.   Affected allies gain a bonus on caster level checks, manifester level checks, and skill checks equal to the knight-chandler's illumination, up to a maximum bonus equal to her knight-chandler initiation modifier.   Affected allies gain a deflection bonus to their AC equal to the knight-chandler's illumination, to a maximum bonus equal to her knight-chandler initiation modifier. Bonfire Effects : [ ] Affected allies gain fast healing equal to the knight-chandler's illumination, to a maximum amount equal to her class level.   Whenever an affected ally recovers one or more maneuvers, that ally heals up to 2 points of ability damage to a single ability score of their choice. If an ally does not have maneuvers or does not wish to recover maneuvers, they can activate this ability as a standard action.   Affected allies gain the ability to move up to twice their speed as a swift action without provoking attacks of opportunity.   If an affected ally would be reduced to 0 or fewer hit points, that ally can trigger the candle's power as an immediate action. If they do, that ally is immediately restored to 1/2 their maximum hit point total, and all of the following adverse conditions affecting that ally (if any) immediately end: ability damage, blinded, confused, dazed, dazzled, deafened, diseased, exhausted, fatigued, feebleminded, insanity, nauseated, poisoned, sickened, and stunned. The damage that would have reduced the ally to 0 or fewer hit points is negated. Triggering the candle's power in this fashion is draining to the knight-chandler; doing so reduces the knight-chandler's illumination pool to one point (even if her minimum is normally higher) and renders her incapable of projecting bonfire effects for the remainder of the encounter. This ability replaces elemental glyphs.",
    "share the light ": "Starting at 9th level, the knight-chandler can share the fierce light that wells up from deep within her soul, bestowing it upon her allies. As a swift action, she can select an ally within 15 feet. That ally chooses a single boost or counter that the knight-chandler has readied and unexpended. Until the beginning of the knight-chandler's next turn, that ally can initiate that maneuver as if they had readied it normally, using the knight-chandler's initiator level or their own, whichever is higher. If the ally chooses to initiate the maneuver, the knight-chandler expends that boost or counter (even if it isn't currently granted to her; if it wasn't granted to her, treat it as though it had been granted, then expended). This ability replaces quell magic.",
    "eternal candle ": "At 20th level, the knight-chandler transcends to something more than mortal, her fierce soul transforms her body with its overflowing light. Her type changes to Outsider, and she gains the Native and Good subtypes. In addition, she ceases aging, and her minimum illumination becomes equal to her knight-chandler initiation modifier; increasing as normal during combat and resetting to her new minimum after spending one minute outside combat. Finally, the knight-chandler gains the ability to initiate two boosts with the same swift action, expending each as normal. This ability replaces glyph mastery.",
    "ex-knight chandlers": "A knight-chandler who becomes of evil alignment finds themselves deprived of the hopeful, valorous worldview that shapes their unique power. Such characters may not advance further as knight-chandlers until such a time as they cease being of evil alignment, though they do not lose access to their class features. Even an evil knight-chandler remembers her former loyalty and compassion, and by focusing on these memories, she can still summon a candle and use her candle magic."
  }
},

"Stalker":{
  "Brutal_Slayer": {
    "parent class:": "Stalker",
    "maneuvers": "A brutal slayer loses access to the Thrashing Dragon discipline and adds Black Seraph and Primal Fury to his list of available disciplines. He gains Survival as a class skill, and otherwise learns, readies, and initiates maneuvers as a standard stalker. This ability alters maneuvers.",
    "maneuvers readied": "Instead of recovering maneuvers like a standard stalker a brutal slayer uses his ki to reinforce his body as a full-round action. When he does so, he recovers a number of expended maneuvers equal to his brutal slayer initiation modifier (minimum 2) and gains temporary hit points equal to twice his initiator level and damage reduction/ - equal to his brutal slayer initiation modifier (minimum 0). These temporary hit points and damage reduction last for one round, and stack with any other sources of temporary hit points or damage reduction he may have. In addition, the next strike he initiates this encounter deals additional bleed damage equal to his brutal stalker initiation modifier. The target continues to bleed until the bleeding is stopped via magical healing or a successful DC 15 Heal check. Alternately, the brutal slayer can take a moment to realign himself and recover a single maneuver as a standard action. This ability alters maneuvers readied.",
    "brutal strikes ": "Starting at 1st level, whenever a brutal slayer confirms a critical hit against a creature, he gains a +4 profane bonus to Strength for a number of rounds equal to his brutal slayer initiation modifier. This bonus increases to +6 at 8th level and to +8 at 16th level. This ability replaces deadly strikes.",
    "stalker arts (ex or su)": "Whenever a brutal slayer gains a new stalker art, he may choose from the following list in addition to the standard stalker's stalker arts. This ability alters stalker arts, but does not cause the brutal slayer archetype to be incompatible with other archetypes that alter the stalker arts class feature. Brutal Ambush (Ex) : Whenever the brutal slayer attacks a flat-footed opponent, he increases his Strength while making that attack as if he had activated his brutal strikes ability. This benefit ends after his attack resolves.      Brutal Assault (Ex) : As a swift action, the brutal slayer can spend a point of ki and target a single creature he can see. He gains the benefit of his brutal strikes ability when making attacks against that creature for a number of rounds equal to his initiation modifier.      Furious Strikes (Ex) : The Strength bonus granted by the brutal slayer's brutal strikes ability increases by +2. In addition, he treats his class level as his base attack bonus for the purposes of qualifying for critical feats. If the brutal slayer possesses fighter levels, he also adds his brutal slayer level to his fighter level for the purposes of qualifying for critical feats.      Cruel Strike (Ex) : When the brutal slayer hits with a melee attack while under the effect of his brutal strikes ability, he can reduce the damage he deals by 1/4 (rounded down) to sicken the target for a number of rounds equal to his brutal slayer initiation modifier.      Armor of Scars (Ex) [ ]   The brutal slayer takes as well as he gives, becoming protected by the scars of wounds he has already survived. At 1st level, a brutal slayer gains a +1 bonus to his natural armor bonus to AC. (this stacks with his existing natural armor bonus, if any) At 4th level and every four levels thereafter, this bonus increases by +1. In addition, the brutal slayer's instincts enable him to better dodge incoming blows; whenever he spends a full-round action to recover maneuvers, he gains a dodge bonus to AC equal to his brutal slayer initiation modifier.  This ability replaces dodge bonus.    Muscle Memory (Ex) [ ]   The muscles of a brutal slayer are honed to deadly efficiency, just like his blades. Starting at 2nd level, a brutal slayer may add 1/2 his Strength modifier to his AC and to Reflex saves instead of his Dexterity modifier. At 6th level, the brutal slayer may add his full Strength modifier instead of his Dexterity modifier, rather than 1/2. The brutal slayer's Strength bonus to his AC is still limited by his armor's maximum Dexterity bonus.",
    "armor of scars ": "The brutal slayer takes as well as he gives, becoming protected by the scars of wounds he has already survived. At 1st level, a brutal slayer gains a +1 bonus to his natural armor bonus to AC. (this stacks with his existing natural armor bonus, if any) At 4th level and every four levels thereafter, this bonus increases by +1. In addition, the brutal slayer's instincts enable him to better dodge incoming blows; whenever he spends a full-round action to recover maneuvers, he gains a dodge bonus to AC equal to his brutal slayer initiation modifier. This ability replaces dodge bonus.",
    "muscle memory ": "The muscles of a brutal slayer are honed to deadly efficiency, just like his blades. Starting at 2nd level, a brutal slayer may add 1/2 his Strength modifier to his AC and to Reflex saves instead of his Dexterity modifier. At 6th level, the brutal slayer may add his full Strength modifier instead of his Dexterity modifier, rather than 1/2. The brutal slayer's Strength bonus to his AC is still limited by his armor's maximum Dexterity bonus."
  },
  "Bushi": {
    "parent class:": "Warlord",
    "converting your character": "The bushi is a class template suitable for use with the stalker, warlord and warder classes. When converting a character to a bushi, the character loses or changes the following class features. A character can still take the bushi class template even if they also have an archetype that alters their maneuvers readied ability (so long as they still have the ability to recover a single maneuver as a standard action to give up): Stalker [ ] The stalker gives up the ability to recover a single maneuver as a standard action.   The stalker gives up the blending and improved blending class features.   The stalker gives up the stalker art at 1st level.   The stalker can choose to take a bushido in place of a stalker art. This alters stalker arts, but does not make the bushi class template incompatible with archetypes that also alter the stalker arts class feature. Warlord [ ] The warlord gives up the ability to recover a single maneuver as a standard action.   The warlord gives up their first two bonus feats (at 1st and 6th level).   The warlord gives up the tactical presence, dual presence, and warlord's presence class features. Warder [ ] The warder gives up the ability to recover a single maneuver as a standard action.   The warder gives up their first two bonus feats (at 3rd and 8th level).   The warder gives up proficiency with heavy armor.   The warder gives up the clad in steel, steel defense, and born of steel class features.",
    "maneuvers": "A bushi trades one of his available disciplines for the  Mithral Current  discipline, and gains Perform as a class skill. He otherwise learns, readies, and initiates maneuvers as a standard member of his base class. This ability alters maneuvers.",
    "iaido ": "In addition to his normal maneuver recovery, a bushi can recover his maneuvers by sheathing his blade and taking a brief moment of quiet contemplation. When he sheathes a weapon (normally a move action), he recovers one maneuver. He cannot recover more than one maneuver per round this way, no matter how many weapons he sheathes or how many times he sheathes an individual weapon per round, nor can he use a maneuver in the same round it is recovered in this way. A bushi cannot use this ability to recover a maneuver in the same round in which it was initiated.",
    "iaido training ": "At 1st level, a bushi gains Exotic Weapon Proficiency (katana) and Exotic Weapon Proficiency (wakizashi) as bonus feats, even if he does not meet their prerequisites.",
    "quick draw ": "At 1st level, a bushi gains Quick Draw as a bonus feat, even if he does not meet the prerequisites. In addition, the bushi may sheathe his weapon without provoking attacks of opportunity.",
    "mixed combat ": "At 6th level, a bushi gains  Mixed Combat  as a bonus feat, even if he does not meet the prerequisites. In addition, the bushi is considered to be threatening all adjacent squares even if his weapon is sheathed, and can draw his weapon when making any attack (including attacks of opportunity).",
    "bushido ": "As a bushi grows in power, he gains access to abilities through the refinement of his spirit and his weapon by adhering to the principles of bushido. A stalker bushi can choose to take a bushido in place of a stalker art at 3rd, 7th, 11th, 15th, and 19th levels. This ability does not cause the bushi class template to be incompatible with other archetypes that alter the stalker arts class feature. A warlord bushi selects a bushido to gain at 2nd, 5th, 7th, 9th, 11th, and 15th levels. A warder bushi selects a bushido to gain at 3rd, 6th, 8th, 13th, 15th, and 19th levels. A bushi gains bushidos from the following list: Benevolence : The bushi's kindness and concern for his allies takes on a supernatural quality. The bushi can spend a swift action to grant all allies within 30 feet a number of temporary hit points equal to the bushi's initiator level. These temporary hit points do not stack with other temporary hit points, and last for one minute or until depleted. Courage : The bushi becomes immune to nonmagical fear effects. In addition, he gains a +4 bonus on saves against fear effects, and can grant this bonus to his allies within 60 feet for a number of rounds equal to his bushi initiation modifier as a swift action. Honesty : The Universal Truth speaks to the bushi, allowing him to detect falsehood wherever it may hide. The bushi can use  discern lies  as a spell-like ability with a caster level equal to his initiator level. He can use this ability for a number of rounds per day equal to his initiation modifier, although these rounds need not be consecutive. Honor : The bushi knows that honorable combat is the only true test of a warrior, and that the most honorable combat is a one-on-one duel. Whenever the bushi hits a creature with an attack, he gains a +1 bonus on attack and damage rolls against that creature until the end of his next turn. This bonus increases by +1 for every four initiator levels the bushi possesses. A bushi does not get an additional benefit from attacking a creature multiple times, although he loses the bonus if he does not attack the creature for one round. Loyalty : The bushi's strong sense of loyalty to friends and allies allows him to instinctively know when they are in danger. As a standard action, the bushi can mark an ally, allowing him to know the relative position and general condition of the marked allies as if they were under the effects of both a  deathwatch  and a  status  spell. This mark lasts for a number of hours equal to the bushi's initiator level, and functions as long as both the bushi and the target are on the same plane. The bushi can activate this ability a number of times per day equal to his bushi initiation modifier (minimum 1). Respect : The bushi respects all life, and knows that the strength of his allies support his own strength. Whenever the bushi uses the aid another action, he uses his bushi initiation modifier (minimum +2) instead the normal aid another bonus granted to his allies. Righteousness : The bushi knows right from wrong on an inherent, instinctual level. He can gains the ability to use  detect chaos ,  detect evil ,  detect good , and  detect law  as spell-like abilities at-will, with a caster level equal to his initiator level."
  },
  "Privateer": {
    "parent class:": "Warlord",
    "converting your character": "The privateer is a class template suitable for use with the stalker and warlord classes. When converting a character to a privateer, the character loses or changes the following class features: Stalker [ ] The stalker gives up the blending and improved blending class features.   The stalker loses the ability to recover their maneuvers by spending a full-round action to center their ki. Warlord [ ] The warlord gives up the warleader and improved warleader class features.   The warlord no longer recovers maneuvers when executing a gambit.",
    "maneuvers": "The disciplines available to a privateer are  Golden Lion ,  Solar Wind ,  Steel Serpent ,  Tempest Gale , and  Thrashing Dragon . If the privateer does not have these disciplines' associated skills as class skills, he gains them as class skills. He otherwise learns, readies, initiates maneuvers as a standard member of his base class. This ability alters maneuvers.",
    "maneuvers readied": "Instead of his base class' normal maneuver recovery, a privateer must spend a full-round action laughing intimidatingly. When he does so, he recovers a number of expended maneuvers equal to his privateer initiation modifier (minimum 2) and can make an Intimidate check to demoralize all opponents within 30 feet. This ability counts as the Dazzling Display feat for the purposes of meeting prerequisites and for effects or abilities that augment or alter the Dazzling Display feat. Alternatively, the privateer can recover a single maneuver as a standard action. This ability alters maneuvers readied.",
    "barking irons ": "At 1st level, a privateer gains proficiency with firearms.",
    "sea dog ": "At 1st level, the privateer gains Knowledge (dungeoneering), Knowledge (geography), Knowledge (local), Profession (sailor), and Swim as class skills if they are not already class skills for the privateer. In addition, he gains a bonus on skill checks with these skills equal to 1/2 his class level.",
    "swash and buckle ": "At 2nd level, a privateer learns to use the signature fighting style of high seas corsairs, combining a blade with a number of other weapons. As long as the privateer is wearing a buckler or wielding a boarding axe, cutlass, rapier, or one-handed firearm in one hand, he reduces the penalties for fighting with two weapons by 1. He does not need to be wielding the same weapon in each hand to gain this benefit; a single one of the listed weapons is enough. At 12th level, he reduces the penalties for fighting with two weapons by an additional 1.",
    "jolly roger ": "At 5th level, a privateer gains a specialized flag which represents his ship and his crew. As long as the privateer and his crew are on a ship displaying his flag or otherwise able to see the flag (regardless of whether the flag is on the ship or not), they gain a +2 morale bonus on Intimidate, Profession (sailor), and Swim checks, a +2 morale bonus on saving throws against fear effects, and a +1 morale bonus on attack rolls. At 10th level and every five levels thereafter, these bonuses increase by +1.",
    "privateer ploys ": "As a privateer levels, he learns several tricks, tactics, maneuvers and dirty deeds that he uses in combat to aid his crew and strike fear into the hearts of his foes. Unless otherwise specified, each ploy can only be taken once. A warlord privateer may choose to take a ploy in place of a warlord bonus feat or gambit. A stalker privateer may choose to take a ploy in place of a stalker art. This ability does not cause the privateer class template to be incompatible with other archetypes that alter the warlord's bonus feats or gambit class features, or the stalker's stalker arts class feature. Daring Gambit : The privateer learns one warlord gambit (see the warlord class feature), using his privateer initiation modifier instead of his Charisma modifier for any relevant bonuses. In addition, whenever the privateer succeeds on a gambit, he and each other ally within 30 feet recover one expended maneuver. This ploy can be taken multiple times; each additional time it is taken, the privateer learns one new gambit.      Dazzling Gambit : Whenever the privateer succeeds on a gambit, he can make an Intimidate check to demoralize all opponents within 30 feet as a free action, even if it isn't his turn.      Deadly Strike : The privateer gains the deadly strike class feature (see the stalker class feature) as a stalker of his level  -4 (minimum 1d6 damage). The privateer uses his privateer initiation modifier instead of his Wisdom modifier to determine the duration of his deadly strikes. If the privateer already has the deadly strike class feature, this ploy instead increases the damage of his deadly strikes by 1d6.      Gun Training : The privateer gains Amatuer Gunslinger as a bonus feat, even if he does not meet the prerequisites. He uses his privateer initiation modifier instead of his Wisdom modifier to determine the maximum amount of grit points he can have. In addition, the privateer gains a grit feat of his choice as a bonus feat. He must meet the prerequisites for this feat as normal. If the privateer already has grit from another ability, he gains Extra Grit as a bonus feat instead of Amatuer Gunslinger, as normal (he can use his privateer initiation modifier instead of his Wisdom modifier if he so wishes).      Laugh It Off : Once per day when the privateer fails a Fortitude or Will save, he can reroll that saving throw as a free action, even if it isn't his turn. He must take the result of the second roll, even if it is worse. At 10th level and again at 15th level, the privateer can use this ability one additional time per day.      Red Shirt, Brown Pants : Once per encounter when the privateer takes damage, he can grant his other allies within 60 feet gain a bonus on damage rolls equal to his privateer initiation modifier for 1d6 rounds as a free action, even if it isn't his turn.      Salt in the Wound:  The privateer gains Improved Dirty Trick and Greater Dirty Trick as bonus feats, even if he does not meet their prerequisites.      Sea Legs : The privateer gains a +1 bonus on saving throws against effects that would cause him to become sickened, nauseated, fatigued, or exhausted. At 5th level and again at every five levels thereafter, this bonus increases by +1.      Sea Combat : The privateer can treat ranged attacks with firearms against adjacent opponents as melee attacks in every way. He may initiate strikes and use feats and abilities that normally only apply to melee attacks (such as Power Attack) with such attacks, and uses his Strength modifier to determine his attack bonus instead of his Dexterity modifier. He adds his Strength modifier to damage rolls as normal for a melee weapon of the firearm's handedness. The privateer may treat one-handed firearms as light weapons for the purpose of the Weapon Finesse feat, the penalties for fighting with two weapons, and similar effects. He does not provoke attacks of opportunity when making attacks in this manner, and may not use feats that normally only apply to ranged weapons while treating a firearm as a melee weapon. In addition, the privateer can reload a one-handed firearm while wielding another weapon in his other hand, and does not provoke attacks of opportunity while doing so.      Sneak Shot : Once per round when the privateer makes a full attack using a melee weapon, he can draw and fire a loaded one-handed firearm as a free action. The attack with the firearm must be made against one of the targets of the privateer's full attack, and does not provoke an attack of opportunity.      Terrifying Brutality : Whenever the privateer reduces an opponent to 0 hit points, he can terrify another opponent within 30 feet as a swift action. That creature must succeed at a Will save (DC 10 + 1/2 the privateer's class level + the privateer's initiation modifier) or cower for one round. This is a mind-affecting fear effect.      Terrifying Strike : Whenever the privateer successfully hits an opponent with a deadly strike, that creature must succeed at a Will save (DC 10 + 1/2 the privateer's class level + the privateer's initiation modifier) or become shaken for one round. If the target is already shaken or demoralized, they instead become frightened for one round. This is a mind-affecting fear effect."
  },
  "Soul_Hunter": {
    "parent class:": "Stalker",
    "maneuvers readied": "A soul hunter stalker readies his maneuvers as a normal stalker would, but his recovery methods are different. In order for a soul hunter to recover maneuvers, he must either focus on the hunt of his prey or on the memories of past kills as a standard action and recover one expended maneuver. Alternately, the soul hunter may tap into the escaping energy of a soul by using his Soul Claiming ability (see Soul Claiming class feature below), and recover a number of expended maneuvers equal to his Wisdom modifier.",
    "ki pool": "A soul hunter is more in-tune with his own native rhythms so he may better hunt his chosen prey. The soul hunter stalker's base  ki  pool is increased by 2 additional points of  ki  at first level. Additionally, the use of his  ki  pool affords him several other abilities. At 5th level, the soul hunter may use his soulburning on Claimed targets within 30 ft. of his position. The stalker spends 1 point of  ki  as a move action and all Claimed targets suffer his soulburning damage. At 7th level, the stalker may spend 1 point from his  ki  pool to gain a +4 insight bonus on a saving throw as an immediate action. At 9th level, the stalker can delve into his subconscious in battle and remember key lessons from his training. The stalker envisions potential scenarios where martial abilities he has not readied come into play and gains a momentary burst of martial insight. A number of times per day equal to his Wisdom modifier, the character spends one  ki  point as a swift action to trade an unexpended readied maneuver for a maneuver known of the same level or lower and have it immediately readied and accessible for his use. The character may initiate this maneuver and recover it as if he had prepared at the beginning of the day (or whenever the stalker readied his maneuvers last). This alters the  ki  pool class feature of the soul hunter, which otherwise functions identically to a normal stalker.",
    "soul claiming ": "A soul hunter is capable of attuning his own  ki  to a foe's vital energies, making it difficult for quarry to elude or escape him. As a swift action, the soul hunter stalker may Claim a target creature that he has inflicted damage upon. A Claimed target's position is known to the soul hunter, even if they have total concealment against him (though he still suffers the normal miss chance if his target is concealed, and is denied his Dexterity bonus if the Claimed target attacks him). Additionally, the target of his Claiming provokes attacks of opportunity from the soul hunter when using the withdraw action to escape him. A soul hunter may not Claim more than his Wisdom modifier in creatures at any given time; a creature remains Claimed until the soul hunter withdraws his Claim (a free action) or until the target is slain. If the Claimed target is slain (reduced to 0 or fewer hit points) by the Claiming soul hunter, then he may recover his Wisdom modifier in expended maneuvers. A soul hunter may not Claim a target creature with fewer than 1/2 HD. This replaces the stalker's standard recovery method.",
    "soulburning ": "When combating his target, the soul hunter can use his ki to cause disharmony within a Claimed creature's very life energy, causing the foe's own ki to erupt into life-destroying energy. Some describe the pain experienced as being the worst that any could endure, like something was inside their very spirit and devouring it whole. When making an attack or initiating a martial maneuver against his Claimed target, the soul hunter may force this subtle disharmony to become a geyser of agony, as the soul hunter's ki causes the target's life energies to ignite. This inflicts an additional 1d6 points of damage at 1st level upon a successful attack, and this damage increases by an additional 1d6 points of damage every four soul hunter levels. Stalker arts that utilize deadly strikes use soulburning instead, and function as written with the following caveat: Soulburning cannot be done against targets that do not have vital forces (this includes constructs, oozes, and undead with an Intelligence score of 0.) This replaces the stalker's deadly strikes ability.",
    "combat insight ": "The soul hunter's combat insight differs from a more traditionally trained stalker in the following ways: At 2nd level, the soul hunter gains the scent special ability, and gains a +4 insight bonus to track targets that the he has Claimed. At 12th level, whenever he reduces a Claimed target to 0 hit points or less, he may recover an expended maneuver. These replace the abilities gained through combat insight at 2nd and 12th level.",
    "sight of the hunter (sp)": "The soul hunter learns ways to be able to hunt his prey with his extrasensory abilities. At 6th level, the soul hunter may spend 1  ki  and use the spell  clairaudience  - clairvoyance  (clairvoyance only) as a spell-like ability, using his stalker level as his caster level for the effect. He may spend an additional  ki  point to Claim a target seen in such a way. At 16th level, he may spend a  ki  point to use  scrying  and  locate creature  as spell-like abilities, and Claim targets spied upon in such a manner. The soul hunter must have either visited the location first, or have a clear picture of the target within his mind to use these abilities (as per the spells specific requirements). This replaces the blending and improved blending class features."
  },
  "Vigilante_(Stalker_archetype)": {
    "parent class:": "Stalker",
    "class skills": "A vigilante gains Knowledge (dungeoneering), Knowledge (history), Knowledge (geography), Knowledge (nobility), and Sleight of Hand as class skills.",
    "maneuvers": "A vigilante loses access to the  Solar Wind  and  Veiled Moon  disciplines and adds  Primal Fury ,  Scarlet Throne , and  Tempest Gale  to his list of available disciplines. His initiation modifier is Intelligence, and any stalker class features that previously used his Wisdom modifier now use his Intelligence modifier. He otherwise learns, readies, and initiates maneuvers as a standard stalker. This ability alters maneuvers.",
    "maneuvers readied": "Instead of recovering maneuvers like a standard stalker, a vigilante must open his mind to the flow of battle and the inherent patterns therein as a full-round action. When he does so, he recovers a number of expended maneuvers equal to his vigilante initiation modifier (minimum 2), gains a +4 insight bonus to his AC for one round and can move up to to his speed during the action, provoking attacks of opportunity as normal. In addition, the next attack he makes this encounter adds his sneak attack damage if it hits, regardless of whether or not the target his flanked or flat-footed. Alternately, the vigilante can center his awareness and recover a single maneuver as a standard action. This ability alters maneuvers readied.",
    "inspiration ": "A vigilante relies on his insight to aid him in his mission, using his cunning to augment skill checks and ability checks. The vigilante has an inspiration pool equal to 1/2 his class level + his vigilante initiation modifier (minimum 1). A vigilante's inspiration pool refreshes each day, typically after he gets a restful night's sleep. As a free action, he can expend one use of inspiration from his pool to add 1d6 to the result of that check, including any on which he takes 10 or 20. This choice is made after the check is rolled and before the results are revealed. A vigilante can only use inspiration once per check or roll. The vigilante can use inspiration on any Knowledge, Perception, or Sense Motive skill checks without expending a use of inspiration, provided he's trained in the skill. Inspiration can also be used on attack rolls and saving throws, although it costs two points of inspiration rather than one. Using inspiration while making a saving throw is an immediate action, rather than a free action. This ability replaces ki pool.",
    "trapfinding ": "A vigilante adds 1/2 his level as a bonus on Perception checks to locate traps and to Disable Device checks (minimum 1). A vigilante can use Disable Device to disarm magical traps.",
    "sneak attack ": "If a vigilante can catch an opponent when he is unable to defend himself effectively from the vigilante's attack, he can strike a vital spot for extra damage. The vigilante's attack deals extra damage any time his target would be denied a Dexterity bonus to AC (whether the target actually has a Dexterity bonus or not), or when the vigilante flanks his target. This extra damage is 1d6 at 1st level, and increases by 1d6 every three vigilante levels thereafter (2d6 at 4th level, 3d6 at 7th level, and so on). Ranged attacks can count as sneak attacks only if the target is within 30 feet. This additional damage is precision damage and is not multiplied on a critical hit. With a weapon that deals nonlethal damage (such as a sap, unarmed strike, or whip), a vigilante can make a sneak attack that deals nonlethal damage instead of lethal damage. He cannot use a weapon that deals lethal damage to deal nonlethal damage in a sneak attack not even with the usual  -4 penalty. The vigilante must be able to see the target well enough to pick out a vital spot and must be able to reach such a spot. A vigilante cannot sneak attack while striking a creature with total concealment. This ability replaces deadly strike.",
    "stalker arts (ex or su)": "Instead of selecting a stalker art at the appropriate level, a vigilante can select an investigator talent instead, treating his stalker level as his effective investigator level. He must meet the prerequisites for this investigator talent as normal. The vigilante cannot select investigator talents which augment alchemy, nor can he select stalker arts which require a ki pool to function. Any investigator talent which augments studied strike instead affects the vigilante's sneak attacks. This ability alters stalker arts, but does not cause the vigilante archetype to be incompatible with other archetypes that alter the stalker arts class feature.",
    "inspired vengeance ": "At 20th level, a vigilante has mastered inspiration to such an extent that he instinctively places his attacks in near-perfect paths. The vigilante can use inspiration on any attack roll he makes without spending any points from his pool. In addition, the vigilante can spend one point of inspiration once per round as a free action to to add 1d6 the save DC of a maneuver he initiates. This ability replaces retributive ki."
  }
},
"Warder":{
  "Dervish_Defender": {
    "parent class:": "Warder",
    "weapon and armor proficiencies": "Dervish defender are proficient in all simple weapons and martial melee weapons, double weapons, and with light armor. They are not proficient with shields.",
    "disciplines": "(Path of War: Expanded) The dervish defender gains access to  Thrashing Dragon  and loses access to Iron Tortoise. Bluff is no longer a class skill; Acrobatics is now a class skill. In addition, a dervish defender chooses between  Eternal Guardian  and  Riven Hourglass , rather than Eternal Guardian and Piercing Thunder.",
    "bonus feat": "The dervish defender gains Two-Weapon Fighting as a bonus feat at 1st level.",
    "two-weapon defense ": "While not all dervish defenders fight in the same manner, most do and all are extensively trained in these fighting philosophies. While wearing light armor or no armor, wielding a weapon in each hand (or using a double weapon), and not using a shield heavier than a buckler, the warder may add her Intelligence bonus (if any) to her Armor Class. She retains this bonus even against touch attacks or when flat-footed, but loses this bonus should she be rendered helpless by any means.",
    "dervish defense ": "A dervish defender is capable of an aggressive defense, attacking even as they defend. At 4th level, the dervish defender may use a counter against an enemy's attack and if she successfully counters it, she may make an immediate attack of opportunity against that foe. This replaces the tactical acumen class feature.",
    "shield of blades ": "At 6th level, when fighting unarmed or with a weapon from the light blades, double weapon or close weapon weapon group in each hand, the dervish defender improves her shield bonus to AC by an amount equal to her aegis bonus. As an immediate action, the dervish defender may lose her shield bonus to armor class until the beginning of her next turn and grant an adjacent creature an equivalent shield bonus to armor class until the beginning of the dervish defender's next turn. This replaces the clad in steel class feature.",
    "grace of blades ": "At 15th level the dervish defender gains mastery over her two-weapon style. Whenever the dervish defender makes an attack with one weapon while holding two or more weapons or using a double weapon (such as during a full attack during which she is not two-weapon fighting, or using a strike that includes a melee attack) she increases that attack's damage by an amount equal to one of her off-hand weapons' damage (including any extraordinary and magical enhancements) plus one-half her Strength modifier. Whenever the dervish defender makes an attack with more than one weapon (such as when making a full attack while two-weapon fighting or a strike that includes an attack with two or more weapons) she increases the damage of her weapons (and their enhancements) by one die step (as if increasing in size). This replaces the steel defense class feature.",
    "critical evasion ": "This functions as the born of steel class feature, but only functions if the character is wearing light armor or no armor."
  },
  "Fiendbound_Marauder": {
    "parent class:": "Warder",
    "maneuvers": "A fiendbound marauder loses access to the Golden Lion and Iron Tortoise disciplines and adds  Black Seraph ,  Cursed Razor , and  Eternal Guardian  to her list of available disciplines. She gains Intimidate and Spellcraft as class skills. She otherwise learns, readies, and initiates maneuvers as a standard warder. In addition, the fiendbound marauder's fiend's grip is considered a discipline weapon for the Black Seraph and Cursed Razor disciplines. This ability alters maneuvers.",
    "fiend's grip ": "The signature feature of fiendbound marauders is the ability to manifest an oversized, spiny spectral claw, often wrapped in barbed chains. To manifest her fiend's grip, a warder must be wearing gauntlets or spiked gauntlets, which act as a focus for the weapon to come into the world. The warder can manifest up to one fiend's grip for each gauntleted hand she has. Manifesting a fiend's grip is a move action, and dismissing one is a free action. A fiend's grip is a light weapon that deals 1d8 points of bludgeoning or slashing damage (for a Medium-sized wielder). It threatens a critical hit on a natural roll of 20 and deals double damage on a successful critical hit. A fiend's grip has the grapple and reach weapon properties, and the fiendbound marauder gains the grab universal monster ability for attacks made with her fiend's grip. Unlike a normal reach weapon, the fiendbound marauder can be used against adjacent foes. In addition, the fiendbound marauder can apply her full Strength bonus on damage rolls with her fiend's grip, even if wielding it in her off hand. A fiend's grip is treated as a spiked gauntlet for the purposes of Weapon Focus, being discipline weapon for a discipline, or other feats and abilities. A fiendbound marauder is always proficient in her fiend's grip. A fiend's grip is treated as both a manufactured weapon and a natural weapon for the purpose of spells and effects that enhance or improve either manufactured weapons or natural weapons. It is also considered a magic weapon for the purpose of overcoming damage reduction, affecting incorporeal creatures, and similar effects. When attacking with her fiend's grip, the fiendbound marauder may apply any magical properties and enhancement bonus of the gauntlet or spiked gauntlet that fiend's grip used as a focus to her attacks. She can also treat a fiend's grip as being made of the special material of the gauntlet or spiked gauntlet used as a focus. For example, a fiendbound marauder wearing a  +1 flaming gauntlet  and a  +2 adamantine defending   gauntlet  would grow a  +1 flaming fiend's grip  and a  +2   adamantine defending fiend's grip . As a supernatural ability, manifesting a fiend's grip does not provoke attacks of opportunities. A fiend's grip cannot be counterspelled or dispelled, although it winks out while within an  antimagic field  or similar effect. If a fiend's grip is sundered or disarmed, the spectral weapon disappears, and may be manifested again on the fiendbound marauder's next turn (although if the gauntlet it was using as a focus is sundered or otherwise removed, the fiend's grip cannot be recalled until the fiendbound marauder has a new gauntlet). This ability replaces aegis and clad in steel.",
    "the dark mark ": "A fiendbound marauder's armiger's mark is tainted by his eldritch power, causing marked creatures to also become cursed for the duration of the mark. The mark is now a supernatural ability, but otherwise functions as the armiger's mark class feature. The fiendbound marauder can use feats and abilities that require or alter the armiger's mark class feature as normal. This ability alters armiger's mark.",
    "canny pugilist ": "A fiendbound marauder's monstrous fiend's grip is as much a part of her body as it is her mind, allowing her to use it to great advantage. Starting at 4th level, the fiendbound marauder adds her fiendbound marauder initiation modifier as a competence bonus on combat maneuver checks made with her fiend's grip. This ability replaces tactical acumen.",
    "improved fiend's grip ": "Starting at 5th level, the fiendbound marauder's fiend's grip can strike incorporeal creatures as if it possessed the  ghost touch  weapon special ability. In addition, the fiend's grip can be manifested as a free action, rather than a move action. At 11th level, the fiendbound marauder's fiend's grip's critical multiplier increases to x3. This ability replaces extended defense at 5th and 11th levels.",
    "fiendish empowerment ": "At 8th level, the fiendbound marauder's fiend's grip infects his armor, causing it to grow cruel spikes and blades when her weapon manifests. While her fiend's grip is manifested, the fiendbound marauder's armor grows  +1 ghost touch   armor spikes  that deal piercing and slashing damage. If the armor already had spikes, they grow crueler, dealing damage as if the fiendbound marauder was one size category larger, dealing piercing and slashing damage, and using the enhancement bonus granted by this ability or their original enhancement bonus, whichever is higher, and gaining the benefits of the  ghost touch  weapon special ability. In addition, the fiendbound marauder gains resistance 10 to two of the following energy types: acid, cold, electricity, or fire. At 14th level, the enhancement bonus of these armor spikes increases to +2, and the fiendbound marauder gains resistance 10 to a third energy type from the above list. At 17th level, the enhancement bonus of these armor spikes increases to +3, and the energy resistances granted by this ability increase to 20. If the fiendbound marauder is not wearing armor, she can still manifest her armor spikes and gain the energy resistances granted by this ability while wielding a fiend's grip if she so chooses. If she does so, the spikes grow out of her clothing or skin, as appropriate. This ability replaces extended defense at 8th, 14th, and 17th levels."
  },
  "Hussar": {
    "parent class:": "Warlord",
    "converting your character": "The hussar is a class template suitable for use with the warlord and warder classes. When converting a character to a hussar, the character loses or changes the following class features: Warlord [ ] The warlord gives up the bonus feats class feature.   The warlord gives up the tactical presence, dual presence, and warlord's presence class features. Warder [ ] The warder gives up the bonus feats class feature.   The warder gives up proficiency with heavy armor.   The warder gives up the clad in steel, steel defense, and born of steel class features.",
    "class skills": "A hussar gains Handle Animal as a class skill.",
    "weapon and armor proficiency": "Hussars are proficient with all simple and martial weapons, with light and medium armor, and with shields (except tower shields). This ability replaces the base class' standard weapon proficiencies.",
    "maneuvers": "The disciplines available to a hussar are  Golden Lion ,  Iron Tortoise ,  Piercing Thunder ,  Primal Fury , and  Solar Wind . If the hussar does not have these disciplines' associated skills as class skills, he gains them as class skills. He otherwise learns, readies, and initiates maneuvers as a standard member of his base class. This ability alters maneuvers.",
    "maneuvers readied": "In addition to his base class' normal maneuver recovery, a hussar recovers one expended maneuver every time he successfully negates an attack using the Mounted Combat feat. This ability alters maneuvers readied.",
    "mount ": "At 1st level, a hussar gains the service of a loyal and trusty steed to carry him into battle. This mount functions as a druid's animal companion, using the hussar's level as his effective druid level. The creature must be one that he is capable of riding and is suitable as a mount. A Medium-sized hussar can select a camel or a horse. A Small-sized hussar can select a pony or wolf, but can also select a boar or a dog if he is at least 4th level. At the GM's options, other animals may be suitable mounts for a hussar to select. A hussar's bond with his mount is strong, with the pair learning to anticipate each other's moods and moves. A hussar does not take an armor check penalty on Ride checks while riding his mount. The mount is always considered combat trained and begins play with Light Armor Proficiency as a bonus feat. Should a hussar's mount die, he may find another mount to serve him after 1 week of mourning.",
    "mounted combat ": "At 1st level, a hussar gains Mounted Combat as a bonus feat, even if he does not meet the prerequisites.",
    "mounted maneuver expertise ": "Starting at 1st level, a hussar and his trusty steed are so in tune with each other that they can work as one when performing maneuvers. Whenever a hussar is mounted and uses a maneuver with a movement component (such as making a charge attack, or taking an extra move action), the hussar can have his mount take the appropriate movement in his place. If the maneuver allows the hussar to make a charge attack, both him and his mount are considered to be charging. This replaces the share spells ability that normal animal companions gain.",
    "formations ": "As the hussar levels, he learns a number of formations that assist both himself and his allies. Adopting a formation is a move action for the hussar, and allies within range of someone in the formation can enter the formation as a free action. Formations have a limited range, as noted in the formation's description. In order for a hussar's ally to participate in a formation and gain its benefits, they must start their turn within range of another ally who is participating in the formation. Allies participating in a formation do not necessarily have to be within range of the hussar; they merely must be within range of another ally within the formation. A hussar may only have one formation active at a time, and if the hussar leaves a formation, all allies in the formation also leave that formation. A creature can only gain the benefits of one formation at any given time. The hussar selects one formation from the following list to learn at 5th, 8th, 11th, 14th, and 17th levels: Guerrilla:  Allies in the Guerrilla formation gain a +2 bonus on attack and damage rolls against creatures they flank. At 7th level, allies in the formation can take a 5-foot step once per round as a free action (even if it isn't their turn) as long as that 5-foot step would place them in a position to flank an opponent. At 15th level, as long as two allies in the formation are adjacent to the same opponent, they are considered to be flanking that opponent.  Range: 15 feet.      Marching:  Allies in the Marching formation gain a +10- foot bonus to their movement speeds. At 7th level, allies in the formation gain the benefits of the Endurance and Diehard feats. At 15th level, allies in the formation cannot become fatigued or exhausted for as long as they remain in this formation. If an ally is already fatigued or exhausted when they join the formation, they ignore the effects of the condition while they remain in the formation.  Range: 10 feet.      Phalanx:  Allies in the Phalanx formation gain a +1 bonus to their AC and to Reflex Saves. At 10th level, these bonuses increase to +2, and allies in the formation gain evasion (as the rogue class feature). At 15th level, this bonus to AC increases to +2 for each ally in the formation (up to a maximum of +10) and the bonus to Reflex saves increases to +1 for each ally in the formation (up to a maximum of +5).  Range: 5 feet.      Siegebreaker:  Allies in the Siegebreaker formation gain a +4 bonus on combat maneuver checks when making bull rush, disarm, and sunder attempts. At 10th level, this bonus increases to +8. At 15th level, allies in the formation ignore an amount of hardness an object has equal to 5 times the number of allies in the formation, and can perform disarm and sunder combat maneuvers on opponents as if they were two size categories larger. This stacks with other effects that increase effective size.  Range: 15 feet.      Surge:  Allies in the Surge formation gain a +2 bonus on attack and damage rolls while charging. At 10th level, whenever an ally in the formation charges a creature, they may make one turn of up to 90 degrees when charging. At 15th level, whenever an ally in the formation makes a charge attack, one other ally in the formation can make a charge attack against the same target as an immediate action. The ally making this charge attack must be able to charge the target in order to activate this ability, and cannot make a charge on their following turn afterwards. Only one ally in the formation can use this ability per round, regardless of how many allies are in the formation.  Range: 10 feet.      Terror:  Allies in the Terror formation gain a +4 bonus on Intimidate checks to demoralize opponents. At 7th level, allies in the formation gain the benefits of the Dazzling Display feat, except that they may use it with any weapon they wield, not just ones with which they have Weapon Focus. At 15th level, whenever an ally in the formation successfully demoralizes an opponent, that opponent takes an additional  -2 penalty on attack rolls, saving throws, skill checks, and ability checks for as long as it is shaken.  Range: 10 feet.      Volley:  Allies in the Volley formation gain a +2 bonus on ranged attack rolls. At 10th level, ranged attacks made by these allies ignore all concealment less than total concealment. At 15th level, allies in the formation gain the ability to launch a hail of deadly bolts or arrows that affects a 5-foot-radius burst within their weapon's first range increment as a standard action. This attack deals 1d6 points of damage per character level of the ally to any creature in the area. Creatures in the area may make a Reflex Save (DC 10 + 1/2 that ally's Hit Dice + that ally's Dexterity modifier) to halve this damage. Damage reduction applies as normal to this damage, although it is treated as if it had been dealt by the ally's weapon for the purposes of overcoming it.  Range: 5 feet."
  },

  "Hawkguard": {
    "parent class:": "Warder",
    "weapon and armor proficiencies": "The hawkguard is proficient with all simple and martial weapons, and he is proficient with light and medium armor, and with bucklers. This replaces the warder's normal starting weapon and armor proficiencies.",
    "archer training ": "With the exhaustive training that hawkguards undergo, the hawkguard becomes a skilled ranged combatant who specializes in the use of a branch of ranged weaponry. She may select one ranged weapon to be her favored. When wielding this weapon, she does not suffer a penalty to hit for wearing a buckler and retains her shield bonus to AC even when using that arm to attack with her chosen weapon. The hawkguard also gains Point Blank Shot as a bonus feat.",
    "disciplines": "The hawkguard gains access to  Solar Wind , losing access to Primal Fury. Survival is no longer a class skill; Perception is now a class skill.",
    "ranged defensive focus ": "The hawkguard is a deadly opponent as he focuses on protecting his allies and himself while planning his next moves. This functions as the normal warder defensive focus, except for the following changes. When recovering warder maneuvers as a full-round action, the hawkguard threatens an area within 15 feet of herself, except for adjacent squares. This area increases by 5 feet for every five initiator levels the hawkguard possesses. The bowman threatens this space only if he's wielding a ranged weapon, and may make attacks of opportunity with ranged weapons as long as Ranged Defensive Focus is active. This modifies and changes the warder's defensive focus class feature.",
    "close combat archery ": "At 3rd level, the hawkguard no longer provokes attacks of opportunity when firing or reloading his favored weapon while threatened in melee combat. When using his ranged defensive focus ability, he may now attack foes in adjacent spaces to himself. This replaces the improved defensive focus class feature.",
    "defending the sky ": "Upon reaching 5th level, the hawkguard becomes increasingly adept at protecting his allies from harm. Once per day he is capable of extending the use of his counters to react to multiple attacks. Any counter that the hawkguard possesses that has a duration of instant instead has a duration of 1 round. He may then use this counter against any attack targeting an allied creature that it could normally be used to repel. Every three levels beyond this (8th, 11th, 14th, and 17th levels) he may use this ability an additional time per day. This ability replaces the extended defense class feature.",
    "evasive reflexes ": "At 7th level the hawkguard gains evasion (as the rogue class feature, except it functions in medium and heavy armor in addition to light). As an immediate action, he may lose the benefits of the evasion ability for one round and grant it to an ally for one round. This replaces the adaptive tactics class feature."
  },

  "Ordained_Defender": {
    "parent class:": "Warder",
    "class skills": "Instead of the rigorous tactical training that most warders undergo, ordained defenders undergo a process of dogmatic indoctrination that lends them to more introspective pursuits, meditating on the nature of their faith and their role in their deity's plan. An ordained defender gains Knowledge (religion) as a class skill and loses Knowledge (nobility) as a class skill.",
    "maneuvers": "A good-aligned ordained defender adds  Silver Crane  to her list of available disciplines, an evil-aligned ordained defender adds  Black Seraph  to her list of available disciplines, and an ordained defender who is neither good nor evil adds  Eternal Guardian  to her list of available disciplines. If the ordained defender does not have this discipline's associated skill as a class skill, she gains it as a class skill. Her initiation modifier is Wisdom, and any warder class features that previously used her Intelligence modifier now use her Wisdom modifier. She otherwise learns, readies, and initiates maneuvers as a standard warder. This ability alters maneuvers.",
    "aura ": "An ordained defender who worships a chaotic, evil, good, or lawful deity has a particularly powerful aura (as a cleric) corresponding to the deity's alignment (see the  detect evil  spell for details).",
    "divine gift ": "At 3rd level, an ordained defender receives supernatural empowerment from her deity in the form of a divine gift. She receives her choice of one inquisitor inquisition or warpriest blessing. She must be of the correct alignment to choose an alignment-based blessing. For determining the abilities gained from an inquisition, the ordained defender's effective inqusitor level is equal to her ordained defender level  -2. If the ordained defender chooses a blessing, the blessing grants a minor power at 3rd level and a major power at 13th level. An ordained defender can call upon the power of her blessings a number of times per day, in any combination, equal to 3 + 1/2 her ordained defender level (rounded down). Each time she uses a blessing, it counts against her daily limit. The save DC (if any) for these blessings is 10 + 1/2 the ordained defender's class level + the ordained defender's initiation modifier. If an ordained defender also has levels in a class that grants cleric domains, the blessings chosen must match the domains selected by that class. With the GM's permission, an ordained defender can change her former blessings or domains to make them conform. This ability replaces the bonus feats gained at 3rd and 13th levels."
  },
  "Sworn_Protector": {
    "parent class:": "Warder",
    "guardianship ": "At 1st level, the sworn protector may select a ward, a person whom she must protect no matter what the cost. When in combat and the sworn protector's ward is within 10ft of their ward's position, the ward gains a +1 morale bonus to their AC and savings throws. This bonus increases by +1 at 5th level, and every four levels after that (9th, 13th, and 17th level). Additionally, the sworn protector may add her guardianship bonus to her attack and damage rolls as a morale bonus if the ward is within the sworn protector's guardianship range. This radius increases by 10ft at 6th and again at 12th level. A sworn protector may only have one ward at a time at 1st level; they may then select a second ward at 8th level and a 3rd ward at 15th level. To select a ward, the sworn protector must take ten minutes discussing tactics and practicing with his ward so that he may learn how best to protect him, and from there on he practices those tactics when he readies his maneuvers. A sworn protector may dismiss a creature as his ward at anytime as a free action. This augments and replaces the aegis class feature, and if an ability uses the warder's aegis bonus for anything, then substitute with his guardianship bonus instead.",
    "defensive intercept ": "With swift speed and trained instincts, a sworn protector is capable of sudden bursts of speed in the defense of a chosen ward. A number of times per day equal to 1 + the sworn protector's Intelligence bonus she may leap to her ward's defense with lightning speed. As an immediate action, the sworn protector moves up to her base speed to a space within 10 ft. of a ward who is being subjected to an attack or effect that would cause harm, to thereby grant her guardianship benefits. This movement is subject to attacks of opportunity. If the sworn protector is too distant to reach her ward, she cannot use this ability.",
    "shared counter ": "At 3rd level, the warder's ability to protect those around him expands to allow him to use readied counters with a range of personal to protect another as long as he is adjacent to their position. If the counter is unsuccessful, then the protected ally must rely on their own defenses. He may use this with no daily limit, but only as often as he has an immediate action to initiate a counter. Additionally, in the defense of a ward she may use her defensive intercept ability as part of the same immediate action to use a shared counter. This ability functions with the Extended Defense class feature. This replaces the bonus feat gained at 3rd level."
  },
  "Zweihander_Sentinel": {
    "parent class:": "Warder",
    "weapon and armor proficiencies": "The zweihander sentinel loses proficiency with shields and tower shields.",
    "zweihander training": "At 1st level, when wielding a two-handed weapon or a one-handed weapon in both hands, the warder gains a shield bonus to his armor class equal to his aegis class feature bonus.",
    "zweihander expertise ": "A zweihander sentinel loses access to the Broken Blade discipline and adds  Scarlet Throne  to her list of available disciplines. She gains Sense Motive as a class skill. This ability does not cause zweihander sentinel archetype to be incompatible with other archetypes that alter the maneuvers class feature or her available disciplines, so long as she can still give up Broken Blade.",
    "armament shield ": "When wielding a one-handed weapon in two hands or a two-handed weapon, the weapon is treated as a light shield for the purposes of performing a shield bash attack on an opponent. The warder smashes with the butt of a spear-haft, the pommel of a greatsword, or the broadside of her axe. All are essentially the same and are treated as light shields for the purposes of shield bash attacks or martial maneuvers to be used with a weapon of this type (such as Iron Tortoise maneuvers that require a shield to function). The zweihander sentinel may always use her armament shield as an off-hand weapon, even if she has already attacked with her weapon in both hands.",
    "defensive reach ": "At 6th level, the warder has supreme control over his environment and the use of his weapon to defend himself and his allies. When wielding a non-reach two-handed weapon, the warder increases his reach by five feet for use with attacks of opportunity and counters. When wielding a two-handed reach weapon the warder threatens adjacent enemies and may attack them as though he was not wielding a reach weapon. This ability replaces the aegis class feature's range increase at 6th level.",
    "punishing defenses ": "At 12th level, the warder has gained a great deal of skill in using offense as his best defense. When making an attack of opportunity or when making an attack against a foe as part of a counter, he inflicts an additional 2d6 points of damage. This damage is not multiplied if the character scores a successful critical hit. This ability replaces the aegis class feature's range increase at 12th level."
  }

},
"Warlord": {
  "Bannerman": {
    "parent class:": "Warlord",
    "courageous defense ": "The bannerman is a combatant of grace and skill, and his faith in both himself as a symbol as well as in his allies assists his defense. When fighting with a ranged weapon (such as with a bow or a crossbow), or with a one-handed or light weapon in one hand and nothing in the other (or with a buckler and/or an inspiring banner, see below) and wearing medium or lighter armor, the bannerman gains a +1 dodge bonus to his Armor Class per four warlord levels. This replaces the bonus feat gained at 1st level.",
    "tactical presence ": "This class feature functions as normal, but the bannerman gains additional presence choices. Diplomat's Presence:  At 2nd level, the bannerman adds a +4 competence bonus to Bluff, Diplomacy, Intimidate and Sense Motive rolls while in this presence.      Fearsome Presence:  At 13th level, the bannerman's reputation in battle precedes him and an aura of his many victories inspires dread in his foes. Enemies of the bannerman within 30-ft. of his position are filled with dread as if under a  fear  spell (use the bannerman's Charisma modifier for the Will save DC and his initiator level as his caster level). Foes that succeed the saving throw are unaffected by the bannerman's fearsome presence for 24 hours.      Commander's Presence:  At 17th level, the bannerman is a true commander amongst warlords, allowing him to lend a readied maneuver to an ally within 30-ft. as a swift action. When he lends this maneuver, the maneuver is expended until the recipient initiates this maneuver (using the recipient's initiator level and Charisma modifier to determine the saving throw DC; if the recipient's initiator level is too low to initiate the maneuver, then the bannerman cannot lend the maneuver). He can only lend one maneuver at a time when using this presence, and if the bannerman stops using this presence, then the effect ends immediately (but the maneuver remains expended until recovered).      Inspiring Banner (Ex) [ ]   At 5th level, a bannerman's banner becomes a symbol of inspiration to his allies and companions. As long as the bannerman's banner is clearly visible and he is in a Golden Lion stance, all allies within 60 feet receive a +2 morale bonus on saving throws against fear and fatigue and a +2 morale bonus on attack and damage rolls. At 12th level, and at 19th level, these bonuses increase by +1. If the Golden Lion stance he is using grants a similarly typed bonus to attack, damage, or saving throws, then increase that bonus by the amount of the inspiring banner's bonus. The banner must be at least Small or larger and must be carried or displayed by the bannerman or his mount to function, and can be held while using a buckler.  This replaces the warlord's battle prowess class feature.        The Bannerman and his Banner  While trying to leave it to the player and GM to determine if a banner is acceptable for the character in the method of how it is carried, we wanted to be more easy and unrestricted with it. A bannerman's banner is intended to be able to be placed on any manner of item so long as it is displayed. Some official ideas for how a bannerman may carry a banner: as heraldry on a shield, on a small pole mounted to either his mount's saddle or to the back of his armor, a tabard that they wear prominently, or a standard that hangs from a polearm or spear. So long as that standard is carried upon his person where people can see it, he can inspire these allies.      Share Boost (Ex) [ ]   At 6th level, the bannerman's ability to inspire his troops allows him to share some of his martial prowess with an ally on occasion. Once per day he is able to initiate a boost as an immediate action to utilize a boost for an ally who is initiating a maneuver or making an attack that qualifies for the use of that boost. The boost shared uses the bannerman's initiator level and saving throw DC (if applicable). He can use this ability one additional time per day at 12th level and again at 18th level.  This replaces the dual boost class feature.",
    "inspiring banner ": "At 5th level, a bannerman's banner becomes a symbol of inspiration to his allies and companions. As long as the bannerman's banner is clearly visible and he is in a Golden Lion stance, all allies within 60 feet receive a +2 morale bonus on saving throws against fear and fatigue and a +2 morale bonus on attack and damage rolls. At 12th level, and at 19th level, these bonuses increase by +1. If the Golden Lion stance he is using grants a similarly typed bonus to attack, damage, or saving throws, then increase that bonus by the amount of the inspiring banner's bonus. The banner must be at least Small or larger and must be carried or displayed by the bannerman or his mount to function, and can be held while using a buckler. This replaces the warlord's battle prowess class feature. The Bannerman and his Banner  While trying to leave it to the player and GM to determine if a banner is acceptable for the character in the method of how it is carried, we wanted to be more easy and unrestricted with it. A bannerman's banner is intended to be able to be placed on any manner of item so long as it is displayed. Some official ideas for how a bannerman may carry a banner: as heraldry on a shield, on a small pole mounted to either his mount's saddle or to the back of his armor, a tabard that they wear prominently, or a standard that hangs from a polearm or spear. So long as that standard is carried upon his person where people can see it, he can inspire these allies.",
    "share boost ": "At 6th level, the bannerman's ability to inspire his troops allows him to share some of his martial prowess with an ally on occasion. Once per day he is able to initiate a boost as an immediate action to utilize a boost for an ally who is initiating a maneuver or making an attack that qualifies for the use of that boost. The boost shared uses the bannerman's initiator level and saving throw DC (if applicable). He can use this ability one additional time per day at 12th level and again at 18th level. This replaces the dual boost class feature."
  },
  "Desperado": {
    "parent class:": "Warlord",
    "weapon and armor proficiencies": "The desperado is proficient with with simple and martial weapons, and with firearms. They are proficient with light armor and with bucklers. This ability alters the warlord's weapon and armor proficiencies.",
    "trick shot training ": "A desperado adds  Tempest Gale  to his list of available disciplines and gains Sleight of Hand as a class skill.",
    "gunfighter ": "At 1st level, a desperado gains his choice of a blunderbuss, musket, or pistol. His starting weapon is battered, and only he knows how to use it properly. All other creatures treat his gun as if it had the broken condition. If the weapon already has the broken condition, it does not work at all for anyone else trying to use it. This starting weapon can only be sold for scrap (it's worth 4d10 gp when sold). The desperado also gains Gunsmithing as a bonus feat, and can upgrade this gun to masterwork quality for 300gp and one day of work, as if he were a gunslinger. In addition, he gains Amatuer Gunslinger as a bonus feat. He uses his desperado initiation modifier instead of his Wisdom modifier to determine the maximum amount of grit points he can have. This ability replaces the bonus feat gained at 1st level.",
    "fan the hammer ": "A desperado's hands are lightning-quick, and he seemingly seemingly draws, fires, and reloads his weapons on pure instinct. At 2nd level, a desperado gains Rapid Reload as a bonus feat, even if he does not meet the prerequisites, and applies that feat to any firearm he wields. At 5th level, a desperado can reload a two-handed firearm as if it were a one-handed firearm, and a one-handed firearm as if it were a hand or light crossbow. At 9th level, a desperado no longer provokes attacks of opportunity when firing or reloading his firearm. This replaces tactical presence (indomitable presence).",
    "daring grit ": "Through determination, verve, or otherwise dumb luck, a desperado is capable of forcing incredible feats of daring and skill through their own tenacity. In game terms, grit is a fluctuating measure of a desperado's ability to perform incredible actions in combat. Starting at 5th level, at the start of each day, a desperado gains a number of grit points equal to his desperado initiation modifier (minimum 1). His grit goes up or down throughout the day, but usually cannot go higher than his desperado initiation modifier (minimum 1), though some feats and magic items may affect this maximum. A desperado spends grit to accomplish deeds (see below), and regains grit in the following ways: Critical Hit with a Firearm:  Each time the desperado confirms a critical hit with a firearm attack while in the heat of combat, he regains 1 grit point. Confirming a critical hit on a helpless or unaware creature or on a creature that has fewer Hit Dice than half the desperado's character level does not restore grit. Killing Blow with a Firearm:  When the desperado reduces a creature to 0 or fewer hit points with a firearm attack while in the heat of combat, he regains 1 grit point. Destroying an unattended object, reducing a helpless or unaware creature to 0 or fewer hit points, or reducing a creature that has fewer Hit Dice than half the desperado's character level to 0 or fewer hit points does not restore any grit. When the desperado gains this ability, his Amateur Gunslinger feat is immediately traded for the Extra Grit feat, as normal. If the desperado already has gunslinger levels, he gains a bonus to the maximum amount of grit he can have each day equal to his desperado initiation modifier, but gains no extra grit at the start of each day. This ability replaces the remaining tactical presences gained at 5th and 9th levels. Daring Acts   With the GM's approval, a desperado can regain grit by performing daring acts. As a general rule, a daring act should be risky and dramatic. It should take a good deal of guts, and its outcome should have a low probability of success. If it is successful, the desperado regains 1 grit point. Before attempting a daring act, the player should ask the GM whether the act qualifies. Th GM is the final arbiter of what's considered a daring act, and can grant a regained grit point for a daring act even if the player does not ask beforehand whether the act qualifies.",
    "daring acts": "With the GM's approval, a desperado can regain grit by performing daring acts. As a general rule, a daring act should be risky and dramatic. It should take a good deal of guts, and its outcome should have a low probability of success. If it is successful, the desperado regains 1 grit point. Before attempting a daring act, the player should ask the GM whether the act qualifies. Th GM is the final arbiter of what's considered a daring act, and can grant a regained grit point for a daring act even if the player does not ask beforehand whether the act qualifies.",
    "deeds": "Desperados spend grit points to accomplish deeds. Most deeds grant the desperado some momentary bonus or effect, but there are some that provide longer lasting effects. Some deeds stay in effect as long as the desperado has at least 1 grit point. For the purposes of learning and performing deeds and for prerequisites, a desperado's effective gunslinger level is equal to his class level  -4. Unless otherwise noted, a deed can be performed multiple successive times, as long as the appropriate amount of grit is spent to perform the deed. At 5th level and again at 7th, 9th, 11th, 13th, and 15th levels, the desperado learns a deed that a gunslinger of his effective gunslinger level could learn. He may select deeds from both the standard gunslinger's list and those normally only available to specific gunslinger archetypes. This ability replaces dual tactical presence and warlord's presence.",
    "blackpowder prowess ": "The desperado is a skilled warrior with his chosen firearms and is capable of using them with incredible proficiency. Starting at 5th level, while the desperado maintains a Tempest Gale or Solar Wind stance, he gains a +1 competence bonus on attack rolls, damage rolls, and combat maneuver checks with using firearms. This bonus increases by +1 at 12th level and again at 19th level. This ability replaces battle prowess."
  },
  "Steelfist_Commando": {
    "parent class:": "Warlord",
    "weapon and armor proficiencies": "Steelfist commandos are proficient with all simple and martial weapons and with monk weapons, and they are proficient with light armor. Steelfist commandos are not proficient with shields. This replaces the warlord's standard weapon and armor proficiencies.",
    "disciplines": "The steelfist commando loses access to Primal Fury and Scarlet Throne, and gains access to the  Broken Blade  and  Steel Serpent  disciplines; Bluff, Heal, and Stealth are now class skills.",
    "bonus feats": "A steelfist commando can select rogue talents in place of his warlord bonus feats. Starting at 14th level, he can also select advanced rogue talents. This ability alters bonus feats, but does not cause the steelfist commando archetype to be incompatible with other archetypes that alter the bonus feats class feature.",
    "unarmed combat ": "At 1st level, the steelfist commando learns to use his body as the best weapon he can bring to any confrontation, He gains Improved Unarmed Strike as a bonus feat. At 3rd level, he gains Greater Unarmed Strike as a bonus feat. A steelfist commando's unarmed strike is treated as both a manufactured weapon and a natural weapon for the purpose of spells and effects that enhance or improve either manufactured weapons or natural weapons. This ability replaces the bonus feat gained at 1st level.",
    "dodge bonus ": "At 2nd level, the steelfist commando is especially capable of avoiding attacks and gains a +1 dodge bonus to his Armor Class. This improves by +1 at 6th level and every four levels after (to a maximum of +5 at 18th level).",
    "commando prowess ": "At 5th level, the prowess of the steelfist commando expresses itself in his mastery of the unarmed arts as well as in stealth. While in a martial stance, he adds a +1 competence bonus to attack and damage rolls, and +2 competence bonus to his CMB and CMD. This improves by +1 for attack and damage rolls and +2 to CMB and CMD at 12th level and again at 19th level. Additionally, while in a martial stance, he may add his Charisma modifier to Stealth rolls. This replaces the battle prowess class feature.",
    "powerful pugilist ": "At 8th level, the steelfist commando's skill allows him to better utilize his unarmed strikes to their fullest potential. When using his unarmed strike, he is considered one size category larger when determining his unarmed strike damage and when determining his CMB and CMD. If his target is flat-footed, he inflicts an additional 2d6 points of damage against his foe; this is precision damage and if a target would be immune to sneak attack, they are immune to this effect. This replaces the bonus feat gained at 10th level."
  },
  "Vanguard_Commander": {
    "parent class:": "Warlord",
    "weapon and armor proficiencies": "The vanguard commander is proficient with all simple and martial weapons, all armor and shields (except tower shields). This replaces the warlord's standard weapon and armor proficiencies.",
    "disciplines": "The vanguard commander gains access to  Iron Tortoise  and loses access to Solar Wind. Perception is no longer a class skill, Bluff is now a class skill.",
    "improved shield bash": "The vanguard commander gains the Improved Shield Bash feat as a bonus feat at 1st level. This replaces the bonus feat gained at 1st level, and bonus feats resume as normal at 6th level and on.",
    "warlord's gambit ": "The vanguard commander gains access to a new gambit, the Guardian's Gambit, and gains this as one of his two initial gambits known. Guardian's Gambit   Risk : The warlord attempts a successful charging shield bash attack against an opponent.  Reward : If the shield bash attempt is successful, the warlord and all allies within 30-ft. may make a free 5-ft. step, even if they have already made one this turn.      Daring Defense (Ex) [ ]   The vanguard commander rushes the enemy lines, heedless of personal danger, with bold charges and bolder personality. This headstrong determination gives rise to vanguard commanders having an almost uncanny luck at avoiding dangers. The vanguard commander may add his Charisma modifier to his Dexterity modifier to determine his Reflex save bonus. If the character is ever able to add his Charisma modifier to his Reflex save through use of another ability (for example. the paladin's divine grace) he may only add his Charisma modifier once to his Reflex save.  This replaces force of personality.    Defensive Prowess (Ex) [ ]   The vanguard commander lives to inspire his troops, and by training diligently to best defend himself in the midst of heavy combat he has developed techniques for higher survivability. While in a Golden Lion or Iron Tortoise stance, the vanguard commander reduces his armor check penalty by 1, gains a +1 competence bonus to his existing shield bonus to his Armor Class, and adds a +1 competence bonus to his CMD. This improves by +1 at 12th level, and again at 19th level.  This replaces the battle prowess class feature.    Heightened Defenses (Ex) [ ]   The vanguard commander is a capable warrior who can blend both defense and offense together with precision. The character gains an additional immediate action to be used for the purposes of initiating a counter on a round that he initiates a boost. He can use this additional immediate action a number of times per day equal to 1 + his Charisma modifier (minimum of 1).  This replaces the dual boost class feature.    Vanguard's Shield (Ex) [ ]   The vanguard commander is lightning fast with his shield for both defense and offense. Whenever the vanguard initiates a melee strike or uses a counter to defend against an attack from an adjacent foe, he may make a shield bash attempt as free action at his full base attack bonus against that creature.  This replaces the tactical assistance class feature.",
    "daring defense ": "The vanguard commander rushes the enemy lines, heedless of personal danger, with bold charges and bolder personality. This headstrong determination gives rise to vanguard commanders having an almost uncanny luck at avoiding dangers. The vanguard commander may add his Charisma modifier to his Dexterity modifier to determine his Reflex save bonus. If the character is ever able to add his Charisma modifier to his Reflex save through use of another ability (for example. the paladin's divine grace) he may only add his Charisma modifier once to his Reflex save. This replaces force of personality.",
    "defensive prowess ": "The vanguard commander lives to inspire his troops, and by training diligently to best defend himself in the midst of heavy combat he has developed techniques for higher survivability. While in a Golden Lion or Iron Tortoise stance, the vanguard commander reduces his armor check penalty by 1, gains a +1 competence bonus to his existing shield bonus to his Armor Class, and adds a +1 competence bonus to his CMD. This improves by +1 at 12th level, and again at 19th level. This replaces the battle prowess class feature.",
    "heightened defenses ": "The vanguard commander is a capable warrior who can blend both defense and offense together with precision. The character gains an additional immediate action to be used for the purposes of initiating a counter on a round that he initiates a boost. He can use this additional immediate action a number of times per day equal to 1 + his Charisma modifier (minimum of 1). This replaces the dual boost class feature.",
    "vanguard's shield ": "The vanguard commander is lightning fast with his shield for both defense and offense. Whenever the vanguard initiates a melee strike or uses a counter to defend against an attack from an adjacent foe, he may make a shield bash attempt as free action at his full base attack bonus against that creature. This replaces the tactical assistance class feature."
  }
},

"Zealot":{

"Excruciator": {
    "parent class:": "Zealot",
    "converting your character": "The excruciator is a class template suitable for the warder and zealot classes. When converting a character to a excruciator, the character loses or changes the following class features: Warder [ ] The Warder does not gain the extended defense class feature.   The warder gives up their first bonus feat (at 3rd level). Zealot [ ] The Zealot's zeal bonus does not increase at 5th and 15th levels.   The Zealot does not gain a conviction at 14th level.   The Zealot cannot grant a second maneuver with echoes of steel at 11th level.",
    "lore of the planes": "The excruciator may trade one of her available disciplines for the  Elemental Flux  discipline. This ability does not cause excruciator archetype to be incompatible with other archetypes that alter the maneuvers class feature or her available disciplines. She otherwise learns, readies, initiates maneuvers as a standard member of her base class. In addition, the excruciator may select akashic feats as bonus feats in addition to combat feats.",
    "cosmic agony ": "At 5th level, the excruciator gains the ability to establish a planar link which intensifies as she takes damage. Whenever the excruciator takes damage equal to or greater than her initiator level, she gains one point of temporary essence which lasts for 1 minute. The excruciator can have a maximum number of temporary essence from this ability equal to half her excruciator level. Once per round, the excruciator may intentionally harm herself to compound this link as a swift action taking damage equal to her initiator level, to enter a stance or use a boost, and gaining 1 point of temporary essence. This essence, in addition to any other essence the excruciator possesses, can be invested in the following ways: Blood for Blood : For every point of essence invested in this ability, the excruciator gains a +1 bonus on all damage rolls.   Enhanced Recuperation : When recovering maneuvers from this class, the excruciator recovers one additional maneuver for every point of essence invested in this ability.   Numb to the Suffering : For every point of essence invested in this ability, the excruciator gains DR 1/- that stacks with any other forms of DR the excruciator possesses.   Planar Resolution : The excruciator gains a +1 bonus on CMB and CMD in addition to any checks made in place of a CMB check for every point of essence invested in this ability At 11th level, essence can be invested in the following additional ways: Akashic Warden : For every 2 points of essence invested in this ability, the excruciator's reach increases by 5 feet   Deathless : For every point of essence invested in this ability, treat the excruciator's Constitution score as 2 higher for the purpose of determining when she dies from negative hit points.   Heavenpiercer : For every point of essence invested in this ability, the excruciator ignores 2 points of damage reduction, energy resistance, and hardness when attacking.   Warded Steps : For every point of essence invested in this ability, the excruciator gains a +1 bonus on AC against attacks of opportunity provoked from movement.",
    "mantle of pain ": "At 11th level, the excruciator learns to share the fruits of their suffering with those around them. Any creatures within the excruciator's collective or affected by their aegis share the benefits of any essence invested in the Cosmic Agony class feature.",
    "master of pain ": "At 14th level, the excruciator has become so accustomed to suffering that injuries no longer trouble them. The excruciator becomes immune to pain effects and the bleeding condition. The excruciator gains one point of temporary point of essence when targeted by a pain effect or when they reduce a creature to 0 hit points (this counts as essence gained through cosmic agony for determining the max amount of temporary essence that the excruciator can have)."
  },
  "Discordant_Crusader": {
    "parent class:": "Zealot",
    "maneuvers": "The dueling focus within the discordant crusader allows for a split focus of his talents as well as his ambiguously moral state. By embracing the tools and techniques of both good and evil, he may fulfil his mission without regard to conventional morality. A discordant crusader loses access to the Piercing Thunder discipline and adds  Black Seraph  and  Silver Crane  to his list of available disciplines. He otherwise learns, readies, and initiates maneuvers as a standard zealot. This ability alters maneuvers.",
    "moral ambiguity ": "A discordant crusader decides the nature of his own path, for good or ill. Starting at 1st level, the discordant crusader can initiate maneuvers with the Good and Evil descriptors regardless of his alignment, and regular use of these maneuver does not threaten to change his alignment.",
    "grey aura ": "Starting at 4th level, as long as the discordant crusader is psionically focused, his alignment cannot be discerned by spells and effects as long as his class level is higher than the effect's caster level. In addition, whenever he deals profane damage, he can expend his psionic focus as a free action to instead deal an equal amount of sacred damage. Alternatively, he can use this ability when he deals sacred damage to instead deal an equal amount of profane damage. This ability replaces the mission ability gained at 4th level. A discordant crusader never gains a mission.",
    "paired weapons ": "Starting at 5th level, a discordant crusader treats all Black Seraph discipline weapons as Silver Crane discipline weapons, and vice versa. This ability replaces defiance.",
    "divided focus ": "At 6th level, a discordant crusader gains  Discipline Focus  (Black Seraph) and Discipline Focus (Silver Crane) as bonus feats, even if he does not meet their prerequisites. This ability replaces the conviction gained at 6th level.",
    "twofold fire ": "Starting at 8th level, a discordant crusader gains the ability to augment his strikes from the Black Seraph and Silver Crane disciplines by spending power points. A discordant crusader can spend a maximum number of power points augmenting a maneuver equal to one plus one additional power point for every four initiator levels he possesses (up to a maximum of 6 at 20th level). If the zealot has the ability to augment his maneuvers in other ways, such as from another class feature or the maneuver itself, this cannot be combined with the augments granted by this ability; he must choose which augmentation type to use when initiating the maneuver. The discordant crusader can augment his Black Seraph and Silver Crane strikes in one or more of the following ways: For every power point the discordant crusader spends, this strike deals an additional 1d6 points of profane damage (if a Black Seraph strike) or sacred damage (if a Silver Crane strike).   For every 3 power points the discordant crusader spends, his target takes a  -4 penalty to their AC (if a Black Seraph strike) or on their attack rolls (if a Silver Crane strike) for one minute. A successful Will save (DC 10 + the strike's level + the discordant crusader's initiation modifier) negates this penalty. These penalties do not stack with themselves if the discordant crusader hits an opponent with multiple augmented strikes, although a creature can suffer from both penalties simultaneously. This ability replaces the mission augments gained at 8th level.",
    "twinned avatar ": "At 16th level, the discordant crusader can enter a two stances, one each from the Black Seraph and Silver Crane Disciplines, with a single swift action. Doing so is taxing for the discordant crusader, and he can only maintain the stances together for a number of rounds equal to 3 + his discordant crusader initiation modifier. These rounds do not need to be consecutive, but after he reaches this maximum he must wait an equal number of rounds before he can use this ability again. At 20th level, the discordant crusader can maintain a Black Seraph and a Silver Crane stance together indefinitely. This ability replaces metaphysical transcendence."
  },
  "Void_Prophet": {
    "parent class:": "Zealot",
    "maneuvers": "A void prophet loses access to the Golden Lion and Solar Wind disciplines and adds  Cursed Razor  and  Riven Hourglass  to her list of available disciplines. She gains Spellcraft as a class skill. She otherwise learns, readies, and initiates maneuvers as a standard zealot. This ability alters maneuvers.",
    "maneuvers readied": "Instead of recovering maneuvers like a standard zealot, a void prophet recovers one expended maneuver whenever she adds an unwilling creature to her collective, and recovers expended maneuvers equal to her void prophet initiation modifier (minimum 2) whenever a member of her collective is reduced to 0 or fewer hit points. Alternately, the void prophet may focus inwards, meditating and recovering a single maneuver as a standard action. This ability alters maneuvers readied.",
    "unwilling participant": "At 1st level, a void prophet gains  Unwilling Participant  as a bonus feat. The save DC to resist being added to the void prophet's collective is equal to 10 + 1/2 the void prophet's initiator level + the void prophet's initiation modifier.",
    "expanded collective": "At 1st level, a void prophet gains  Expanded Collective  as a bonus feat. This ability replaces compartmentalized aid.",
    "hollow faith ": "The void prophet shares the patient emptiness of the void with her enemies, inviting them to gaze into the pitiless nothing. Her devotion to the hollow hunger of the void spurs her to feats of psionic and martial prowess. At 1st level, she may add unwilling members to her collective as a move action, and may expend her psionic focus to add an unwilling member as a swift action instead. A void prophet never loses power points as a result of an unwilling member of her collective dying. At 4th level, the void prophet may designate any number of creatures in her collective as a free action at the beginning of her turn. Those creatures suffer a  -2 penalty to armor class, attack rolls, skill checks, caster level checks (such as those made to overcome spell resistance), and manifester level checks (such as those made to overcome power resistance). These penalties persist until those creatures leave the void prophet's collective or she is rendered unconscious or dead, or else chooses to rescind the penalties as a free action at the beginning of her turn. Starting at 8th level, a void prophet's hollow faith grants her the ability to augment her maneuvers by spending power points. A void prophet can spend a maximum number of power points augmenting a maneuver equal to one plus one additional power point for every four initiator levels she possesses (up to a maximum of 6 at 20th level). If the void prophet has the ability to augment her maneuvers in other ways, such as from another class feature or the maneuver itself, this cannot be combined with the augments granted by this ability; she must choose which augmentation type to use when initiating the maneuver. For every power point the void prophet spends when initiating a strike, the target of the strike has any insight and morale bonuses affecting them reduced by 1 for the duration of the bonus or 24 hours, whichever is shorter. This can reduce a bonus below 0 (effectively creating a penalty), but only if such a bonus is already affecting the creature. If the strike allows a saving throw, a successful save against it negates this effect. If it does not allow a saving throw, then the target can make a Will save (DC 10 + 1/2 the void prophet's initiator level + the void prophet's initiation modifier) to negate this effect.   If the void prophet spends 3 power points when initiating a counter and that counter successfully negates an attack against the void prophet (either through making the attack miss or otherwise preventing the attack from occurring), the void prophet may have the attack target a member of her collective instead. The redirected attack uses the same attack and damage rolls as the initial attack against the void prophet, but can target the member of the collective regardless of the range. This ability replaces mission.",
    "preach the silence ": "The void prophet knows how to take the hope she leeches from her victims and use it to empower her allies. Whenever a creature fails a saving throw to be added to her collective, the void prophet's allies in the collective gain a +1 morale bonus to attack rolls and saving throws for a number of rounds equal to her initiation modifier, or until the creature leaves her collective, whichever happens first. This bonus increases by +1 at 5th level and again every five void prophet levels thereafter. This ability replaces zeal.",
    "endless hunger ": "At 3rd level, the void prophet may attempt to add a creature who fails its saving throw against one of her strikes to her collective; if the strike does not normally allow a save, the creature must instead succeed at a Will save (DC 10 + the strike's level + the void prophet's initiation modifier) to avoid being added to the void prophet's collective. This is a free action that is part of the strike in question. If successful, the void prophet may not recover the strike that provoked this ability, though she may still recover 1 other maneuver as normal. The void prophet can only use this ability with strikes that allow a saving throw. This ability replaces commitment.",
    "the consuming void ": "At 16th level, the void prophet may expend the soul of an unwilling creature that has died and merged with her collective through her metaphysical transcendence ability as a free action. If she does, that creature dies (and leaves the collective) and the void prophet regains her psionic focus. She may not expend the souls of willing members of her collective. This ability alters and replaces metaphysical transcendence, but otherwise functions as that ability."
  }
}

}