{
  "basic": {
   "Acid Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it inflict acid damage. Creatures that take a direct hit from an acid bomb take an additional 1d6 points of acid damage 1 round later."
    },
   "Alchemical Simulacrum (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist gains the ability to create a lesser simulacrum. This works like the lesser simulacrum spell, except it costs 100 gp in alchemical materials per Hit Die of the simulacrum, requires 24 hours to grow, and decays into inert flesh rather than ice or snow if killed. The created simulacrum is a creature, not a supernatural effect."
    },
   "Alchemical Zombie (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist gains the ability to animate a relatively complete corpse as an alchemy-powered zombie. This process takes 1 hour and costs 100 gp in alchemical reagents per HD of the corpse being animated; the dead creature gains the zombie template. Zombies that are created in this manner count as undead created by animate dead for the purposes of determining how many undead the alchemist can control. The created zombie is a creature, not a supernatural effect."
    },
   "Anarchic Bombs*": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal chaotic divine damage. Lawful creatures that take a direct hit from an anarchic bomb must succeed at a Fortitude save or be staggered on their next turn. Against neutral creatures, anarchic bombs deal half damage, and such targets are not affected by their staggering effect. Anarchic bombs have no effect on chaotic-aligned creatures."
    },
   "Axiomatic Bombs*": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal lawful divine damage. Chaotic creatures that take a direct hit from an axiomatic bomb must succeed at a Fortitude save or be staggered on their next turn. Against neutral creatures, axiomatic bombs deal half damage, and such targets are not affected by their staggering effect. Axiomatic bombs have no effect on lawful creatures."
    },
   "Bitter Pill (Su)": {
     "Benefit":"The alchemist becomes bitter in flavor. Any creature that hits the bitter alchemist with a bite attack gains the sickened condition for 1 round unless it succeeds at a Fortitude save (DC = 10 + half the alchemists level + the alchemists Constitution modifier). Any creature that swallows the alchemist whole gains the nauseated condition for 1 round unless it succeeds at a Fortitude save (same DC as above). If the alchemist is trapped in the creatures gullet and it becomes nauseated, the creature vomits him back out immediately as a free action at the start of the creatures turn; the alchemist lands prone adjacent to the creature."
    },
   "Blackstar Bomb (Su)": {
     "Prerequisite":"void bomb",
     "Benefit":"This bomb crushes the target like a void bomb, then repels nearby creatures with a burst of gravity. The target takes damage as if hit by a void bomb. All other creatures within 5 feet of the target are subject to a bull rush. The alchemist uses his alchemist class level in place of his Combat Maneuver Bonus, and adds his Intelligence modifier in place of his Strength or Dexterity modifier to resolve the bull rush attempts. Creatures moved by a blackstar bomb are pushed directly away from the targets square."
    },
   "Void Bomb (Su)": {
     "Prerequisite":"alchemist 6",
     "Benefit":"By combining the spores from strange fungi with slivers from extradimensional voids, some drow alchemists create bombs that cause bursts of gravity capable of crushing those inside. Void bombs deals 1d4 points of bludgeoning damage, plus 1d4 points of bludgeoning damage for every 2 alchemist levels beyond 1st, instead of 1d6. A creature hit by the bomb must succeed at a Reflex save against the bombs DC. If it fails, it is knocked prone and cant get up for 1 round. If it succeeds, all of its movement speeds are reduced to 5 feet for 1 round. Other creatures within 5 feet of the bombs target take no damage, but must succeed at a Reflex save against the bombs DC or have all their movement speeds reduced to 5 feet for 1 round.  "
    },
   "Blinding Bomb (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose for it to detonate very brightly. Creatures that take a direct hit from a blinding bomb are blinded for 1 minute unless they succeed at a Fortitude save. Creatures in the splash area that fail their saves against the bomb are dazzled for 1 minute. This is a light effect."
    },
   "Boneshard Bomb*": {
     "Prerequisite":"alchemical zombie",
     "Benefit":"The alchemists bomb deals piercing damage instead of fire damage, and creatures that take a direct hit from a boneshard bomb must succeed at a Fortitude save or take 1d4 points of bleed damage in addition to normal damage. If a creature is killed by a boneshard bomb or the resulting bleed effect, its corpse immediately reanimates as an undead creature with the skeleton template. Skeletons that are created in this manner count as undead created by animate dead for the purposes of determining how many undead the alchemist can control."
    },
   "Bottled Ooze (Su)": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"The alchemist has learned how to preserve a sample of oozes in a sealed bottle, which he can prepare for use as an extract. When the alchemist activates the extract, he actually throws the bottle at a square within 30 feet, releasing the ooze, which reconstitutes and attacks the closest creature. The ooze is not under the alchemists control, but is otherwise treated as a summoned creature. The ooze remains for 1 round per caster level, and decays into powder when the duration expires. If the alchemist has the infusion discovery, another character can use the infused specimen. Creating a bottled ooze requires an extract with a level equal to the oozes CR (so a CR 4 gray ooze requires a 4th-level extract)."
    },
   "Breath Weapon Bomb": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"Instead of drawing the components of, creating, and throwing a bomb, the alchemist can draw the components, drink them, mix them within his body, and then expel them as a breath weapon as a standard action. This breath weapon is a 15-foot cone and has the same DC as the bomb. Each creature within the cone takes damage as if it had suffered a direct hit from the alchemists bomb, but succeeding at a Reflex save (DC = 10 + 1/2 the alchemists level + the alchemists Intelligent modifier) halves the damage. Unlike throwing normal bombs, drawing, drinking, and expelling breath weapon bombs does not provoke attacks of opportunity."
    },
   "Celestial Poisons (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist is able to infuse poisons with celestial power so they can affect evil creatures that are normally immune to poison. Any poison the alchemist administers to a weapon can affect undead and evil outsiders, bypassing their inherent immunities. Magical effects that negate poisons still apply. If a creature fails its save, the poison acts as normal, but may have no effect on the creature, depending on the effect of the poison (such as dealing Constitution damage to undead)."
    },
   "Change Alignment (Su)": {
     "Prerequisite":"Alchemist 12, infusion",
     "Benefit":"Once per day as part of his preparation of infusions, the alchemist can brew an infusion that shifts the imbibers alignment to good. This change in alignment lasts for 10 minutes per alchemist level. An unwilling creature receives a Will save to resist this change. The alchemist may have only one such infusion at any one time. The effects of this infusion may have serious repercussions for a creature suddenly struggling with a new outlook. Many see it as little more than forced insanity, and some good faiths outlaw its use."
    },
   "Infusion": {
     "Benefit":"When the alchemist creates an extract, he can infuse it with an extra bit of his own magical power. The extract created now persists even after the alchemist sets it down. As long as the extract exists, it continues to occupy one of the alchemists daily extract slots. An infused extract can be imbibed by a non-alchemist to gain its effects. Editors Note Can I use the infusion discovery to create an infused extract of a personal-range formula (such as true strike), which someone else can drink? Yes, you can. The design team may decide to close this loophole in the next printing of the Advanced Players Guide. [Source]"
    },
   "Cognatogen (Su)": {
     "Benefit":"The alchemist gains the ability to create a cognatogen, a mutagen-like mixture that heightens one mental ability score at the expense of a physical ability score. If the cognatogen enhances his Intelligence, it applies a penalty to his Strength. If it enhances his Wisdom, it applies a penalty to his Dexterity. If it enhances his Charisma, it applies a penalty to his Constitution. Otherwise, this ability works just like the mutagen ability (including the natural armor bonus). Anytime the alchemist would prepare a mutagen, he may instead prepare a cognatogen. All limitations of mutagens apply to cognatogens as if they were the same substancean alchemist can only maintain one mutagen or cognatogen at a time, a cognatogen that is not in an alchemists possession becomes inert, drinking a cognatogen makes a non-alchemist sick, and so on. When the effect of the cognatogen ends, the alchemist takes 2 points of ability damage to the ability score penalized by the cognatogen. The infuse mutagen discovery and the persistent mutagen class ability apply to cognatogens."
    },
   "Collective Memory (Su)": {
     "Prerequisite":"Cognatogen",
     "Benefit":"While under the effects of a cognatogen, the alchemist adds half his class level on all Knowledge skill checks and may attempt all Knowledge skill checks untrained. This bonus does not stack with the second Intelligence bonus granted by the mindchemist archetypes perfect recall class feature."
    },
   "Combine Extracts": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates an extract, he can place two formulae into one extract. When the extract is consumed, both formulae take effect. This extract has a level two levels higher than the highest-level formulae placed in the extract."
    },
   "Concentrate Poison": {
     "Benefit":"The alchemist can combine two doses of the same poison to increase their effects. This requires two doses of the poison and 1 minute of concentration. When completed, the alchemist has one dose of poison. The poisons frequency is extended by 50% and the save DC increases by +2. This poison must be used within 1 hour of its creation or it is ruined."
    },
   "Concussive Bomb": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it inflict sonic damage. Concussive bombs deal 1d4 points of sonic damage, plus 1d4 points of sonic damage for every odd-numbered level, instead of 1d6. Creatures that take a direct hit from a concussive bomb are deafened for 1 minute unless they succeed at a Fortitude save."
    },
   "Confusion Bomb (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemists bombs twist the targets perception of friend and foe. A creature that takes a direct hit from a confusion bomb takes damage from the bomb and is under the effect of a confusion spell for 1 round per caster level of the alchemist. Reduce the amount of normal damage dealt by the bomb by 2d6 (so a bomb that would normally deal 6d6+4 points of damage deals 4d6+4 points of damage instead).  FAQ \n  Should the confusion discovery require a saving throw? Yes. The target of the bomb may attempt at a save against the confusion effect (Will negates, using the bombs DC). This will be corrected in the next printing of PRG:UM. [Source]"
    },
   "Cursed Bomb*": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"When an alchemist creates a bomb, he can choose to have it deliver a debilitating curse. A creature that takes a direct hit from a cursed bomb must succeed at a Will save or be affected by bestow curse."
    },
   "Cytillesh Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can infuse it with cytillesh extract. Cytillesh bombs deal 1d4 points of damage, plus 1d4 points of damage for every odd-numbered level, instead of 1d6. Creatures that take a direct hit from a cytillesh bomb are sickened for 1 round per alchemist level unless they succeed at Fortitude saves. If a creature is rendered unconscious from this bomb or any other attack before it is able to remove the sickened condition, the victim loses all memory from the last hour and cannot form new memories for 8 hours. The lost and prevented memories might return later as dreams, and can be restored with a restoration spell. This discovery doesnt stack with other discoveries that alter an alchemists bomb."
    },
   "Delayed Bomb": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist can place a bomb so that it explodes a number of rounds after the alchemist ceases contact with the bomb. This delay can be any number of rounds as chosen by the alchemist, up to a number of rounds equal to his level. If at any point the alchemist reclaims possession of the delayed bomb, he can end the timer and prevent the bombs detonation. A delayed bomb detonates immediately if any other creature attempts to touch or move it, or if the bombs contents are removed from the vial (such as if the vial breaks). The bomb deals damage as if it scored a direct hit to any creature in the square with the bomb when it detonates, and splash damage (see Throw Splash Weapon) to all adjacent creatures as normal. An alchemist cannot have more than one delayed bomb at one time. If he creates another delayed bomb, the previous bomb becomes inert. Dispel magic can neutralize a delayed bomb, as can a successful Disable Device check (DC equals 10 + the alchemists level + the alchemists Intelligence modifier)."
    },
   "Demolition Charge": {
     "Prerequisite":"Alchemist 8.",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal damage to an object as if by a sunder combat maneuver. If the item is worn or held by an opponent, the item is considered the direct target, and the wearer/holder takes splash damage from the blast. If the object is unattended, a demolition charge deals an additional 2d6 points of damage on a direct hit. This bonus doesnt affect the bombs splash damage."
    },
   "Dilution": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"Once per day, the alchemist can dilute any one potion or elixir, creating two doses of the same potion from one. Diluting a potion costs a number of gp equal to one-quarter of the potions market value. A potion that has been diluted cannot be diluted again. This discovery cannot be used to dilute extracts or mutagens."
    },
   "Directed Bomb": {
     "Benefit":"The alchemist can cause his bombs to splash in a 15-foot cone instead of a 5-foot-radius burst. The alchemist chooses the direction of the cone. If the attack misses, roll an additional 1d8 to determine the direction of the blast from where the bomb lands. This discovery cant be combined with the explosive bomb discovery."
    },
   "Dispelling Bomb": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it dispel magic effects instead of deal damage. Creatures that take a direct hit from a dispelling bomb are subject to a targeted dispel magic spell, using the alchemists level as the caster level. This cannot be used to target a specific spell effect."
    },
   "Doppelganger Simulacrum (Su)": {
     "Prerequisite":"Alchemist 10, alchemical simulacrum",
     "Benefit":"The alchemist learns how to create a simulacrum, a soulless duplicate of his body, into which he can project his consciousness. As a full-round action, he may shift his consciousness from his current body to any one of his available doppelganger simulacra, which must be on the same plane as the alchemist. If killed in a simulacrum, he transfers to his own body automatically; if killed in his own body, he is dead. Unused simulacra (including his abandoned original body) appear to be lifeless corpses, though they do not decay. Creating a duplicate costs 1,000 gp in alchemical materials and requires 1 week to grow. The created simulacrum is a creature, not a supernatural effect."
    },
   "Ectoplasmic Bomb*": {
     "Benefit":"The alchemist can infuse her bombs with a special unction that damages incorporeal creatures and reveals the presence of undead creatures hiding in the area. Incorporeal creatures struck by an ectoplasmic bomb take full damage from the bomb. In addition, squares in the affected area of the bomb begin to faintly glow in the spaces where undead creatures have traveled in the last minute, including undead benefiting from invisibility or other forms of obscurity (such as ethereal jaunt), effectively creating a glowing trail. Any undead creatures in the affected area at the time of the explosion likewise glow faintly. This glowing effect lasts for 1 minute, and is otherwise identical to faerie fire."
    },
   "Elemental Mutagen": {
     "Benefit":"The alchemist chooses an element (air, earth, fire, or water). Whenever the alchemist imbibes a mutagen, he gains resistance 5 to the associated energy type and a +2 competence bonus on an associated skill check. This resistance increases by 5 and the competence bonus by 2 for each of the following discoveries the alchemist possesses: grand mutagen, greater mutagen, and true mutagen. The elements and their associated energies and skills are air (electricity, Fly), earth (acid, Climb), fire (fire, Acrobatics), and water (cold, Swim). An alchemist can select this discovery up to four times, but must choose a different element each time. An alchemist can gain the benefits of only one elemental mutagen at a time, selected when he imbibes the mutagen."
    },
   "Mutagen (Su)": {
     "Benefit":"This discovery gives the alchemist the mutagen class ability. (This discovery exists so alchemist archetypes who have variant mutagens, such as the mindchemist, can learn how to make standard mutagens.)"
    },
   "Elixir of Life": {
     "Prerequisite":"Alchemist 16",
     "Benefit":"Once per day, the alchemist can brew an elixir of life. This special concoction costs 25,000 gp to create and takes 1 hour of work. An elixir of life, when administered by the alchemist who brewed it, restores life to a dead creature as per the spell true resurrection. Alternatively, the alchemist himself may drink the elixir of life, after which point he is immediately targeted with a resurrection spell the next time he is killed. Used in this manner, the effects of an elixir of life persist only for a number of days equal to the alchemists Intelligence modifier; if he does not die before that time expires, the effects of the elixir of life end."
    },
   "Enhance Potion": {
     "Benefit":"A number of times per day equal to his Intelligence modifier, the alchemist can cause any potion he drinks to function at a caster level equal to his class level."
    },
   "Eternal Potion": {
     "Prerequisite":"Alchemist 16, extend potion",
     "Benefit":"If an alchemist drinks a potion that he extends, the effects of that potion become permanent until he chooses to make another potion effect permanent."
    },
   "Extend Potion": {
     "Benefit":"A number of times per day equal to his Intelligence modifier, the alchemist can cause any potion he drinks that does not have an instantaneous duration to function at twice its normal duration. This does not apply to extracts."
    },
   "Explosive Bomb": {
     "Benefit":"The alchemists bombs now have a splash radius of 10 feet rather than 5 feet (see Throw Splash Weapon). Creatures that take a direct hit from an explosive bomb catch fire, taking 1d6 points of fire damage each round until the fire is extinguished. Extinguishing the flames is a full-round action that requires a Reflex save. Rolling on the ground provides the target with a +2 to the save. Dousing the target with at least 2 gallons of water automatically extinguishes the flames."
    },
   "Explosive Missile": {
     "Prerequisite":"Alchemist 4",
     "Benefit":"As a standard action, the alchemist can infuse a single arrow, crossbow bolt, or one-handed firearm bullet with the power of his bomb, load the ammunition, and shoot the ranged weapon. He must be proficient with the weapon in order to accomplish this. When the infused ammunition hits its target, it deals damage normally and detonates as if the alchemist had thrown the bomb at the target. If the explosive missile misses, it does not detonate."
    },
   "Fast Bombs": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"An alchemist with this discovery can quickly create enough bombs to throw more than one in a single round. The alchemist can prepare and throw additional bombs as a full-round action if his base attack bonus is high enough to grant him additional attacks. This functions just like a full-attack with a ranged weapon. Editors Note If an alchemist has the Fast bombs discovery, can he use Rapid Shot, Two-Weapon Fighting, Improved Two-Weapon Fighting, haste, and similar abilities and effects to add more attacks? As written, yes, all of these apply because fast bombs functions just like a full-attack with a ranged weapon. [Source]"
    },
   "Feral Mutagen": {
     "Benefit":"Whenever the alchemist imbibes a mutagen, he gains two claw attacks and a bite attack. These are primary attacks and are made using the alchemists full base attack bonus. The claw attacks deal 1d6 points of damage (1d4 if the alchemist is Small) and the bite attack deals 1d8 points of damage (1d6 if the alchemist is Small). While the mutagen is in effect, the alchemist gains a +2 competence bonus on Intimidate skill checks."
    },
   "Flesh-Eating Bomb*": {
     "Benefit":"Your bomb deals damage one die step higher than normal (regular bombs deal d8s, concussive bombs deal 1d6, and so on), but they have no effect on inorganic matter. In addition, a creature with at least a +1 armor bonus to AC is less likely to be harmed; such creatures in the bombs splash radius take no damage on a successful Reflex save, and the target of a direct hit can attempt a Reflex save against the bombs save DC to take only half damage."
    },
   "Force Bomb": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it inflict force damage. Force bombs deal 1d4 points of force damage, plus 1d4 points of force damage for every odd-numbered level, instead of 1d6. Creatures that take a direct hit from a force bomb are knocked prone unless they succeed on a Reflex save."
    },
   "Frost Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it inflict cold damage. Creatures that take a direct hit from a frost bomb are staggered on their next turn unless they succeed on a Fortitude save."
    },
   "Glimmering Infusion (Sp)": {
     "Prerequisite":"Infusion",
     "Benefit":"The alchemist can expend any prepared extract to produce a cube of glowing motes that act as per glitterdust. The area must be adjacent to the alchemist and covers one 5-foot square per level of extract sacrificed, and the effects save DC is calculated using the level of the sacrificed extract."
    },
   "Grand Cognatogen (Su)": {
     "Prerequisite":"Alchemist 16, greater cognatogen discovery or greater cognatogen class ability",
     "Benefit":"The alchemists cognatogen now grants a +6 natural armor bonus, a +8 alchemical bonus to one mental ability score (Intelligence, Wisdom, or Charisma), a +6 alchemical bonus to a second mental ability score, and a +4 alchemical bonus to a third mental ability score. The alchemist takes a 2 penalty to his Strength, Dexterity, and Constitution as long as the cognatogen persists, and takes 2 points of ability damage to each physical ability score when the cognatogen ends."
    },
   "Greater Cognatogen (Su)": {
     "Prerequisite":"Alchemist 12, cognatogen discovery or cognatogen class ability",
     "Benefit":"The alchemists mutagen now grants a +4 natural armor bonus, a +6 alchemical bonus to one mental ability score (Intelligence, Wisdom, or Charisma), and a +4 alchemical bonus to a second mental ability score. The alchemist takes a 2 penalty on both associated physical ability scores as long as the mutagen persists, and takes 2 points of ability damage to both associated physical ability scores when the cognatogen ends."
    },
   "Grand Inspiring Cognatogen (Su)": {
     "Prerequisite":"Alchemist 16, greater inspiring cognatogen",
     "Benefit":"The alchemists inspiring cognatogen now grants a +4 dodge bonus to AC and a +4 bonus to Reflex saving throws; a 6 penalty to Strength and Constitution; and the effects of having the item lore, tenacious inspiration, and underworld inspiration investigator talents."
    },
   "Greater Inspiring Cognatogen (Su)": {
     "Prerequisite":"Alchemist 12, inspiring cognatogen",
     "Benefit":"The alchemists inspiring cognatogen now grants a +2 dodge bonus to AC and a +2 bonus to Reflex saving throws; a 4 penalty to Strength and Constitution; and the effects of having the amazing inspiration, eidetic recollection, and expanded inspiration investigator discoveries."
    },
   "Inspiring Cognatogen (Su)": {
     "Benefit":"An alchemist with this discovery learns how to make an inspiring cognatogen, a mutagen-like mixture that grants him inspiration (as the investigators class feature) at the expense of Strength and Constitution. Upon drinking the inspiring cognatogen, the alchemist gains a pool of inspiration equal to 1/2 his alchemist level + his Intelligence modifier (minimum 1). He also gains a +2 dodge bonus to AC and takes a 2 penalty to both Strength and Constitution. As a free action, the alchemist can add 1d6 to the result of an ability or skill check (including any he takes 10 or 20 on) by expending one use of inspiration. This ability works exactly like the investigators inspiration ability, except that the alchemist gains the pool of inspiration upon drinking the inspiring cognatogen, and any unspent inspiration is lost at the end of the cognatogens duration. If the alchemist already has access to inspiration, the inspiration added by the inspiring cognatogen is added to his inspiration pool, but each time he expends at least one use of inspiration while this ability is active, he must succeed at a DC 20 Will saving throw or become dazed for 1 round. He cannot use inspiration to augment this saving throw. All limitations of mutagens apply to an inspiring cognatogen as if they were the same substancean alchemist can only maintain one mutagen or cognatogen (either the standard cognatogen or the inspired cognatogen) at a time, a cognatogen not in an alchemists possession becomes inert, drinking a cognatogen makes non-alchemists sick, and so on. When the effect of an inspiring cognatogen ends, the alchemist takes 2 points of ability damage to Strength and Dexterity. The infuse mutagen discovery and the persistent mutagen class ability apply to an inspiring cognatogen."
    },
   "Grand Mutagen": {
     "Prerequisite":"Alchemist 16, greater mutagen",
     "Benefit":"The alchemists mutagen now grants a +6 natural armor bonus, a +8 alchemical bonus to one ability score (Strength, Dexterity, or Constitution), a +6 alchemical bonus to a second physical ability score, and a +4 alchemical bonus to a third physical ability score. The alchemist takes a 2 penalty to his Intelligence, Wisdom, and Charisma as long as the mutagen persists."
    },
   "Greater Mutagen": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"The alchemists mutagen now grants a +4 natural armor bonus, a +6 alchemical bonus to one physical ability score (Strength, Dexterity, or Constitution), and a +4 alchemical bonus to a second physical ability score. The alchemist takes a 2 penalty on both associated mental ability scores as long as the mutagen persists."
    },
   "Grease Bomb": {
     "Prerequisite":"Alchemist 6.",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it create a grease slick upon detonation. When a grease bomb detonates, it coats an area equal to the bombs splash radius in grease (as the grease spell) for 1 round per level. The DC of the Reflex save to avoid falling after a failed Acrobatics check is equal to 10 + 1/2 the alchemists level + the alchemists Intelligence modifier. A grease bomb cant affect items or armor."
    },
   "Plague Bomb (Su)": {
     "Prerequisite":"Alchemist 8, smoke bomb",
     "Benefit":"The effects of the smoke created by an alchemists bomb duplicates the effects of contagion instead of fog cloud, filling an area equal to twice the bombs splash area for 1 round per level. Editors Note \n    Does an alchemists inferno bomb, poison bomb, smoke bomb, or stink bomb cause bomb damage in addition to the special effect listed for those discoveries? \n "
    },
   "Smoke Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it create a cloud of thick smoke when it detonates. The cloud functions as fog cloud, filling an area equal to twice the bombs splash radius for 1 round per level. FAQ Does an alchemists inferno bomb, poison bomb, smoke bomb, or stink bomb cause bomb damage in addition to the special effect listed for those discoveries? Yes. For example, a smoke bomb deals bomb damage and creates an area of smoke. [Source]"
    },
   "Greater Alchemical Simulacrum (Su)": {
     "Prerequisite":"Alchemist 14, alchemical simulacrum",
     "Benefit":"The alchemist gains the ability to create a simulacrum. This works like the simulacrum spell, except it costs 100 gp in alchemical materials per Hit Die of the simulacrum, requires 24 hours to grow, and decays into inert flesh rather than ice or snow if killed. The created simulacrum is a creature, not a supernatural effect."
    },
   "Grounding Goo (Su)": {
     "Benefit":"The alchemists bomb applies a sticky residue after any damage from the bomb is resolved. If a creature damaged by the bomb has a non-magical fly speed, its flight is severely impaired, and it takes a penalty equal to the alchemists level on Fly checks for 1 minute."
    },
   "Healing Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it heal damage instead of dealing it. Creating a healing bomb requires the alchemist to expend an infused extract or potion containing a cure spell. A creature that takes a direct hit from a healing bomb is healed as if she had imbibed the infusion or potion used to create the bomb. Creatures in the splash radius are healed for the minimum amount of damage the cure spell is capable of healing. A healing bomb damages undead instead of healing them."
    },
   "Healing Touch (Ex)": {
     "Prerequisite":"Alchemist 6, spontaneous healing discovery or spontaneous healing class ability",
     "Benefit":"The alchemist gains the ability to heal other creatures. As a standard action, he may touch a creature and apply 1 rounds effect of his spontaneous healing discovery to that creature; this counts toward his spontaneous healing limit for the day. The alchemists daily limit for hit points healed by spontaneous healing increases to 5  his alchemist level. This ability only functions if the target is the same type of creature (humanoid, undead, and so on) as the alchemist."
    },
   "Spontaneous Healing (Ex)": {
     "Benefit":"The alchemist gains the ability to heal from wounds rapidly. As a free action once per round, he can heal 5 hit points as if he had the fast healing ability. He can heal 5 hit points per day in this manner for every 2 alchemist levels he possesses. If the alchemist falls unconscious because of hit point damage and he still has healing available from this ability, the ability activates automatically each round until he is conscious again or the ability is depleted for the day."
    },
   "Hellfire Bomb": {
     "Prerequisite":"Alchemist 9, explosive bomb, tiefling",
     "Benefit":"When the alchemist creates a bomb, he can have it act as an explosive bomb, but deal half of its damage as fire damage and half as unholy damage that is not subject to fire resistance or immunity."
    },
   "Holy Bombs": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal good divine damage. Evil creatures that take a direct hit from a holy bomb must succeed at a Fortitude save or be staggered on their next turn. Against neutral creatures, holy bombs deal half damage, and such targets are not affected by their staggering effect. Holy bombs have no effect on good-aligned creatures."
    },
   "Immolation Bomb": {
     "Prerequisite":"Alchemist 3",
     "Benefit":"When the alchemist creates a bomb, he can choose to have its substance coat the direct targets body, causing the bomb to deal its damage over time instead of all at once. The bombs effect lasts for a number of rounds equal to the number of damage dice the bomb would normally deal (for instance, a 5d6 bomb lasts for 5 rounds). When the bomb hits the direct target, the bomb deals 1d6 + the alchemists Intelligence modifier in damage, and those within the splash zone take damage equal to 1 + the alchemists Intelligence modifier. It repeats this damage against the direct target of the bomb each round the immolation bomb lasts, dealing the damage at the start of the alchemists turn. Splash damage is dealt again to any creature that is adjacent to the direct target when it takes damage from the immolation bomb. A creature taking damage from an immolation bombs direct hit can attempt to extinguish the flames as a full-round action that requires a Reflex save (DC = 10 + 1/2 the alchemists level + the alchemists Intelligence modifier). Because of the alchemical nature of this bomb, rolling on the ground does not grant a bonus on the saving throw, and dousing a creature with water does not stop it from burning. These bombs can be used underwater."
    },
   "Inferno Bomb": {
     "Prerequisite":"Alchemist 16, smoke bomb",
     "Benefit":"The effects of the smoke created by an alchemists bomb duplicate the effects of incendiary cloud instead of fog cloud, filling an area equal to twice the bombs splash radius for 1 round per level (see Throw Splash Weapon). Editors Note \n    Does an alchemists inferno bomb, poison bomb, smoke bomb, or stink bomb cause bomb damage in addition to the special effect listed for those discoveries? \n "
    },
   "Infuse Mutagen": {
     "Benefit":"When the alchemist creates a mutagen he can infuse it with an extra bit of his own magical power. This inflicts 2 points of Intelligence damage to the alchemist and costs 1,000 gp in rare reagents, but the mutagen created persists on its own and is not rendered inert if the alchemist creates another mutagen. This allows an alchemist to create different types of mutagens and keep them handy for emergencies. This does not allow an alchemist to gain the effects of multiple mutagensonly the most recently imbibed mutagen has any effect."
    },
   "Inspired Bomb (Su)": {
     "Benefit":"An alchemist with this discovery and a pool of inspiration (by way of a class feature, a feat, or the inspiring cognatogen discovery) can expend two uses of inspiration to increase the bombs damage by 1d6. The type of damage the bomb deals does not change. Unlike other a discoveries that affect bombs, this one can be applied to a bomb with another bomb discovery, though it cannot be applied to the same bomb more than once."
    },
   "Intuitive Understanding (Sp)": {
     "Prerequisite":"Alchemist 4, cognatogen",
     "Benefit":"If the alchemist drinks an extract of the divination school while under the effects of a cognatogen, his effective caster level temporarily increases by 2. In addition, while under the effects of a cognatogen, the alchemist may use augury once as a spell-like ability (caster level equal to his alchemist level). At 10th level, he can use divination instead."
    },
   "Lingering Spirit (Ex)": {
     "Prerequisite":"Alchemist 4",
     "Benefit":"The alchemist is familiar enough with the ties between his body and spirit that he lingers at deaths door far longer than a normal person. He treats his Constitution as 10 points higher than normal for the purpose of determining when hit point damage kills him (so an alchemist with a Constitution of 10 and this discovery dies at 20 hit points instead of 10). Reducing him to 0 Constitution or its equivalent (from ability damage, ability drain, Constitution penalties, and so on) makes him unconscious and comatose, but he is only killed after taking an additional 5 points of Constitution damage, drain, or penalty (in effect, the alchemist must be brought to 5 Constitution in order to be killed by these attacks)."
    },
   "Madness Bomb": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"The alchemists bombs do more than sear fleshthey sear the mind. A creature that takes a direct hit from a madness bomb takes damage from the bomb plus 1d4 points of Wisdom damage. Reduce the amount of normal damage dealt by the bomb by 2d6 (so a bomb that would normally deal 6d6+4 points of damage deals 4d6+4 points of damage instead). The amount of Wisdom damage dealt by a madness bomb is reduced by 1 for each madness bomb that hit the target in the past 24 hours, to a minimum of 1 point of Wisdom damage."
    },
   "Malignant Poison": {
     "Prerequisite":"Alchemist 10.",
     "Benefit":"As a full-round action, the alchemist can increase the save DC of any poison by 4 and increase its duration by 2 frequency increments (for example, large scorpion venom lasts 8 rounds instead of 6 and drow poison lasts 4 minutes instead of 2). Additionally, malignant poisons take effect immediately and do not have an onset time. This alchemical change lasts until the poisons extended duration ends or for a number of minutes equal to the alchemists level, whichever comes first. After that, the poison reverts back to its original state."
    },
   "Material Mastery (Ex)": {},
   "Mummification (Ex)": {
     "Prerequisite":"Alchemist 10, preserve organs",
     "Benefit":"The alchemist has mastered preserving flesh and applied this knowledge to his own body, turning himself into an undead-like creature. After learning this discovery, the alchemist must perform a 30-day regimen of a special diet, rigorous exercise, and drinking a mildly poisonous alchemical tea. At the end of this regimen, he falls unconscious for 24 hours, then awakens as a living mummy. The alchemists type does not change, but he becomes immune to cold, nonlethal damage, paralysis, and sleep."
    },
   "Preserve Organs (Ex)": {
     "Benefit":"The alchemist learns how to preserve and protect his vital organs, reducing the chance of a mortal wound. When a critical hit or sneak attack is scored on the alchemist, there is a 25% chance that the critical hit or sneak attack is negated and damage is instead rolled normally. Special: This does not stack with similar abilities that negate critical hits and sneak attacks (such as fortification armor). An alchemist can take this discovery up to three times; the effects stack, increasing this chance to 50% and then 75%."
    },
   "Nauseating Flesh": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"The alchemists body is suffused with poison. Any creature that bites, engulfs, or swallows the alchemist must make a Fortitude saving throw or be nauseated for 1d4 rounds. The alchemist with this discovery does not suffer the effect of the poison of his own nauseating flesh."
    },
   "Neutralizing Bomb": {},
   "Ooze Blight*": {
     "Benefit":"A target hit by your bomb loses the split special quality for 1d4 rounds. In addition, against creatures with the ooze type, this bomb deals untyped damage that bypasses all resistances."
    },
   "Parasitic Twin (Ex)": {
     "Prerequisite":"Vestigial Arm discovery x2",
     "Benefit":"The alchemists vestigial arms are part of a parasitic twin on his torso, consisting of a head, a torso, and two arms (from the vestigial arm discovery). Normally, the twin is mostly recessed within the alchemists body, with the visible arms acting like the vestigial arm discovery, though the alchemist can manifest or hide the twin as a standard action. The twin is helpless, fully subservient to the alchemist, and cannot be targeted or harmed. Once per day, if the alchemist succumbs to a mental effect that would make him unconscious, helpless, or not in control of his own actions (such as charm person, feeblemind, or hold person), he can reroll his saving throw; success means the twin absorbs the effect and the alchemist can ignore it. Using this ability sickens the alchemist for the duration of the absorbed effect (removing the effect from the twin ends the sickened condition), and he cannot use the twins arms during that time, though passive effects (such as from rings worn on the vestigial arm) continue normally."
    },
   "Vestigial Arm (Ex)": {
     "Benefit":"The alchemist gains a new arm (left or right) on his torso. The arm is fully under his control and cannot be concealed except with magic or bulky clothing. The arm does not give the alchemist any extra attacks or actions per round, though the arm can wield a weapon and make attacks as part of the alchemists attack routine (using two-weapon fighting). The arm can manipulate or hold items as well as the alchemists original arms (for example, allowing the alchemist to use one hand to wield a weapon, another hand to hold a potion, and the third hand to throw a bomb). The arm has its own hand and ring magic item slots (though the alchemist can still only wear two rings and two hand magic items at a time). Special: An alchemist may take this discovery up to two times."
    },
   "Phantom Limb": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist can manifest a ghostly, incorporeal arm that juts out from his torso. This phantom limb does not grant the alchemist any extra attacks or actions per round, and it cannot hold or grab anything (including incorporeal objects). The alchemist may use his phantom limb to make a touch attack against a foe as a standard action, scraping away at the very fibers of the victims soul. This attack deals 1d4 points of damage per alchemist level (Fortitude half ). Creatures that are immune to incorporeal attacks are immune to this damage, but otherwise the damage bypasses all forms of damage reduction except DR/epic. The alchemist may suppress or activate this ability as a free action, and can use his phantom limb for a number of rounds per day equal to 3 + his Intelligence modifier (these rounds need not be consecutive)."
    },
   "Pheromones (Su)": {
     "Benefit":"The alchemist exudes an imperceptible musk that grants him a permanent +3 competence bonus on Bluff, Diplomacy, and Intimidate checks."
    },
   "Pickled Quasit": {
     "Prerequisite":"Alchemist 10",
     "Benefit":"The alchemist has learned how to seal a quasit in a bottle, which he can prepare for use as an extract. When the alchemist activates the extract, he throws the bottle at a square within 30 feet, releasing the quasit. The quasit is not under the alchemists control, but is otherwise treated as a summoned creature. The quasit remains for 1 round per caster level, then collapses into its associated elements. If the alchemist has the infusion discovery, another character can use the infused specimen. Creating a pickled quasit requires a 4th-level extract."
    },
   "Plague Vector": {
     "Prerequisite":"Alchemist 14, plague bomb",
     "Benefit":"The effects of the alchemists plague bomb operate as normal except for the following changes. The chosen diseases save DC is equal to 10 + 1/2 the alchemists level + his Intelligence modifier. Any creatures affected by the chosen disease become vectors for it, spreading the disease to any creatures they come in physical contact with for a number of days equal to the alchemists Intelligence modifier (minimum 1). The save DC to avoid contracting the disease from the vector is the same as the DC used for this discovery."
    },
   "Poison Bomb": {
     "Prerequisite":"Alchemist 12, smoke bomb",
     "Benefit":"The effects of the smoke created by an alchemists bomb duplicates the effects of cloudkill instead of fog cloud, filling an area equal to twice the bombs splash radius for 1 round per level. Editors Note \n    Does an alchemists inferno bomb, poison bomb, smoke bomb, or stink bomb cause bomb damage in addition to the special effect listed for those discoveries? \n "
    },
   "Poison Conversion": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"By spending 1 minute, the alchemist can convert 1 dose of poison from its current type (contact, ingested, inhaled, or injury) to another type. For example, the alchemist can convert a dose of Small centipede poison (an injury poison) to an inhaled poison. This process requires an alchemy lab."
    },
   "Precise Bombs": {
     "Benefit":"Whenever the alchemist throws a bomb, he can select a number of squares equal to his Intelligence modifier that are not affected by the splash damage from his bombs. If the bomb misses, this discovery has no effect."
    },
   "Profane Bomb*": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal evil divine damage. Good creatures that take a direct hit from a profane bomb must succeed at a Fortitude save or be staggered on their next turn. Against a neutral creature, a profane bomb deals half damage, and the target is not affected by the bombs staggering effect. A profane bomb has no effect against evil-aligned creatures."
    },
   "Promethean Disciple": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"An alchemist with this discovery learns how to craft constructs by way of alchemical research rather than arcane magic. The alchemist gains Craft Construct as a bonus feat without needing to meet its requirements. The alchemist substitutes his number of ranks in Craft (alchemy) for his total caster level and must use Craft (alchemy) to create the construct. The DC to create the construct still increases for any necessary spells that the alchemist does not have access to. However, the alchemist can use extracts in place of spells as spell prerequisites."
    },
   "Psychoactive Bomb": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"Psychoactive bombs are mixed with neurotoxic extracts that heighten certain sensations. A creature struck by a psychoactive bomb takes a 1 penalty on saving throws against charm, emotion, fear, and pain effects, and the DC for Intimidate checks against the victim decreases by 2. This effect lasts for 1 hour per alchemist level. These penalties do not stack, and a creature can only be affected by a single psychoactive bomb at a time. A psychoactive bomb deals 1d6 fewer hit points of damage than normal. An alchemist must be at least 6th level before selecting this discovery."
    },
   "Psychokinetic Tincture": {},
   "Purging Mutagen": {},
   "Ranged Baptism (Su)": {
     "Prerequisite":"Alchemist 4",
     "Benefit":"When the alchemist uses holy water as a splash weapon, any squares subject to its effects (including creatures affected by splash damage) or that contain creatures subject to its effects are also affected as if by consecrate, for a number of rounds equal to the alchemists Intelligence modifier. Undead struck by holy water remain affected by the consecrate effect even if they leave the affected area."
    },
   "Remedy Extract": {
     "Prerequisite":"Alchemist 4",
     "Benefit":"When the alchemist creates an extract, he can add one non-magical alchemical remedy (such as an antitoxin) to it. When the extract is consumed, both the formula and the alchemical remedy take effect. The extract has a level 1 higher than normal. This discovery cannot be combined with other methods of combining multiple consumed items or extracts into one."
    },
   "Sandstone Solution (Su)": {
     "Benefit":"As a full-round action, the alchemist can convert any potion or extract into a solution that, when thrown or applied, solidifies sand or dirt to the hardness of stone for 1 hour, affecting an area with a radius of 10 feet  the level of the potion or extract. If this solution is thrown at or applied to stone, it instead causes a 5-foot cube of stone to become crumbly and soft for 1 minute, reducing its hardness by double the level of the potion or extract."
    },
   "Shock Bomb": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it inflict electricity damage. Creatures that take a direct hit from a shock bomb are dazzled for 1d4 rounds."
    },
   "Siege Bomb": {
     "Prerequisite":"Alchemist 12, explosive bomb",
     "Benefit":"As a standard action, the alchemist infuses a single piece of ammunition on a loaded siege weapon with the power of his bomb. As long as the siege weapon with this ammunition is fired before the start of the alchemists next turn, the ammunition does damage normally, and also deals the damage of the alchemists bomb. The splash radius of the bomb effect is 20 feet rather than 5 feet. Creatures that take the bombs damage (either direct damage or splash damage), take 1d6 points of fire damage each round until the fire is extinguished. Extinguishing the flames is a full-round action that requires a Reflex save. Rolling on the ground provides the target with a +2 bonus on the save. Dousing the target with at least 2 gallons of water automatically extinguishes the flames."
    },
   "Solid Ground (Su)": {
     "Benefit":"The alchemist launches an explosive paste bomb that bonds with any earthen surface. Each application of this paste deals no damage and affects a 5-foot-cube of dirt, loose soil, or stone, transmuting the earth for a number of minutes equal to the alchemists level. Creatures cannot use burrow, earthglide, or similar abilities (such as the meld into stone spell) while the ground remains transmuted in this way."
    },
   "Spell Knowledge": {},
   "Splitting Mutagen": {
     "Prerequisite":"Alchemist 12",
     "Benefit":"Once per day while under the effects of your mutagen, you can split into two identical copies of yourself as an immediate action after being damaged by a piercing or slashing weapon. Each copy has an ooze-like complexion, most often manifesting as a slimy sheen to his skin. You split your current hit points evenly between the copies. The copies use the same statistics, share the same resources, and have identical equipment (except artifacts, which only one copy has). Similarly, if one of the copies expends a charge or daily use from a magic item that a copy has, the charge or daily use is expended from both copies. If one copy drops or gives away an item, the duplicate item disappears from the other copy as well. The two copies act independently and each one has a full set of actions. At the end of your next turn, select one of the copies, which loses its ooze-like complexion as it becomes the alchemist; the other copy dissolves into a fine mist and dissipates. If one of the copies is destroyed before this happens, the remaining copy immediately becomes the alchemist, and you gain 1 permanent negative level. If both copies are destroyed simultaneously (such as from a fireball), both copies collapse into formless goo and you can only be restored to life via resurrection or similarly powerful magic."
    },
   "Sticky Bomb": {
     "Prerequisite":"Alchemist 10",
     "Benefit":"The effects of the alchemists bombs are persistent and continue to damage creatures for 1 round after the initial damage. Creatures that take a direct hit from a sticky bomb take the splash damage 1 round later. Bombs that have effects that would normally occur 1 round later instead have those effects occur 2 rounds later."
    },
   "Sticky Poison": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"Any poison the alchemist creates is stickywhen the alchemist applies it to a weapon, the weapon remains poisoned for a number of strikes equal to the alchemists Intelligence modifier."
    },
   "Stink Bomb": {
     "Prerequisite":"Smoke bomb",
     "Benefit":"The effects of the smoke created by an alchemists bomb can duplicate the effects of stinking cloud instead of fog cloud, filling an area equal to twice the bombs splash radius for 1 round. Editors Note \n    Does an alchemists inferno bomb, poison bomb, smoke bomb, or stink bomb cause bomb damage in addition to the special effect listed for those discoveries? \n "
    },
   "Strafe Bomb (Su)": {
     "Benefit":"The alchemist can throw bombs that splash in a 40-foot line rather than affecting a radius. The line starts at the alchemist and extends away from him in the direction he chooses. The alchemist designates one creature in the squares affected by the line to be the target of the bomb and makes his attack roll against that creature; all other squares in the line take splash damage. Special: If the alchemist has the explosive bomb discovery and throws an explosive strafe bomb, the line of splash damage is 80 feet long instead of 40 feet."
    },
   "Sunlight Bomb (Su)": {
     "Prerequisite":"Alchemist 10, blinding bomb",
     "Benefit":"The alchemist can throw bombs that explode with a searing radiance equivalent to that of sunlight and that act as blinding bombs. Undead, fungi, molds, oozes, slimes, and creatures to which sunlight is harmful or unnatural take +2 damage per die from the bomb. Undead that are harmed by sunlight and that fail their saves against the bomb are staggered for 1 round."
    },
   "Syringe Stirge (Su)": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"As a full-round action, you can expend two daily uses of bombs to create a syringe stirge, a tiny construct primed with a bomb (if you have multiple types of bombs, you must select which type the syringe stirge carries when created). Undirected, they take no actions except to flock around you in your square and follow you as best they can. They can be attacked normally, but gain cover while occupying your square. As a swift action, you can order one of your syringe stirges to attack an enemy it can see. Once ordered to attack that enemy, the syringe stirge will continue to attack every round, attempting to attach and deliver its payload A syringe stirge has all of the statistics of a stirge but lacks the blood drain ability. If it ends its turn attached to an opponent, it injects your bomb into the opponents bloodstream, dealing damage as a direct hit plus the alchemists Intelligence modifier (as the Throw Anything featthis injection is a direct attack and doesnt deal splash damage. A syringe stirge dies immediately after injecting its bomb. A syringe stirge lasts for 1 minute per alchemist level or until destroyed; if it has not attached to an enemy before the end of its life span, it and its bomb payload fall inert."
    },
   "Tainted Infusion": {
     "Prerequisite":"Delayed bomb, infusion",
     "Benefit":"The alchemist can mask murder behind beneficence. When preparing an extract with the infusion discovery, he can lace the extract with one of his bombs as long as the extract has a duration greater than instantaneous. If he chooses, the alchemist can reduce the duration of the extract to 1 round. As soon as the extracts duration expires, it detonates, dealing 150% of the alchemists bomb damage to the drinker. This effect does not produce a splash radius. Producing a tainted extract consumes both an infusion slot and a daily bomb use."
    },
   "Tanglefoot Bomb (Su)": {
     "Benefit":"A creature that takes a direct hit from a tanglefoot bomb must save against the bombs DC or be entangled and glued to the floor as if it had failed its save against a tanglefoot bag. Creatures in the splash area that fail their saves are entangled but not glued to the floor; those who make this save are not entangled at all."
    },
   "Tentacle (Ex)": {
     "Benefit":"The alchemist gains a prehensile, arm-length tentacle on his body. The tentacle is fully under his control and cannot be concealed except with magic or bulky clothing. The tentacle does not give the alchemist any extra attacks or actions per round, though he can use it to make a tentacle attack (1d4 damage for a Medium alchemist, 1d3 damage for a Small one) with the grab ability. The tentacle can manipulate or hold items as well as the alchemists original arms can (for example, allowing the alchemist to use one hand to wield a weapon, the tentacle to hold a potion, and the third hand to throw a bomb). Unlike an arm, the tentacle has no magic item slots."
    },
   "Thorny Bomb (Su)": {
     "Benefit":"When the alchemist creates a bomb, he can choose to have it deal piercing damage. Thorny bombs count as magic weapons for the purpose of overcoming damage reduction."
    },
   "Tumor Familiar (Ex)": {
     "Benefit":"The alchemist creates a Diminutive or Tiny tumor on his body, usually on his back or stomach. As a standard action, the alchemist can have the tumor detach itself from his body as a separate creature vaguely resembling a kind of animal suitable for a familiar (bat, cat, and so on) and move about as if it were an independent creature. The tumor can reattach itself to the alchemist as a standard action. The tumor has all the abilities of the animal it resembles (for example, a batlike tumor can fly) and familiar abilities based on the alchemists caster level (though some familiar abilities may be useless to an alchemist). The tumor acts as the alchemists familiar whether attached or separated (providing a skill bonus, the Alertness feat, and so on). When attached to the alchemist, the tumor has fast healing 5. An alchemists extracts and mutagens are considered spells for the purposes of familiar abilities like share spells and deliver touch spells. If a tumor familiar is lost or dies, it can be replaced 1 week later through a specialized procedure that costs 200 gp per alchemist level. The ritual takes 8 hours to complete."
    },
   "Volumizer (Su)": {
     "Benefit":"The alchemist can use an extract slot of any level to create a reactive tablet that purifies water and doubles its volume. This works like purify food and drink for a maximum volume of water equal to 1 gallon for each level the alchemist has  the level of the extract slot the alchemist used to create the tablet. Additionally, if the alchemist has a receptacle of sufficient volume to gather the water, the tablet doubles the volume of pure water. The water volume increases over the course of 1 minute, but the effect stops before it can create significant water pressure on a container thats not large enough to hold the entire volume. An unused tablet remains usable until the next time the alchemist recovers extract slots."
    },
   "Wings (Ex)": {
     "Prerequisite":"Alchemist 6",
     "Benefit":"The alchemist gains bat-like, bird-like, or insect-like functional wings, allowing him to fly as the fly spell for a number of minutes per day equal to his caster level. These minutes do not need to be consecutive, but they must be spent in 1-minute increments. Special: An alchemist can select this discovery multiple times; each time he does so, he adds his caster level to the number of minutes per day that he can fly with the wings. This flight is an extraordinary ability."
    },
   "Change Alignment, Greater (Su)": {
     "Prerequisite":"Alchemist 20, change alignment discovery, infusion",
     "Benefit":"The effects of the alchemists change alignment infusion become permanent and can only be reversed by a wish or miracle. A permanent, forced change of alignment may be devastating, and some believe it is little better than zealous slavery or mind control. Others consider a good alignment brought about by any means but purity of heart an affront to freedom. This discovery remains controversial at best."
    },
   "Alter Simulacrum (Su)": {
     "Prerequisite":"Alchemist 10, alchemical simulacrum",
     "Benefit":"The alchemist gains the ability to alter the physical appearance of any alchemical simulacrum he creates. This functions as a sculpt simulacrum spell. This process requires careful application, taking 10 minutes to complete and alchemical components worth 50 gp. The simulacrum cannot move and is considered helpless while being altered in this manner."
    },
   "Blending Body (Ex)": {
     "Prerequisite":"None",
     "Benefit":"The color of the alchemists skin better absorbs light, letting him remain better hidden in darkness. When in dim light, the miss chance due to concealment increases to 50% (rather than 20%); this does not grant total concealment, it just increases the miss chance."
    },
   "Bottled Assistant (Sp)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist learns to create an alchemical assistant to aid him on routine tasks of alchemy and medicine. Creating a bottled assistant takes 10 minutes, and the alchemist can only have one bottled assistant created or in use at a time. At any point as a standard action, he may pour out the contents of the bottle into an open space to grow his bottled assistant nearly instantly; this functions as a phantom caretaker spell, using the alchemists level as his caster level. In addition to its normal abilities, the assistant has a Craft (alchemy) skill bonus equal to the alchemists skill bonus. It can identify the properties of a magical potion using Craft (alchemy) the same way the alchemist can, and can create alchemical items using its skills (though it must be given materials). It is treated as having both the Brew Potion and Cooperative Crafting feats in order to help the alchemist create potions, but it cannot make use of the Brew Potion feat on its own to make potions (only to help the alchemist via the Cooperative Crafting feat)."
    },
   "Darkness Bomb (Su)": {
     "Prerequisite":"None",
     "Benefit":"When the alchemist creates a bomb, he can choose to have it create an area of shadows when it detonates. The shadows function as darkness, lowering the light level in an area equal to twice the bombs splash radius for 1 round per level. A creature hit directly by the darkness bomb has its energy sapped by the magical darkness, making it fatigued for 1 minute. This cannot cause a creature that is already fatigued to become exhausted."
    },
   "Extinguishing Touch (Ex)": {
     "Prerequisite":"None",
     "Benefit":"The alchemist can create a fine black powder from his hand that extinguishes fires and small light sources. This essentially allows him to cast snuff at will, but with a range of touch. Touching a small fire to extinguish it does not damage the alchemist."
    },
   "Keen Sight (Ex)": {
     "Prerequisite":"None",
     "Benefit":"The alchemist makes alterations to his senses to greatly improve his visual perception. The alchemist gains low-light vision and darkvision 60 feet. If the alchemist already has darkvision, its range is increased by 30 feet instead."
    },
   "Perfect Sight (Ex)": {
     "Prerequisite":"Alchemist 12, keen sight",
     "Benefit":"The alchemist wards his vision with alchemical protection, making him immune to blindness."
    },
   "Shadowmeld Compound (Sp)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist can create an alchemical compound infused with shadowstuff that, when coated on an object, melds it into darkness. Creating this compound takes 10 minutes, and the alchemist can only create one shadowmeld compound every 24 hours. He can only have one shadowmeld compound in existence at a time; creating another renders any previously made compound that has not yet been used inert (a compound that has already been used and is still in effect continues to function). The compound acts as a shadow courier spell, using the alchemists level as his caster level, letting him hide an object within the shadow of a creature. The object must be on the shadow of the recipient of the shadow courier effect at the time of applying the compound."
    },
   "Terror Bomb (Su)": {
     "Prerequisite":"Alchemist 8",
     "Benefit":"The alchemist can create a bomb containing psychotropic chemicals that instill fear in those exposed to it. A creature hit directly by the bomb must make a Will save or become frightened for 2d4 rounds. A creature caught in the splash area must make a Will save or be shaken for 1d4 rounds instead. This is a mind-affecting fear effect."
    },
   "Umbral Bomb (Su)": {
     "Prerequisite":"Alchemist 6, darkness bomb",
     "Benefit":"The alchemists bomb creates shadows as deeper darkness, lowering the light level in an area equal to twice the bombs splash radius for 1 round per level. A creature hit directly by the umbral bomb has its energy sapped by the magical darkness, making it exhausted for 1 minute. Creatures caught in the blast radius that fail their Reflex save are fatigued for 1 minute; this cannot make a creature already fatigued become exhausted."
    }
  },
  "grand": {
    "Awakened Intellect": {
      "Prerequisite": "Grand discovery",
      "Benefit": "The alchemists constant exposure to strange chemicals has expanded his mind. His Intelligence score permanently increases by 2 points."
    },
    "True Mutagen": {
      "Prerequisite": "Grand discovery, grand mutagen discovery",
      "Benefit": "The alchemists mutagen now grants a +8 natural armor bonus and a +8 alchemical bonus to Strength, Dexterity, and Constitution. The alchemist takes a 2 penalty to his Intelligence, Wisdom, and Charisma as long as the mutagen persists."
    },
    "Fast Healing": {
      "Prerequisite": "Grand discovery",
      "Benefit": "The alchemists flesh responds to damage with shocking speedhe gains fast healing 5."
    },
    "Eternal Youth": {
      "Prerequisite": "Grand discovery",
      "Benefit": "The alchemist has discovered a cure for aging, and from this point forward he takes no penalty to his physical ability scores from advanced age. If the alchemist is already taking such penalties, they are removed at this time."
    },
    "Philosophers Stone": {
      "Prerequisite": "Grand discovery",
      "Benefit": "The alchemist learns how to create a philosophers stone, and can do so once per month at no cost. Creating a philosophers stone takes 1 day of work."
    },
    "Poison Touch": {
      "Prerequisite": "Grand discovery",
      "Benefit": "The alchemist gains a poisonous touch, as if under the effects of a poison spell. He can suppress or activate this ability as a free action. The physical appearance of how the alchemist generates and delivers his poisonous touch varies from alchemist to alchemist."
    }
  }
  }