{
  "Paizo, Inc. – Investigator Talentsâ\u0080\u008e": {},
  "Alchemist Discovery (Ex)": {
    "Benefit": "The investigator can select one of the following alchemist discoveries as an investigator talent: combine extracts, concentrate poison, dilution, elixir of life, enhance potion, eternal potion, extend potion, infusion, mutagen, and poison conversion. When selecting an alchemist discovery, he must be high enough level to qualify for that discovery, using his investigator level as his alchemist level to determine if he qualifies. This talent can be selected multiple times; each time grants a new alchemist discovery. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Amazing Inspiration (Ex)": {
    "Prerequisite": "Investigator 7th level",
    "Benefit": "When using inspiration, the investigator rolls a d8 instead of a d6. At 20th level, the investigator rolls 2d8 and adds both dice to the result. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Applied Engineering (Ex)": {
    "Benefit": "The investigator can leverage his knowledge of engineering to solve tasks that normally require brute strength or keen eyes. He can expend one use of inspiration as a full-round action to study an object or area and attempt a Knowledge (engineering) check. On his next turn, he can use the result of that Knowledge (engineering) check in place of a Strength check to break the object or in place of a Perception check to locate hidden doors or compartments in that area. Pathfinder Player Companion: Advanced Class Origins  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Tom Phillips, Stephen Radney-MacFarland, and Owen K.C. Stephens."
  },
  "Blinding Strike* (Ex)": {
    "Prerequisite": "Investigator 17th level",
    "Benefit": "When the investigator deals damage with studied strike, the opponent must succeed at a Fortitude saving throw or be permanently blinded. A successful saving throw reduces this to dazzled for 1d4 rounds. The DC for this Fortitude save is equal to 10 + 1/2 the investigators level + his Intelligence modifier. This talent has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GMs discretion). Blindness can be cured by heal, regeneration, remove blindness/deafness, or similar abilities. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Combat Inspiration (Ex)": {
    "Prerequisite": "Investigator 9th level",
    "Benefit": "When an investigator uses inspiration on an attack roll or saving throw, he expends one use of inspiration instead of two. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Confusing Strike* (Ex)": {
    "Prerequisite": "Investigator 19th level",
    "Benefit": "When the investigator deals damage with studied strike, the opponent must succeed at a Fortitude saving throw or become confused for 1d4+1 rounds. A successful saving throw reduces the duration to 1 round. The DC for this Fortitude save is equal to 10 + 1/2 the investigators level + his Intelligence modifier. Constructs, mindless creatures, oozes, plants, undead, incorporeal creatures, and creatures immune to critical hits are not affected by this ability. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Deafening Strike* (Ex)": {
    "Prerequisite": "Investigator 15th level",
    "Benefit": "When an investigator deals damage with studied strike, the opponent must succeed at a Fortitude saving throw or become permanently deafened. A successful saving throw reduces the duration of this effect to 1 round. The DC for this save is equal to 10 + 1/2 the investigators level + his Intelligence modifier. This talent has no effect on deaf creatures. Deafness can be cured by heal, regeneration, remove blindness/deafness, or similar effects. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Device Talent (Ex)": {
    "Benefit": "The investigator can use the Use Magic Device skill even if not trained in that skill. If the investigator is trained in Use Magic Device, he can use the inspiration ability with that skill without expending uses of inspiration. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Domino Effect* (Ex)": {
    "Prerequisite": "Investigator 5th level",
    "Benefit": "When the investigator uses studied strike, he uses his opponents against each other and sets himself up for his next move. Whenever he successfully deals damage to an opponent with studied strike, as a free action the investigator can apply the effects of studied combat to an opponent adjacent to the first. Pathfinder Player Companion: Advanced Class Origins  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Tom Phillips, Stephen Radney-MacFarland, and Owen K.C. Stephens."
  },
  "Effortless Aid (Ex)": {
    "Benefit": "The investigator can use an aid another action as a move action instead of as a standard action. An investigator can expend one use of inspiration to instead perform an aid another action as a swift action. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Eidetic Recollection (Su)": {
    "Prerequisite": "Investigator 11th level",
    "Benefit": "An investigator can always choose to take 10 on any of his Knowledge checks, even if hes in immediate danger or distracted. An investigator may expend one use of inspiration to take 20 on a Knowledge skill check even if hes in immediate danger or distracted. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Empathy (Ex, Su)": {
    "Prerequisite": "Investigator 5th level",
    "Benefit": "When attempting a Sense Motive check, the investigator makes two d20 rolls and takes the higher result. If an investigator uses inspiration on a Sense Motive check, he rolls the inspiration dice twice and takes the higher result. Once per day, the investigator can expend one use of inspiration to target a single creature that he can see and hear within 30 feet. Upon doing so, the investigator detects the surface thoughts of the targets mind, as if he concentrated for 3 rounds while using the detect thoughts spell, unless the creature succeeds on a Will saving throw. The DC of this save is 10 + 1/2 the investigators level + his Intelligence modifier. If the target fails, the investigator can continue to detect the surface thoughts of the target creature for a number of rounds equal to 1/2 his investigator level. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Expanded Inspiration (Ex)": {
    "Benefit": "An investigator can use his inspiration ability when attempting Diplomacy, Heal, Perception, Profession, and Sense Motive checks without expending uses of inspiration, provided hes trained in the skill. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Greater Combat Inspiration (Ex)": {
    "Prerequisite": "Investigator 19th level, combat inspiration",
    "Benefit": "Choose a single weapon type (such as sword cane or short sword). As long as the investigator has at least 1 inspiration point in his inspiration pool, he no longer has to expend a use of inspiration to use that ability with attacks made with this weapon. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Hidden Agendas (Ex)": {
    "Prerequisite": "Investigator 11th level",
    "Benefit": "An investigator learns to obscure his thoughts and endeavors from prying eyes and even intrusive magic. When an investigator uses inspiration while attempting a Bluff check to pass secret messages or attempting a Linguistics check to create forgeries, he can roll his inspiration dice twice and take the higher result. In addition, the investigator can use inspiration when attempting a saving throw against a divination spell or effect without expending a use of inspiration. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Inspirational Expertise (Ex)": {
    "Prerequisite": "Investigator 7th level",
    "Benefit": "When an investigator succeeds at a Knowledge check to identify a monsters special powers or vulnerabilities, he can expend one use of inspiration as a swift action to grant allies within 30 feet that can hear him a +4 insight bonus on attack rolls against that monster or type of monster for 1 round. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Inspired Alertness (Ex)": {
    "Benefit": "Whenever the investigator becomes flat-footed, he can expend one use of inspiration to ignore that condition. He must be conscious to do so, and must decide to do so when he becomes flat-footed. Using this ability doesnt require an action. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Inspired Intelligence (Ex)": {
    "Benefit": "An investigator can add his inspiration die to all Knowledge, Linguistics, or Spellcraft checks without expending a use of inspiration, even those hes not trained in. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Inspired Intimidator (Ex)": {
    "Benefit": "When the investigator succeeds at an Intimidate check to demoralize an opponent, he can expend one use of inspiration to automatically increase the result of the check by 5 for the purpose of determining the duration of the demoralize effect. He can choose to spend multiple uses to inspiration in this manner to further increase the duration of the demoralize effect. He must be trained in Intimidate to take this talent. The underworld inspiration investigator talent has no effect on this talent. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Item Lore (Ex)": {
    "Prerequisite": "Investigator 7th level",
    "Benefit": "An investigator can use Spellcraft to identify the properties and command words of magic items without the use of detect magic or similar spells. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Numerical Alchemy (Su)": {
    "Benefit": "The investigators skill with mental mathematics allows him to know exactly which muscle movements are necessary to mix an extract in the quickest, most efficient way. The investigator can expend one use of inspiration to mix an extract in 1 round (as opposed to 1 minute). Pathfinder Player Companion: Disciples Doctrine  2018, Paizo Inc.; AuthorSaif Ansari, Mara Lynn Butler, Jeffrey Hersh, Andrew Hoskins, Lyz Liddell, Luis Loza, and Linda Zayas-Palmer."
  },
  "Numerical Alchemy, Greater (Su)": {
    "Prerequisite": "Investigator 11, numerical alchemy",
    "Benefit": "The investigator can calculate his movements and account for his reactions to danger or unexpected situations with lightning speed. He can expend a use of inspiration to mix an extract as a standard action. Pathfinder Player Companion: Disciples Doctrine  2018, Paizo Inc.; AuthorSaif Ansari, Mara Lynn Butler, Jeffrey Hersh, Andrew Hoskins, Lyz Liddell, Luis Loza, and Linda Zayas-Palmer."
  },
  "Numerical Strike* (Ex)": {
    "Prerequisite": "Investigator 5",
    "Benefit": "Once per day when the investigator has confirmed a critical hit with a studied strike, he can deal average damage instead of rolling damage as normal. This includes the damage dealt by the successful attack as well as the additional damage from the studied strike. He can expend a use of inspiration to use this ability a second time per day. Using this ability doesnt require an action. Pathfinder Player Companion: Disciples Doctrine  2018, Paizo Inc.; AuthorSaif Ansari, Mara Lynn Butler, Jeffrey Hersh, Andrew Hoskins, Lyz Liddell, Luis Loza, and Linda Zayas-Palmer."
  },
  "Numerical Strike, Greater* (Ex)": {
    "Prerequisite": "Investigator 13, numerical strike",
    "Benefit": "Once per day, when the investigator has confirmed a critical hit with a studied strike, he can deal the strikes maximum damage instead of rolling damage as normal. This includes the damage dealt by the successful attack as well as the additional damage from the studied strike. He can expend a use of inspiration to use this ability a second time per day. Using this ability doesnt require an action. Pathfinder Player Companion: Disciples Doctrine  2018, Paizo Inc.; AuthorSaif Ansari, Mara Lynn Butler, Jeffrey Hersh, Andrew Hoskins, Lyz Liddell, Luis Loza, and Linda Zayas-Palmer."
  },
  "Numerical Strike, Masterful* (Ex)": {
    "Prerequisite": "Investigator 17, numerical strike, greater numerical strike",
    "Benefit": "The investigator can use both numerical strike and greater numerical strike three times per day. The investigator doesnt need to expend uses of inspiration to use either ability, but he can never use either more than three times per day each. Pathfinder Player Companion: Disciples Doctrine  2018, Paizo Inc.; AuthorSaif Ansari, Mara Lynn Butler, Jeffrey Hersh, Andrew Hoskins, Lyz Liddell, Luis Loza, and Linda Zayas-Palmer."
  },
  "Perceptive Tracking (Ex)": {
    "Prerequisite": "Perception 1 rank",
    "Benefit": "The investigator can use Perception instead of Survival to both find and follow tracks, using the same DCs listed under the Survival skill. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Prolonged Study* (Ex)": {
    "Prerequisite": "Investigator 13th level",
    "Benefit": "The investigator can study his opponents for long periods of time. The effects of his studied combat ability last for a number of rounds equal to twice his Intelligence modifier (minimum 2) or until he deals damage with a studied strike, whichever comes first. Pathfinder Player Companion: Advanced Class Origins  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Tom Phillips, Stephen Radney-MacFarland, and Owen K.C. Stephens."
  },
  "Quick Study (Ex)": {
    "Benefit": "An investigator can use his studied combat ability as swift action instead of a move action. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Repositioning Strike* (Ex)": {
    "Prerequisite": "Investigator 13th level",
    "Benefit": "When the investigator deals damage with studied strike, he can perform a reposition combat maneuver as a free action against the creature damaged by studied strike. This reposition does not provoke attacks of opportunity. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Rogue Talent (Ex)": {
    "Benefit": "An investigator can select one of the following rogue talents in place of an investigator talent: assault leader, black market connections, camouflage, canny observer, charmer, coax information, combat swipe, convincing lie, cunning trigger, deft palm, expert leaper, fast fingers, fast getaway, fast picks, fast stealth, firearm training, guileful polyglot, grit, hard to fool, hold breath, honeyed words, iron guts, lasting poison, ledge walker, major magic, minor magic, nimble climber, peerless maneuver, quick disable, quick disguise, quick trapsmith, resiliency, rogue crawl, rope master, stand up, strong stroke, terrain mastery, trap spotter, or wall scrambler. Any talent effects based on rogue level use the investigators class level. If the rogue talent has a prerequisite (such as the major magic rogue talent requiring the minor magic talent), the investigator must fulfill the prerequisite before selecting that rogue talent. This talent can be selected multiple times; each time, it grants the investigator a new rogue talent. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Sapping Offensive* (Ex)": {
    "Prerequisite": "Investigator 5th level",
    "Benefit": "When the investigator damages a studied target, that creature cannot make attacks of opportunity for 1 round. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Sickening Offensive* (Ex)": {
    "Prerequisite": "Investigator 7th level",
    "Benefit": "When the investigator damages a studied target, that creature is also sickened for 1 round. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Slowing Strike* (Ex)": {
    "Prerequisite": "Investigator 7th level",
    "Benefit": "When the investigator deals damage with studied strike, the opponent must succeed at a Fortitude save (DC = 10 + 1/2 the investigators class level + his Intelligence modifier) or be slowed by the crippling blow. A slowed opponents movement speeds are each reduced by 5 feet (to a minimum of 5 feet) until the creature is healed through the application of any spell that cures hit point damage or with a successful DC 15 Heal check. Multiple slowing strikes stack, to a minimum of 5 feet. Pathfinder Player Companion: Advanced Class Origins  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Tom Phillips, Stephen Radney-MacFarland, and Owen K.C. Stephens."
  },
  "Stealing Strike* (Ex)": {
    "Prerequisite": "Investigator 13th level",
    "Benefit": "When the investigator deals damage with studied strike, he can perform a steal combat maneuver as a free action against the creature damaged by studied strike. This steal does not provoke attacks of opportunity. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Studied Defense (Ex)": {
    "Prerequisite": "Investigator 9th level",
    "Benefit": "When an investigator with this talent uses his studied combat ability, he can chose to apply that abilitys insight bonus to his AC against attacks made by the target of his studied combat instead of to attack rolls against the target of his studied combat. (The insight bonus on damage rolls remains.) He must choose which type of bonus he gains when using studied combat, and it cannot be changed until he uses studied combat again. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Tenacious Inspiration (Ex)": {
    "Prerequisite": "Investigator 13th level",
    "Benefit": "When an investigator rolls his inspiration die, he can roll an additional inspiration die and take the higher result. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Timed Strike* (Ex)": {
    "Benefit": "The longer the investigator studies his opponent, the greater the damage he ultimately deals with his studied strike. When the investigator makes a studied strike, he deal a number of points of additional damage equal to the number of consecutive rounds he studied the target with studied combat. Pathfinder Player Companion: Advanced Class Origins  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Tom Phillips, Stephen Radney-MacFarland, and Owen K.C. Stephens."
  },
  "Toppling Strike* (Ex)": {
    "Prerequisite": "Investigator 9th level",
    "Benefit": "When the investigator deals damage with studied strike, he can perform a trip combat maneuver as a free action against the creature damaged by studied strike. This steal does not provoke attacks of opportunity. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Unconventional Inspiration (Ex)": {
    "Benefit": "An investigator with this talent can pick any one skill. He can add his inspiration die to checks attempted with that skill without expending a use of inspiration. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Underworld Inspiration (Ex)": {
    "Benefit": "An investigator can use his inspiration on Bluff, Disable Device, Disguise, Intimidate, or Sleight of Hand checks without expending uses of inspiration, provided hes trained in the skill. Pathfinder Roleplaying Game: Advanced Class Guide  2014, Paizo Inc.; AuthorDennis Baker, Ross Byers, Jesse Benner, Savannah Broadway, Jason Bulmahn, Jim Groves, Tim Hitchcock, Tracy Hurley, Jonathan H. Keith, Will McCardell, Dale C. McCoy, Jr., Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Sean K Reynolds, Tork Shaw, Owen K.C. Stephens, and Russ Taylor."
  },
  "Everyman Gaming, LLC – Investigator Talents": {},
  "Investigatorâ\u0080\u0099s Certainty (Ex)": {
    "Benefit": "The investigator chooses one skill that, when attempting a skill check with the skill, he can use his inspiration ability without expending uses of inspiration. Once per day, the investigator can reroll a skill check just made with the selected skill and take the better result. He can use this reroll with the selected skill one additional time per day at 10th level and every 5 levels thereafter. An investigator can select this talent multiple times. Each time, the investigator must choose a different skill. Everyman Unchained: Unchained Cunning  2015 by Everyman Gaming, LLC.; Author: Alexander Augunas."
  },
  "Relic Researcher (Ex)": {
    "Benefit": "An investigator with this talent can attempt to determine the properties of a magic item without using the detect magic or identify spells. Attempting to ascertain the items properties in this manner increases the amount of time required to make the check to 3 minutes. Everyman Unchained: Unchained Cunning  2015 by Everyman Gaming, LLC.; Author: Alexander Augunas."
  },
  "Signature Skill": {
    "Benefit": "An investigator with this talent gains the Signature Skill feat as a bonus feat. Everyman Unchained: Unchained Cunning  2015 by Everyman Gaming, LLC.; Author: Alexander Augunas."
  },
  "Unchained Rogue Talent": {}
}