{
  "Aligned Disguise (Sp)": {
    "Prerequisite": "Disguise self spell-like ability.",
    "Benefit": "When a rogue with this talent uses the disguise self spell-like ability, she can also alter her alignment aura to deceive spells that discern alignment (such as detect evil) for the duration of the disguise self effect. She can choose to detect as any specific alignment, or to detect as no alignment at all. This ability does not protect against spells or effects that cause harm based on alignment. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Another Day (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, when the rogue would be reduced to 0 or fewer hit points by a melee attack, she can take a 5-foot step as an immediate action. If the movement takes her out of the reach of the attack, she takes no damage from the attack. The rogue is staggered for 1 round on her next turn. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Blinding Strike": {
    "Prerequisite": "Obscuring blow, 15th level",
    "Benefit": "A rogue who selects this talent gains Blinding Critical as a bonus feat, even if she doesnt meet the prerequisites. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Confounding Blades (Ex)": {
    "Prerequisite": "Advanced talents, slow reactions",
    "Benefit": "When a rogue with this talent hits a creature with a melee weapon that deals sneak attack damage, her target cannot make attacks of opportunity for 1d4+1 rounds. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Crippling Strike (Ex*)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this ability can sneak attack opponents with such precision that her blows weaken and hamper them. An opponent damaged by one of her sneak attacks also takes 2 points of Strength damage."
  },
  "Dance of Disorienting Shadows (Ex)": {
    "Benefit": "A rogue with this talent can attempt a Perform (dance) check in place of a combat maneuver check when attempting a reposition combat maneuver. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Deadly Cocktail (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent can apply two doses of poison to a weapon at once. These can be separate poisons, in which case they both affect the target individually, or two doses of the same toxin, in which case the poisons frequency is extended by 50% and the save DC increases by +2. This talent is an exception to the rule that injury poisons can only be delivered one dose at a time. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Deadly Sneak (Ex)": {
    "Prerequisite": "Advanced talents, powerful sneak rogue talent",
    "Benefit": "Whenever a rogue with this talent uses the powerful sneak rogue talent, she treats all 1s and 2s on the sneak attack damage dice as 3s. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Defensive Roll (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "With this advanced talent, the rogue can roll with a potentially lethal blow to take less damage from it than she otherwise would. Once per day, when she would be reduced to 0 or fewer hit points by damage in combat (from a weapon or other blow, not a spell or special ability), the rogue can attempt to roll with the damage. To use this ability, the rogue must attempt a Reflex saving throw (DC = damage dealt). If the save succeeds, she takes only half damage from the blow; if it fails, she takes full damage. She must be aware of the attack and able to react to it in order to execute her defensive rollif she is denied her Dexterity bonus to AC, she cant use this ability. Since this effect would not normally allow a character to make a Reflex save for half damage, the rogues evasion ability does not apply to the defensive roll. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Dispelling Attack (Su)": {
    "Prerequisite": "Advanced talents, major magic rogue talent",
    "Benefit": "Opponents that are dealt sneak attack damage by a rogue with this ability are affected by a targeted dispel magic, targeting the lowest-level spell effect active on the target. The caster level for this ability is equal to the rogues level. Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author: Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
  },
  "Entanglement of Blades (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "When a rogue with this talent hits a creature with a melee attack that deals sneak attack damage, the target cannot take a 5-foot step until the beginning of the rogues next turn. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Familiar (Ex)": {
    "Prerequisite": "Advanced talents, major magic talent, minor magic talent",
    "Benefit": "A rogue with this talent gains a familiar as the familiar option of the wizards arcane bond class feature. This ability functions exactly like that part of the class feature, but the rogues effective wizard level is her rogue level 4. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Fast Tumble (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "When a rogue with this talent uses Acrobatics to move at full speed through a threatened square without provoking an attack of opportunity, the DC of the Acrobatics check does not increase by 10. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Frugal Trapsmith (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "When a rogue with this talent constructs a mechanical trap, she only pays 75% of the normal cost. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Feat": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue may gain any feat that she qualifies for in place of a rogue talent. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Getaway Master (Ex)": {
    "Prerequisite": "Advanced talents, getaway artist talent",
    "Benefit": "A rogue with this talent gains a +10 bonus on all drive checks. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Glib Facade (Sp)": {
    "Prerequisite": "Innocent facade",
    "Benefit": "Once per day, a rogue with this advanced talent can use glibness as a spell-like ability, using her rogue level as the spells caster level. Pathfinder Player Companion: Magic Tactics Toolbox  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Thurston Hillman, and Ron Lundeen."
  },
  "Hard Minded (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent is hard to fool with illusions. She automatically receives a save to disbelieve any illusion she can see each round at the start of her turn, even if she hasnt interacted with it. If she fails a saving throw against an illusion that is not to disbelieve, she can attempt to save again again 1 round later at the same DC. She gets only one extra chance to succeed at her saving throw. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Harrow Strike (Ex)": {
    "Benefit": "Once per day while making a sneak attack against a creature, you can draw a random card from a harrow deck you own. If your attack hits, instead of dealing sneak attack damage as normal, you deal a number of points of ability damage equal to your number of sneak attack dice. The ability score damaged is the score affiliated with the suit of the harrow card drawn. You can use this ability an additional time per day at 15th level and 20th level. Pathfinder Player Companion: The Harrow Handbook  2014, Paizo Inc.; AuthorCrystal Frasier, Will McCardell, and David Schwartz."
  },
  "Hide in Plain Sight (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent can select a single terrain from the rangers favored terrain list. She is a master at hiding in that terrain, and while within that terrain, she can use the Stealth skill to hide, even while being observed. Special: A rogue may take this advanced talent more than once, each time selecting a different terrain from the favored terrain list. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Hunterâ\u0080\u0099s Surprise (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, a rogue with this talent can designate a single enemy she is adjacent to as her prey. Until the end of her next turn, she can add her sneak attack damage to all attacks made against her prey, even if she is not flanking it or it is not flat-footed. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Improved Shadowâ\u0080\u0099s Chill* (Su)": {
    "Prerequisite": "Cold resistance racial trait, shadows chill.",
    "Benefit": "When a rogue with this talent hits a creature with a melee weapon that deals sneak attack damage, the sneak attack damage is cold damage. Normal weapon damage is unaffected. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Knock-Out Blow (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, the rogue can forgo her sneak attack damage to attempt to knock out an opponent. She must declare the use of knock-out blow before she makes the attack. If the attack hits, it does normal damage, but instead of dealing sneak attack damage (and instead of any effect that triggers when the rogue deals sneak attack damage), the target falls unconscious for 1d4 rounds. A successful Fortitude save reduces this effect to staggered for 1 round. The DC of this save is equal to 10 + 1/2 the rogues level + the rogues Intelligence modifier. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Improved Evasion (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "This works like evasion, except that while the rogue still takes no damage on a successful Reflex saving throw against attacks, she henceforth takes only half damage on a failed save. A helpless rogue does not gain the benefit of improved evasion. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Master of Disguise (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, a rogue with this talent gains a +10 bonus on a single Disguise check. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Master Tricks": {
    "Prerequisite": "Advanced talents",
    "Benefit": "The rogue can select a ninja trick from the list of master tricks in place of a rogue talent. The rogue cannot select a ninja trick that has the same name as a rogue talent. The rogue can choose but cannot use tricks that require ki points, unless she has a ki pool. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Opportunist (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per round, the rogue can make an attack of opportunity against an opponent who has just been struck for damage in melee by another character. This attack counts as an attack of opportunity for that round. Even a rogue with the Combat Reflexes feat cant use the opportunist ability more than once per round. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Redirect Attack (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, when a rogue with this talent is hit with a melee attack, she can redirect the attack to strike at an adjacent creature with a free action. The creature targeted must be within melee reach of the attack that hit the rogue, and the creature that made the attack against the rogue must make a new attack roll against the new target. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Reflexive Shadow Shield (Su)": {
    "Prerequisite": "Resiliency rogue talent.",
    "Benefit": "Once per day as an immediate action, the rogue can gain an amount of cold resistance or electricity resistance equal to half the rogues level. This resistance lasts for 1 round. If the rogue has the shadowy resistance racial trait, the cold or electricity resistance stacks with the resistance that trait grants; otherwise, the energy resistance does not stack with any cold or electricity resistance the rogue has. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Rumormonger (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent can attempt to spread a rumor through a small town or larger settlement by making a Bluff check. She can do so a number of times per week equal to her Charisma modifier (minimum 0). The DC is based on the size of the settlement, and it takes a week for the rumor to propagate through the settlement. If the check succeeds, the rumor is practically accepted as fact within the community; succeeding by 5 or more over the DC decreases the time it takes the rumor to propagate by 1d4 days. A failed check means the rumor failed to gain traction, while failing by 5 or more causes the opposite of the rumor or some other competing theory involving the rumors subject to take hold. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "See in Darkness (Su)": {
    "Prerequisite": "Darkvision.",
    "Benefit": "The rogue gains the see in darkness ability. Pathfinder Player Companion: Blood of Shadows  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Luis Loza, and Ron Lundeen."
  },
  "Skill Mastery": {
    "Prerequisite": "Advanced talents",
    "Benefit": "The rogue becomes so confident in the use of certain skills that she can use them reliably even under adverse conditions. Upon gaining this ability, she selects a number of skills equal to 3 + her Intelligence modifier. When making a skill check with one of these skills, she may take 10 even if stress and distractions would normally prevent her from doing so. Special: A rogue may gain this special ability multiple times, selecting additional skills for skill mastery to apply to each time. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Slippery Mind (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "This ability represents the rogues ability to wriggle free from magical effects that would otherwise control or compel her. If a rogue with slippery mind is affected by an enchantment spell or effect and fails her saving throw, she can attempt it again 1 round later at the same DC. She gets only this one extra chance to succeed on her saving throw. Pathfinder Roleplaying Game Core Rulebook "
  },
  "Stealthy Sniper (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "When a rogue with this talent uses the Stealth skill to snipe, she only suffers a 10 penalty on the Stealth check, instead of 20. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Thoughtful Reexamining (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "Once per day, a rogue with this talent can reroll a Knowledge, Sense Motive, or Perception skill check to try to gain new or better information from the roll. This reroll can be made any time during the same day as the original check. Advanced Players Guide. Copyright 2010, Paizo Publishing, LLC; Author: Jason Bulmahn."
  },
  "Unlock Ki (Ex)": {
    "Prerequisite": "Ki pool.",
    "Benefit": "A rogue with this advanced talent increases the number of points in the ki pool that she gains from the ki pool rogue talent to be equal to 1/2 her rogue level + her highest mental ability score modifier (Intelligence, Wisdom, or Charisma). In addition, she can spend 2 points from her ki pool as a swift action to gain the skill unlocks for one skill of her choice as appropriate for her number of ranks in that skill. This benefit lasts for 1 minute. Pathfinder Player Companion: Magic Tactics Toolbox  2016, Paizo Inc.; AuthorAlexander Augunas, Steven T. Helt, Thurston Hillman, and Ron Lundeen."
  },
  "Unwitting Ally (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent can spend a swift action to attempt to make an opponent act like an ally for purposes of providing a flank until the beginning of the rogues next turn. The opponent must be able to hear and see the rogue, and the rogue must succeed at a Bluff check opposed by the opponents Sense Motive. If the check succeeds, the opponent acts as an ally for the purpose of providing a flank. Whether or not the check succeeds, the rogue cannot use this trick again on the same opponent for the next 24 hours. If the rogue fails the check by 5 or more, she cannot use the unwitting ally ability on any opponent within line of sight of the failed attempt for 24 hours. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  },
  "Weapon Snatcher (Ex)": {
    "Prerequisite": "Advanced talents",
    "Benefit": "A rogue with this talent can make a Sleight of Hand check in place of a combat maneuver check when attempting to disarm an opponent. Pathfinder Roleplaying Game Ultimate Combat.  2011, Paizo Publishing, LLC; AuthorJason Bulmahn, Tim Hitchcock, Colin McComb, Rob McCreary, Jason Nelson, Stephen Radney-MacFarland, Sean K Reynolds, Owen K.C. Stephens, and Russ Taylor."
  }
}