[
  {
    "Apocalyptic Spell (Metamagic)": {
      "Benefit(s)": "You can alter a spell with an area of effect and a duration of instantaneous to become an apocalyptic spell.",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Aquatic Spell (Metamagic)": {
      "Benefit": "An aquatic spell functions normally underwater and requires no caster level check to cast, even if it has the fire descriptor. In addition, the spell can be cast from the surface into water and still be effective.",
      "Level Increase": "+1 (an aquatic spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game Ultimate Wilderness © 2017, Paizo Inc.; Authors": "Alexander Augunas, John Bennett, Robert Brookes, John Compton, Dan Dillon, Steven T. Helt, Thurston Hillman, Eric Hindley, Mikko Kallio, Jason Keeley, Isabelle Lee, Jason Nelson, Stephen Radney-MacFarland, Alex Riggs, David N. Ross, David Schwartz, Mark Seifter, Jeffery Swank, and Linda Zayas-Palmer."
    }
  },
  {
    "Authoritative Spell (Metamagic)": {
      "Benefit(s)": "You can alter any spell that targets a single creature to become an authoritative spell. When you cast an authoritative spell, choose one of the following activities to prohibit",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Benthic Spell (Metamagic)": {
      "Benefit": "You can modify a spell that deals acid, cold, electricity, or fire damage to deal damage through high-pressure water instead. The spell gains the water descriptor, and you can either replace the spell’s normal damage with bludgeoning damage or split the spell’s damage so that half is bludgeoning and half is of its normal type. Creatures with damage reduction apply their damage reduction to bludgeoning damage from a benthic spell, but the spell counts as bludgeoning and magic for the purposes of bypassing damage reduction.",
      "Pathfinder Player Companion": "Elemental Master’s Handbook © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Blissful Spell (Metamagic)": {
      "Benefit(s)": "You can alter any spell that targets a single creature to become a blissful spell, although the exact effects of the metamagic vary depending on whether the spell is beneficial or offensive. A creature successfully hit by an offensive blissful spell (if the spell requires an attack roll) or that fails its saving throw against an offensive blissful spell takes a –2 penalty on attack rolls and weapon damage rolls for 1 round. A beneficial blissful spell instead grants affected creatures a +2 morale bonus on skill checks and saving throws for 1 round in addition to its normal effects.",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Bouncing Spell (Metamagic)": {
      "Benefit": "Whenever a bouncing spell targeting a single creature has no effect on its intended target (whether due to spell resistance or a successful saving throw) you may, as a swift action, redirect it to target another eligible creature within range. The redirected spell behaves in all ways as if its new target were the original target for the spell. Spells that affect a target in any way (including a lesser effect from a successful saving throw) may not be redirected in this manner.",
      "Level Increase": "+1 (a bouncing spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Brackish Spell (Metamagic)": {
      "Benefit": "This feat can be applied only to spells with the water descriptor. You can modify the spell to surround you with a thin sheath of brackish salt water in addition to the spell’s normal effect. You gain DR/piercing equal to the spell’s level for 1 round after you finish casting the spell.",
      "Pathfinder Player Companion": "Elemental Master’s Handbook © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Brisk Spell (Metamagic)": {
      "Prerequisite(s)": "Dex 13+.",
      "Benefit(s)": "You can alter spells that grant a creature a movement type it doesn’t normally have to increase the speed for that movement type by 10 feet.",
      "Level Increase": "+0 (a brisk spell uses a spell slot equal to the spell’s normal spell level.)",
      "Pathfinder Player Companion": "Magic Tactics Toolbox © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Burning Spell (Metamagic)": {
      "Benefit": "The acid or fire effects of the affected spell adhere to the creature, causing more damage the next round. When a creature takes acid or fire damage from the affected spell, that creature takes damage equal to 2x the spell’s actual level at the start of its next turn. The damage is acid or fire, as determined by the spell’s descriptor. If a burning spell has both the fire and acid descriptor, the caster chooses what kind of damage is dealt by the burning spell effect.",
      "Level Increase": "+2 (a burning spell uses up a slot two levels higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Centered Spell (Metamagic)": {
      "Prerequisite(s)": "Spellcraft 3 ranks.",
      "Benefit(s)": "You can center the area of a spell with an area effect and duration of instantaneous on you, and exclude yourself from the effects of the spell. Your familiar (if any) is also excluded from the effect, provided that it is in your square and at least one size category smaller than you.",
      "Pathfinder Player Companion": "Legacy of the First World © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Cherry Blossom Spell (Metamagic)": {
      "Benefit(s)": "When a living creature takes damage from the affected spell, that creature also takes 2 points of damage to Strength, Dexterity, and Constitution or 2 points of damage to Intelligence, Wisdom, and Charisma (your choice). If the spell does not normally allow a save, the target can attempt a Fortitude save to negate the effect. Ageless or immortal creatures are immune to this effect. This is a magical aging effect, but it does not alter the creature’s true age—it merely simulates the effects of old age on the flesh or the reversion to a more infantile mental age. A cherry blossom spell uses up a slot 3 levels higher than the spell’s actual level. Spells that don’t deal damage don’t benefit from this feat.",
      "Pathfinder Player Companion": "Wilderness Origins © 2019, Paizo Inc.; Authors"
    }
  },
  {
    "Coaxing Spell (Metamagic)": {
      "Prerequisites": "Spell Focus (enchantment), Knowledge (dungeoneering) 6 ranks.",
      "Benefit": "This feat only works with mind-affecting effects. A coaxing spell affects mindless oozes and vermin as if they weren’t mindless, but has no effect on other creature types.",
      "Level Increase": "+2 (a coaxing spell uses a spell slot 2 levels higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Dungeoneer’s Handbook © 2013, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Concussive Spell (Metamagic)": {
      "Benefit": "With sonic damage comes a concussive wave of energy that rattles creatures affected by the spell. A concussive spell causes creatures that take damage from a spell that has the sonic descriptor to take a –2 penalty on attack rolls, saving throws, skill checks, and ability checks for a number of rounds equal to the actual spell level of the spell. A concussive spell only affects spells with the sonic descriptor.",
      "Level Increase": "+2 (a concussive spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Conditional Spell (Metamagic)": {
      "Benefit(s)": "A conditional spell is subject to the rules laid out in the spell conditional favor.",
      "Metamagic Adjustment": "+1 (a conditional spell takes up a spell slot 1 level higher than normal.)",
      "Pathfinder Player Companion": "Healer’s Handbook © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Consecrate Spell (Metamagic)": {
      "Prerequisites": "Aasimar, able to prepare or cast consecrate.",
      "Benefit": "A consecrated spell is treated as a maximized spell against evil creatures and creatures with the evil subtype. Against all other creatures, this feat does not modify the spell in any way (for example, a consecrated fireball acts as a normal fireball against neutral or good creatures). This feat does not stack with Maximize Spell.",
      "Level Increase": "+2 (a consecrated spell uses up a spell slot two levels higher than the spell’s actual level.)"
    }
  },
  {
    "Maximize Spell (Metamagic)": {
      "Benefit": "All variable, numeric effects of a spell modified by this feat are maximized. Saving throws and opposed rolls are not affected, nor are spells without random variables.",
      "Level Increase": "+3 (a maximized spell uses up a spell slot three levels higher than the spell’s actual level.)",
      "An empowered, maximized spell gains the separate benefits of each feat": "the maximum result plus half the normally rolled result.",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Contagious Spell (Metamagic)": {
      "Requirement(s)": "You can apply Contagious Spell only to targeted spells that are harmful to their target and don’t have a range of personal; a contagious spell never spreads to someone who would benefit from being the target of the spell.",
      "Benefit(s)": "A caster level check to dispel or remove a contagious spell that fails by 5 or more causes it to spread from the original target to the creature that attempted to remove it. The spell spreads to the new target regardless of its normal range or any special targeting requirement like a melee or ranged touch attack. The spell is treated as if you had just cast it on the new target. The new target receives a saving throw or the benefit of spell resistance (if applicable) if the spell normally allows it.",
      "Level Increase": "+2 (an contagious spell uses up a spell slot 2 levels higher than the spell’s actual level.)",
      "Special": "A contagious spell can be identified normally as it is being cast with a successful Spellcraft check.",
      "Pathfinder Roleplaying Game Horror Adventures © 2016, Paizo Inc.; Authors": "John Bennett, Clinton J. Boomer, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Jim Groves, Steven Helt, Thurston Hillman, Eric Hindley, Brandon Hodge, Mikko Kallio, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Alistair Rigg, Alex Riggs, David N. Ross, F. Wesley Schneider, David Schwartz, Mark Seifter, and Linda Zayas-Palmer."
    }
  },
  {
    "Contingent Spell (Metamagic)": {
      "Prerequisite(s)": "Ability to cast cure spells (a cure spell is any spell with “cure” in its name).",
      "Benefit(s)": "A contingent spell infuses a target with a dormant healing or restorative spell that can trigger when the target needs it the most. This metamagic feat can be applied to only cure spells; breath of life; or any harmless spell that can be used to remove ability score damage, ability score drain, or a negative condition or effect (including break enchantment, neutralize poison, and remove disease). When you cast a contingent spell, you must set a specific trigger that dictates under what circumstances the target is immediately subject to the spell’s effects (for instance, “When the target dies, breath of life takes effect”). The contingent spell’s effects can remain dormant within the target for up to 10 minutes per caster level you have. A creature can be infused with only one contingent spell at a time.",
      "Metamagic Adjustment": "+2 (a contingent spell uses up a spell slot 2 levels higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Healer’s Handbook © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Crypt Spell (Metamagic)": {
      "Benefit(s)": "You can enhance any spell that inflicts hit point damage to become a crypt spell. A creature that dies within 1 round of being damaged by a crypt spell is considered to have been killed by a death effect for the purpose of being returned to life. An undead creature damaged by a crypt spell gains the sickened condition for a number of rounds equal to the spell’s original spell level; this duration is halved if the undead creature succeeds at its saving throw against the spell. If the spell does not allow a save, the target can attempt a Will save to negate the sickened effect. A crypt spell gains the death descriptor.",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Dazing Spell (Metamagic)": {
      "Benefit": "You can modify a spell to daze a creature damaged by the spell. When a creature takes damage from this spell, they become dazed for a number of rounds equal to the original level of the spell. If the spell allows a saving throw, a successful save negates the daze effect. If the spell does not allow a save, the target can make a Will save to negate the daze effect. If the spell effect also causes the creature to become dazed, the duration of this metamagic effect is added to the duration of the spell.",
      "Level Increase": "+3 (a dazing spell uses up a spell slot three levels higher than the spell’s actual level.",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Delayed Spell (Metamagic)": {
      "Benefit(s)": "A delayed spell can be activated as a standard action anytime within 1 minute per spell level of being cast. Only spells that target one or more squares or grid intersections can be affected by Delayed Spell, and the target (as well as any other variables determined at the time of casting) cannot be changed once the delayed spell is cast. You can have as many delayed spells as you wish at any given time, but only one spell can be triggered in a single standard action. Though a delayed spell does not manifest until it is triggered, it emits a magical aura as normal and can be identified with Knowledge (arcana) as a spell effect in place.",
      "Level Increase": "+1 (a delayed spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Adventure Path #116": "Fangs of War © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Disruptive Spell (Metamagic)": {
      "Benefit": "Targets affected by a disruptive spell must make concentration checks when using spells or spell-like abilities (DC equals the save DC of the disruptive spell plus the level of the spell being cast) for 1 round. Targets that avoid the spell’s effects avoid this feat’s effect as well.",
      "Level Increase": "+1 (a disruptive spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Echoing Spell (Metamagic)": {
      "Benefit": "When you cast an echoing spell, it does not disappear entirely from memory, and you can cast it one additional time during that day. No effect that allows you to reprepare or recast a spell can affect the echoed spell.",
      "Level Increase": "+3 (an echoing spell uses up a spell slot three levels higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Eclipsed Spell (Metamagic)": {
      "Benefit(s)": "Only spells that create areas of light or darkness can be eclipsed spells. If the eclipsed spell creates an area that shines like a torch or raises the light level by one step, you can choose to have the spell lower the illumination level in the affected area by one step, functioning like darkness. If the eclipsed spell creates an area that shines like daylight or raises the light level by two steps, you can choose to have the spell lower the illumination level in the affected area by two steps and create an area of magical darkness, functioning like deeper darkness.",
      "Pathfinder Player Companion": "Blood of Shadows © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Ectoplasmic Spell (Metamagic)": {
      "Benefit": "An ectoplasmic spell has full effect against incorporeal or ethereal creatures.",
      "Level Increase": "+1 (an ectoplasmic spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Elemental Spell (Metamagic)": {
      "Benefit": "Choose one energy type",
      "Level Increase": "+1 (an elemental spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Special": "You can gain this feat multiple times. Each time you must choose a different energy type.",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Empower Spell (Metamagic)": {
      "Benefit": "All variable, numeric effects of an empowered spell are increased by half including bonuses to those dice rolls.",
      "Level Increase": "+2 (an empowered spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Encouraging Spell (Metamagic)": {
      "Prerequisite(s)": "Cha 13, Diplomacy 6 ranks.",
      "Benefit(s)": "Any morale bonus granted by an encouraging spell is increased by 1.",
      "Level Increase": "+1 (an encouraging spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Magic Tactics Toolbox © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Enlarge Spell (Metamagic)": {
      "Benefit": "You can alter a spell with a range of close, medium, or long to increase its range by 100%. An enlarged spell with a range of close now has a range of 50 ft. + 5 ft./level, while medium-range spells have a range of 200 ft. + 20 ft./level and long-range spells have a range of 800 ft. + 80 ft./level.",
      "Level Increase": "+1 (an enlarged spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Extend Spell (Metamagic)": {
      "Benefit": "An extended spell lasts twice as long as normal. A spell with a duration of concentration, instantaneous, or permanent is not affected by this feat.",
      "Level Increase": "+1 (an extended spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Familiar Spell (Metamagic)": {
      "Prerequisites": "Spellcaster with familiar class feature.",
      "Benefit": "You can transfer a prepared spell to your familiar, allowing the familiar to cast that spell at a later time. Variables that rely on caster level function according to your caster level, not your familiar’s Hit Dice, though your familiar’s Intelligence may influence how precisely it can follow your instructions on how to use these spells.",
      "Special": "If you are a spontaneous caster, you must select a specific spell with which to imbue your familiar; you cannot imbue your familiar with an open spell slot.",
      "Pathfinder Player Companion": "Animal Archive © 2013, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Fearsome Spell (Metamagic)": {
      "Benefit(s)": "When a creature takes damage from a fearsome spell, if that creature failed its save against the spell, it becomes shaken for a number of rounds equal to the spell’s original level. If the spell doesn’t allow a save, creatures harmed by it can attempt a Will save (against the same DC the spell would have if it did allow a save) to negate the shaken effect. If the spell effect already causes creatures to become shaken, on a failed save, add the duration of this metamagic effect to the duration of the shaken condition imposed by the spell. A fearsome spell can’t cause a creature to become frightened, even if that creature is already shaken.",
      "Level Increase": "+2 (a fearsome spell uses up a spell slot 2 levels higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Flaring Spell (Metamagic)": {
      "Benefit": "The electricity, fire, or light effects of the affected spell create a flaring that dazzles creatures that take damage from the spell. A flare spell causes a creature that takes fire or electricity damage from the affected spell to become dazzled for a number of rounds equal to the actual level of the spell. A flaring spell only affects spells with a fire, light, or electricity descriptor.",
      "Level Increase": "+1 (a flaring spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Fleeting Spell (Metamagic)": {
      "Benefit(s)": "A fleeting spell’s duration becomes dismissible, if it is not already. You can dismiss your own fleeting spell as a swift action. When you dismiss a fleeting spell, its lingering aura cannot be detected by magic unless the caster succeeds at a caster level check against a DC equal to 11 + your caster level. The DC of dispel checks to counter a fleeting spell is reduced by 2, and once active, dispel magic removes a fleeting spell without a caster level check. A fleeting spell has half its normal duration (with an extended fleeting spell, these duration adjustments cancel out). Only spells with a duration of at least 2 rounds can be made fleeting, and instantaneous or permanent spells cannot be fleeting spells.",
      "Normal": "It is a standard action to dismiss a dismissible spell, and only spells whose Duration entry is marked with a D are dismissible.",
      "Level Increase": "+0 (a fleeting spell does not use up a higher-level spell slot than the spell’s actual level.",
      "Pathfinder Roleplaying Game Ultimate Intrigue © 2016, Paizo Inc.; Authors": "Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."
    }
  },
  {
    "Focused Spell (Metamagic)": {
      "Benefit": "When casting a spell that affects or targets more than one creature, you can choose one target or creature within the spell effect. That creature’s saving throw DC to resist the spell is increased by +2. You must choose which target to focus the spell on before casting the spell.",
      "Level Increase": "+1 (a focused spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Furious Spell (Metamagic)": {
      "Benefit(s)": "A furious spell that deals hit point damage adds twice the spell’s original level to the amount of damage dealt by the spell. Spells that affect multiple targets deal the extra damage once to each target, regardless of whether the spell deals its damage all at once or in multiple hits (in the latter case, add the extra damage to the first hit against each target). In addition, a furious spell can be cast while the caster is enraged, including during a barbarian rage or while affected by a rage spell. Even a furious spell that requires an emotion component can be cast while enraged. The caster gains a +2 circumstance bonus on concentration checks and caster level checks related to casting a furious spell if she is enraged.",
      "Level Increase": "+1 (a furious spell uses up a spell slot 1 level higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Heighten Spell (Metamagic)": {
      "Benefit": "A heightened spell has a higher spell level than normal (up to a maximum of 9th level). Unlike other metamagic feats, Heighten Spell actually increases the effective level of the spell that it modifies. All effects dependent on spell level (such as saving throw DCs and ability to penetrate a lesser globe of invulnerability) are calculated according to the heightened level.",
      "Level Increase": "The heightened spell is as difficult to prepare and cast as a spell of its effective level.",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Intensified Spell (Metamagic)": {
      "Benefit": "An intensified spell increases the maximum number of damage dice by 5 levels. You must actually have sufficient caster levels to surpass the maximum in order to benefit from this feat. No other variables of the spell are affected, and spells that inflict damage that is not modified by caster level are not affected by this feat.",
      "Level Increase": "+1 (an intensified spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Intuitive Spell (Metamagic)": {
      "Benefit(s)": "An intuitive spell can be cast with no thought components. Spells without thought components are not affected.",
      "Level Increase": "+1 (an intuitive spell uses up a spell slot 1 level higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Jinxed Spell (Metamagic)": {
      "Prerequisites": "Any two metamagic feats, Halfling Jinx alternate racial trait.",
      "Benefit": "Any creature that fails its saving throw against a jinxed spell also suffers the effects of your jinx. This feat has no effect on spells that do not allow a saving throw. If the spell affects an area or multiple creatures, you must select one creature to take the jinx, unless you have the Area Jinx feat; if you have the Area Jinx feat, choose a jinx burst area within the spell’s area or among its targets and apply the jinx to those in the burst that failed their save.",
      "Level Increase": "+1 (a jinxed spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Halflings of Golarion. Copyright 2010, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Lingering Spell (Metamagic)": {
      "Benefit": "You may cause an instantaneous spell that affects an area to persist until the beginning of your next turn. Those already in the area suffer no additional harm, but other creatures or objects entering the area are subject to its effects. A lingering spell with a visual manifestation obscures vision, providing concealment (20% miss chance) beyond 5 feet and total concealment (50% miss chance) beyond 20 feet.",
      "Level Increase": "+1 (a lingering spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Logical Spell (Metamagic)": {
      "Benefit(s)": "A logical spell can be cast without emotion components. Spells that don’t require emotion components are not affected.",
      "Level Increase": "+1 (a logical spell uses up a spell slot 1 level higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Maximize Spell (Metamagic)": {
      "Benefit": "All variable, numeric effects of a spell modified by this feat are maximized. Saving throws and opposed rolls are not affected, nor are spells without random variables.",
      "Level Increase": "+3 (a maximized spell uses up a spell slot three levels higher than the spell’s actual level.)",
      "An empowered, maximized spell gains the separate benefits of each feat": "the maximum result plus half the normally rolled result.",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Merciful Spell (Metamagic)": {
      "Benefit": "You can alter spells that inflict damage to inflict nonlethal damage instead. Spells that inflict damage of a particular type (such as fire) inflict nonlethal damage of that same type.",
      "Level Increase": "None (a merciful spell does not use up a higher-level spell slot than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Murky Spell (Metamagic)": {
      "Benefit": "You can apply Murky Spell only to a mist or fog spell that normally doesn’t work underwater, such as cloudkill, fog cloud, mind fog, obscuring mist, or solid fog. When cast underwater, a murky spell clouds the water with sediments, producing roughly the same effects as the normal spell would above water except as follows. Due to the dilution, a murky spell has only one-tenth of the duration of a normal spell (generally 1 minute per level, though mind fog lasts 3 minutes), but this reduction doesn’t affect the duration of secondary effects like mind fog’s mental penalties. Abilities that see through mist and fog can’t see through a murky spell unless they also specifically see through murky water (like the mistsight universal monster rule). Instead of wind, currents can disperse a murky spell; any current with a speed of at least 10 feet disperses a murky spell in 1 round. A murky spell has no effect above the water. A murky spell uses up a slot the same spell level as the spell’s actual level.",
      "Pathfinder Campaign Setting": "Aquatic Adventures © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Persistent Spell (Metamagic)": {
      "Benefit": "Whenever a creature targeted by a persistent spell or within its area succeeds on its saving throw against the spell, it must make another saving throw against the effect. If a creature fails this second saving throw, it suffers the full effects of the spell, as if it had failed its first saving throw.",
      "Level Increase": "+2 (a persistent spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Piercing Spell (Metamagic)": {
      "Benefit": "When you cast a piercing spell against a target with spell resistance, it treats the spell resistance of the target as 5 lower than its actual SR.",
      "Level Increase": "+1 (a piercing spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Quicken Spell (Metamagic)": {
      "Benefit": "Casting a quickened spell is a swift action. You can perform another action, even casting another spell, in the same round as you cast a quickened spell. A spell whose casting time is more than 1 full-round action cannot be quickened. [FAQ]",
      "Level Increase": "+4 (a quickened spell uses up a spell slot four levels higher than the spell’s actual level.)",
      "Special": "You can apply the effects of this feat to a spell cast spontaneously, so long as it has a casting time that is not more than 1 full-round action, without increasing the spell’s casting time.",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Reach Spell (Metamagic)": {
      "Benefit": "You can alter a spell with a range of touch, close, or medium to increase its range to a higher range category, using the following order",
      "Level Increase": "Special. A reach spell uses up a spell slot one level higher than the spell’s actual level for each increase in range category. For example, a spell with a range of touch increased to long range uses up a spell slot three levels higher.",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Rime Spell (Metamagic)": {
      "Benefit": "The frost of your cold spell clings to the target, impeding it for a short time. A rime spell causes creatures that takes cold damage from the spell to become entangled for a number of rounds equal to the original level of the spell.",
      "Level Increase": "+1 (a rime spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Scarring Spell (Metamagic)": {
      "Benefit(s)": "When a creature fails a saving throw against a scarring spell, for the next 24 hours that creature takes a —2 penalty on saving throws against emotion and fear effects you create, and a —1 penalty on saving throws against other emotion and fear effects. Penalties from multiple scarring spells don’t stack. This metamagic feat can be applied only to spells with the emotion or fear descriptor.",
      "Level Increase": "+1 (a scarring spell uses up a spell slot 1 level higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Seeking Spell (Metamagic)": {
      "Benefit(s)": "A seeking spell’s range can bend around obstacles to reach the intended target. You can define the route yourself or unambiguously identify a target and allow the spell to determine its own path. However, the spell fails if it would have to travel farther than its maximum range to reach the identified target. A ranged attack roll made to deliver a seeking spell is not subject to cover or concealment. In order to benefit from this feat, the selected spell must have a range greater than touch and target one or more creatures, or it must require the caster to make a ranged touch attack.",
      "Level Increase": "+2 (a seeking spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Ranged Tactics Toolbox © 2014, Paizo Inc.; Authors"
    }
  },
  {
    "Selective Spell (Metamagic)": {
      "Prerequisite": "Spellcraft 10 ranks.",
      "Benefit": "When casting a selective spell with an area effect and a duration of instantaneous, you can choose a number of targets in the area equal to the ability score modifier used to determine bonus spells of the same type (Charisma for bards, oracles, paladins, sorcerers, and summoners; Intelligence for witches and wizards; Wisdom for clerics, druids, inquisitors, and rangers). These targets are excluded from the effects of your spell.",
      "Level Increase": "+1 (a selective spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Tenebrous Spell (Metamagic)": {
      "Benefit": "When you cast a tenebrous spell in darkness or dim light, the spell’s effective caster level and any associated save DCs are increased by 1. Any attempts at dispelling a tenebrous spell in darkness or dim light take a –2 penalty on the dispel check.",
      "Pathfinder Campaign Setting": "Inner Sea Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Umbral Spell (Metamagic)": {
      "Prerequisite": "Tenebrous Spell.",
      "Benefit": "An umbral spell gains the darkness descriptor. As long as the spell is in effect, the creature or object affected radiates darkness in a 10-foot radius, reducing illumination similar to the effects of the darkness spell. Nonmagical sources of light, such as torches or lanterns, do not increase the light level in this area. Magical light sources only increase the light level in an area affected by an umbral spell if they are of a higher level than the umbral spell’s unmodified spell level. This effect does not stack with itself or with any other effect that creates darkness.",
      "Level Increase": "+2 (an umbral spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Pathfinder Campaign Setting": "Inner Sea Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Sickening Spell (Metamagic)": {
      "Benefit": "You can modify a spell to sicken a creature damaged by the spell. When a creature takes damage from this spell, they become sickened for a number of rounds equal to the original level of the spell. If the spell allows a saving throw, a successful save negates the sickening effect. If the spell does not allow a save, the target can make a Fortitude save to negate the sickening effect. If the spell effect also causes the creature to become sickened, the duration of this metamagic effect is added on to the duration of the spell.",
      "Level Increase": "+2 (a sickening spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Silent Spell (Metamagic)": {
      "Benefit": "A silent spell can be cast with no verbal components. Spells without verbal components are not affected.",
      "Level Increase": "+1 (a silent spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Special": "Bard spells cannot be enhanced by this feat.",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Snuffing Spell (Metamagic)": {
      "Benefit(s)": "You can modify a spell to extinguish magical and non-magical light sources that the target has. The first time a creature takes damage from or fails a saving throw against a snuffing spell, any non-magical light sources it has are immediately extinguished and you can attempt to dispel any active spells with the light descriptor that are affecting the target as if you had also cast the targeted version of dispel magic. Spells that do not target creatures can’t be snuffing spells.",
      "Pathfinder Player Companion": "Blood of Shadows © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Solar Spell (Metamagic)": {
      "Note": "Spells that do not inflict damage do not benefit from this feat.",
      "Benefit(s)": "Any spell you cast with the [light] descriptor is fortified with the cleansing energies of the sun. If the spell creates an area of light, all creatures are dazzled for as long as they remain within the spell’s area. Oozes, fungal creatures, creatures from the Shadow Plane, and undead must also succeed at a Will save (DC 10 + the spell level + your Wisdom or Charisma bonus) or take a –2 penalty on attack rolls, damage rolls, saving throws, skill checks, and ability checks for as long as they remain within the spell’s area. If the spell normally dazzles or blinds affected creatures with a duration other than instantaneous or permanent, the duration of that effect is increased by a number of rounds equal to the spell’s original level. Saving throws to remove the effect early still apply and can bypass this increase.",
      "Level Increase": "+1 (a solar spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Cohorts and Companions © 2015, Paizo Inc.; Authors"
    }
  },
  {
    "Still Spell (Metamagic)": {
      "Benefit": "A stilled spell can be cast with no somatic components. Spells without somatic components are not affected.",
      "Level Increase": "+1 (a stilled spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Steam Spell (Metamagic)": {
      "Benefit": "You can apply Steam Spell only to a spell with the fire descriptor. A steam spell works underwater without a caster level check, but it requires a caster level check to function above water. A steam spell uses up a slot the same spell level as the spell’s actual level.",
      "Pathfinder Campaign Setting": "Aquatic Adventures © 2017, Paizo Inc.; Authors"
    }
  },
  {
    "Studied Spell (Metamagic)": {
      "Benefit(s)": "When casting a studied spell, designate one target affected by the spell. Attempt an appropriate Knowledge check based on that target’s creature type as you cast the spell. The DC for this check is equal to 20 + the creature’s CR based on its race and not including any class levels or template (a creature that is defined by class levels has an effective CR of 0 for this ability). If you succeed, your studied spell ignores any energy resistance or damage reduction the target has because of its race as well as any bonuses on saving throws against the spell granted by the target’s race (such as the bonus from a dwarf’s hardy ability or a halfling’s halfling luck ability). Your studied spell doesn’t ignore energy resistance, damage reduction, or saving throw bonuses granted by other spells and effects. If you fail the Knowledge check, the spell still has its normal effects.",
      "Level Increase": "+2 (a studied spell uses up a spell slot 2 levels higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game Ultimate Intrigue © 2016, Paizo Inc.; Authors": "Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."
    }
  },
  {
    "Stygian Spell (Metamagic)": {
      "Benefit(s)": "You can enhance any spell with the water descriptor that targets at least one creature to become a Stygian spell. Any creature successfully hit by a Stygian spell (if the spell requires an attack roll) or that fails its saving throw against a Stygian spell must succeed at a Will save (using the save DC of the original spell) or suffer the fugue lesser madness in addition to the spell’s normal effects. If the attack is a confirmed critical hit or the original saving throw result is a natural 1, the creature must instead succeed at a Will save (again using the same DC) or suffer the amnesia greater madness (Horror Adventures 186). Madness gained this way lasts indefinitely, but can be treated using the normal methods for curing madness. This is a mind-affecting effect, and creatures native to the River Styx are immune to it.",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Stylized Spell (Metamagic)": {
      "Prerequisite(s)": "Bluff 5 ranks, Spellcraft 5 ranks.",
      "Benefit(s)": "A stylized spell has slightly different verbal and somatic components than normal, and the spell effect appears noticeably different. The Spellcraft DC to identify a stylized spell as it is being cast is 10 higher than normal.",
      "Level Increase": "+1 (a stylized spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "*Special": "When you cast a spell modified by this feat, you can reduce the DC of the Spellcraft or Knowledge (arcana) check to identify the spell by 5 to disguise the spell in one of the following ways.",
      "Apparent Descriptor": "A stylized spell can appear to have a descriptor it lacks or appear to lack a descriptor it truly has. Changing an apparent energy descriptor changes the superficial manifestation of the energy in the spell effect but does not change the type of damage the spell deals. If the energy damages any creatures or objects, an observer who succeeds at a DC 15 Knowledge (arcana) or Perception check as a move action can identify the actual type of damage dealt based on sensory clues.",
      "Apparent School": "A stylized spell can appear to be of a different school or subschool when studied with detect magic.",
      "Apparent Source of Magic": "A stylized spell can appear to be a different type of magic—arcane, divine, or psychic. The effect is convincing only if the spellcaster provides any necessary components (such as a divine focus when imitating divine spells), and the caster must have a number of ranks in the skill associated with that type of magic equal to the spell’s level. Knowledge (arcana) and Perform are associated with arcane magic, Knowledge (nature and religion) are associated with divine magic, and Bluff and Knowledge (arcana) are associated with psychic magic. A spellcaster can disguise his spell as psychic magic only if he can hide or remove the spell’s verbal and somatic components (if any), such as with Conceal Spell, Secret Signs, Silent Spell, or Still Spell.",
      "Direction of Spell’s Effect": "A stylized spell effect that visibly originates from the caster (such as a ray, magic missile, or fireball bead) can instead appear to originate from another point within 30 feet of the caster. There must be clear lines of effect between each of the caster, the new origin point, and the destination. If the spell effect instead fills an area that originates from the caster (such as a line or cone), the effect can instead appear to originate from any point in that area. The new point of origin is entirely cosmetic, and it does not allow the spellcaster to ignore cover or other barriers. In addition, the deception can’t make it appear that another creature cast the spell.",
      "Imitate a Dissimilar Spell": "If a stylized spell appears to be of the same school and same source of magic, and to have the same descriptors as another spell because of other stylized spell modifications or changes from other sources (such as a class ability), the stylized spell can take on the superficial visual and auditory properties of the other spell.",
      "Suppress Audible or Visible Effects": "A stylized spell’s effects can be suppressed to the point where they are difficult to spot or hear. Such a spell’s audible and visual effects are largely transparent, quieter, smaller, or otherwise less obtrusive. A creature notices the suppressed effects only if it succeeds at a Perception check (DC = 10 + your number of ranks in Bluff or Spellcraft + the highest of your Intelligence, Wisdom or Charisma modifiers). If, at the GM’s discretion, a spell’s effects are intrinsically bound to its visual or auditory signature (such as sunburst, sound burst, and most spells with the language-dependent, light, or sonic descriptors), reduce the DC of the Perception by 10.",
      "Source PPC": "ISI"
    }
  },
  {
    "Tenacious Spell (Metamagic)": {
      "Benefit(s)": "Increase the DC of caster level checks to counter or dispel a tenacious spell by 2. If a tenacious spell is dispelled or dismissed, it lasts for 1d4 further rounds (to a maximum of the spell’s normal duration) before ending (this does not occur if antimagic field or a similar spell or effect suppresses or ends the spell’s effect without dispelling or dismissing it). The lingering auras of tenacious spells detectable with detect magic last for twice as long as usual after the spells end.",
      "Level Increase": "+1 (a tenacious spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game Ultimate Intrigue © 2016, Paizo Inc.; Authors": "Jesse Benner, John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, Robert N. Emerson, Amanda Hamon Kunz, Steven Helt, Thurston Hillman, Tim Hitchcock, Mikko Kallio, Rob McCreary, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alexander Riggs, David N. Ross, David Schwartz, Mark Seifter, Linda Zayas-Palmer."
    }
  },
  {
    "Tenebrous Spell (Metamagic)": {
      "Benefit": "When you cast a tenebrous spell in darkness or dim light, the spell’s effective caster level and any associated save DCs are increased by 1. Any attempts at dispelling a tenebrous spell in darkness or dim light take a –2 penalty on the dispel check.",
      "Pathfinder Campaign Setting": "Inner Sea Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Thanatopic Spell (Metamagic)": {
      "Prerequisites": "Knowledge (religion) 6 ranks, Spell Focus (necromancy).",
      "Benefit": "A thanatopic spell pierces defenses and immunities that protect against death effects, negative levels, and energy drain, affecting the target as if the protective barrier did not exist.",
      "Level Increase": "+2 (a thanatopic spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Normal": "Defenses such as death ward negate death effects, negative levels, and energy drain. Undead are immune to these attacks.",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Threnodic Spell (Metamagic)": {
      "Prerequisites": "Knowledge (religion) 6 ranks, Spell Focus (necromancy).",
      "Benefit": "This feat only works on mind-affecting spells. A threnodic spell affects undead creatures (even mindless undead) as if they weren’t immune to mind-affecting effects, but has no effect on living creatures.",
      "Level Increase": "+2 (a threnodic spell uses up a spell slot two level higher than the spell’s actual level.)",
      "Normal": "Undead are immune to mind-affecting effects.",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Thundering Spell (Metamagic)": {
      "Benefit": "You can modify a spell to deafen a creature damaged by the spell. When a creature takes damage from this spell, it becomes deafened for a number of rounds equal to the original level of the spell. If the spell allows a saving throw, a successful save negates the deafening effect. If the spell does not allow a save, the target can make a Fortitude save to negate the deafening effect. If the spell effect also causes the creature to become deafened, the duration of this metamagic effect is added to the duration of the spell.",
      "Level Increase": "+2 (a thundering spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Advanced Player’s Guide. Copyright 2010, Paizo Publishing, LLC; Author": "Jason Bulmahn."
    }
  },
  {
    "Toppling Spell (Metamagic)": {
      "Benefit": "The impact of your force spell is strong enough to knock the target prone. If the target takes damage, fails its saving throw, or is moved by your force spell, make a trip check against the target, using your caster level plus your casting ability score bonus (Wisdom for clerics, Intelligence for wizards, and so on). This does not provoke an attack of opportunity. If the check fails, the target cannot attempt to trip you or the force effect in response.",
      "Level Increase": "+1 (a toppling spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder Roleplaying Game": "Ultimate Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Toxic Spell (Metamagic)": {
      "Prerequisite(s)": "Craft (poison) 5 ranks, ability to cast 2nd-level spells, poison use class feature.",
      "Benefit(s)": "You can use 1 dose of contact, ingested, inhaled, or injury poison as an additional material component for a spell you cast. This spell gains the poison descriptor. Select a single creature affected by the spell. If that creature fails its saving throw against the spell, it must also attempt a saving throw against the poison used as a material component. If the target fails the save against the poison, the poison takes effect immediately, ignoring any onset time. The poison uses its save DC (rather than the save DC of the spell), but is modified by any effects that increase the spell’s DC (such as Spell Focus). This feat works only with spells whose effects can be negated by a successful Fortitude save.",
      "Level Increase": "+1 (a toxic spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Dirty Tactics Toolbox © 2015, Paizo Inc.; Authors"
    }
  },
  {
    "Traumatic Spell (Metamagic)": {
      "Benefit(s)": "A traumatic spell causes lingering memories of pain and suffering in creatures harmed by it. When a creature fails a saving throw against a traumatic spell, the next time it sleeps it must succeed at a Will save with a DC equal to the original spell’s DC or be affected as if by nightmare. Each time the target fails its save, it must save again the following night or be affected by another nightmare, though the save DC decreases by 2 each night after the first.",
      "Level Increase": "+2 (a traumatic spell uses up a spell slot 2 levels higher than the spell’s actual level.",
      "Pathfinder Roleplaying Game Occult Adventures © 2015, Paizo Inc.; Authors": "John Bennett, Logan Bonner, Robert Brookes, Jason Bulmahn, Ross Byers, John Compton, Adam Daigle, Jim Groves, Thurston Hillman, Eric Hindley, Brandon Hodge, Ben McFarland, Erik Mona, Jason Nelson, Tom Phillips, Stephen Radney-MacFarland, Thomas M. Reid, Alex Riggs, Robert Schwalb, Mark Seifter, Russ Taylor, and Steve Townshend."
    }
  },
  {
    "Trick Spell (Metamagic)": {
      "Prerequisite(s)": "Ability to cast 1st-level spells, chaotic neutral alignment, worshiper of a deity of trickery, lust, and revenge.",
      "Benefit(s)": "Only enchantment spells that affect a single target and can be negated with a successful Will save can be trick spells. If the target fails its Will save against a trick spell, in addition to the spell’s normal effects, the target also clumsily hinders itself. Immediately attempt a special combat maneuver check (1d20 + your caster level + your Charisma bonus) to perform a dirty trick combat maneuver against the target. Any feats you have that apply to dirty trick maneuvers (such as Greater Dirty Trick) also apply to this check.",
      "Level Increase": "+1 (a trick spell takes up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Dirty Tactics Toolbox © 2015, Paizo Inc.; Authors"
    }
  },
  {
    "Tumultuous Spell (Metamagic)": {
      "Benefit(s)": "You can enhance any spell that targets a single creature to become a tumultuous spell. A creature hit by a tumultuous spell (if the spell requires an attack roll) or that fails its saving throw against a tumultuous spell immediately moves 1d4×5 feet in a random direction. This movement does not provoke attacks of opportunity. If this movement would force a creature into a solid object or another creature, the movement ends harmlessly just before impact.",
      "Pathfinder Roleplaying Game Planar Adventures © 2018, Paizo Inc.; Authors": "Robert Brookes, John Compton, Paris Crenshaw, Eleanor Ferron, Thurston Hillman, James Jacobs, Isabelle Lee, Lyz Liddell, Ron Lundeen, Joe Pasini, Lacy Pellazar, Jessica Price, Mark Seifter, F. Wesley Schneider, Todd Stewart, James L. Sutter, and Linda Zayas-Palmer."
    }
  },
  {
    "Umbral Spell (Metamagic)": {
      "Prerequisite": "Tenebrous Spell.",
      "Benefit": "An umbral spell gains the darkness descriptor. As long as the spell is in effect, the creature or object affected radiates darkness in a 10-foot radius, reducing illumination similar to the effects of the darkness spell. Nonmagical sources of light, such as torches or lanterns, do not increase the light level in this area. Magical light sources only increase the light level in an area affected by an umbral spell if they are of a higher level than the umbral spell’s unmodified spell level. This effect does not stack with itself or with any other effect that creates darkness.",
      "Level Increase": "+2 (an umbral spell uses up a spell slot two levels higher than the spell’s actual level.)",
      "Pathfinder Campaign Setting": "Inner Sea Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Tenebrous Spell (Metamagic)": {
      "Benefit": "When you cast a tenebrous spell in darkness or dim light, the spell’s effective caster level and any associated save DCs are increased by 1. Any attempts at dispelling a tenebrous spell in darkness or dim light take a –2 penalty on the dispel check.",
      "Pathfinder Campaign Setting": "Inner Sea Magic. © 2011, Paizo Publishing, LLC; Authors"
    }
  },
  {
    "Vast Spell (Metamagic)": {
      "Prerequisite(s)": "Caster level 3rd.",
      "Benefit(s)": "You can alter a spell that targets a number of creatures no more than 30 feet apart, such as haste. The maximum distance apart of those you target with the spell increases to 60 feet.",
      "Level Increase": "+1 (a vast spell uses up a spell slot 1 level higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Magic Tactics Toolbox © 2016, Paizo Inc.; Authors"
    }
  },
  {
    "Verdant Spell (Metamagic)": {
      "Prerequisites": "Spell Focus (enchantment), Knowledge (nature) 6 ranks.",
      "Benefit": "A verdant spell affects plant creatures (even mindless plant creatures) as if they weren’t immune to mind-affecting effects, but it has no effect on other types of creatures. This feat works only on mind-affecting spells.",
      "Level Increase": "+2 (a verdant spell uses up a spell slot 2 levels higher than the spell’s actual level.)",
      "Normal": "Creatures of the plant type are immune to mind-affecting effects.",
      "Pathfinder Roleplaying Game Ultimate Wilderness © 2017, Paizo Inc.; Authors": "Alexander Augunas, John Bennett, Robert Brookes, John Compton, Dan Dillon, Steven T. Helt, Thurston Hillman, Eric Hindley, Mikko Kallio, Jason Keeley, Isabelle Lee, Jason Nelson, Stephen Radney-MacFarland, Alex Riggs, David N. Ross, David Schwartz, Mark Seifter, Jeffery Swank, and Linda Zayas-Palmer."
    }
  },
  {
    "Widen Spell (Metamagic)": {
      "Benefit": "You can alter a burst, emanation, or spread-shaped spell to increase its area. Any numeric measurements of the spell’s area increase by 100%.",
      "Level Increase": "+3 (a widened spell uses up a spell slot three levels higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  },
  {
    "Yai-Mimic Spell (Metamagic)": {
      "Prerequisites": "Int 15, Still Spell.",
      "Benefit": "You can modify a ray spell to issue from the center of your forehead, where the third eye would be on a yai. This spell doesn’t require somatic components.",
      "Level Increase": "+3 (a yai-mimic spell uses up a spell slot 3 levels higher than the spell’s actual level.)",
      "Pathfinder Player Companion": "Giant Hunter’s Handbook © 2014, Paizo Inc.; Authors"
    }
  },
  {
    "Still Spell (Metamagic)": {
      "Benefit": "A stilled spell can be cast with no somatic components. Spells without somatic components are not affected.",
      "Level Increase": "+1 (a stilled spell uses up a spell slot one level higher than the spell’s actual level.)",
      "Pathfinder RPG Core Rulebook. Copyright 2009, Paizo Publishing, LLC; Author": "Jason Bulmahn, based on material by Jonathan Tweet, Monte Cook, and Skip Williams."
    }
  }
]