{
    "aberrant": {
        "class skills": "Knowledge (dungeoneering)",
        "bonus spells": [
            "Enlarge Person (3rd)", "See Invisibility (5th)", "Tongues (7th)", "Black Tentacles (9th)",
            "Feeblemind (11th)", "Veil (13th)", "Plane Shift (15th)", "Mind Blank (17th)", "Shapechange (19th)"
        ],
        "bonus feats": [
            "Combat Casting", "Improved Disarm", "Improved Grapple", "Improved Initiative", "Improved Unarmed Strike",
            "Iron Will", "Silent Spell", "Skill Focus (Knowledge (dungeoneering))"
        ],
        "bloodline arcana": "Whenever you cast a spell of the polymorph subschool, increase the duration of the spell by 50% (minimum 1 round). This bonus does not stack with the increase granted by the Extend Spell feat.",
        "bloodline power": {
        "Acidic Ray (Sp)": "Starting at 1st level, you can fire an acidic ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. The acidic ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
        "Long Limbs (Ex)": "At 3rd level, your reach increases by 5 feet whenever you are making a melee touch attack. This ability does not otherwise increase your threatened area. At 11th level, this bonus to your reach increases to 10 feet. At 17th level, this bonus to your reach increases to 15 feet.",
        "Unusual Anatomy (Ex)": "At 9th level, your anatomy changes, giving you a 25% chance to ignore any critical hit or sneak attack scored against you. This chance increases to 50% at 13th level.",
        "Alien Resistance (Su)": "At 15th level, you gain spell resistance equal to your sorcerer level + 10.",
        "Aberrant Form (Ex)": "At 20th level, your body becomes truly unnatural. You are immune to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/."
    }
},
    "abyssal": {
        "class skills": "Knowledge (planes)",
        "bonus spells": [
            "Cause Fear (3rd)", "Bull's Strength (5th)", "Rage (7th)", "Stoneskin (9th)",
            "Dismissal (11th)", "Transformation (13th)", "Greater Teleport (15th)", "Unholy Aura (17th)", "Summon Monster IX (19th)"
        ],
        "bonus feats": [
            "Augment Summoning", "Cleave", "Empower Spell", "Great Fortitude", "Improved Bull Rush", "Improved Sunder", "Power Attack", "Skill Focus (Knowledge [planes])"
        ],
        "bloodline arcana": "Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/good equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.",
        "bloodline power": {
        "Claws (Su)": "At 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. These attacks deal 1d4 points of damage each (1d3 if you are small) plus your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are small). At 11th level, these claws become flaming weapons, each dealing an additional 1d6 points of fire damage on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.",
        "Demon Resistances (Ex)": "At 3rd level, you gain resist electricity 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to electricity increases to 10 and your bonus on poison saving throws increases to +4.",
        "Strength of the Abyss (Ex)": "At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.",
        "Added Summonings (Su)": "At 15th level, whenever you summon a creature with the demon subtype or the fiendish template using a summon monster spell, you summon one additional creature of the same kind.",
        "Demonic Might (Su)": "At 20th level, the power of the abyss flows through you. You gain immunity to electricity and poison. You also gain resistance to acid 10, cold 10, and fire 10, and gain telepathy with a range of 60 feet (allowing you to communicate with any creature that can speak a language)."
    }
},
    "accursed": {
        "class skills": "Perception",
        "bonus spells": [
            "Ray of Enfeeblement (3rd)", "Touch of Idiocy (5th)", "Ray of Exhaustion (7th)", "Bestow Curse (9th)",
            "Feeblemind (11th)", "Eyebite (13th)", "Insanity (15th)", "Dimensional Lock (17th)", "Energy Drain (19th)"
        ],
        "bonus feats": [
            "Alertness", "Blind-Fight", "Combat Casting", "Deceitful", "Defensive Combat Training", "Endurance", "Great Fortitude", "Mounted Combat"
        ],
        "bloodline arcana": "You count as a hag for the purpose of joining a hag's coven. The coven must contain at least one hag. In addition, whenever you are within 30 feet of another sorcerer with this bloodline or a witch with the coven hex, you can use the aid another action to grant a +1 bonus to the other spellcaster's caster level for 1 round.",
        "bloodline power": {
        "Horrific Visage (Su)": "At 1st level, you can draw upon your hag ancestor to cause one target to perceive you as having a horrifying appearance. As a standard action, you can force one target within 30 feet to make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be shaken for 1 round for every 2 sorcerer levels you possess (minimum 1 round). This is a mind-affecting, fear-based ability. This fear does not stack with other fear effects. You may use this ability a number of times per day equal to 3 + your Charisma modifier.",
        "Wretched Endurance (Ex)": "At 3rd level, you gain a +2 bonus on all saving throws against charm, cold, fear, fire, and sleep effects. At 9th level, these bonuses increase to +4.",
        "Dread Gaze (Su)": "At 9th level, you gain a form of the green hag's evil eye power. As a standard action, you may fix your gaze on any one creature within 60 feet. The target must make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be staggered for 1 round for every 2 sorcerer levels you possess. You may use this ability once per day at 9th level. At 17th level, you can use this ability twice per day. At 20th level, you may use this ability three times per day.",
        "Dream Walking (Sp)": "At 15th level, you can enter the ethereal plane. This functions like ethereal jaunt, but with a duration of 1 minute for every 2 sorcerer levels you possess. Once during this trip, you may cast nightmare as a spell-like ability on a creature you see on the material plane. (This is an exception to the normal rule that ethereal creatures cannot affect targets on the material plane.)",
        "Fearsome Survival (Su)": "At 20th level, your hag-blood gives you considerable resilience. You gain DR 10/cold iron, and gain SR equal to 6 + your sorcerer level."
    }
},
    "aquatic": {
        "class skills": "Swim",
        "bonus spells": [
            "Hydraulic Push* (3rd)", "Slipstream* (5th)", "Aqueous Orb* (7th)", "Geyser* (9th)",
            "Control Water (11th)", "Beast Shape IV (13th)", "Summon Monster VII (15th)", "Seamantle* (17th)", "World Wave* (19th)"
        ],
        "bonus feats": [
            "Athletic", "Brew Potion", "Defensive Combat Training", "Dodge", "Mobility", "Silent Spell", "Skill Focus (Swim)", "Toughness"
        ],
        "bloodline arcana": "Whenever you cast a spell of the water type, your effective caster level is increased by one, and summoned creatures with a swim speed or the aquatic or water type gain a +1 morale bonus on attack and damage rolls.",
        "bloodline power": {
        "Dehydrating Touch (Sp)": "Starting at 1st level, you can make a melee touch attack as a standard action that inflicts 1d6 points of nonlethal damage + 1 for every two sorcerer levels you possess and sickens the target for 1 round. Oozes, plants, and creatures with the aquatic or water subtypes suffer lethal damage instead. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
        "Aquatic Adaptation (Ex)": "At 3rd level, you gain a swim speed of 30 feet. At 9th level, you gain the amphibious special quality and develop a fat layer that grants a +1 natural armor bonus and resist cold 5. When immersed in water, you gain blindsense 30 feet. At 15th level, you gain a swim speed of 60 feet and blindsense of 60 feet in water.",
        "Aquatic Telepathy (Su)": "At 9th level, you gain telepathy (100 feet) and can communicate with creatures with a swim speed or the aquatic or water types regardless of intelligence. You may cast suggestion on such creatures a number of times per day equal to your Charisma modifier. This ability is telepathic and does not require audible or visual components. At 15th level, once per day you can telepathically call and request a service from an aquatic, water, or swimming creature as if using demand or greater planar ally.",
        "Raise the Deep (Sp)": "At 15th level, you raise water as per control water, but no water need be present. This created water is stationary and does not flow out of the area where you create it; it lasts 1 round per sorcerer level and then disappears. At 20th level, the dimensions of the effect are doubled. You may use this ability once per day.",
        "Deep One (Ex)": "At 20th level, you gain blindsense 60 feet and your body is covered with fine, slippery scales granting DR 10/piercing, resist cold 20, and continuous freedom of movement. Underwater, you gain evasion and blindsight 120 feet, and you are immune to pressure damage from deep water."
    }
}
    ,
    
    "arcane": {
        "description": ["Your family has always been skilled in the eldritch art of magic. While many of your relatives were accomplished wizards, your powers developed without the need for study and practice."],
        "class skill": ["Knowledge (any one)."],
        "bonus spells": [
            "Identify (3rd)", "Invisibility (5th)", "Dispel Magic (7th)", "Dimension Door (9th)", "Overland Flight (11th)",
            "True Seeing (13th)", "Greater Teleport (15th)", "Power Word Stun (17th)", "Wish (19th)"
        ],
        "bonus feats": ["Combat Casting", "Improved Counterspell", "Improved Initiative", "Iron Will", "Scribe Scroll", "Skill Focus (Knowledge [arcana])", "Spell Focus", "Still Spell"],
        "bloodline arcana": ["Whenever you apply a metamagic feat to a spell that increases the slot used by at least one level, increase the spell's DC by +1. This bonus does not stack with itself and does not apply to spells modified by the Heighten Spell feat."],
        "bloodline powers": {
        "arcane bond (Su)": ["At 1st level, you gain an arcane bond, as a wizard equal to your sorcerer level. Your sorcerer levels stack with any wizard levels you possess when determining the powers of your familiar or bonded object. Once per day, your bonded item allows you to cast any one of your spells known (unlike a wizard's bonded item, which allows him to cast any one spell in his spellbook). This ability does not allow you to have both a familiar and a bonded item."],
        "metamagic adept (Ex)": ["At 3rd level, you can apply any one metamagic feat you know to a spell you are about to cast without increasing the casting time. You must still expend a higher-level spell slot to cast this spell. You can use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 19th level. At 20th level, this ability is replaced by Arcane Apotheosis."],
        "new arcana (Ex)": ["At 9th level, you can add any one spell from the sorcerer/wizard spell list to your list of spells known. This spell must be of a level that you are capable of casting. You can also add one additional spell at 13th level and 17th level."],
        "school power (Ex)": ["At 15th level, pick one school of magic. The DC for any spells you cast from that school increases by +2. This bonus stacks with the bonus granted by Spell Focus."],
        "arcane apotheosis (Ex)": ["At 20th level, your body surges with arcane power. You can add any metamagic feats that you know to your spells without increasing their casting time, although you must still expend higher-level spell slots. Whenever you use magic items that require charges, you can instead expend spell slots to power the item. For every three levels of spell slots that you expend, you consume one less charge when using a magic item that expends charges."]
    }
},
    "boreal": {
        "description": ["Descended from inhabitants of the lands of ice and snow, you count among your ancestors giant-kin, troll-born, and frost-rimed spirits. Their savage and raw energies flow down through generations to infuse you to the marrow with the chill of the polar wind, crackling auroras, and the long winter's night."],
        "class skill": ["Survival."],
        "bonus spells": [
            "Enlarge Person (3rd)", "Rage (5th)", "Elemental Aura* (Cold only) (7th)", "Wall of Ice (9th)", "Cone of Cold (11th)",
            "Transformation (13th)", "Giant Form I (15th)", "Polar Ray (17th)", "Meteor Swarm (dealing cold damage) (19th)"
        ],
        "bonus feats": ["Arcane Strike", "Diehard", "Empower Spell", "Endurance", "Exotic Weapon Proficiency", "Power Attack", "Skill Focus (Intimidate)", "Toughness"],
        "bloodline arcana": ["Whenever you cast a spell with the cold descriptor, increase the spell's save DC by 1."],
        "bloodline powers": {
        "Cold Steel (Sp)": ["At 1st level, you can touch a weapon or up to 50 pieces of ammunition as a standard action, giving it the frost property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the Icy Burst property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier."],
        "Icewalker (Ex)": ["At 3rd level, you gain Resist Cold 5 and can move across snow and icy surfaces without penalty and without leaving tracks. At 9th level, you gain Resist Cold 10 and can climb icy surfaces as if using Spider Climb."],
        "Snow Shroud (Su)": ["At 9th level, you ignore concealment and perception penalties in natural or magical snow, ice, fog, and similar weather conditions. In addition, you can surround yourself with a cloak of swirling snow for a number of rounds per day equal to your sorcerer level. This power acts and deals damage as a Fire Shield (Chill Shield) that sheds no light. It provides a 20% miss chance on attacks made against you and grants a bonus on Stealth checks equal to 1/2 your sorcerer level in snowy or icy areas. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th."],
        "Blizzard (Sp)": ["At 15th level, you can create a savage winter storm centered on you. This power acts as Control Winds, but in addition, the entire area (not including the eye at the center of the storm) is affected as a Sleet Storm and all in the area are exposed to extreme cold. You may use this ability once per day."],
        "Child of Ancient Winters (Su)": ["At 20th level, you gain the Cold subtype and you become immune to fatigue and exhaustion. In addition, you gain immunity to sneak attacks and critical hits. This power causes you to gain vulnerability to fire."]
    }
},
    "celestial": {
        "description": ["Your blood is blessed by a celestial power, either from a celestial ancestor or through divine intervention. Although this power drives you along the path of good, your fate (and alignment) is your own to determine."],
        "class skill": ["Heal."],
        "bonus spells": [
            "Bless (3rd)", "Resist Energy (5th)", "Magic Circle Against Evil (7th)", "Remove Curse (9th)", "Flame Strike (11th)",
            "Greater Dispel Magic (13th)", "Banishment (15th)", "Sunburst (17th)", "Gate (19th)"
        ],
        "bonus feats": ["Dodge", "Extend Spell", "Iron Will", "Mobility", "Mounted Combat", "Ride-By Attack", "Skill Focus (Knowledge [Religion])", "Weapon Finesse"],
        "bloodline arcana": ["Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/evil equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have."],
        "bloodline powers": {
        "Heavenly Fire (Sp)": ["Starting at 1st level, you can unleash a ray of heavenly fire as a standard action, targeting any foe within 30 feet as a ranged touch attack. Against evil creatures, this ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is divine and not subject to energy resistance or immunity. This ray heals good creatures of 1d4 points of damage + 1 for every two sorcerer levels you possess. A good creature cannot benefit from your Heavenly Fire more than once per day. Neutral creatures are neither harmed nor healed by this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier."],
        "Celestial Resistances (Ex)": ["At 3rd level, you gain Resist Acid 5 and Resist Cold 5. At 9th level, your resistances increase to 10."],
        "Wings of Heaven (Su)": ["At 9th level, you can sprout feathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1-minute increments."],
        "Conviction (Su)": ["At 15th level, you can reroll any one ability check, attack roll, skill check, or saving throw you just made. You must decide to use this ability after the die is rolled, but before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability once per day."],
        "Ascension (Su)": ["At 20th level, you become infused with the power of the heavens. You gain:", "- Immunity to acid, cold, and petrification", "- Resist electricity 10", "- Resist fire 10", "- +4 racial bonus on saves against poison", "- Unlimited use of the Wings of Heaven ability", "- The ability to speak with any creature that has a language (as per the Tongues spell)."]
    }
},
    "deep earth": {
        "description": ["The echoing cave-songs and the rumble and creak of primal spirits deep below the ground thrum in your soul and in all your family line. You are likely slow, steady, and stable in your thinking, little prone to wandering and preferring to instead find depth in contemplation."],
        "class skill": ["Knowledge (Dungeoneering)."],
        "bonus spells": [
            "Expeditious Excavation* (3rd)", "Darkvision (5th)", "Shifting Sand* (7th)", "Stoneskin (9th)", "Spike Stones (11th)",
            "Stone Tell (13th)", "Repel Metal or Stone (15th)", "Earthquake (17th)", "Clashing Rocks* (19th)"
        ],
        "bonus feats": ["Acrobatic Steps", "Alertness", "Blind-Fight", "Forge Ring", "Nimble Moves", "Skill Focus (Perception)", "Stealthy", "Still Spell"],
        "bloodline arcana": ["Whenever you and the target of your spell are both underground, increase the spell's save DC by +1."],
        "bloodline powers": {
        "Tremor (Sp)": ["At 1st level, as a standard action, you can cause the ground to shake beneath a single creature within 30 feet, functioning as a trip maneuver using your sorcerer level plus your Charisma modifier in place of your CMB. You can use this ability a number of times per day equal to 3 + your Charisma modifier."],
        "Rockseer (Su)": ["At 3rd level, you gain the Stonecunning trait as a dwarf; if already a dwarf, your bonus improves to +4. At 9th level, you gain Tremorsense 30 feet. At 15th level, you can see through solid objects as if using a Ring of X-ray Vision for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive."],
        "Crystal Shard (Sp)": ["At 9th level, you can touch a metal or stone weapon (or up to 50 pieces of ammunition) as a standard action, giving it the Bane property against any creature with the Earth subtype, oozes, or constructs made of stone or metal, for 1 minute. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th."],
        "Earth Glide (Ex)": ["At 15th level, you can glide through any sort of natural earth or stone as easily as a fish swims through water, with a burrow speed equal to half your normal speed. You do not leave a tunnel or trace of your passage. You can use this ability for 1 minute per sorcerer level each day. The duration need not be continuous, but it must be used in 1-minute increments."],
        "Strength of Stone (Su)": ["At 20th level, your flesh becomes as hard as stone, giving you DR 10/Adamantine, and you become immune to petrification. You suffer no penalties while squeezing through tight spaces and are immune to bull rush, drag, grapple, reposition, and trip maneuvers, and to push and pull effects as long as you are standing on the ground."]
    }
}
    ,
    
    "destined": {
        "description": ["Your family is destined for greatness in some way. Your birth could have been foretold in prophecy, or perhaps it occurred during an especially auspicious event, such as a solar eclipse. Regardless of your origin, you have a great future ahead."],
        "class skill": ["Knowledge (History)."],
        "bonus spells": [
            "Alarm (3rd)", "Blur (5th)", "Protection from Energy (7th)", "Freedom of Movement (9th)", "Break Enchantment (11th)",
            "Mislead (13th)", "Spell Turning (15th)", "Moment of Prescience (17th)", "Foresight (19th)"
        ],
        "bonus feats": ["Arcane Strike", "Diehard", "Endurance", "Leadership", "Lightning Reflexes", "Maximize Spell", "Skill Focus (Knowledge [History])", "Weapon Focus"],
        "bloodline arcana": ["Whenever you cast a spell with a range of personal, you gain a luck bonus equal to the spell's level on all your saving throws for 1 round."],
        "bloodline powers": {
        "Touch of Destiny (Sp)": ["At 1st level, you can touch a creature as a standard action, giving it an insight bonus on attack rolls, skill checks, ability checks, and saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier."],
        "Fated (Su)": ["Starting at 3rd level, you gain a +1 luck bonus on all of your saving throws and to your AC during surprise rounds and when you are otherwise unaware of an attack. At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level."],
        "It Was Meant to Be (Su)": ["At 9th level, you may reroll any one attack roll, critical hit confirmation roll, or level check made to overcome spell resistance. You must decide to use this ability after the first roll is made but before the results are revealed by the GM. You must take the second result, even if it is worse. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day."],
        "Within Reach (Su)": ["At 15th level, your ultimate destiny is drawing near. Once per day, when an attack or spell that causes damage would result in your death, you may attempt a DC 20 Will save. If successful, you are instead reduced to 1 hit point and are automatically stabilized. The bonus from your Fated ability applies to this save."],
        "Destiny Realized (Su)": ["At 20th level, your moment of destiny is at hand. Any critical threats made against you only confirm if the second roll results in a natural 20 on the die. Any critical threats you score with a spell are automatically confirmed. Once per day, you can automatically succeed at one caster level check made to overcome spell resistance. You must use this ability before making the roll."]
    }
}
    
    ,
    
    "djinni": {
        "description": [
          "you were born with the power of air genies, and the magic of the djinn is strong in you. "
        ],
        "class skills": "knowledge (planes)",
        "bonus spells": [
          "shocking grasp (3rd)", "invisibility (5th)", "fly (7th)", "minor creation (9th)", "overland flight (11th)", "chain lightning (13th)", "plane shift (15th)", "greater planar binding (17th)", "wish (19th)"
        ],
        "bonus feats": [
          "dodge", "empower spell", "great fortitude", "improved initiative", "lightning reflexes", "power attack", "skill focus (knowledge [planes])", "weapon finesse"
        ],
        "bloodline arcana": "whenever you cast a spell that deals energy damage, you can change the type of damage to electricity. This also changes the spells descriptors to match this energy type.",
        "bloodline power": {
          "Electricity Ray (Sp)": "At 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of electricity damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your charisma modifier.",
          "Elemental Resistance (Ex)": "At 3rd level, you gain electricity resistance 10. Your electricity resistance increases to 20 at 9th level.",
          "Whirlwind (Su)": "At 9th level, you gain the ability to turn into a 10-foot-high whirlwind once per day for 1 round per sorcerer level.",
          "Elemental Movement (Su)": "At 15th level, you gain a fly speed of 60 feet with average maneuverability.",
          "Power of the Djinn (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words 'I wish,' and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component."
        }
      },
      "draconic": {
        "class skills": "Perception",
        "bonus spells": [
          "Mage Armor (3rd)", "Resist Energy (5th)", "Fly (7th)", "Fear (9th)", "Spell Resistance (11th)", "Form of the Dragon I (13th)", "Form of the Dragon II (15th)", "Form of the Dragon III (17th)", "Wish (19th)"
        ],
        "bonus feats": [
          "Blind-Fight", "Great Fortitude", "Improved Initiative", "Power Attack", "Quicken Spell", "Skill Focus (Fly)", "Skill Focus (Knowledge [Arcana])", "Toughness"
        ],
        "bloodline arcana": "Whenever you cast a spell with an energy descriptor that matches your draconic's energy type, that spell deals +1 point of damage per die rolled.",
        "bloodline power": {
          "Claws (Su)": "Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action.",
          "Dragon Resistances (Ex)": "At 3rd level, you gain resist 5 against your energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and natural armor bonus increases to +2.",
          "Breath Weapon (Su)": "At 9th level, you gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per sorcerer level.",
          "Wings (Su)": "At 15th level, leathery dragon wings grow from your back as a standard action, giving you a fly speed of 60 feet with average maneuverability.",
          "Power of Wyrms (Su)": "At 20th level, your draconic heritage becomes manifest. You gain immunity to paralysis, sleep, and damage of your energy type. You also gain blindsense 60 feet."
        }
      },
      "dreamspun": {
        "class skills": "Sense Motive",
        "bonus spells": [
          "Sleep (3rd)", "Augury (5th)", "Deep Slumber (7th)", "Divination (9th)", "Dream (11th)", "Shadow Walk (13th)", "Vision (15th)", "Moment of Prescience (17th)", "Astral Projection (19th)"
        ],
        "bonus feats": [
          "Alertness", "Blind-Fight", "Combat Expertise", "Deceitful", "Heighten Spell", "Improved Feint", "Persuasive", "Skill Focus (Sense Motive)"
        ],
        "bloodline arcana": "Whenever you target a single creature with a spell, you gain an insight bonus equal to half the spell's level (minimum +1) for 1 round to your AC and saving throws against any spell or attack made by that creature.",
        "bloodline power": {
          "Lullaby (Sp)": "At 1st level, you can use lullaby as a spell-like ability a number of times per day.",
          "Combat Precognition (Su)": "Your insight into the future grants you an advantage in combat.",
          "Dreamshaper (Sp)": "At 9th level, you can manipulate the dreamscape of others, drawing forth or tampering with their subconscious minds.",
          "Eye of Somnus (Sp)": "At 15th level, you can project your consciousness as if using arcane eye.",
          "Solipsism (Ex)": "At 20th level, you can drift into the dream world, fading from the world around you."
        }
      },
      "efreeti": {
        "description": [
          "you were born with the power of fire genies, and the magic of the efreet is strong in you. "
        ],
        "class skills": "knowledge (planes)",
        "bonus spells": [
          "enlarge person (3rd)", "scorching ray (5th)", "fireball (7th)", "wall of fire (9th)", "persistent image (11th)", "planar binding (13th)", "plane shift (15th)", "giant form ii (17th)", "wish (19th)"
        ],
        "bonus feats": [
          "dodge", "empower spell", "great fortitude", "improved initiative", "lightning reflexes", "power attack", "skill focus (knowledge [planes])", "weapon finesse"
        ],
        "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to fire. This also changes the spells descriptors to match this energy type.",
        "bloodline power": {
          "Fire Ray (Sp)": "At 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of fire damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your charisma modifier.",
          "Elemental Resistance (Ex)": "At 3rd level, you gain fire resistance 10. Your fire resistance increases to 20 at 9th level.",
          "Cinder Dance (Su)": "At 9th level, you can move through fire, lava, and magma without harm.",
          "Elemental Movement (Su)": "At 15th level, you gain a fly speed of 60 feet with average maneuverability.",
          "Power of the Efreet (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast limited wish as a spell-like ability. Such wishes must begin with the words 'I wish,' and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component."
        }
      },
    
    "elemental": {
    "description": [
    "the power of the elements resides in you, and at times you can hardly control its fury. "
    ],
    "class skill": [
    "knowledge (planes). "
    ],
    "bonus spells": [
    "burning hands* (3rd), scorching ray* (5th), protection from energy (7th), elemental body i (9th), elemental body ii (11th), elemental body iii (13th), elemental body iv (15th), summon monster viii (elementals only) (17th), elemental swarm (19th). ",
    "*these spells always deal a type of damage determined by your element. In addition, the subtype of these spells changes to match the energy type of your element. "
    ],
    "bonus feats": [
        "blind-fight", "great fortitude", "improved initiative", "power attack", "quicken spell", "skill focus (fly)", "skill focus (knowledge [arcana])", "toughness"
    ],
    "bloodline arcana": [
    "whenever you cast a spell that deals energy damage, you can change the type of damage to match the type of your. This also changes the spells type to match the type of your. "
    ],
    "bloodline powers": {
        "elemental ray (sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of damage of your energy type + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your charisma modifier.",
        "elemental resistance (ex)": "At 3rd level, you gain energy resistance 10 against your energy type. At 9th level, your energy resistance increases to 20.",
        "elemental blast (sp)": "At 9th level, you can unleash a blast of elemental power once per day. This 20-foot-radius burst does 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of your blast receive a reflex save for half damage. Creatures that fail their saves gain vulnerability to your energy type until the end of your next turn. The DC of this save is equal to 10 + 1/2 your sorcerer level + your charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.",
        "elemental movement (su)": "At 15th level, you gain a special movement type or bonus. This ability is based on your chosen element, as indicated on the Elemental Energy Types and Movement table.",
        "elemental body (su)": "At 20th level, elemental power surges through your body. You gain immunity to sneak attacks, critical hits, and damage from your energy type."
    }
    },
    "fey": {
    "description": [
    "the capricious nature of the fey runs in your family due to some intermingling of fey blood or magic. You are more emotional than most, prone to bouts of joy and rage. "
    ],
    "class skill": [
    "knowledge (nature). "
    ],
    "bonus spells": [
    "entangle (3rd), hideous laughter (5th), deep slumber (7th), poison (9th), tree stride (11th), mislead (13th), phase door (15th), irresistible dance (17th), shapechange (19th). "
    ],
    "bonus feats": [
        "blind-fight", "great fortitude", "improved initiative", "power attack", "quicken spell", "skill focus (fly)", "skill focus (knowledge [arcana])", "toughness"
    ],
    "bloodline arcana": [
    "whenever you cast a spell of the compulsion subschool, increase the spells dc by +2. "
    ],
    "bloodline powers": {
        "laughing touch (sp)": "At 1st level, you can cause a creature to burst out laughing for 1 round as a melee touch attack. A laughing creature can only take a move action but can defend itself normally. Once a creature has been affected by laughing touch, it is immune to its effects for 24 hours. You can use this ability a number of times per day equal to 3 + your charisma modifier. This is a mind-affecting effect.",
        "woodland stride (ex)": "At 3rd level, you can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you.",
        "fleeting glance (sp)": "At 9th level, you can turn invisible for a number of rounds per day equal to your sorcerer level. This ability functions as greater invisibility. These rounds need not be consecutive.",
        "fey magic (su)": "At 15th level, you may reroll any caster level check made to overcome spell resistance. You must decide to use this ability before the results are revealed by the GM. You must take the second result, even if it is worse.",
        "soul of the fey (su)": "At 20th level, your soul becomes one with the world of the fey. You gain immunity to poison and DR 10/cold iron. Creatures of the animal type do not attack you unless compelled to do so through magic. Once per day, you can cast shadow walk as a spell-like ability using your sorcerer level as your caster level."
    }
    }
    ,
    
    "infernal": {
    "description": [
    "somewhere in your familys history, a relative made a deal with a devil, and that pact has influenced your family line ever since. "
    ],
    "class skill": [
    "diplomacy. "
    ],
    "bonus spells": [
    "protection from good (3rd), scorching ray (5th), suggestion (7th), charm monster (9th), dominate person (11th), planar binding (devils and creatures with the fiendish template only) (13th), greater teleport (15th), power word stun (17th), meteor swarm (19th). "
    ],
    "bonus feats": [
    "blind-fight, combat expertise, deceitful, extend spell, improved disarm, iron will, skill focus (knowledge [planes]), spell penetration. "
    ],
    "bloodline arcana": [
    "whenever you cast a spell of the charm subschool, increase the spells dc by +2. "
    ],
    "bloodline powers": {
        "corrupting touch (sp)": "At 1st level, you can cause a creature to become shaken as a melee touch attack. This effect persists for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Creatures shaken by this ability radiate an aura of evil, as if they were an evil outsider (see detect evil). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your charisma modifier.",
        "infernal resistances (ex)": "At 3rd level, you gain resist fire 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to fire increases to 10 and your bonus on poison saving throws increases to +4.",
        "hellfire (sp)": "At 9th level, you can call down a column of hellfire. This 10-foot-radius burst does 1d6 points of fire damage per sorcerer level. Good creatures that fail their saves are shaken for a number of rounds equal to your sorcerer level. The DC of this save is equal to 10 + 1/2 your sorcerer level + your charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.",
        "on dark wings (su)": "At 15th level, you can grow fearsome bat wings as a standard action, giving you a fly speed of 60 feet with average maneuverability. The wings can be dismissed as a free action.",
        "power of the pit (su)": "At 20th level, your form becomes infused with vile power. You gain immunity to fire and poison. You also gain resistance to acid 10 and cold 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet."
    }
    },
    
    "maestro": {
    "description": [
    "the spiritual power of art and song runs strongly through your family line. "
    ],
    "class skill": [
    "perform. "
    ],
    "bonus spells": [
    "ventriloquism (3rd), hideous laughter (5th), suggestion (7th), shout (9th), dominate person (11th), mass suggestion (13th), power word blind (15th), greater shout (17th), wail of the banshee (19th). "
    ],
    "bonus feats": [
        "deceitful", "greater spell focus (enchantment)", "lingering performance", "persuasive", "skill focus (perform)", "spell focus (enchantment)", "spellsong", "still spell"
    ],
    "bloodline arcana": [
    "whenever you cast a spell with a verbal component and no somatic or material component, you treat your caster level as if it were one higher. "
    ],
        "bloodline powers": {
            "beguiling voice (ex)": "At 1st level, you can use the sound of your voice to lull a target creature into taking no action.",
            "fascinate (ex)": "At 3rd level, you gain the ability to use a perform skill to cause one or more creatures to become fascinated with you.",
            "perfect voice (su)": "At 9th level, you understand all efforts to communicate through sound and can make yourself understood to any creature able to understand language.",
            "inspire (sp)": "At 15th level, your artistic magic can inspire your allies to great accomplishments. You can use greater heroism as a spell-like ability.",
            "grand maestro (su)": "At 20th level, the power of pure magic music flows through you."
        }
    },
    
        "marid": {
            "description": ["You were born with the power of water genies, and the magic of the marids is strong in you."],
            "class skill": ["Knowledge (Planes)."],
            "bonus spells": [
                "Obscuring Mist (3rd)", "See Invisibility (5th)", "Gaseous Form (7th)", "Wall of Ice (9th)", "Persistent Image (11th)",
                "Elemental Body III (13th)", "Plane Shift (15th)", "Polar Ray (17th)", "Wish (19th)"
            ],
            "bonus feats": ["Dodge", "Empower Spell", "Great Fortitude", "Improved Initiative", "Lightning Reflexes", "Power Attack", "Skill Focus (Knowledge [Planes])", "Weapon Finesse"],
            "bloodline arcana": ["Whenever you cast a spell that deals energy damage, you can change the type of damage to cold."],
            "bloodline powers": {
            "Frost Ray (Sp)": ["Starting at 1st level, you can unleash an elemental ray as a standard action."],
            "Elemental Resistance (Ex)": ["At 3rd level, you gain cold resistance 10. At 9th level, your cold resistance increases to 20."],
            "Water's Fury (Su)": ["At 9th level, you gain the ability to summon a rushing jet of water from the Elemental Plane of Water and direct it against your foes."],
            "Elemental Movement (Su)": ["At 15th level, you gain a swim speed of 60 feet."],
            "Power of the Marid (Su)": ["At 20th level, you gain the power of genies to grant wishes."]
        }
    }
        ,
        "orc": {
            "description": ["The rage of your ancestors burns within you, and the taint of savage orc blood flows through your veins."],
            "class skill": ["Survival."],
            "bonus spells": [
                "Burning Hands (3rd)", "Bull's Strength (5th)", "Rage (7th)", "Wall of Fire (9th)", "Cloudkill (11th)",
                "Transformation (13th)", "Delayed Blast Fireball (15th)", "Iron Body (17th)", "Meteor Swarm (19th)"
            ],
            "bonus feats": ["Diehard", "Endurance", "Great Fortitude", "Intimidating Prowess", "Improved Overrun", "Power Attack", "Toughness", "Widen Spell"],
            "bloodline arcana": [
                "You gain the orc subtype, including darkvision 60 feet and light sensitivity. If you already have darkvision, its range increases to 90 feet. Whenever you cast a spell that deals damage, that spell deals +1 point of damage per die rolled."
            ],
            "bloodline powers": {
            "Touch of Rage (Sp)": ["At 1st level, you can touch a creature as a standard action, giving it a morale bonus on attack rolls, damage rolls, and Will saving throws."],
            "Fearless (Ex)": ["At 3rd level, you gain a +4 bonus on saving throws made against fear and a +1 natural armor bonus."],
            "Strength of the Beast (Ex)": ["At 9th level, you gain a +2 inherent bonus to your strength."],
            "Power of Giants (Sp)": ["At 15th level, you may grow to large size as a standard action."],
            "Warlord Reborn (Su)": ["At 20th level, you become a true orc warlord of legend."]
        }
    }
        ,
    
        "protean": {
            "description": ["Your carries the ever-changing wildness of primal chaos, the raw essence of unbound creation."],
            "class skill": ["Knowledge (Planes)."],
            "bonus spells": [
                "Entropic Shield (3rd)", "Blur (5th)", "Gaseous Form (7th)", "Confusion (9th)", "Major Creation (11th)",
                "Disintegrate (13th)", "Greater Polymorph (15th)", "Polymorph Any Object (17th)", "Shapechange (19th)"
            ],
            "bonus feats": ["Agile Maneuvers", "Defensive Combat Training", "Enlarge Spell", "Great Fortitude", "Improved Great Fortitude", "Skill Focus (Craft [Any])", "Spell Focus", "Toughness"],
            "bloodline arcana": ["Increase the DC to dispel Transmutation or Conjuration (Creation) spells that you cast by +4."],
            "bloodline powers": {
            "Protoplasm (Sp)": ["At 1st level, you can create a ball of entropic protoplasm and hurl it at targets within 30 feet."],
            "Protean Resistances (Ex)": ["At 3rd level, you gain resist acid 5 and a +2 bonus on saving throws against polymorph, petrification, and transmutation spells or effects."],
            "Reality Wrinkle (Sp)": ["At 9th level, you can surround yourself with a mobile, 10-foot-radius emanation of mutable reality."],
            "Spatial Tear (Sp)": ["At 15th level, you can unravel the fibers of reality and ride along them as they snap back into place."],
            "Avatar of Chaos (Ex)": ["At 20th level, you are infused with the essence of raw chaos."]
        }
    }
        ,
    "rakshasa": {
        "class skills": "Disguise",
        "bonus spells": [
            "Charm Person (3rd)", "Invisibility (5th)", "Suggestion (7th)", "Detect Scrying (9th)",
            "Prying Eyes (11th)", "Mass Suggestion (13th)", "Greater Polymorph (15th)", "Mind Blank (17th)",
            "Dominate Monster (19th)"
        ],
        "bonus feats": [
            "Arcane Armor Mastery", "Arcane Armor Training", "Deceitful", "Detect Expertise", "Empower Spell",
            "Light Armor Proficiency", "Martial Weapon Proficiency", "Stealthy"
        ],
        "bloodline arcana": "Add half your sorcerer level to the Spellcraft DC for others to identify spells you cast.",
        "bloodline power": {
            "Silver Tongue (Su)": "At 1st level, you can draw upon your outsider heritage to spin amazingly convincing lies.",
            "Mind Reader (Sp)": "At 3rd level, you can read minds as a spell-like ability.",
            "Hide Aura (Sp)": "At 9th level, you can conceal yourself from prying magic.",
            "Alter Self (Sp)": "At 15th level, you can change your shape into that of any humanoid at will.",
            "Outsider (Su)": "At 20th level, your natural form becomes an animal-headed humanoid."
        }
    }
    ,
    "serpentine": {
        "class skills": "Diplomacy",
        "bonus spells": [
            "Hypnotism (3rd)", "Delay Poison (5th)", "Summon Monster III (Reptiles only) (7th)",
            "Poison (9th)", "Hold Monster (11th)", "Mass Suggestion (13th)",
            "Summon Monster VII (Reptiles only) (15th)", "Irresistible Dance (17th)", "Dominate Monster (19th)"
        ],
        "bonus feats": [
            "Combat Casting", "Combat Reflexes", "Deceitful", "Deft Hands", "Persuasive",
            "Silent Spell", "Skill Focus (Bluff)", "Stealthy"
        ],
        "bloodline arcana": "Your powers of compulsion can affect even bestial creatures.",
        "bloodline power": {
            "Serpent's Fang (Ex)": "At 1st level, you can grow fangs as a free action.",
            "Serpentfriend (Ex)": "At 3rd level, you can use Speak with Animals at will with reptilian animals.",
            "Snakeskin (Ex)": "At 9th level, you gain a +1 bonus to natural armor, a +2 racial bonus on saves against poison, and a +2 bonus on Escape Artist checks.",
            "Den of Vipers (Sp)": "At 15th level, you may summon a host of writhing serpents.",
            "Scaled Soul (Su)": "At 20th level, you gain the Shapechanger subtype."
        }
    }
    ,
    
    "shadow": {
        "class skills": "Stealth",
        "bonus spells": [
            "Ray of Enfeeblement (3rd)", "Darkvision (5th)", "Deeper Darkness (7th)",
            "Shadow Conjuration (9th)", "Shadow Evocation (11th)", "Shadow Walk (13th)",
            "Power Word Blind (15th)", "Greater Shadow Evocation (17th)", "Shades (19th)"
        ],
        "bonus feats": [
            "Acrobatic", "Blind-Fight", "Dodge", "Quick Draw", "Silent Spell",
            "Skill Focus (Stealth)", "Stealthy", "Weapon Finesse"
        ],
        "bloodline arcana": "Whenever you cast a spell with the [darkness] descriptor or the shadow subschool, you gain a circumstance bonus on Stealth checks equal to the spell's level for 1d4 rounds.",
        "bloodline power": {
            "Shadowstrike (Sp)": "At 1st level, you can make a melee touch attack that inflicts nonlethal damage and dazzles the target.",
            "Nighteye (Ex)": "At 3rd level, you gain darkvision, which increases at 9th level.",
            "Shadow Well (Sp)": "At 9th level, you can use the Stealth skill even while being observed and switch places with allies in dim light or darkness.",
            "Enveloping Darkness (Sp)": "At 15th level, you can create an area of deeper darkness that you can see through without penalty.",
            "Shadow Master (Su)": "At 20th level, you can see perfectly in darkness, and your shadow conjuration and shadow evocation spells are more real."
        }
    }
    
    ,
    
    "solar": {
        "class skills": "Perception",
        "bonus spells": [
            "Searing Light (3rd)", "Fury of the Sun (5th)", "Daylight (7th)",
            "Shield of Dawn (9th)", "Flame Strike (11th)", "True Seeing (13th)",
            "Sunbeam (15th)", "Sunburst (17th)", "Overwhelming Presence (19th)"
        ],
        "bonus feats": [
            "Alertness", "Combat Casting", "Empower Spell", "Improved Initiative", "Lightning Reflexes",
            "Quicken Spell", "Spell Focus", "Spell Penetration"
        ],
        "bloodline arcana": "Whenever you cast a spell with the fire descriptor, it deals additional damage.",
        "bloodline power": {
            "Healing Touch (Su)": "At 9th level, you can use fire to restore the health of yourself or your allies.",
            "Channel Energy (Su)": "At 15th level, you can channel energy as a cleric.",
            "Luminous Form (Sp)": "At 20th level, you can become an incorporeal being of light."
        }
    }
    ,
    
    "starsoul": {
        "class skills": "Knowledge (Nature)",
        "bonus spells": [
            "Unseen Servant (3rd)", "Glitterdust (5th)", "Blink (7th)",
            "Call Lightning Storm (9th)", "Overland Flight (11th)", "Repulsion (13th)",
            "Reverse Gravity (15th)", "Greater Prying Eyes (17th)", "Meteor Swarm (19th)"
        ],
        "bonus feats": [
            "Blind-Fight", "Craft Rod", "Dodge", "Endurance", "Improved Counterspell",
            "Improved Iron Will", "Iron Will", "Quicken Spell", "Skill Focus (Perception)", "Toughness"
        ],
        "bloodline arcana": "Dazzles targets that fail their saves when you cast evocation spells.",
        "bloodline power": {
            "Minute Meteors (Sp)": "At 1st level, you can summon a rain of tiny meteorites as a standard action.",
            "Voidwalker (Ex)": "At 3rd level, you gain low-light vision, resistances, and other benefits.",
            "Aurora Borealis (Sp)": "At 9th level, you can create a sheet of cascading colors.",
            "Breaching the Gulf (Sp)": "At 15th level, your caster level is increased when casting teleportation spells.",
            "Starborn (Ex)": "At 20th level, you gain immunity to cold, blindness, and darkvision."
        }
    }
    
    ,
    
    "stormborn": {
        "class skills": "Knowledge (Nature)",
        "bonus spells": [
            "Shocking Grasp (3rd)", "Gust of Wind (5th)", "Lightning Bolt (7th)",
            "Shout (9th)", "Overland Flight (11th)", "Chain Lightning (13th)",
            "Control Weather (15th)", "Whirlwind (17th)", "Storm of Vengeance (19th)"
        ],
        "bonus feats": [
            "Deadly Aim", "Dodge", "Enlarge Spell", "Far Shot", "Great Fortitude",
            "Point Blank Shot", "Skill Focus (Fly)", "Wind Stance"
        ],
        "bloodline arcana": "Increase the save DC of electricity and sonic spells by 1.",
        "bloodline power": {
            "Thunderstaff (Sp)": "At 1st level, you can imbue a weapon with the shock property for a duration.",
            "Stormchild (Ex)": "At 3rd level, you gain resistances and benefits related to wind effects.",
            "Thunderbolt (Sp)": "At 9th level, you can command a damaging lightning strike.",
            "Ride the Lightning (Sp)": "At 15th level, you can become a living lightning bolt and move rapidly.",
            "Storm Lord (Ex)": "At 20th level, you gain immunity and blindsight against certain effects."
        }
    }
    
    ,
    
    "undead": {
        "class skills": "Knowledge (Religion)",
        "bonus spells": [
            "Chill Touch (3rd)", "False Life (5th)", "Vampiric Touch (7th)",
            "Animate Dead (9th)", "Waves of Fatigue (11th)", "Undeath to Death (13th)",
            "Finger of Death (15th)", "Horrid Wilting (17th)", "Energy Drain (19th)"
        ],
        "bonus feats": [
            "Combat Casting", "Diehard", "Endurance", "Iron Will", "Skill Focus (Knowledge [Religion])",
            "Spell Focus", "Still Spell", "Toughness"
        ],
        "bloodline arcana": "Some undead are susceptible to your mind-affecting spells.",
        "bloodline power": {
            "Grave Touch (Sp)": "At 1st level, you can make a touch attack that causes a living creature to become shaken.",
            "Death's Gift (Su)": "At 3rd level, you gain resistances and damage reduction.",
            "Grasp of the Dead (Sp)": "At 9th level, you can summon a swarm of skeletal arms to attack your foes.",
            "Incorporeal Form (Sp)": "At 15th level, you can become incorporeal.",
            "One of Us (Ex)": "At 20th level, you become more like the undead."
        }
    }
    
    
    ,
    "verdant": {
        "class skills": "Knowledge (Nature)",
        "bonus spells": [
            "Entangle (3rd)", "Barkskin (5th)", "Speak with Plants (7th)",
            "Command Plants (9th)", "Wall of Thorns (11th)", "Transport via Plants (13th)",
            "Plant Shape III (15th)", "Animate Plants (17th)", "Shambler (19th)"
        ],
        "bonus feats": [
            "Acrobatic Steps", "Craft Staff", "Endurance", "Extend Spell", "Fleet",
            "Nimble Moves", "Skill Focus (Knowledge [Nature])", "Toughness"
        ],
        "bloodline arcana": "When casting personal range spells, your skin toughens, granting natural armor for a duration.",
        "bloodline power": {
            "Tanglevine (Sp)": "At 1st level, you can create an animated vine.",
            "Photosynthesis (Ex)": "At 3rd level, your need for eating and sleeping is reduced.",
            "Massmorph (Sp)": "At 9th level, you can alter the size and health of plant life.",
            "Rooting (Ex)": "At 15th level, you can extend roots, gaining natural armor and CMD bonuses.",
            "Shepherd of the Trees (Su)": "At 20th level, you gain various natural benefits and immunities."
        }
    }
    ,

    "ectoplasm": {
        "class skillss": "Stealth",
        "bonus spells": [
          "Obscuring mist", "ghost whip", "ectoplasmic snare", "spirit-bound blade",
          "wall of ectoplasm", "ethereal jaunt", "ectoplasmic eruption", "create demiplane", "etherealness"
        ],
        "bonus feats": [
          "Blind-Fight", "Dodge", "Ectoplasmic Spell", "Lingering Spell", "Silent Spell",
          "Skill Focus (Fly)", "Skill Focus (Stealth)", "Spell Focus"
        ],
        "bloodline arcana": "Incorporeal creatures take 75% of the normal amount of damage from your damaging spells, and when incorporeal creatures attempt saving throws against your non-damaging spells, they roll twice and must take the lower result.",
        "bloodline powers": {
          "Entangling Ectoplasm (Sp)": "At 1st level, you can create a ball of ectoplasm and hurl it at targets within 30 feet. This ectoplasm acts as a tanglefoot bag that can also entangle incorporeal creatures. The ectoplasm dissipates within 1d3 rounds. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Ectoplasmic Reach (Su)": "At 3rd level, you can exude small tendrils of ectoplasm that can be used to make melee touch attacks as part of a spell with a range of touch. You can make melee touch attacks as if you had an additional 5 feet of reach. You must have a free hand with which to direct the ectoplasm. This ability does not otherwise increase your threatened area. At 11th level, this additional reach increases to 10 feet. At 17th level, this additional reach increases to 15 feet.",
          "Ectoplasmic Form (Sp)": "At 9th level, you can transform into a cloud of ectoplasm. Treat this as gaseous form, except that you can fly at a speed of 30 feet, and you can solidify your form sufficiently to carry small objects, though fine manipulation is impossible. You can use this ability for a number of minutes per day equal to your sorcerer level. These minutes need not be consecutive, but must be used in 1-minute increments.",
          "Malevolent Ectoplasm (Sp)": "At 15th level, your ectoplasmic tendrils can lash out at creatures around you. Treat this as a black tentacles effect centered on your position, but the tentacles can also grapple ethereal and incorporeal creatures, and they do not affect you (though they still affect your allies). You can use this ability a number of rounds per day equal to your sorcerer level. These rounds need not be consecutive.",
          "Ectoplasmic Body (Ex)": "At 20th level, you are more ectoplasm than flesh. You become immune to sneak attacks and critical hits and gain DR 5/slashing."
        }
      },
      "ghoul": {
        "class skillss": "Stealth",
        "bonus spells": [
          "Ray of enfeeblement", "feast of ashes", "vampiric touch", "fear",
          "hungry earth", "move earth", "control undead", "unholy aura", "wail of the banshee"
        ],
        "bonus feats": [
          "Arcane Strike", "Combat Casting", "Power Attack", "Skill Focus (Knowledge [religion])", "Spell Focus (necromancy)", "Toughness", "Warren Digger*", "Weapon Finesse"
        ],
        "bloodline arcana": "Whenever you cast a spell of the necromancy school that deals hit point damage, you are healed of 1 hit point per spell level.",
        "bloodline powers": {
          "Ghoulish Claws (Su)": "Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack using your full base attack bonus. Each of these attacks deals 1d4 points of damage + your Strength modifier (1d3 if you are Small). At 5th level, creatures damaged with your claw attack are paralyzed for 1 round, as the ghoul ability (Fort negates). At 7th level, the duration of the paralysis increases to 1d4+1 rounds, and the claws are considered magic weapons for the purpose of overcoming DR. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive. If youre a ghoul with this, instead of gaining this ability, your levels in sorcerer stack with your racial Hit Dice when determining the DC of your paralysis and disease special abilities.",
          "Leathery Skin (Ex)": "At 3rd level, you gain cold resistance 5 and a +1 natural armor bonus to AC. At 9th level, your cold resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.",
          "Ravenous Frenzy (Ex)": "At 9th level, you gain the benefits of haste for a number of rounds per day equal to your sorcerer level. These rounds dont need to be consecutive. Each time you hit a creature with two or more claw attacks during a full attack while affected by this ability, that creature takes 1d4 points of bleed damage.",
          "Earth Crawler (Su)": "At 15th level, you gain a burrow speed of 30 feet. Additionally, as long as you are surrounded by at least 5 feet of dirt or natural stone on all sides, you gain fast healing 10. You can heal a number of hit points per day equal to 10  your sorcerer level with this ability.",
          "Ghoulish Aspect (Su)": "At 20th level, you take on aspects of the nature and appearance of ghouls. You no longer feel the need to eat and are immune to hunger (though you are still able to consume flesh if you choose to). You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/. Additionally, you gain the stench ability with a radius of 10 feet. Creatures that fail their Fortitude saving throws are sickened for 1d6+4 minutes. Use half your sorcerer level instead of half your racial Hit Dice to determine the saving throw DC."
        }
      },
      "harrow": {
        "class skillss": "Knowledge (history)",
        "bonus spells": [
          "ill omen", "augury", "harrowing", "shadow conjuration",
          "contact other plane", "legend lore", "greater harrowing", "moment of prescience", "weird"
        ],
        "bonus feats": [
          "Alertness", "Craft Wondrous Item", "Extend Spell", "Fortune Teller",
          "Harrowed", "Mages Tattoo", "Skill Focus (Knowledge [history])"
        ],
        "bloodline arcana": "Whenever you cast a divination spell that requires a percentage roll, add 5 to the result of your roll. In addition, you can roll the percentage dice twice and use the result you prefer. Your maximum percentage chance of receiving a meaningful and accurate reply for divination spells is 100%, instead of the usual 90%.",
        "bloodline powers": {
          "Twisted Fortune (Sp)": "At 1st level, you can use your supernatural insight to hijack the fortunes of a single target within 30 feet. For 1 round, the target becomes confused and cannot directly control its actions (Will negates). Once a creature has been affected by twisted fortune, it is immune to the abilitys effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Cha modifier.",
          "See It Coming (Su)": "At 3rd level, you gain a +1 luck bonus on the saving throw type of your choice (Fortitude, Reflex, or Will). As a full-round action, you can change which saving throw your luck bonus applies to. At 7th level and every 4 levels thereafter, this bonus increases by 1, to a maximum of +5 at 19th level.",
          "Invoke the Harrow (Su)": "At 9th level, you can draw a random harrow card from a complete harrow deck you own as a standard action and channel the aspects of the card into your body. You take on superficial traits featured on the card and gain a +4 enhancement bonus to the ability score associated with the cards suit. You can invoke the harrow for a number of minutes per day equal to your sorcerer level; the duration need not be continuous, but it must be used in 1-minute increments.",
          "Harrowed Home (Sp)": "At 15th level, your otherworldly connection is so strong that your subconscious cleaves off a small portion of the Harrowed Realm for use as your own private sanctuary. Your harrowed home is created the first time you use this ability, and is decorated as a garish reflection of your personality. Thereafter, you always visit this same home. You can place a portal to your harrowed home once every 24 hours, but placing a new portal destroys the previous one, and you can not move the entrance while you are inside. As long as you are not in your harrowed home, time ceases to pass for anything and anyone still in your pocket dimension; creatures cannot move, objects do not decay, and everything remains exactly the same as you left it the last time you visited the plane. Time continues as normal whenever you are inside your harrowed home. This ability is otherwise identical to mages magnificent mansion.",
          "Kin to the Old Tales (Su)": "At 20th level, your soul becomes host to the otherworldly energies of the harrow. You gain DR 10/cold iron and immunity to curses, paralysis, and sleep. You can always act in the surprise round of combat, and you cannot be caught flat-footed. You gain unlimited use of your invoke the harrow ability."
        }
      },
    "imperious": {
    "class skillss": "Perform (oratory)",
    "bonus spells": [
        "moment of greatness", "eagles splendor", "heroism", "threefold aspect",
        "greater command", "repulsion", "greater age resistance", "prediction of failure", "overwhelming presence"
    ],
    "bonus feats": [
        "Diehard", "Endurance", "Heroic Defiance", "Heroic Recovery", "Improved Initiative", "Lingering Spell", "Magical Aptitude", "Persuasive"
    ],
    "bloodline arcana": "Whenever you cast a harmful spell, you gain a bonus equal to the spells level on Intimidate checks made against any creature adversely affected by that spell until the end of your next turn. Adversely affected typically means damage, but it can also mean debilitating effects or conditions.",
    "bloodline powers": {
        "Student of Humanity (Ex)": "At 1st level, you gain Diplomacy, Knowledge (history), Knowledge (local), Knowledge (nobility), and Linguistics as class skills. In addition, when using these skills to learn, study, or gather information about humans, you add an insight bonus equal to your Charisma bonus on such checks.",
        "Heroic Echo (Su)": "At 3rd level, when you receive a morale bonus from any spell, spell-like ability, or magic item, including those you cast on yourself, that bonus increases by +1. At 9th level, this ability also applies to competence bonuses. If you receive a morale effect (or a competence effect at 9th level) that affects an area or multiple targets, as an immediate action you can share your increased bonus with all other recipients. This increase to other participants lasts a number of rounds equal to your Charisma bonus. You can use this ability once per day, plus one time per three levels after 3rd.",
        "Take Your Best Shot (Su)": "At 9th level, if you are targeted by a harmful spell, spell-like ability, or supernatural ability and suffer no harm from it, whether because of a successful saving throw, spell resistance, the attack missing, or some other protection, as an immediate action you can make an Intimidate check to demoralize the creature that produced the effect, but only if the creature that used the harmful effect is within 30 feet and can clearly see and hear you. At 13th level, you can use this ability after succeeding at a saving throw to reduce the effects of an attack (if no save is allowed, you cannot use this ability).",
        "Heroic Legends (Su)": "At 15th level, you may inspire greatness or inspire heroics as a bard of your sorcerer level by sacrificing a spell slot as a swift or move action. The effect lasts a number of rounds equal to the sacrificed spells level; this duration is doubled for human recipients.",
        "Immortal Legend (Ex)": "At 20th level, you cease aging; no longer need to eat, drink, or sleep; and gain immunity to death effects and energy drain."
    }
},


"impossible": {
    "class skills": "Knowledge (engineering)",
    "bonus spells": [
        "lesser confusion (3rd)", "make whole (5th)", "shrink item (7th)", "confusion (9th)",
        "fabricate (11th)", "animate objects (13th)", "insanity (15th)", "polymorph any object (17th)", "wish (19th)"
    ],
    "bonus feats": [
        "Craft Construct", "Craft Magic Arms and Armor", "Deft Hands", "Exotic Weapon Proficiency", "Far Shot", "Iron Will", "Point-Blank Shot", "Skill Focus (Knowledge [engineering])"
    ],
    "bloodline arcana": "Constructs are susceptible to your enchantment (compulsion) spells as if they were not mind-affecting. Constructs are treated as living creatures for the purposes of determining which spells affect them.",
    "bloodline powers": {
        "Disorienting Touch (Sp)": "At 1st level, as a melee touch attack, you can cause a creature to doubt its sense of depth and direction. The target is sickened for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
        "Spontaneous Generation": "At 3rd level, you gain Craft Wondrous Item as a bonus feat. In addition, when you craft a magic item (except a potion, a spell-trigger item, or a spell-completion item), you may ignore one spell prerequisite without increasing the creation DC. You can ignore an additional spell prerequisite at 9th, 15th, and 20th levels.",
        "Distracting Pattern (Su)": "At 9th level, you can distort the scenery around you for a number of rounds equal to your sorcerer level. This ability provides a 20% miss chance on ranged attacks made against you and grants you a bonus on Stealth checks equal to 1/2 your sorcerer level. You can use this ability once per day at 9th level, twice per day at 17th level, and three times per day at 20th level.",
        "Relativity (Su)": "At 15th level, you can traverse vertical surfaces as easily as you walk on the ground. When climbing, you move at your normal land speed and take none of the penalties associated with climbing. The surface must be able to support your weight, and difficult terrain affects your speed as normal. You are also immune to reverse gravity and similar effects.",
        "Living Paradox (Ex)": "At 20th level, your outward appearance remains the same, but beneath your skin lies not flesh and blood but clockwork gears, miniature galaxies, or something equally uncanny. You gain immunity to disease and poison. You take no additional damage from bleed effects, critical hits, and sneak attacks."
    }
    },

    
    "kobold": {
    "class skills": "Disable Device",
    "bonus spells": [
        "alarm (3rd)", "create pit (5th)", "explosive runes (7th)", "dragons breath (9th)",
        "transmute rock to mud (11th)", "guards and wards (13th)", "delayed blast fireball (15th)", "form of the dragon III (17th)", "imprisonment (19th)"
    ],
    "bonus feats": [
        "Alertness", "Combat Casting", "Defensive Combat Training", "Dodge", "Improved Initiative", "Lightning Reflexes", "Silent Spell"
    ],
    "bloodline arcana": "Whenever you cast a spell against a creature that is denied its Dexterity bonus to AC, increase that spells DC by +2.",
    "bloodline powers": {
        "Trap Rune (Sp)": "At 1st level, as a standard action, you can sketch a single, nearly invisible magical rune on any 5-foot-square solid surface. When you create a rune, pick one of the following energy types: acid, cold, electricity, or fire. While the rune is active, the next creature other than you who steps on or touches the runes area causes the rune to explode. The runes explosion deals a number of points of energy damage equal to 1d8 + 1 per sorcerer level you possess to anything in its square. A Reflex saving throw halves the damage (DC 10 + 1/2 your sorcerer level + your Charisma modifier). You can use this ability a number of times per day equal to 3 + your Charisma modifier. Each rune lasts for 24 hours or until discharged.",
        "Trap Sense (Ex)": "At 3rd level, you develop a sixth sense that helps you avoid traps. You gain a +2 bonus on Perception checks made to notice traps. You also gain a +1 bonus on Reflex saves to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 at 7th level and for every four sorcerer levels you gain thereafter (to a maximum of +5 at 19th level). This bonus stacks with that provided by a rogues trap sense and similar abilities.",
        "Arcane Ambush (Su)": "At 9th level, as a swift action, you can expend a spell slot in order to grant you and your allies a bonus on attack and damage rolls. This bonus lasts 1 round, is equal to the level of the spell expended, and only applies to opponents your allies are flanking or opponents denied their Dexterity bonus against your allies. You grant this bonus to yourself plus up to one ally for every four sorcerer levels you possess (to a maximum of five allies at 20th level). The allies must be within 30 feet of you and you must have line of effect to each affected ally.",
        "Earth Glide (Su)": "At 15th level, you gain the earth glide universal monster ability with a speed equal to your base speed. This does not give you the ability to breathe while passing through earth, so you must hold your breath or use some alternate method to breathe while using this ability.",
        "Nimble Walker (Su)": "At 20th level, you gain a +5 racial bonus on Reflex saving throws and on Acrobatics checks made to move through a creatures threatened area or through its space. You also gain the ability to breathe while passing through earth using your earth glide ability."
    }
    },

    
    "martyred": {
        "class skills": "Perform (oratory)",
        "bonus spells": [
          "endure elements (3rd)", "surmount affliction (5th)", "heroism (7th)", "blessing of fervor (9th)",
          "greater heroism (13th)", "joyful rapture (15th)", "mind blank (17th)", "overwhelming presence (19th)"
        ],
        "bonus feats": [
          "Diehard", "Endurance", "Heroic Defiance", "Heroic Recovery", "Leadership", "Persuasive", "Skill Focus (Perform)", "Toughness"
        ],
        "bloodline arcana": "Whenever you take damage in battle, your effective caster level increases by 1 during your next turn. This effect does not apply more than once per round.",
        "bloodline powers": {
          "Sacrificial Boon (Su)": "At 1st level, as an immediate action, you can sacrifice 1 hit point in exchange for a +1 sacred bonus on the next damage roll, saving throw, or skill check you make. This bonus only applies as long as you use it by or during your next turnotherwise both your sacrificed hit point and the bonus are wasted. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Rallying Cry (Su)": "At 3rd level, as a standard action once per day, you can shout a cry instilled with the noble sacrifices of your ancestor. You and any allies within 30 feet who can hear you gain a +1 morale bonus on attack and damage rolls for a number of rounds equal to half your sorcerer level (minimum 1). At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.",
          "Gift of Blood (Su)": "At 9th level, as a standard action, you can choose to sacrifice some of your hit points to grant an ally double that number in temporary hit points. You can sacrifice up to your character level in hit points when using this ability. These temporary hit points last up to 1 minute per sorcerer level. You cannot heal your sacrificed hit points until your target has lost its temporary hit points.\n\nAt 9th level, you can use this ability once per day.\nAt 17th level, you can use this ability twice per day.",
          "Sacrificial Exchange (Su)": "At 15th level, as a swift action once per day, you can take 2 points of temporary ability damage to one of your ability scores and add a temporary +2 inherent bonus to any other ability score. This bonus lasts for a maximum of 1 hour per sorcerer level or until you choose to prematurely dismiss it (a free action), during which time the temporary ability damage cannot be healed by any means. After this effect ends, you can heal the ability damage normally.\n\nAt 20th level, you can use this ability twice per day.",
          "Eternal Martyr (Su)": "At 20th level, your ancestors act of martyrdom infuses your spirit. You become immune to death effects. Material components for spells and effects to bring you back to life (such as raise dead or resurrection) cost half as much as normal. Your body cannot be turned into an undead creature, as though you were affected by a permanent hallow effect (caster level equal to your sorcerer level)."
        }
      },


      "nanite": {
        "class skills": "Knowledge (engineering)",
        "bonus spells": [
          "disguise self (3rd)", "defensive shock (5th)", "gaseous form (7th)", "miasmatic form (9th)",
          "echolocation (11th)", "fluid form (13th)", "magnetic field (15th)", "iron body (17th)", "shapechange (19th)"
        ],
        "bonus feats": [
          "Blind-Fight", "Combat Expertise", "Dodge", "Eldritch Heritage", "Expanded Arcana", "Improved Disarm", "Lightning Reflexes", "Skill Focus (Knowledge [engineering])"
        ],
        "bloodline arcana": "Whenever you cast a spell from the transmutation school and target only yourself, increase the spells duration by 50%. This does not stack with metamagic feats or abilities such as Extend Spell.",
        "bloodline powers": {
          "Nanite Strike (Ex)": "At 1st level as a free action, you can cause nanites to flow from your body and coat the striking end of any manufactured melee weapon you wield. When you hit with a melee attack using this weapon, some of the nanites infect the blood of the victim (Poisoninjury; save Fort DC 10 + 1/2 your sorcerer level + your Con modifier; frequency 1/round for 6 rounds; effect 1 Str damage; cure 1 save).\n\nAt 5th level, weapons you use with this ability are treated as magical for the purposes of overcoming DR, and the poison also deals 1 point of Constitution damage. At 7th level, the damage increases to 1d2 points of Constitution damage and 1d2 points of Strength damage. At 11th level, the cure becomes two successful saves. You can use this ability for a number of rounds per day equal to 3 + your Charisma modifier; these rounds need not be consecutive.",
          "Nanite Surge (Ex)": "At 3rd level, once per day as an immediate action, you can cause your nanites to surge, granting you a bonus equal to 3 + your sorcerer level on any one d20 roll; this ability must be activated before the roll is made. If you already possess the nanite surge ability from another source (such as from being an android), you can use your nanite surge an additional time per day.\n\nAt 9th level, you can use this ability an additional time per day.",
          "Nanite Resurgence (Ex)": "At 9th level, once per day as an immediate action upon being reduced to one-quarter your maximum hit points, you can force the mechanical swarm living inside you to keep you alive. This ability functions like a resurgent transformation spell using your sorcerer level as the caster level, except it is an extraordinary ability and cannot be dispelled.\n\nAt 17th level, you can use this ability twice per day (though using this ability twice in one 24-hour period entails a chance of system shock and death; see the spells description for more details).\n\nAt 20th level, you never die of system shock from using this ability.",
          "Distributed Body (Ex)": "At 15th level, anytime you are struck by a critical hit or a sneak attack, there is a 25% chance that your nanites scatter and reincorporate around the attack, negating the extra damage and causing the attack to deal damage as normal instead.",
          "Living Swarm (Su)": "At 20th level, you and the machines within you become one. Your nanites consume and replicate your body, allowing swift and radical physical alterations with little more than a thought. You become immune to bleed effects, diseases, and poisons, and gain DR 5/. At will, you can break down your body and move in a shimmering stream of flying nanites, as if affected by gaseous form."
        }
      },

      
      "oni": {
        "class skills": "Disguise",
        "bonus spells": [
          "ray of enfeeblement (3rd)", "invisibility (5th)", "fly (7th)", "charm monster (9th)",
          "cone of cold (11th)", "greater dispel magic (13th)", "waves of exhaustion (15th)", "trap the soul (17th)", "dominate monster (19th)"
        ],
        "bonus feats": [
          "Combat Expertise", "Combat Reflexes", "Enforcer", "Fast Healer", "Improved Initiative", "Iron Will", "Power Attack", "Skill Focus (Intimidate)", "Weapon Proficiency (katana)"
        ],
        "bloodline arcana": "Whenever you cast a spell of the charm or compulsion subschool, you gain a bonus on Bluff, Diplomacy, and Intimidate skill checks equal to the level of the spell for 1d4 rounds.",
        "bloodline powers": {
          "Touch of Agony (Sp)": "At 1st level, you can make a melee touch attack as a standard action that wracks a living creature with agonizing pain. The target takes 1d4 points of nonlethal damage each round for a number of rounds equal to 1/2 your sorcerer level (minimum 1). You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Altered Form (Sp)": "At 3rd level, you gain the ability to change shape (as the spell alter self) for a number of minutes per day equal to your sorcerer level. These rounds need not be consecutive. At 17th level, the duration of this effect is no longer limited, and you may remain in your chosen form as long as you want.",
          "Windborne (Sp)": "At 9th level, you can turn gaseous (as the spell gaseous form) for a number of rounds per day equal to your sorcerer level. These rounds need not be consecutive. At 11th level and every two levels thereafter, your speed while gaseous increases by +10 feet, to a maximum speed of 60 feet at 19th level.",
          "Oni Healing (Su)": "At 15th level, if your hit points drop below 0, you automatically stabilize and begin regenerating 2 hit points per round for a number of rounds per day equal to your sorcerer level. While regenerating in this way, you are not affected by spells or effects that would cause you to continue dying, such as bleed, but if you take any acid or fire damage, you stop regenerating for the rest of the day (but remain stabilized) and you are affected by such effects as normal. You still die if your hit points reach a negative number equal to your Constitution score, regardless of whether you are regenerating. This ability only works once per dayif you drop below 0 hit points a second time, you do not benefit from this ability.",
          "Hedonistic Master (Su)": "At 20th level, you fully embrace your oni heritage to unlock its maximum potential. You gain the ability to change your shape between your natural form and that of any one Large humanoid creature of the giant subtype at will (as the spell giant form I). You must choose which creature you wish to be able to change into when you reach 20th level; once you make this decision, you cannot change it. You can switch between your forms at will, and can assume your giant form for as long as you want. In addition, you gain SR equal to 6 + your sorcerer level, and whenever you cast a spell of the charm or compulsion subschool, the spells DC increases by +2."
        }
      },

      
      "pestilence": {
        "class skills": "Heal",
        "bonus spells": [
          "charm animal (3rd)", "summon swarm (5th)", "contagion (7th)", "repel vermin (9th)",
          "insect plague (11th)", "eyebite (13th)", "creeping doom (15th)", "horrid wilting (17th)", "power word kill (19th)"
        ],
        "bonus feats": [
          "Brew Potion", "Diehard", "Endurance", "Great Fortitude", "Self-Sufficient", "Skill Focus (Knowledge [nature])", "Silent Spell", "Toughness"
        ],
        "bloodline arcana": "Vermin are susceptible to your mind-affecting spells. They are treated as animals for the purposes of determining which mind-affecting spells affect them.",
        "bloodline powers": {
          "Plagues Caress (Sp)": "At 1st level, you can make a melee touch attack as a standard action that causes a living creatures flesh to break out into rancid-smelling pustules and sores for a number of rounds equal to 1/2 your sorcerer level (minimum 1 round). These sores cause the victim to become sickened for the duration of the effect; this is a disease effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Accustomed to Awfulness (Ex)": "At 3rd level, you become immune to the sickened condition and gain a +4 bonus on all saving throws against effects that cause nausea or disease. At 9th level, you become immune to the nauseated condition and to the debilitating effects of disease (but you can still be a carrier of diseases).",
          "Shroud of Vermin (Su)": "At 9th level, swarms no longer see you as prey. You can walk among swarms without fear of being harmed by them at all, and by taking a standard action to mentally command a swarm in which you stand, you can direct that swarms attacks and movements as long as you have more Hit Dice than the swarm. Even when you arent standing amid a swarm, your body crawls with vermin, and their chitinous bodies increase your natural armor bonus by +1. At 11th level, this bonus increases to +2, and at 17th level it increases to +3.",
          "Pestilential Breath (Su)": "At 15th level, the sickness within your body finally becomes so potent that your very breath is deadly. Once per day as a standard action, you can exhale a cloud of pestilence in a 30-foot cone. Those caught in the area of this miasmic cloud receive a single Fortitude save to avoid suffering the effects of two different diseases. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You can choose what two diseases you inflict on each target that succumbs to your plague breath, but they must be two different diseases chosen from the following list: blinding sickness, bubonic plague, cackle fever, filth fever, leprosy, mindfire, red ache, shakes, or slimy doom. The victim suffers the initial effects of these two diseases immediately  use the diseases frequency and save DC normally to determine further effects as detailed on page 557 of the Pathfinder RPG Core Rulebook. At 17th level, you can use this ability twice per day. At 20th level you can use this ability three times per day.",
          "Plague Carrier (Su)": "At 20th level, your touch inflicts mummy rot on those you strike. You can choose to suppress this ability for 1 round as a swift action. You can make a touch attack to inflict this disease on a target, or transfer it as part of an attack with any melee weapon or touch-based spell. The creature touched can resist contracting mummy rot by making a Fortitude save  the DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier."
        }
      },

      "phoenix": {
        "class skills": "Knowledge (Arcana)",
        "bonus spells": [
          "color spray (3rd)", "see invisibility (5th)", "magic circle against evil (7th)", "wall of fire (9th)",
          "break enchantment (11th)", "path of the winds (13th)", "firebrand (15th)", "prismatic wall (17th)", "fiery body (19th)"
        ],
        "bonus feats": [
          "Dodge", "Elemental Focus (fire)", "Fast Healer", "Improved Initiative", "Iron Will", "Mobility", "Quicken Spell", "Skill Focus (Knowledge [arcana])"
        ],
        "bloodline arcana": "When casting any spell that deals fire damage, you can instead heal your targets. The spell deals no damage, and living creatures affected by the spell instead regain a number of hit points equal to half the fire damage the spell would normally deal.",
        "bloodline powers": {
          "The Unseen World (Su)": "At 1st level, you gain detect magic and read magic as spells known. At 5th level, you can automatically identify the properties of a non-cursed magic item you hold. You can use this ability a number of times per day equal to your Charisma modifier.",
          "Immolation (Su)": "At 3rd level, you gain the ability to surround yourself in fire as a swift action, granting additional fire damage to your attacks and harming adjacent creatures.",
          "Vermilion Wings (Su)": "At 9th level, you gain the ability to grow a pair of phoenix wings, granting you a fly speed.",
          "Restoring Flames (Sp)": "At 15th level, you can cast greater restoration once per day as a spell-like ability.",
          "Rebirth (Su)": "At 20th level, when you die, you are brought back to life as true resurrection after 1 minute. This ability can be used only once every 24 hours."
        }
      },

      
      "possessed": {
        "class skills": "Knowledge (religion)",
        "bonus spells": [
          "anticipate peril (3rd)", "share memory (5th)", "purge spirit (7th)", "entrap spirit (9th)",
          "possession (11th)", "telepathy (13th)", "insanity (15th)", "bilocation (17th)", "divide mind (19th)"
        ],
        "bonus feats": [
          "Combat Casting", "Deceitful", "Fearsome Spell", "Improved Iron Will", "Iron Will", "Persuasive", "Selective Spell", "Skill Focus (Bluff)", "Spell Focus", "Traumatic Spell"
        ],
        "bloodline arcana": "You can attempt additional Will saves against mind-affecting effects after casting non-cantrip spells, and you can use this ability a number of times per day equal to 3 + your Charisma modifier.",
        "bloodline powers": {
          "Aggressive Possession (Sp)": "At 1st level, you can make a melee touch attack that can confuse the target. You can use this ability a number of times per day.",
          "Sight Unseen (Sp)": "At 3rd level, you gain darkvision and later gain lifesense at 9th level.",
          "Inside Agent (Sp)": "At 9th level, you can reroll Perception and other skill checks, but with a penalty.",
          "One Body, Two Minds (Sp)": "At 15th level, you can improve the effectiveness of a spell, allowing it to benefit from Silent Spell, Still Spell, and Extend Spell metamagic feats.",
          "Dual Spirit (Su)": "At 20th level, you gain immunity to mind-affecting effects and complete control over your body and the body of your possessed target when using possession effects."
        }
      },

      
      "salamander": {
        "class skills": "Acrobatics",
        "bonus spells": [
          "magic weapon (3rd)", "molten orb (5th)", "magic vestment (7th)", "fire shield (warm shield) (9th)",
          "fire snake (11th)", "tar pool (13th)", "firebrand (15th)", "wall of lava (17th)", "meteor swarm (19th)"
        ],
        "bonus feats": [
          "Cleave", "Craft Wondrous Item", "Iron Will", "Power Attack", "Prodigy", "Skill Focus (Acrobatics)", "Skill Focus (Perception)", "Toughness"
        ],
        "bloodline arcana": "The DCs of your sorcerer spells increase by 2 against creatures that are suffering ongoing fire damage.",
        "bloodline powers": {
          "Ember (Su)": "At 1st level, you gain a bonus on Craft checks involving metal, and you can use this ability a certain number of times per day.",
          "Forge and Fire (Su)": "At 3rd level, you gain Craft Magic Arms and Armor as a bonus feat, and you can grant the flaming special ability to weapons affected by nonpermanent spells.",
          "Serpents Tail (Su)": "At 9th level, you can grow a serpentine tail, gaining a tail slap attack and other benefits.",
          "Searing Heat (Su)": "At 15th level, your body becomes as hot as a salamanders, dealing additional fire damage with your attacks and to creatures you grapple.",
          "Reforged Flesh (Ex)": "At 20th level, you become immune to fire damage, gain DR 10/adamantine and magic."
        }
      },
      "scorpion": {
        "class skills": "Climb",
        "bonus spells": [
          "thorn javelin (3rd)", "spider climb (5th)", "poison (7th)", "giant vermin (scorpions only) (9th)",
          "vermin shape II (11th)", "sirocco (13th)", "creeping doom (15th)", "horrid wilting (17th)", "transmute blood to acid (19th)"
        ],
        "bonus feats": [
          "Arcane Strike", "Blind-Fight", "Combat Reflexes", "Disruptive Spell", "Improved Initiative", "Nimble Moves", "Skill Focus (Climb)", "Stealthy"
        ],
        "bloodline arcana": "You are trained in the use of poison and cannot accidentally poison yourself when applying poison to a weapon.",
        "bloodline powers": {
          "Progenitors Sting (Sp)": "At 1st level, you can apply a poisonous effect to weapons. The ability damage increases at higher levels.",
          "Modify Onset (Su)": "At 3rd level, you can modify the onset time of poisons or trigger them at will.",
          "Sudden Sting (Ex, Sp)": "At 9th level, you can take full-round actions in the surprise round, and cast accelerate poison and delay poison spell-like abilities.",
          "Sandwalker (Ex)": "At 15th level, you gain a burrow speed and tremorsense.",
          "It Is My Nature (Su)": "At 20th level, your poisoned blood protects you with an ethereal stinger that lashes out at nearby foes."
        }
      },
      "shaitan": {
        "class skills": "Knowledge (planes)",
        "bonus spells": [
          "true strike (3rd)", "glitterdust (5th)", "greater magic weapon (7th)", "stoneskin (9th)", "wall of stone (11th)",
          "wall of iron (13th)", "plane shift (15th)", "iron body (17th)", "wish (19th)"
        ],
        "bonus feats": [
          "Dodge", "Empower Spell", "Great Fortitude", "Improved Initiative", "Lightning Reflexes", "Power Attack", "Skill Focus (Knowledge [planes])", "Weapon Finesse"
        ],
        "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to acid. This effect also changes the spells descriptors to match this energy type.",
        "bloodline powers": {
          "Acid Ray (Sp)": "At 1st level, you can unleash an elemental ray that deals acid damage as a ranged touch attack.",
          "Elemental Resistance (Ex)": "At 3rd level, you gain acid resistance, which increases at 9th level.",
          "Avalanche (Su)": "At 9th level, you can perform a bull rush as a swift action after hitting a target with a damaging spell.",
          "Elemental Movement (Su)": "At 15th level, you gain a burrow speed of 30 feet.",
          "Power of the Shaitan (Su)": "At 20th level, you gain the power to cast limited wish and gain immunities and plane shift abilities."
        }
      },
                  
      "shapechanger": {
        "class skills": "Disguise",
        "bonus spells": [
          "disguise self (3rd)", "alter self (5th)", "fly (7th)", "beast shape II (9th)", "polymorph (11th)",
          "transformation (13th)", "greater polymorph (15th)", "frightful aspect (17th)", "shapechange (19th)"
        ],
        "bonus feats": [
          "Combat Casting", "Dodge", "Extend Spell", "Great Fortitude", "Improved Initiative", "Lightning Reflexes", "Skill Focus (Disguise)", "Toughness"
        ],
        "bloodline arcana": "Transmutation spells you cast only on yourself affect you as though your caster level were 1 higher.",
        "bloodline powers": {
          "Hardened Fists (Su)": "At 1st level, you can enlarge your fists, claws, or natural attacks for improved damage and reach.",
          "Mutable Flesh (Su)": "At 3rd level, you can extend the duration of transmutation spells that affect only yourself.",
          "Vortex of Flesh (Su)": "At 9th level, you can unleash an area attack that deals bludgeoning, piercing, and slashing damage.",
          "Superior Transformation (Su)": "At 15th level, you gain immunity to polymorph effects and the ability to gain special movement abilities when using polymorph spells.",
          "Amorphous Anatomy (Su)": "At 20th level, you gain immunity to critical hits and sneak attacks, blindsight, and damage reduction."
        }
      },
            
      "vestige": {
        "class skills": "Knowledge (history)",
        "bonus spells": [
          "identify (3rd)", "share memory (5th)", "arcane sight (7th)", "hypercognition (9th)", "telepathic bond (11th)",
          "analyze dweomer (13th)", "vision (15th)", "discern location (17th)", "foresight (19th)"
        ],
        "bonus feats": [
          "Arcane Strike", "Augment Summoning", "Craft Wondrous Item", "Echoing Spell", "Iron Will", "Leadership", "Skill Focus (Knowledge [history])", "Spell Focus"
        ],
        "bloodline arcana": "Whenever you cast a spell of the divination school, you gain an insight bonus on the next Appraise, Craft, or Knowledge skill check you attempt within 24 hours.",
        "bloodline powers": {
          "Bonded Object (Sp)": "At 1st level, you gain an arcane bond with a special object from a lost civilization.",
          "Restored Glory (Su)": "At 3rd level, you can make broken or destroyed objects in your possession function again.",
          "Call Ancestor (Sp)": "At 9th level, you can summon an ancestor simulacrum with knowledge in one specific Knowledge skill.",
          "Eternal Past (Su)": "At 15th level, you gain an immersive mindscape that serves as a library for Knowledge skills and allows you to cast create mindscape at will.",
          "Manifest Memory (Su)": "At 20th level, you can create illusions overlaying your mindscape onto the world, allowing a library-like space for Knowledge skills."
        }
      }
            

    }   
