{

    "barbarian": {
    "weapon and armor proficiency": [ "a barbarian is proficient with all simple and martial weapons, light armor, medium armor, and shields (except tower shields). "]
    , "fast movement (ex)": [ "a barbarians land speed is faster than the norm for her race by +10 feet. This benefit applies only when he is wearing no armor, light armor, or medium armor, and not carrying a heavy load. Apply this bonus before modifying the barbarians speed because of any load carried or armor worn. This bonus stacks with any other bonuses to the barbarians land speed. "]
    , "rage (ex)": [ "a barbarian can call upon inner reserves of strength and ferocity, granting her additional combat prowess. Starting at 1st level, a barbarian can rage for a number of rounds per day equal to 4 + her constitution modifier. At each level after 1st, she can rage for 2 additional rounds. Temporary increases to constitution, such as those gained from rage and spells like bears endurance, do not increase the total number of rounds that a barbarian can rage per day. A barbarian can enter rage as a free action. The total number of rounds of rage per day is renewed after resting for 8 hours, although these hours do not need to be consecutive. "]
    , "rage powers (ex)": [ "as a barbarian gains levels, she learns to use her rage in new ways. Starting at 2nd level, a barbarian gains a rage power. She gains another rage power for every two levels of barbarian attained after 2nd level. A barbarian gains the benefits of rage powers only while raging, and some of these powers require the barbarian to take an action first. Unless otherwise noted, a barbarian cannot select an individual power more than once. "]
    , "uncanny dodge (ex)": [ "at 2nd level, a barbarian gains the ability to react to danger before her senses would normally allow her to do so. She cannot be caught flat-footed, nor does she lose her dex bonus to ac if the attacker is invisible. She still loses her dexterity bonus to armor class if immobilized. A barbarian with this ability can still lose her dexterity bonus to armor class if an opponent successfully uses the feint action against her. "]
    , "trap sense (ex)": [ "at 3rd level, a barbarian gains a +1 bonus on reflex saves made to avoid traps and a +1 dodge bonus to armor class against attacks made by traps. These bonuses increase by +1 every three barbarian levels thereafter (6th, 9th, 12th, 15th, and 18th level). Trap sense bonuses gained from multiple classes stack. "]
    , "improved uncanny dodge (ex)": [ "at 5th level and higher, a barbarian can no longer be flanked. This defense denies a rogue the ability to sneak attack the barbarian by flanking her, unless the attacker has at least four more rogue levels than the target has barbarian levels. "]
    , "damage reduction (ex)": [ "at 7th level, a barbarian gains damage reduction. Subtract 1 from the damage the barbarian takes each time she is dealt damage from a weapon or a natural attack. At 10th level, and every three barbarian levels thereafter (13th, 16th, and 19th level), this damage reduction rises by 1 point. Damage reduction can reduce damage to 0 but not below 0. "]
    , "greater rage (ex)": [ "at 11th level, when a barbarian enters rage, the morale bonus to her strength and constitution increases to +6 and the morale bonus on her will saves increases to +3. "]
    , "indomitable will (ex)": [ "while in rage, a barbarian of 14th level or higher gains a +4 bonus on will saves to resist enchantment spells. This bonus stacks with all other modifiers, including the morale bonus on will saves she also receives during her rage. "]
    , "tireless rage (ex)": [ "starting at 17th level, a barbarian no longer becomes fatigued at the end of her rage. "]
    , "mighty rage (ex)": [ "at 20th level, when a barbarian enters rage, the morale bonus to her strength and constitution increases to +8 and the morale bonus on her will saves increases to +4. "]
    , "unstoppable (ex)": [ "at 20th level, nothing can kill the barbarian, though not for lack of trying. The barbarian gains dr 3/ or increases the value of any existing damage reduction by 3. In addition, she gains energy resistance to acid, cold, electricity, and fire equal to her dr/ value. "]
    }
    ,
    
    "bard": {
    "weapon and armor proficiency": "a bard is proficient with all simple weapons, plus the longsword, rapier, sap, shortsword, shortbow, and whip. Bards are also proficient with light armor and shields (except tower shields). A bard can cast bard spells while wearing light armor and using a shield without incurring the normal arcane spell failure chance. Like any other arcane spellcaster, a bard wearing medium or heavy armor incurs a chance of arcane spell failure if the spell in question has a somatic component. A multiclass bard still incurs the normal arcane spell failure chance for arcane spells received from other classes. ",
    "spells": "a bard casts arcane spells drawn from the bard spell list. He can cast any spell he knows without preparing it ahead of time. Every bard spell has a verbal component (singing, reciting, or music). To learn or cast a spell, a bard must have a charisma score equal to at least 10 + the spell level. The difficulty class (dc) for a saving throw against a bards spell is 10 + the spell level + the bards charisma modifier. ",
    "bardic knowledge (ex)": "a bard adds half his class level (minimum 1) to all knowledge skill checks and may make all knowledge skill checks untrained. ",
    "bardic performance": "a bard is trained to use the perform skill to create magical effects on those around him, including himself if desired. He can use this ability for a number of rounds per day equal to 4 + his charisma modifier. At each level after 1st a bard can use bardic performance for 2 additional rounds per day. Each round, the bard can produce any one of the types of bardic performance that he has mastered, as indicated by his level. ",
    "cantrips (sp)": "bards learn a number of cantrips, or 0-level spells, as noted on table: bard spells known under spells known. These spells are cast like any other spell, but they do not consume any slots and may be used again. ",
    "versatile performance (ex)": "at 2nd level, a bard can choose one type of perform skill. He can use his bonus in that skill in place of his bonus in associated skills. When substituting in this way, the bard uses his total perform skill bonus, including class skill bonus, in place of its associated skills bonus, whether or not he has ranks in that skill or if it is a class skill. At 6th level, and every 4 levels thereafter, the bard can select an additional type of perform to substitute. ",
    "well-versed (ex)": "at 2nd level, the bard becomes resistant to the bardic performance of others, and to sonic effects in general. The bard gains a +4 bonus on saving throws made against bardic performance, sonic, and language-dependent effects. ",
    "lore master (ex)": "at 5th level, the bard becomes a master of lore and can take 10 on any knowledge skill check that he has ranks in. A bard can choose not to take 10 and can instead roll normally. In addition, once per day, the bard can take 20 on any knowledge skill check as a standard action. He can use this ability one additional time per day for every six levels he possesses beyond 5th, to a maximum of three times per day at 17th level. ",
    "jack of all trades (ex)": "at 10th level, the bard can use any skill, even if the skill normally requires him to be trained. At 16th level, the bard considers all skills to be class skills. At 19th level, the bard can take 10 on any skill check, even if it is not normally allowed. ",
    "adoring fan (su)": "at 20th level, the bard can use his performance to convert even the toughest audience. To be affected, a target must be able to see and hear the bard perform for 1 full round and be within 30 feet. The target can attempt a will save (dc = 10 + half the bards level + the bards charisma modifier) to negate the effect. If a creature succeeds at the saving throw, the bard cannot use this ability on that creature again for 24 hours. On a failure, the creature is dominated (as dominate monster) for as long as the bard keeps playing and is charmed (as charm monster) for 1d4 hours thereafter. "
    }
    ,
    
    "cleric": {
    "weapon and armor proficiency": "clerics are proficient with all simple weapons, light armor, medium armor, and shields (except tower shields). Clerics are also proficient with the favored weapon of their deities. ",
    "aura (ex)": "a cleric of a chaotic, evil, good, or lawful deity has a particularly powerful aura corresponding to the deitys alignment (see detect evil for details). ",
    "spellcasting": "clerics can prepare a number of orisons, or 0-level spells, each day, as noted on table: cleric under spells per day. These spells are treated like any other spell, but they are not expended when cast and may be used again. ",
    "channel energy (su)": "regardless of alignment, any cleric can release a wave of energy by channeling the power of her faith through her holy (or unholy) symbol. This energy can be used to cause or heal damage, depending on the type of energy channeled and the creatures targeted. A good cleric (or a neutral cleric who worships a good deity) channels positive energy and can choose to deal damage to undead creatures or to heal living creatures. An evil cleric (or a neutral cleric who worships an evil deity) channels negative energy and can choose to deal damage to living creatures or to heal undead creatures. A neutral cleric of a neutral deity (or one who is not devoted to a particular deity) must choose whether she channels positive or negative energy. Once this choice is made, it cannot be reversed. This decision also determines whether the cleric can cast spontaneous cure or inflict spells (see spontaneous casting). Channeling energy causes a burst that affects all creatures of one type (either undead or living) in a 30-foot radius centered on the cleric. The amount of damage dealt or healed is equal to 1d6 points of damage plus 1d6 points of damage for every two cleric levels beyond 1st (2d6 at 3rd, 3d6 at 5th, and so on). Creatures that take damage from channeled energy receive a will save to halve the damage. The dc of this save is equal to 10 + 1/2 the clerics level + the clerics charisma modifier. Creatures healed by channel energy cannot exceed their maximum hit point totalall excess healing is lost. A cleric may channel energy a number of times per day equal to 3 + her charisma modifier. This is a standard action that does not provoke an attack of opportunity. A cleric can choose whether or not to include herself in this effect. ",
    "domains": "a clerics deity influences her alignment, what magic she can perform, her values, and how others see her. A cleric chooses two domains from among those belonging to her deity. A cleric can select an alignment domain (chaos, evil, good, or law) only if her alignment matches that domain. If a cleric is not devoted to a particular deity, she still selects two domains to represent her spiritual inclinations and abilities (subject to gm approval). The restriction on alignment domains still applies. ",
    "spontaneous casting": "a good cleric (or a neutral cleric of a good deity) can channel stored spell energy into healing spells that she did not prepare ahead of time. The cleric can lose any prepared spell that is not an orison or domain spell in order to cast any cure spell of the same spell level or lower (a cure spell is any spell with cure in its name). ",
    "bonus languages": "a clerics bonus language options include celestial, abyssal, and infernal (the languages of good, chaotic evil, and lawful evil outsiders, respectively). These choices are in addition to the bonus languages available to the character because of her race. ",
    "proxy (su)": "at 20th level, the cleric forges a direct, personal connection to her deity. She knows instinctively whether her deity would approve or disapprove of a given course of action or idea (though deities rarely bother to form opinions about overly mundane or trivial events). In addition, she can select an additional domain from the list offered by her deity. "
    }
    ,
    
    "druid": {
    "weapon and armor proficiency": "the following 3rd party publisher feats are available to a druid character who meets the prerequisites. ",
    "spells": "a druid casts divine spells, which are drawn from the druid spell list. Her alignment may restrict her from casting certain spells opposed to her moral or ethical beliefs; see chaotic, evil, good, and lawful spells. A druid must choose and prepare her spells in advance. ",
    "spontaneous casting": "a druid can channel stored spell energy into summoning spells that she hasnt prepared ahead of time. She can lose a prepared spell in order to cast any summon natures ally spell of the same level or lower. ",
    "chaotic, evil, good, and lawful spells": "a druid cant cast spells of an alignment opposed to her own or her deitys (if she has one). Spells associated with particular alignments are indicated by the chaos, evil, good, and law descriptors in their spell descriptions. ",
    "orisons (sp)": "druids can prepare a number of orisons, or 0-level spells, each day, as noted on table: druid under spells per day. These spells are cast like any other spell, but they are not expended when cast and may be used again. ",
    "bonus languages": "a druids bonus language options include sylvan, the language of woodland creatures. This choice is in addition to the bonus languages available to the character because of her race. ",
    "nature bond (ex)": "can druids, inquisitors, and other classes with access to domains take subdomains? ",
    "nature sense (ex)": "a druid gains a +2 bonus on knowledge (nature) and survival checks. ",
    "wild empathy (ex)": "a druid can improve the attitude of an animal. This ability functions just like a diplomacy check made to improve the attitude of a person. The druid rolls 1d20 and adds her druid level and her charisma modifier to determine the wild empathy check result. ",
    "woodland stride (ex)": "starting at 2nd level, a druid may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at her normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect her. ",
    "trackless step (ex)": "starting at 3rd level, a druid leaves no trail in natural surroundings and cannot be tracked. She may choose to leave a trail if so desired. ",
    "resist natures lure (ex)": "starting at 4th level, a druid gains a +4 bonus on saving throws against the spell-like and supernatural abilities of fey. This bonus also applies to spells and effects that target plants, such as blight, entangle, spike growth, and warp wood. ",
    "wild shape (su)": "at 4th level, a druid gains the ability to turn herself into any small or medium animal and back again once per day. Her options for new forms include all creatures with the animal type. This ability functions like the beast shape i spell, except as noted here. The effect lasts for 1 hour per druid level, or until she changes back. Changing form (to animal or back) is a standard action and doesnt provoke an attack of opportunity. The form chosen must be that of an animal the druid is familiar with. ",
    "venom immunity (ex)": "at 9th level, a druid gains immunity to all poisons. ",
    "a thousand faces (su)": "at 13th level, a druid gains the ability to change her appearance at will, as if using the alter self spell, but only while in her normal form. ",
    "timeless body (ex)": "after attaining 15th level, a druid no longer takes ability score penalties for aging and cannot be magically aged. Any penalties she may have already incurred, however, remain in place. Bonuses still accrue, and the druid still dies of old age when her time is up. ",
    "home ground (su)": "at 20th level, the druid knows every tree, every deer, every blade of grass, and every scuttling beetle of her home. The druid selects a specific area relevant to the campaign, such as a prominent forest, mountain, or even a patch of sea. The druid is constantly under the effect of commune with nature with regards to that area and can change the facts she gleans from the spell when she prepares her spells each day. In addition, while on her home ground, the druid gains a +4 bonus to her caster level. "
    }
    ,
    "fighter":
    {
    "weapon and armor proficiency": "a fighter is proficient with all simple and martial weapons and with all armor (heavy, light, and medium) and shields (including tower shields). ",
    "bonus feats": "can i use the bonus feats class feature to retrain a feat that i gained at 1st level (such as cleave) to gain a feat that i did not qualify for at 1st level, but do qualify for now (such as lunge)? ",
    "bravery (ex)": "starting at 2nd level, a fighter gains a +1 bonus on will saves against fear. This bonus increases by +1 for every four levels beyond 2nd. ",
    "armor training (ex)": "starting at 3rd level, a fighter learns to be more maneuverable while wearing armor. Whenever he is wearing armor, he reduces the armor check penalty by 1 (to a minimum of 0) and increases the maximum dexterity bonus allowed by his armor by 1. Every four levels thereafter (7th, 11th, and 15th), these bonuses increase by +1 each time, to a maximum 4 reduction of the armor check penalty and a +4 increase of the maximum dexterity bonus allowed. ",
    "weapon training (ex)": "starting at 5th level, a fighter can select one group of weapons, as noted below. Whenever he attacks with a weapon from this group, he gains a +1 bonus on attack and damage rolls. ",
    "armor mastery (ex)": "at 19th level, a fighter gains damage reduction 5/ whenever he is wearing armor or using a shield. ",
    "weapon mastery (ex)": "at 20th level, a fighter chooses one weapon, such as the longsword, greataxe, or longbow. Any attacks made with that weapon automatically confirm all critical threats and have their damage multiplier increased by 1 (2 becomes 3, for example). In addition, he cannot be disarmed while wielding a weapon of this type. ",
    "veteran of endless war (ex)": "at 20th level, the fighter has seen more combat than entire platoons of soldiers put together. The bonuses granted by his armor training and weapon training increase by 2 each. "
    }
    ,
    "monk": {
    "weapon proficiency": "monks are proficient with the brass knuckles, cestus, club, crossbow (light or heavy), dagger, handaxe, javelin, kama, nunchaku, quarterstaff, sai, shortspear, short sword, shuriken, siangham, sling, spear, and temple sword. ",
    "ac bonus (ex)": "when unarmored and unencumbered, the monk adds his wisdom bonus (if any) to his ac and his cmd. In addition, a monk gains a +1 bonus to ac and cmd at 4th level. This bonus increases by 1 for every four monk levels thereafter, up to a maximum of +5 at 20th level. ",
    "flurry of blows (ex)": "the monk rules for flurry of blows state: for the purpose of these attacks, the monks base attack bonus is equal to his monk level. How does this interact with bab from class levels and racial hit dice? Does a multiclassed fighter 19/monk 1 flurry as if his bab were only +1? ",
    "unarmed strike": "at 1st level, a monk gains improved unarmed strike as a bonus feat. A monks attacks may be with fist, elbows, knees, and feet. This means that a monk may make unarmed strikes with his hands full. There is no such thing as an off-hand attack for a monk striking unarmed. A monk may thus apply his full strength bonus on damage rolls for all his unarmed strikes. ",
    "bonus feat": "at 1st level, 2nd level, and every 4 levels thereafter, a monk may select a bonus feat. These feats must be taken from the following list: ",
    "stunning fist (ex)": "at 1st level, the monk gains stunning fist as a bonus feat, even if he does not meet the prerequisites. The monk may attempt a stunning attack a number of times per day equal to his monk level, plus one more time per day for every four levels he has in classes other than monk. ",
    "evasion (ex)": "at 2nd level or higher, a monk can avoid damage from many area-effect attacks. If a monk makes a successful reflex saving throw against an attack that normally deals half damage on a successful save, he instead takes no damage. Evasion can be used only if a monk is wearing light armor or no armor. A helpless monk does not gain the benefit of evasion. ",
    "fast movement (ex)": "at 3rd level, a monk gains an enhancement bonus to his land speed, as shown on table: monk. A monk in armor or carrying a medium or heavy load loses this extra speed. ",
    "maneuver training (ex)": "at 3rd level, a monk uses his monk level in place of his base attack bonus when calculating his combat maneuver bonus. Base attack bonuses granted from other classes are unaffected and are added normally. ",
    "still mind (ex)": "a monk of 3rd level or higher gains a +2 bonus on saving throws against enchantment spells and effects. ",
    "ki pool (su)": "at 4th level, a monk gains a pool of ki points, supernatural energy he can use to accomplish amazing feats. The number of points in a monks ki pool is equal to 1/2 his monk level + his wisdom modifier. As long as he has at least 1 point in his ki pool, he can make a ki strike. ",
    "slow fall (ex)": "at 4th level or higher, a monk within arms reach of a wall can use it to slow his descent. When first gaining this ability, he takes damage as if the fall were 20 feet shorter than it actually is. The monks ability to slow his fall (that is, to reduce the effective distance of the fall when next to a wall) improves with his monk level until at 20th level he can use a nearby wall to slow his descent and fall any distance without harm. ",
    "high jump (ex)": "at 5th level, a monk adds his level to all acrobatics checks made to jump, both for vertical jumps and horizontal jumps. In addition, he always counts as having a running start when making jump checks using acrobatics. By spending 1 point from his ki pool as a swift action, a monk gains a +20 bonus on acrobatics checks made to jump for 1 round. ",
    "purity of body (ex)": "at 5th level, a monk gains immunity to all diseases, including supernatural and magical diseases. ",
    "wholeness of body (su)": "at 7th level or higher, a monk can heal his own wounds as a standard action. He can heal a number of hit points of damage equal to his monk level by using 2 points from his ki pool. ",
    "improved evasion (ex)": "at 9th level, a monks evasion ability improves. He still takes no damage on a successful reflex saving throw against attacks, but henceforth he takes only half damage on a failed save. A helpless monk does not gain the benefit of improved evasion. ",
    "diamond body (su)": "at 11th level, a monk gains immunity to poisons of all kinds. ",
    "abundant step (su)": "at 12th level or higher, a monk can slip magically between spaces, as if using the spell dimension door. Using this ability is a move action that consumes 2 points from his ki pool. His caster level for this effect is equal to his monk level. He cannot take other creatures with him when he uses this ability. ",
    "diamond soul (ex)": "at 13th level, a monk gains spell resistance equal to his current monk level + 10. In order to affect the monk with a spell, a spellcaster must get a result on a caster level check (1d20 + caster level) that equals or exceeds the monks spell resistance. ",
    "quivering palm (su)": "starting at 15th level, a monk can set up vibrations within the body of another creature that can thereafter be fatal if the monk so desires. He can use this quivering palm attack once per day, and he must announce his intent before making his attack roll. Creatures immune to critical hits cannot be affected. Otherwise, if the monk strikes successfully and the target takes damage from the blow, the quivering palm attack succeeds. Thereafter, the monk can try to slay the victim at any later time, as long as the attempt is made within a number of days equal to his monk level. To make such an attempt, the monk merely wills the target to die (a free action), and unless the target makes a fortitude saving throw (dc 10 + 1/2 the monks level + the monks wis modifier), it dies. If the saving throw is successful, the target is no longer in danger from that particular quivering palm attack, but it may still be affected by another one at a later time. A monk can have no more than 1 quivering palm in effect at one time. If a monk uses quivering palm while another is still in effect, the previous effect is negated. ",
    "timeless body (ex)": "at 17th level, a monk no longer takes penalties to his ability scores for aging and cannot be magically aged. Any such penalties that he has already taken, however, remain in place. Age bonuses still accrue, and the monk still dies of old age when his time is up. ",
    "tongue of the sun and moon (ex)": "a monk of 17th level or higher can speak with any living creature. ",
    "empty body (su)": "at 19th level, a monk gains the ability to assume an ethereal state for 1 minute as though using the spell etherealness. Using this ability is a move action that consumes 3 points from his ki pool. This ability only affects the monk and cannot be used to make other creatures ethereal. ",
    "perfect self": "at 20th level, a monk becomes a magical creature. He is forevermore treated as an outsider rather than as a humanoid (or whatever the monks creature type was) for the purpose of spells and magical effects. Additionally, the monk gains damage reduction 10/chaotic, which allows him to ignore the first 10 points of damage from any attack made by a nonchaotic weapon or by any natural attack made by a creature that doesnt have similar damage reduction. Unlike other outsiders, the monk can still be brought back from the dead as if he were a member of his previous creature type. ",
    "old master (ex)": "at 20th level, the monk has reached the highest levels of his martial arts school. The monk gains one additional attack at his highest base attack bonus when using flurry of blows, and his dodge bonus to ac increases by 2. "
    
    }
    ,
    "paladin": {
    "weapon and armor proficiency": "paladins are proficient with all simple and martial weapons, with all types of armor (heavy, medium, and light), and with shields (except tower shields). ",
    "aura of good (ex)": "the power of a paladins aura of good (see the detect good spell) is equal to her paladin level. ",
    "detect evil (sp)": "at will, a paladin can use detect evil, as the spell. A paladin can, as a move action, concentrate on a single item or individual within 60 feet and determine if it is evil, learning the strength of its aura as if having studied it for 3 rounds. While focusing on one individual or object, the paladin does not detect evil in any other object or individual within range. ",
    "smite evil (su)": "once per day, a paladin can call out to the powers of good to aid her in her struggle against evil. As a swift action, the paladin chooses one target within sight to smite. If this target is evil, the paladin adds her cha bonus (if any) to her attack rolls and adds her paladin level to all damage rolls made against the target of her smite. If the target of smite evil is an outsider with the evil subtype, an evil-aligned dragon, or an undead creature, the bonus to damage on the first successful attack increases to 2 points of damage per level the paladin possesses. Regardless of the target, smite evil attacks automatically bypass any dr the creature might possess. ",
    "divine grace (su)": "at 2nd level, a paladin gains a bonus equal to her charisma bonus (if any) on all saving throws. ",
    "lay on hands (su)": "beginning at 2nd level, a paladin can heal wounds (her own or those of others) by touch. Each day she can use this ability a number of times equal to 1/2 her paladin level plus her charisma modifier. With one use of this ability, a paladin can heal 1d6 hit points of damage for every two paladin levels she possesses. Using this ability is a standard action, unless the paladin targets herself, in which case it is a swift action. Despite the name of this ability, a paladin only needs one free hand to use this ability. ",
    "aura of courage (su)": "at 3rd level, a paladin is immune to fear (magical or otherwise). Each ally within 10 feet of her gains a +4 morale bonus on saving throws against fear effects. This ability functions only while the paladin is conscious, not if she is unconscious or dead. ",
    "divine health (ex)": "at 3rd level, a paladin is immune to all diseases, including supernatural and magical diseases, including mummy rot. ",
    "mercy (su)": "at 3rd level, and every three levels thereafter, a paladin can select one mercy. Each mercy adds an effect to the paladins lay on hands ability. Whenever the paladin uses lay on hands to heal damage to one target, the target also receives the additional effects from all of the mercies possessed by the paladin. A mercy can remove a condition caused by a curse, disease, or poison without curing the affliction. Such conditions return after 1 hour unless the mercy actually removes the affliction that causes the condition. ",
    "channel positive energy (su)": "when a paladin reaches 4th level, she gains the supernatural ability to channel positive energy like a cleric. Using this ability consumes two uses of her lay on hands ability. A paladin uses her level as her effective cleric level when channeling positive energy. This is a charisma-based ability. ",
    "spells": "beginning at 4th level, a paladin gains the ability to cast a small number of divine spells which are drawn from the paladin spell list. A paladin must choose and prepare her spells in advance. ",
    "divine bond (sp)": "upon reaching 5th level, a paladin forms a divine bond with her god. This bond can take one of two forms. Once the form is chosen, it cannot be changed. ",
    "aura of resolve (su)": "at 8th level, a paladin is immune to charm spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against charm effects. ",
    "aura of justice (su)": "at 11th level, a paladin can expend two uses of her smite evil ability to grant the ability to smite evil to all allies within 10 feet, using her bonuses. Allies must use this smite evil ability by the start of the paladins next turn and the bonuses last for 1 minute. Using this ability is a free action. Evil creatures gain no benefit from this ability. ",
    "aura of faith (su)": "at 14th level, a paladins weapons are treated as good-aligned for the purposes of overcoming damage reduction. Any attack made against an enemy within 10 feet of her is treated as good-aligned for the purposes of overcoming damage reduction. ",
    "aura of righteousness (su)": "at 17th level, a paladin gains dr 5/evil and immunity to compulsion spells and spell-like abilities. Each ally within 10 feet of her gains a +4 morale bonus on saving throws against compulsion effects. ",
    "holy champion (su)": "at 20th level, a paladin becomes a conduit for the power of her god. Her dr increases to 10/evil. Whenever she uses smite evil and successfully strikes an evil outsider, the outsider is also subject to a banishment, using her paladin level as the caster level (her weapon and holy symbol automatically count as objects that the subject hates). After the banishment effect and the damage from the attack is resolved, the smite immediately ends. In addition, whenever she channels positive energy or uses lay on hands to heal a creature, she heals the maximum possible amount. ",
    "crusader champion (su)": "at 20th level, the paladins zeal is so inspiring that it affects all around her. The ranges of all of the paladins auras increase by 30 feet. "
    }
    ,
    "ranger": {
    "weapon and armor proficiency": "a ranger is proficient with all simple and martial weapons and with light armor, medium armor, and shields (except tower shields). ",
    "favored enemy (ex)": "at 1st level, a ranger selects a creature type from the ranger favored enemies table. He gains a +2 bonus on bluff, knowledge, perception, sense motive, and survival checks against creatures of his selected type. Likewise, he gets a +2 bonus on weapon attack and damage rolls against them. A ranger may make knowledge skill checks untrained when attempting to identify these creatures. ",
    "track (ex)": "a ranger adds half his level (minimum 1) to survival skill checks made to follow tracks. ",
    "wild empathy (ex)": "a ranger can improve the initial attitude of an animal. This ability functions just like a diplomacy check to improve the attitude of a person (see using skills). The ranger rolls 1d20 and adds his ranger level and his charisma bonus to determine the wild empathy check result. The typical domestic animal has a starting attitude of indifferent, while wild animals are usually unfriendly. ",
    "combat style feat (ex)": "at 2nd level, a ranger must select one combat style to pursue. ",
    "endurance": "a ranger gains endurance as a bonus feat at 3rd level. ",
    "favored terrain (ex)": "at 3rd level, a ranger may select a type of terrain from table: ranger favored terrains. The ranger gains a +2 bonus on initiative checks and knowledge (geography), perception, stealth, and survival skill checks when he is in this terrain. A ranger traveling through his favored terrain normally leaves no trail and cannot be tracked (though he may leave a trail if he so chooses). ",
    "hunters bond (ex)": "at 4th level, a ranger forms a bond with his hunting companions. This bond can take one of two forms. Once the form is chosen, it cannot be changed. ",
    "spells": "beginning at 4th level, a ranger gains the ability to cast a small number of divine spells, which are drawn from the ranger spell list. A ranger must choose and prepare his spells in advance. ",
    "woodland stride (ex)": "starting at 7th level, a ranger may move through any sort of undergrowth at his normal speed and without taking damage or suffering any other impairment. ",
    "swift tracker (ex)": "beginning at 8th level, a ranger can move at his normal speed while using survival to follow tracks without taking the normal 5 penalty. He takes only a 10 penalty (instead of the normal 20) when moving at up to twice normal speed while tracking. ",
    "evasion (ex)": "when he reaches 9th level, a ranger can avoid even magical and unusual attacks with great agility. If he makes a successful reflex saving throw against an attack that normally deals half damage on a successful save, he instead takes no damage. Evasion can be used only if the ranger is wearing light armor, medium armor, or no armor. ",
    "quarry (ex)": "at 11th level, a ranger can denote one target as his quarry. He can take 10 on his survival skill checks while moving at normal speed, receives a +2 insight bonus on attack rolls, and all critical threats are automatically confirmed. A ranger can have no more than one quarry at a time and the creatures type must correspond to one of his favored enemy types. ",
    "camouflage (ex)": "a ranger of 12th level or higher can use the stealth skill to hide in any of his favored terrains. ",
    "improved evasion (ex)": "at 16th level, a rangers evasion improves. While the ranger still takes no damage on a successful reflex saving throw against attacks, he henceforth takes only half damage on a failed save. A helpless ranger does not gain the benefit of improved evasion. ",
    "hide in plain sight (ex)": "while in any of his favored terrains, a ranger of 17th level or higher can use the stealth skill even while being observed. ",
    "improved quarry (ex)": "at 19th level, the rangers ability to hunt his quarry improves. He can now select a quarry as a free action and can now take 20 while using survival to track his quarry. ",
    "master hunter (ex)": "a ranger of 20th level becomes a master hunter. He can move at full speed while using survival to follow tracks without penalty and can make a single attack against a favored enemy at his full attack bonus. The target takes damage normally and must make a fortitude save or die. A ranger can use this ability once per day against each favored enemy type he possesses. ",
    "seen it before (ex)": "at 20th level, the ranger adds his favored enemy bonus as an insight bonus on saves against spells and abilities used by his favored enemies. "
    }
    ,
    "sorcerer":
    {
    "weapon and armor proficiency": "sorcerers are proficient with all simple weapons. They are not proficient with any type of armor or shield. Armor interferes with a sorcerers gestures, which can cause her spells with somatic components to fail (see arcane spells and armor). ",
    "bloodline": "each sorcerer has a source of magic somewhere in her heritage that grants her spells, bonus feats, an additional class skill, and other special abilities. A sorcerer must pick one bloodline upon taking her first level of sorcerer. Once made, this choice cannot be changed. ",
    "cantrips": "sorcerers learn a number of cantrips, or 0-level spells, as noted on table: sorcerer spells known under spells known. These spells are cast like any other spell, but they do not consume any slots and may be used again. ",
    "eschew materials": "a sorcerer gains eschew materials as a bonus feat at 1st level. "
    }
    ,
    "unchained_monk": {
    "weapon and armor proficiency": "monks are proficient with the club, crossbow (light or heavy), dagger, handaxe, javelin, kama, nunchaku, quarterstaff, sai, short sword, shortspear, shuriken, siangham, sling, spear, and any weapon with the monk special weapon quality. ",
    "ac bonus": "when unarmored and unencumbered, the monk adds his wisdom bonus (if any) to his ac and cmd. In addition, a monk gains a +1 bonus to ac and cmd at 4th level. This bonus increases by 1 for every four monk levels thereafter, up to a maximum of +5 at 20th level. ",
    "bonus feat": "at 1st level, 2nd level, and every 4 levels thereafter, a monk can select a bonus feat. These feats must be taken from the following list. ",
    "flurry of blows": "at 1st level, a monk can make a flurry of blows as a full-attack action. When using this ability, the monk can make one additional attack at his highest base attack bonus. The monk can make these attacks with any combination of unarmed strikes and weapons with the monk special weapon quality. He takes no penalty for using multiple weapons when making a flurry of blows. ",
    "stunning fist": "at 1st level, the monk gains stunning fist as a bonus feat, even if he does not meet the prerequisites. ",
    "unarmed strike": "at 1st level, a monk gains improved unarmed strike as a bonus feat. A monks attacks can be with fists, elbows, knees, and feet. His unarmed strikes deal lethal damage and can use his full strength bonus for damage rolls. ",
    "evasion": "at 2nd level, a monk can avoid damage from many area-effect attacks. Evasion can be used only if a monk is wearing light armor or no armor. ",
    "fast movement": "at 3rd level, a monk gains an enhancement bonus to his land speed. ",
    "ki pool (su)": "at 3rd level, a monk gains a pool of ki points, which allow for various abilities, including ki strike and ki powers. ",
    "ki power (su)": "at 4th level and every 2 levels thereafter, a monk can select one ki power. These powers use ki points and grant special abilities. ",
    "still mind (ex)": "at 4th level, a monk gains a +2 bonus on saving throws against enchantment spells and effects. ",
    "purity of body (ex)": "at 5th level, a monk gains immunity to all diseases, including supernatural and magical diseases. ",
    "style strike (ex)": "at 5th level, a monk can learn one type of style strike. These strikes have additional effects when used in a flurry of blows. ",
    "improved evasion": "at 9th level, a monks evasion ability improves. ",
    "tongue of the sun and moon (ex)": "at 13th level, a monk can understand and speak with any living creature. ",
    "timeless body": "at 17th level, a monk no longer takes penalties to his ability scores for aging and cannot be magically aged. ",
    "flawless mind": "at 19th level, a monk can roll twice and take the better result on will saves and can end long-duration mental effects by making periodic saving throws. ",
    "perfect self": "at 20th level, a monk becomes a magical creature, gains damage reduction, and can enter a state of perfect calm. ",
    "old master": "at 20th level, the monk gains additional attacks with flurry of blows and increased dodge bonus to ac. "
    }
    
    ,
    "wizard": {
    "weapon and armor proficiency": "wizards are proficient with the club, dagger, heavy crossbow, light crossbow, and quarterstaff, but not with any type of armor or shield. Armor interferes with a wizards movements, which can cause his spells with somatic components to fail. ",
    "spells": "a wizard casts arcane spells drawn from the sorcerer/wizard spell list. A wizard must choose and prepare his spells ahead of time. ",
    "bonus languages": "a wizard may substitute draconic for one of the bonus languages available to the character because of his race. ",
    "arcane bond (ex or sp)": "can you identify an item that is the subject of an arcane bond from a wizard with detect magic or a similar affect, even if the item contains no other enchantments? ",
    "arcane school": {
    "classic arcane schools": ["abjuration", "banishment", "counterspell", "conjuration", "creation", "extradimension", "infernal binder", "teleportation", "divination", "prophecy", "foresight", "scryer", "enchantment", "controller", "manipulator", "evocation", "admixture", "generation", "illusion", "deception", "mage of the veil", "phantasm", "shadow", "necromancy", "life", "undead", "sin magic", "transmutation", "enhancement", "shapechange", "universalist"],
    "elemental arcane schools": "instead of specializing in a focused arcane school of magic, a wizard can choose to specialize in one of the elemental schools of magic. Like a normal arcane school, an elemental school grants a number of school powers and one bonus spell slot of each level the wizard can cast, from 1st on up. This bonus spell slot must be used to prepare a spell from the elemental schools spell list. Unlike a normal arcane school, each elemental school requires the wizard to select his opposed element as his opposition school (air opposes earth, fire opposes water). He does not need to select a second opposition school. He must expend two spell slots to prepare a spell from his opposed elemental school as normal. "
    },
    "cantrips": "wizards can prepare a number of cantrips, or 0-level spells, each day, as noted on table: wizard under spells per day. These spells are cast like any other spell, but they are not expended when cast and may be used again. A wizard can prepare a cantrip from an opposition school, but it uses up two of his available slots (see below). ",
    "scribe scroll": "at 1st level, a wizard gains scribe scroll as a bonus feat. ",
    "bonus feats": "at 5th, 10th, 15th, and 20th level, a wizard gains a bonus feat. At each such opportunity, he can choose a metamagic feat, an item creation, or spell mastery. The wizard must still meet all prerequisites for a bonus feat, including caster level minimums. These bonus feats are in addition to the feats that a character of any class gets from advancing levels. The wizard is not limited to the categories of item creation feats, metamagic feats, or spell mastery when choosing those feats. ",
    "well-prepared (su)": "at 20th level, the wizard has a spell for every occasion he can imagineand a few he cant. The wizard gains two additional cantrips per day, six additional 1st- and 2nd-level spell slots, four additional 3rd- and 4th-level spell slots, two additional 5th-level spell slots, and one additional 6th-level spell slot. ",
    "adding spells to a wizards spellbook": "wizards can add new spells to their spellbooks through several methods. A wizard can only learn new spells that belong to the wizard spell lists (see magic). "
    }
    
    }