{
    "1st-level Deeds": {
      "Derring-Do": {
        "Description": "At 1st level, a swashbuckler can spend 1 panache point when she makes an Acrobatics, Climb, Escape Artist, Fly, Ride, or Swim check...",
        "Note": "This deed's cost cannot be reduced by any ability or effect that reduces the number of panache points a deed costs."
      },
      "Dodging Panache": {
        "Description": "At 1st level, when an opponent attempts a melee attack against the swashbuckler, the swashbuckler can, as an immediate action...",
        "Note": "This movement is not a 5-foot step; it provokes attacks of opportunity from creatures other than the one who triggered this deed. The swashbuckler can only perform this deed while wearing light or no armor, and while carrying no heavier than a light load."
      },
      "Opportune Parry and Riposte": {
        "Description": "At 1st level, when an opponent makes a melee attack against the swashbuckler, she can spend 1 panache point and expend a use of an attack of opportunity...",
        "Note": "This deed's cost cannot be reduced by any ability or effect that reduces the number of panache points a deed costs."
      }
    },
    "3rd-level Deeds": {
      "Kip-Up": {
        "Description": "At 3rd level, while the swashbuckler has at least 1 panache point, she can kip-up from prone as a move action without provoking an attack of opportunity...",
        "Note": "She can kip-up as a swift action instead by spending 1 panache point."
      },
      "Menacing Swordplay": {
        "Description": "At 3rd level, while she has at least 1 panache point, when a swashbuckler hits an opponent with a light or one-handed piercing melee weapon, she can choose to use Intimidate to demoralize that opponent..."
      },
      "Precise Strike": {
        "Description": "At 3rd level, while she has at least 1 panache point, a swashbuckler gains the ability to strike precisely with a light or one-handed piercing melee weapon (though not natural weapon attacks)...",
        "Note": "This deed's cost cannot be reduced by any ability or effect that reduces the amount of panache points a deed costs (such as the Signature Deed feat)."
      },
      "Swashbuckler Initiative": {
        "Description": "At 3rd level, while the swashbuckler has at least 1 panache point, she gains a +2 bonus on initiative checks. In addition, if she has the Quick Draw feat, her hands are free and unrestrained..."
      }
    },
    "7th-level Deeds": {
      "Superior Feint": {
        "Description": "At 7th level, a swashbuckler with at least 1 panache point can, as a standard action, purposefully miss a creature she could make a melee attack against with a wielded light or one-handed piercing weapon..."
      },
      "Swashbuckler's Grace": {
        "Description": "At 7th level, while the swashbuckler has at least 1 panache point, she takes no penalty for moving at full speed when she uses Acrobatics to attempt to move through a threatened area or an enemy’s space."
      },
      "Targeted Strike": {
        "Description": "At 7th level, as a full-round action, the swashbuckler can spend 1 panache point to make an attack with a single light or one-handed piercing melee weapon that cripples part of a foe’s body..."
      }
    },
    "11th-level Deeds": {
      "Bleeding Wound": {
        "Description": "At 11th level, when the swashbuckler hits a living creature with a light or one-handed piercing melee weapon attack, as a free action she can spend 1 panache point to have that attack deal additional bleed damage..."
      },
      "Evasive": {
        "Description": "At 11th level, while a swashbuckler has at least 1 panache point, she gains the benefits of the evasion, uncanny dodge, and improved uncanny dodge rogue class features. She uses her swashbuckler level as her rogue level for improved uncanny dodge."
      },
      "Subtle Blade": {
        "Description": "At 11th level, while a swashbuckler has at least 1 panache point, she is immune to disarm, steal, and sunder combat maneuvers made against a light or one-handed piercing melee weapon she is wielding."
      }
    },
    "15th-level Deeds": {
      "Dizzying Defense": {
        "Description": "At 15th level, while wielding a light or one-handed piercing melee weapon in one hand, the swashbuckler can spend 1 panache point to take the fighting defensively action as a swift action instead of a standard action..."
      },
      "Perfect Thrust": {
        "Description": "At 15th level, while the swashbuckler has at least 1 panache point, she can, as a full-round action, make a perfect thrust, pooling all of her attack potential into a single melee attack made with a light or one-handed piercing melee weapon..."
      },
      "Swashbuckler's Edge": {
        "Description": "At 15th level, while the swashbuckler has at least 1 panache point, she can take 10 on any Acrobatics, Climb, Escape Artist, Fly, Ride, or Swim check, even while distracted or in immediate danger. She can use this ability in conjunction with the derring-do deed."
      }
    },
    "19th-level Deeds": {
      "Cheat Death": {
        "Description": "At 19th level, whenever the swashbuckler is reduced to 0 hit points or fewer, she can spend all of her remaining panache to instead be reduced to 1 hit point. She must have at least 1 panache point to spend. Effects that kill the swashbuckler outright without dealing hit point damage are not affected by this ability."
      },
      "Deadly Stab": {
        "Description": "At 19th level, when the swashbuckler confirms a critical hit with a light or one-handed piercing melee weapon, in addition to the normal damage, she can spend 1 panache point to inflict a deadly stab. The target must succeed at a Fortitude saving throw or die..."
      },
      "Stunning Stab": {
        "Description": "At 19th level, when a swashbuckler hits a creature with a light or one-handed piercing melee weapon, she can spend 2 panache points to stun the creature for 1 round..."
      }
    }
  }