{
  "Melee": {
    "Shrinking": {
      "source": "Melee Tactics Toolbox pg. 27",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "none;",
      "price": "+500",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. When the wielder issues the command word, a shrinking weapon shrinks to the size of a standard dagger. While in this state, the weapon deals 1d4 points of damage but is more easily concealable. When the command word is spoken again, the weapon returns to its original state. Construction",
      "requirements": "Craft Magic Arms and Armor, shrink item ;"
    },
    "Agile": {
      "source": "Pathfinder #100: A Song of Silver pg. 21 , Pathfinder Society Field Guide pg. 50",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A character with Weapon Finesse can apply her Dexterity modifier to damage rolls with an agile weapon in place of her Strength modifier. This modifier to damage is not increased for two-handed weapons, but is still reduced for off-hand weapons. This weapon special ability can be placed only on melee weapons usable with Weapon Finesse. Construction",
      "requirements": "Craft Magic Arms and Armor, cat's grace ;"
    },
    "Allying": {
      "source": "Ultimate Equipment pg. 135 , Advanced Player's Guide pg. 286",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " An allying weapon allows the wielder to transfer some or all of the weapon's enhancement bonus to one weapon being used by an ally of the wielder. The wielder must have line of sight to the intended ally. As a free action, at the start of her turn before using her weapon, the wielder chooses how to allocate her weapon's enhancement bonus. The bonus to the ally's weapon lasts until the allying weapon's wielder's next turn. The enhancement bonus from the allying weapon does not stack with the enhancement bonus on the ally's weapon (if any). Construction",
      "requirements": "Craft Magic Arms and Armor, magic weapon ;"
    },
    "Answering": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can be placed only on melee weapons. For the purpose of the opportune parry and riposte deed, the weapon's enhancement bonus increases by 4 (to a maximum of +5). Construction",
      "requirements": "Craft Magic Arms and Armor, good hope , creator must have the opportune parry and riposte deed;"
    },
    "Bane": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A bane weapon excels against certain foes. Against a designated foe, the weapon's enhancement bonus is +2 better than its actual bonus. It also deals an extra 2d6 points of damage against such foes. To randomly determine a weapon's designated foe, roll on the following table. d% Designated Foe   01–05 Aberrations   06–09 Animals   10–16 Constructs   17–22 Dragons   23–27 Fey   28–60 Humanoids (pick one subtype)   61–65 Magical beasts   66–70 Monstrous humanoids   71–72 Oozes   73–88 Outsiders (pick one subtype)   89–90 Plants   91–98 Undead   99–100 Vermin Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Benevolent": {
      "source": "Ultimate Equipment pg. 136",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can only be placed on a melee weapon. When the wielder of a benevolent weapon uses the aid another action to grant an ally a bonus on attack rolls, he increases the aid another bonus by the enhancement bonus of the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, aid ;"
    },
    "Bewildering": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "moderate transmutation",
      "cl": "7th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Three times per day, when the wielder of a bewildering weapon makes a successful attack with this weapon, in addition to dealing the weapon's normal damage, the wielder can inflict the confused condition on that enemy for 1d6 rounds. The target can attempt a DC 17 Will saving throw each round to end this effect. Construction",
      "requirements": "Craft Magic Arms and Armor, confusion ;"
    },
    "Blood-Hunting": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A blood-hunting weapon excels against enemies with the bloodline class feature. Against a designated foe, the weapon's enhancement bonus is 2 better than its actual bonus. It also deals an additional 2d6 points of damage against such foes. When combined with abilities like bane or spirit-hunting , the enhancement bonus increases granted by these abilities don't stack, but an extra 1d6 points of damage are added to the additional damage for each special ability beyond the first. (For example, a bane blood-hunting weapon would deal 3d6 additional points of damage, and a bane blood-hunting spirit-hunting weapon would deal 4d6 additional points of damage.) To randomly determine a weapon's designated foe, roll on the following table. Other designated foes are possible, but most of these weapons are tuned against creatures with the following bloodlines. d% Designated Foe   01–05 Aberrant   06–15 Abyssal   16–30 Arcane   31–35 Celestial   36–40 Destined   41–50 Draconic   51–60 Elemental   61–70 Fey   71–80 Infernal   81–90 Undead   91–100 Other Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Bloodsong": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "moderate transmutation",
      "cl": "6th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on slashing or piercing melee weapons. While the wielder benefits from a raging song performance (whether her own or from an ally), this weapon gains the keen weapon special ability. If the wearer confirms a critical hit while under the effects of a raging song, she gains 1d10 temporary hit points that last until they're reduced to 0 or the raging song ends, whichever comes first. If the weapon's critical multiplier is ×3, add 2d10 temporary hit points instead; if the multiplier is ×4, add 3d10 temporary hit points instead. While its powers are active, the weapon vibrates and makes a barely audible hum that rises to a shriek of triumph when it confirms a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, keen edge , creator must have the raging song class feature;"
    },
    "Brawling": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This weapon special ability can be applied only to brass knuckles, a cestus, a sap, or a light bludgeoning weapon. The wielder of this weapon gains an enhancement bonus on combat maneuver checks equal to the enhancement bonus of the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, Improved Trip, guidance ;"
    },
    "Breaking": {
      "source": "Dungeoneer's Handbook pg. 28",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a breaking weapon deals an extra 2d6 points of damage against inanimate objects and crystalline creatures on a successful hit and ignores the hardness of objects with a hardness of 5 or lower. When used against a crystalline creature, the damage from this effect does not stack with bane or similar weapon special abilities. This effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, break or shatter ;"
    },
    "Called": {
      "source": "Ultimate Equipment pg. 137",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A called weapon can be teleported to the wielder's hand as a swift action that does not provoke attacks of opportunity, even if the weapon is in the possession of another creature. This ability has a maximum range of 100 feet, and effects that block teleportation prevent the return of a called weapon. A called weapon must be in a creature's possession for at least 24 hours for this ability to function. Construction",
      "requirements": "Craft Magic Arms and Armor, teleport ;"
    },
    "Catalytic": {
      "source": "Monster Codex pg. 177",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can be placed only on a corrosive or corrosive burst weapon ( Pathfinder RPG Ultimate Equipment 138). When the wielder of a catalytic weapon hits a creature, the weapon triggers a devastating chemical reaction that burns the struck creature. The creature struck must succeed at a DC 15 Fortitude save, or take 1d6 points of acid damage at the start of its turn for 1d4 rounds. Successive hits with the catalytic weapon increase the duration but don't add to the damage. The creature can attempt to neutralize the reaction as a full-round action as if it were on fire (including bonuses for dropping and rolling on the ground or jumping into water). Anyone who hits a creature subject to this chemical reaction with a natural weapon or unarmed strike takes 1d6 points of acid damage. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Compassionate": {
      "source": "Champions of Purity pg. 30",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A compassionate weapon has the power to save a foe from\r the brink of death. When a successful hit from a compassionate\r weapon would bring a creature to –1 or fewer hit points,\r that creature is automatically stabilized. This ability can be\r suppressed at will as a free action. Construction",
      "requirements": "Craft Magic Arms and Armor, stabilize ;"
    },
    "Conductive": {
      "source": "Ultimate Equipment pg. 137 , Advanced Player's Guide pg. 286",
      "aura": "moderate necromancy",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A conductive weapon is able to channel the energy of a spelllike or supernatural ability that relies on a melee or ranged touch attack to hit its target (such as from a cleric's domain granted power, sorcerer's bloodline power, oracle's mystery revelation, or wizard's arcane school power). When the wielder makes a successful attack of the appropriate type, he may choose to expend two uses of his magical ability to channel it through the weapon to the struck opponent, which suffers the effects of both the weapon attack and the special ability. (If the wielder has unlimited uses of a special ability, she may channel through the weapon every round.) For example, a paladin who strikes an undead opponent with her conductive greatsword can expend two uses of her lay on hands ability (a supernatural melee touch attack) to deal both greatsword damage and damage from one use of lay on hands. A given character can use this weapon special ability only once per round (even if she has several conductive weapons), and the power works only with magical abilities of the same type as the weapon (melee or ranged). Construction",
      "requirements": "Craft Magic Arms and Armor, spectral hand ;"
    },
    "Confounding": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When the wielder confirms a critical hit with a confounding weapon, she can spend 1 panache point to attempt a combat maneuver to disarm, reposition, sunder, or trip the target as an immediate action, gaining an enhancement bonus on the combat maneuver check equal to the enhancement bonus of the confounding weapon. This combat maneuver does not provoke an attack of opportunity. The wielder can't use panache gained by confirming the critical hit to activate this ability. Construction",
      "requirements": "Craft Magic Arms and Armor, eagle's splendor ;"
    },
    "Corrosive": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a corrosive weapon becomes slick with acid that deals an extra 1d6 points of acid damage on a successful hit. The acid does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Countering": {
      "source": "Ultimate Equipment pg. 138",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A countering weapon gives its wielder a +2 bonus to his combat maneuver defense against combat maneuvers made to disarm or sunder this weapon. If the attempt fails, the wielder can immediately attempt the same maneuver against the opponent without provoking attacks of opportunity. The wielder never risks dropping his weapon with a failed disarm combat maneuver when counterattacking in this manner. This ability can be used even if the attacker is not within the wielder's reach. Countering can only be placed on melee weapons. Construction",
      "requirements": "Combat Reflexes, Craft Magic Arms and Armor, cat's grace ;"
    },
    "Courageous": {
      "source": "Ultimate Equipment pg. 138",
      "aura": "faint enchantment",
      "cl": "3rd",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be added to a melee weapon. A courageous weapon fortifies the wielder's courage and morale in battle. The wielder gains a morale bonus on saving throws against fear equal to the weapon's enhancement bonus. In addition, any morale bonus on saving throws against fear the wielder gains from any other source is increased by half the weapon's enhancement bonus (minimum 1). Construction",
      "requirements": "Craft Magic Arms and Armor, heroism , remove fear ;"
    },
    "Cruel": {
      "source": "Ultimate Equipment pg. 138 , Advanced Race Guide pg. 124",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When the wielder strikes a creature that is frightened, shaken, or panicked with a cruel weapon, that creature becomes sickened for 1 round. When the wielder uses the weapon to knock unconscious or kill a creature, he gains 5 temporary hit points that last for 10 minutes. Construction",
      "requirements": "Craft Magic Arms and Armor, cause fear , death knell ;"
    },
    "Cunning": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate divination",
      "cl": "6th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability allows a weapon to find chinks in a foe's defenses using the wielder's knowledge of the target. Whenever the weapon's attack is a critical threat, the wielder gains a +4 bonus on the confirmation roll if she has 5 or more ranks in a Knowledge skill that would be used to identify the creature's type, or a +6 bonus instead if she has 15 or more ranks. Construction",
      "requirements": "Craft Magic Arms and Armor, true strike ;"
    },
    "Dazzling Radiance": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "moderate illusion",
      "cl": "7th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special weapon ability can be placed on only melee weapons. When a character wielding a dazzling radiance weapon uses the Dazzling Display feat, the weapon flashes in a burst of bright color. All creatures within 15 feet of the wielder who can see the display must attempt a DC 17 Fortitude save. Those who fail are blinded for 2 rounds and dazzled for an additional 1d4 rounds; those who succeed are instead dazzled for 1d4 rounds. Construction",
      "requirements": "Craft Magic Arms and Armor, color spray ;"
    },
    "Deadly": {
      "source": "Ultimate Equipment pg. 139 , Advanced Race Guide pg. 124",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons that normally deal nonlethal damage, such as whips and saps. All damage a deadly weapon deals is normal (lethal) damage. A whip (or similar weapon that is not normally able to damage creatures with armor or natural armor bonuses) with this special ability deals damage even to creatures with armor or natural armor. On command, the weapon suppresses this ability until the wielder commands it to resume. Construction",
      "requirements": "Craft Magic Arms and Armor, inflict light wounds ;"
    },
    "Debilitating": {
      "source": "Spymaster's Handbook pg. 30",
      "aura": "moderate necromancy",
      "cl": "7th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A debilitating weapon has wicked ridges and gleams maliciously in any amount of light. Whenever a debilitating weapon is used to attack an opponent that is denied its Dexterity bonus to AC and hits, that opponent takes a –1 penalty on attack rolls or to its AC for 1 round (wielder's choice). Any creature that is immune to sneak attacks is immune to this penalty, and any item or ability that protects a creature from critical hits also protects a creature from the penalties imposed by a debilitating weapon. Multiple hits from multiple debilitating weapons in the same round do not increase the penalty or its duration. If the wielder has the debilitating injury ( Pathfinder RPG Pathfinder Unchained 22 ) class ability, this special ability increases the penalty applied by the bewildered or disoriented effects by 1. Construction",
      "requirements": "Craft Magic Arms and Armor, bestow curse , creator must have 5 ranks in Heal\r\n;"
    },
    "Deceptive": {
      "source": "Pathfinder Society Primer pg. 14",
      "aura": "moderate illusion",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A deceptive weapon's shape blurs and appears to bend\r unpredictably. When the weapon is in hand, the wielder gains a\r bonus on Bluff checks to feint equal to the enhancement bonus\r of the weapon. In addition, when the wielder successfully\r confirms a critical hit with a deceptive weapon against an\r opponent, she can attempt to feint against that opponent as an\r immediate action. Construction",
      "requirements": "Craft Magic Arms and Armor, dazzling blade RG ;"
    },
    "Defending": {
      "source": "Ultimate Equipment pg. 139 , PRPG Core Rulebook pg. 469",
      "aura": "moderate abjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A defending weapon allows the wielder to transfer some or all of the weapon's enhancement bonus to his AC as a bonus that stacks with all others. As a free action, the wielder chooses how to allocate the weapon's enhancement bonus at the start of his turn before using the weapon, and the bonus to AC lasts until his next turn. This ability can only be placed on melee weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, shield or shield of faith ;"
    },
    "Disjoining": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate necromancy",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " These weapons were first created by deities and given to mortals so that they could combat mythic foes. When the wielder confirms a critical hit against a mythic creature with a disjoining weapon, the target loses the ability to expend its mythic power for 1d4 rounds. A mythic creature wielding a disjoining weapon loses the ability to expend uses of mythic power for as long as he wields the weapon. Only melee weapons can have this ability. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, mythic severance ;"
    },
    "Dispelling": {
      "source": "Ultimate Equipment pg. 140",
      "aura": "strong abjuration",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A dispelling weapon functions like a spell storing weapon, but it may only store dispel magic ; however, the caster level check to dispel gains an additional bonus equal to the weapon's enhancement bonus. This bonus also applies to a magus's dispelling strike arcana or a barbarian's spell sunder or sunder enchantment combat maneuver check. Construction",
      "requirements": "Craft Magic Arms and Armor, dispel magic , creator must be a caster of at least 10th level;"
    },
    "Distracting": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Weapons with this special ability cause foes struck by them to have difficulty controlling their magic. Any time a creature that has been struck by a distracting weapon would have to succeed at a concentration check to complete a spell or use a special ability or item, the DC of that check increases by 5. This distraction lasts for 1 minute. Once a distracting weapon affects a creature in this way, that creature can't be affected by a distracting effect for 24 hours, though it can be affected by a greater distracting effect. Construction",
      "requirements": "Craft Magic Arms and Armor, qualm UC ;"
    },
    "Drowscourge": {
      "source": "Faction Guide pg. 59",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Invented by the Lantern Bearers, this enhancement can be added to a magic weapon with at least a +1 bonus. Against driders and creatures with the drow subtype, the weapon's enhancement bonus is +1 better. The bearer is able to detect drow once per day (similar to detect animals or plants ) and gain darkvision (as the spell) once per day. Construction",
      "requirements": "Craft Magic Arms and Armor, darkvision , detect evil , summon monster I ;"
    },
    "Dueling (PSFG)": {
      "source": "Pathfinder Society Field Guide pg. 50",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A dueling weapon bears magical enhancements that makes it particularly effective at performing certain combat maneuvers. When a dueling weapon is used to perform a combat maneuver that utilizes the weapon only (see below), it grants a luck bonus equal to twice its enhancement bonus on the CMB check made to carry out the maneuver. The dueling weapon also grants this same luck bonus to the wielder's CMD score against these types of combat maneuvers. These combat maneuvers include disarm and trip maneuvers, but not bull rush, grapple, or overrun maneuvers. If you're using the additional combat maneuvers in the Advanced Player's Guide , this also includes any dirty trick maneuvers that utilize the weapon, as well as reposition combat maneuvers, but not drag or steal combat maneuvers. Note that this luck bonus stacks with the weapon's enhancement bonus, which in and of itself adds to CMB checks normally. Construction",
      "requirements": "Craft Magic Arms and Armor, cat's grace ;"
    },
    "Fate-Stealing": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. When a fate-stealing weapon strikes a creature that possesses either grit or panache, the wielder can steal 1 grit point or panache point as a swift action. When the wielder steals a grit or panache point, she can regain 1 grit point or 1 panache point (if the wielder has any). The wielder can use a foe's grit to restore her own panache, or use a foe's panache to restore her own grit. If the wielder attempts to use this ability against a foe that isn't a grit or panache user, or that currently has no points of grit or panache remaining, the wielder doesn't expend an action, and the attempt fails. Construction",
      "requirements": "Craft Magic Arms and Armor, vampiric touch ;"
    },
    "Fervent": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A fervent weapon thrums with the divine power of a specific\r deity or set of deities. If the wielder is an adherent of the deity\r or deities, she gains several benefits. First, the wielder gains a\r +4 insight bonus on Bluff, Disguise, and Sleight of Hand checks\r to conceal the weapon from members of other religions. On a\r successful hit against a flat-footed target of a different religion,\r the target must succeed at DC 13 Will save or be shaken for 1\r minute. Finally, the wielder receives a +2 bonus to confirm critical\r hits against members of other religions. The creator of a fervent weapon must be within one step\r of the religion to be attuned to the weapon, along either the\r lawful/chaotic axis or the good/evil axis. The target religion must\r be determined at the weapon's creation and cannot be altered. Construction",
      "requirements": "Craft Magic Arms and Armor, align weapon ;"
    },
    "Flamboyant": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on one-handed or light piercing melee weapons. A flamboyant weapon has its own magical reservoir of panache that its wielder can spend to use her deeds. Usually this panache is stored within a jewel or other adornment. This reservoir holds 1 panache point, which is refreshed at the start of each day. Whether or not the wielder of a flamboyant weapon has any deeds, she can always spend 1 panache point from the flamboyant weapon to reroll an attack made with it that missed due to rolling a natural 1. When the wielder does so, she must take the second result, even if it also misses. Construction",
      "requirements": "Craft Magic Arms and Armor, heroism , creator must be a panache user;"
    },
    "Flaming": {
      "source": "Ultimate Equipment pg. 141 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a flaming weapon is sheathed in fire that deals an extra 1d6 points of fire damage on a successful hit. The fire does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor and fireball , flame blade , or flame strike ;"
    },
    "Fortuitous": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. A fortuitous weapon grants the wielder more attacks of opportunity. Once per round, when the wielder of a fortuitous weapon hits with an attack of opportunity, he can make a second attack of opportunity with this weapon against that foe at a –5 penalty. Construction",
      "requirements": "Craft Magic Arms and Armor, haste ;"
    },
    "Frost": {
      "source": "Ultimate Equipment pg. 142 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a frost weapon is sheathed in a terrible, icy cold that deals an extra 1d6 points of cold damage on a successful hit. The cold does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, chill metal or ice storm ;"
    },
    "Furious": {
      "source": "Ultimate Equipment pg. 142 , Advanced Player's Guide pg. 288",
      "aura": "moderate enchantment",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A furious weapon serves as a focus for its wielder's anger. When the wielder is raging or under the effect of a rage spell, the weapon's enhancement bonus is +2 better than normal. If the wielder has a rage power that gives a skill bonus while raging (such as raging climber, raging leaper, or raging swimmer), the wielder gains an enhancement bonus to that skill whenever the weapon is wielded or held in her hand, even when she is not raging. This bonus is equal to the enhancement bonus of the weapon (and also includes the +2 if the wielder is raging). Construction",
      "requirements": "Craft Magic Arms and Armor, rage ;"
    },
    "Ghost Touch": {
      "source": "Ultimate Equipment pg. 142 , PRPG Core Rulebook pg. 469",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A ghost touch weapon deals damage normally against incorporeal creatures, regardless of its bonus. An incorporeal creature's 50% reduction in damage from corporeal sources does not apply to attacks made against it with ghost touch weapons. The weapon can be picked up and moved by an incorporeal creature at any time. A manifesting ghost can wield the weapon against corporeal foes. Essentially, a ghost touch weapon counts as both corporeal or incorporeal. This special ability can only be placed on melee weapons and ammunition. Construction",
      "requirements": "Craft Magic Arms and Armor, plane shift ;"
    },
    "Grayflame": {
      "source": "Ultimate Equipment pg. 142 , Advanced Player's Guide pg. 288",
      "aura": "moderate transmutation",
      "cl": "6th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This weapon responds to channeled positive and negative energy. When the wielder spends a swift action to channel energy through the weapon, it ignites with a strange gray flame that sheds light as a torch, increases the weapon's enhancement bonus by +1, and deals +1d6 damage (as the divine power from flame strike ) to creatures struck by the weapon. This flame lasts for 1 round for every d6 of damage or healing the channeling normally provides. When charged with positive energy, the flame is a silvery gray, good creatures are immune to the weapon's extra damage, and the weapon counts as a good and silver weapon for the purpose of bypassing damage reduction. When charged with negative energy, the flame is an ashen gray, evil creatures are immune to the weapon's extra damage, and the weapon counts as an evil and cold iron weapon for the purpose of bypassing damage reduction. This special ability can only be placed on melee weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, Channel Smite, align weapon ;"
    },
    "Grounding": {
      "source": "Ultimate Equipment pg. 143",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A grounding weapon can safely touch electrically charged surfaces without harm to its wielder. When used against a creature of the air subtype, it deals an extra 1d6 points of damage. The wielder of a grounding weapon receives a +2 competence bonus on saving throws against air- and electricity-based effects, and the weapon itself is immune to electricity damage. Construction",
      "requirements": "Craft Magic Arms and Armor, shocking grasp ;"
    },
    "Growing": {
      "source": "Melee Tactics Toolbox pg. 26",
      "aura": "moderate transmutation",
      "cl": "6th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. Once per day, a growing weapon is able to grow by one size category, dealing damage as appropriate for its new size and allowing its wielder to affect creatures one size larger than normal with combat maneuvers limited by size. The wielder is able to use the weapon normally without penalty despite its increased size. The weapon remains at its increased size for 10 minutes. Construction",
      "requirements": "Craft Magic Arms and Armor, enlarge person ;"
    },
    "Guardian": {
      "source": "Ultimate Equipment pg. 143 , Pathfinder Society Field Guide pg. 51",
      "aura": "moderate abjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A guardian weapon allows the wielder to transfer some or all of the weapon's enhancement bonus to his saving throws as a bonus that stacks with all others. As a free action, the wielder chooses how to allocate the weapon's enhancement bonus at the start of his turn before using the weapon. The bonus on saving throws lasts until his next turn. Only the weapon's own enhancement bonus can be sacrificed, not any enhancement bonus provided by other effects such as a greater magic weapon spell. However, the total of such effects is still diminished by the amount allocated to improving saving throws. If a weapon has both the defending and guardian abilities, allocating a single point of enhancement bonus increases either AC or saving throws, but not both. Construction",
      "requirements": "Craft Magic Arms and Armor, resistance ;"
    },
    "Guided": {
      "source": "Pathfinder #10: A History of Ashes pg. 22",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A weapon with the guided property allows its wielder to use his instinct when striking blows with it. Attacks from a guided weapon generally don't strike hard, but they strike at precisely the right moment to maximize damage if in the hands of a particularly wise wielder. A character who attacks with a guided weapon modifies his attack rolls and weapon damage rolls with his Wisdom modifier, not his Strength modifier. This modifier to damage is not adjusted for two-handed weapons or off-hand weaponsit always remains equal to the wielder's Wisdom modifier. A guided weapon may be wielded as a normal weapon, using Strength to modify attack and damage rolls, but this goes against the weapon's nature and imparts a –2 penalty on all attack rolls made in this manner. Construction",
      "requirements": "Craft Magic Arms and Armor, spiritual weapon ;"
    },
    "Heartseeker": {
      "source": "Ultimate Equipment pg. 143",
      "aura": "moderate necromancy",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A heartseeker weapon is drawn unerringly toward beating hearts. A heartseeker weapon ignores the miss chance for concealment against most living targets, though the attack must still target the proper square. This special ability does not apply against aberrations, oozes, plants, outsiders with the elemental subtype, or any creature specifically noted to lack a heart. Construction",
      "requirements": "Craft Magic Arms and Armor, death knell ;"
    },
    "Huntsman": {
      "source": "Ultimate Equipment pg. 143 , Advanced Player's Guide pg. 288",
      "aura": "moderate divination",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A huntsman weapon helps its wielder locate and capture quarry. When the weapon is held in hand, the wielder gains the weapon's enhancement bonus on Survival checks made to track any creature the weapon has damaged in the past day. It also deals +1d6 points of damage to creatures the wielder has tracked with Survival in the past day. Construction",
      "requirements": "Craft Magic Arms and Armor, detect animals or plants ;"
    },
    "Injecting": {
      "source": "Agents of Evil pg. 26",
      "aura": "moderate conjuration",
      "cl": "5th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Injecting weapons feature bulbous pommels and small grooves along their blades, allowing them to store and deliver poison. An injecting weapon can hold up to 3 doses of injury poison. As a swift action, the wielder of an injecting weapon can coat the weapon with 1 dose of one of the inserted poisons. Only bladed weapons can be made into injecting weapons. Adding a dose of poison to the reservoir is a full-round action. Construction",
      "requirements": "Craft Magic Arms and Armor, delay poison ;"
    },
    "Inspired": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on simple weapons, hand crossbows, rapiers, shortbows, short swords, and sword canes UE . In the hands of an investigator, an inspired weapon reduces the cost of using inspiration on attack rolls made with the weapon. The weapon's wielder needs to expend only one use of inspiration to augment his attack rolls with this weapon, as with the combat inspiration investigator talent. If the wielder already has the combat inspiration talent, the wielder must still expend one use of inspiration, but in addition to adding the result of the inspiration roll to the attack roll, the investigator adds twice the result of the inspiration roll to the weapon's damage roll. Construction",
      "requirements": "Craft Magic Arms and Armor, good hope ;"
    },
    "Jurist": {
      "source": "Ultimate Equipment pg. 144 , Advanced Player's Guide pg. 288",
      "aura": "faint transmutation",
      "cl": "4th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When an inquisitor wielder uses her judgment class ability while wielding a jurist weapon, it grants her an enhancement bonus on her Perception checks and to CMD. The bonus is +1 on the first round of her judgment, and increases by +1 each round, to a maximum of +3 on the third and following rounds. Construction",
      "requirements": "Craft Magic Arms and Armor, owl's wisdom ;"
    },
    "Keen": {
      "source": "Ultimate Equipment pg. 144 , PRPG Core Rulebook pg. 469",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability doubles the threat range of a weapon. Only piercing or slashing melee weapons can be keen . If you roll this special ability randomly for an inappropriate weapon, reroll. This benefit doesn't stack with any other effects that expand the threat range of a weapon (such as the keen edge spell or the Improved Critical feat). Construction",
      "requirements": "Craft Magic Arms and Armor, keen edge ;"
    },
    "Ki Focus": {
      "source": "Ultimate Equipment pg. 144 , PRPG Core Rulebook pg. 469",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. The magic weapon serves as a channel for the wielder's ki , allowing her to use her special ki attacks through the weapon as if they were unarmed attacks. These attacks include the monk's ki strike, quivering palm, and the Stunning Fist feat (including any condition that the monk can apply using this feat). Construction",
      "requirements": "Craft Magic Arms and Armor, creator must be a monk;"
    },
    "Kinslayer": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A kinslayer weapon is enhanced with enmity against all those\r born into the wielder's familial line. Against creatures related to\r the wielder, this weapon's enhancement bonus is +2 better than\r its actual bonus. It also deals an extra 2d6 points of damage\r against such creatures. This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, detect relations ;"
    },
    "Leveraging": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "faint transmutation",
      "cl": "6th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. The wielder of a leveraging weapon gains a bonus equal to the weapon's enhancement bonus to her Combat Maneuver Defense against bull rush, drag APG , reposition APG , and trip combat maneuvers. The leveraging weapon's enhancement bonus is doubled when applied to combat maneuver checks to attempt bull rush, drag, reposition, and trip combat maneuvers. Construction",
      "requirements": "Craft Magic Arms and Armor, enlarge person ;"
    },
    "Limning": {
      "source": "Ultimate Equipment pg. 145",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When a limning weapon is wielded, a pale glow outlines it. On a successful strike against a creature affected by a means of magical concealment, the weapon outlines the creature in faerie fire (as the spell) for 1 round. Magical means of concealment include blur , displacement , invisibility , and similar effects, whether from a spell, spell-like ability, or supernatural means, but not those provided by extraordinary abilities. A limning weapon has no special effect against creatures merely hiding or concealed by nonmagical means, or those hidden by environmental conditions (even magical) such as darkness or fog. Construction",
      "requirements": "Craft Magic Arms and Armor, faerie fire ;"
    },
    "Menacing": {
      "source": "Ultimate Equipment pg. 145 , Advanced Player's Guide pg. 288",
      "aura": "moderate illusion",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A menacing weapon helps allies deal with flanked foes. When the wielder is adjacent to a creature that is being flanked by an ally, the flanking bonus on attack rolls for all flanking allies increases by +2. This ability works even if the wielder is not one of the characters flanking the creature. Construction",
      "requirements": "Craft Magic Arms and Armor, phantasmal killer ;"
    },
    "Merciful": {
      "source": "Ultimate Equipment pg. 145 , PRPG Core Rulebook pg. 469",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A merciful weapon deals an extra 1d6 points of damage, but all damage it deals is nonlethal damage. On command, the weapon suppresses this ability until told to resume it (allowing it to deal lethal damage, but without any bonus damage from this ability). Construction",
      "requirements": "Craft Magic Arms and Armor, cure light wounds ;"
    },
    "Mighty Cleaving": {
      "source": "Ultimate Equipment pg. 145 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A mighty cleaving weapon allows a wielder using the Cleave feat to make one additional attack if the first attack hits, as long as the next foe is adjacent to the first and also within reach. This additional attack cannot be against the first foe. Construction",
      "requirements": "Craft Magic Arms and Armor, divine power ;"
    },
    "Mimetic": {
      "source": "Ultimate Equipment pg. 145",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. Each time the wielder damages a creature using a mimetic weapon, he gains resistance 10 to one energy type that the creature is resistant or immune to for 1 round (if the creature damaged has multiple types of resistance, the wielder chooses one of those resistances to take). This resistance stacks with itself, to a maximum of 30 points of resistance against a given energy type, but not with other sources of energy resistance. The creature's own resistances and immunities are unaffected. Construction",
      "requirements": "Craft Magic Arms and Armor, resist energy ;"
    },
    "Miserable": {
      "source": "Agents of Evil pg. 26",
      "aura": "moderate conjuration",
      "cl": "8th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A miserable weapon cuts through the energy resistance of certain foes. Miserable weapons must be crafted with a designated creature type (just like bane weapons), and each time they deal damage to their designated foes, their magic halves the creatures' natural energy resistances for 1 round. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Mythic Bane": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A mythic bane weapon works exactly like a bane weapon, except it has a higher bonus and deals extra damage against any creature with the mythic subtype. This ability stacks with the bane weapon special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, divine favor ;"
    },
    "Neutralizing": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A neutralizing weapon thrust into up to 1 gallon of nonmagical corrosive liquid transforms it into harmless water. When used against a creature of the earth subtype, it deals an extra 1d6 points of damage. The wielder of a neutralizing weapon receives a +2 competence bonus on saving throws against acid- and earth-based effects, and the weapon itself is immune to acid damage. Construction",
      "requirements": "Craft Magic Arms and Armor, purify food and drink ;"
    },
    "Ominous": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. An ominous weapon trails a shadowy haze behind every stroke, and moans a menacing dirge in battle. An ominous weapon adds its enhancement bonus on Intimidate checks made by the wielder. In addition, when an ominous weapon confirms a critical hit, the target is shaken for 1 minute (DC 13 Will negates); if the weapon's critical multiplier is greater than ×2, this condition lasts 1 additional minute per multiple over ×2. A creature that gains the shaken condition from an ominous weapon cannot gain that condition again from the same weapon for 24 hours. Construction",
      "requirements": "Craft Magic Arms and Armor, doom or scare ;"
    },
    "Patriotic": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A patriotic weapon radiates with the collective power and\r strength of a particular nation of people. If the wielder is a\r member of that nationality, he gains several benefits. First,\r the wielder gains a +4 insight bonus on Bluff, Disguise, and\r Sleight of Hand checks to conceal the weapon from members\r of other nationalities. On a successful hit against a flat-footed\r target of a different nationality, the target must succeed at DC\r 13 Will save or be shaken for 1 minute. Finally, the wielder\r receives a +2 bonus to confirm critical hits against members of\r other nationalities. The nationality affected must be determined at the patriotic weapon's creation and cannot be altered. At the GM's discretion,\r the nationality named may be a specified human ethnicity, such\r as Chelaxian or Shoanti. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Pitfall": {
      "source": "Taldor, Echoes of Glory pg. 27",
      "aura": "moderate transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can only be placed on a melee weapon. A weapon with the pitfall quality gives you a heightened danger sense. When holding a pitfall weapon, apply the weapon's enhancement bonus to your initiative checks, Reflex saves made to avoid traps, and AC against attacks made by traps. For example, a +5 pitfall longsword gives you a +5 bonus to initiative, +5 to Reflex saves made to avoid traps, and a +5 bonus to AC against attacks made by traps. Wielding two weapons with the pitfall weapon quality only grants the bonuses from the better weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, Improved Initiative, cat's grace ;"
    },
    "Planar": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A planar weapon is effective against all types of extradimensional beings, able to pierce their resistance to physical harm. When used to attack outsiders, a planar weapon ignores 5 points of their damage reduction. Construction",
      "requirements": "Craft Magic Arms and Armor, plane shift ;"
    },
    "Quenching": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A quenching weapon thrust into a nonmagical fire of Medium size or smaller extinguishes it. When used against a creature of the fire subtype, it deals an extra 1d6 points of damage. The wielder of a quenching weapon receives a +2 competence bonus on saving throws against fire-based effects, and the weapon itself is immune to fire damage. Construction",
      "requirements": "Craft Magic Arms and Armor, chill metal ;"
    },
    "Rusting": {
      "source": "Magical Marketplace pg. 15",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A weapon with the rusting special ability is so badly tarnished that no amount of cleaning can restore it. Although the weapon constantly sheds flecks of rust and corroded metal, it remains structurally sound. When the wielder confirms a critical hit with a rusting weapon, she can forgo any extra damage to instead deal normal damage to the target and affect the target or the target's armor with the rusting grasp spell. A rusting weapon cannot be used against unattended inanimate objects. A rusting weapon is immune to mundane or magical rust, including the attack of a rust monster. Construction",
      "requirements": "Craft Magic Arms and Armor, rusting grasp ;"
    },
    "Sacred": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "strong transmutation",
      "cl": "16th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A sacred weapon is filled with divine energy, and acts as a holy symbol. When wielded by a creature that can cast divine spells, the weapon automatically displays an image of that creature's holy symbol, often as a glowing rune on the weapon's blade or along its haft. Additionally, if the wielder has the blessings class feature, whenever he channels energy, he can choose one ally or ally's weapon within the area of the channeled energy and bestow upon that creature or weapon the benefits of one of his minor blessings at a cost of one use of that blessing. Construction",
      "requirements": "Craft Magic Arms and Armor, imbue with spell ability ;"
    },
    "Sapping": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "faint enchantment",
      "cl": "5th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed on only weapons that deal nonlethal damage. A sapping weapon deals an additional 2d6 points of nonlethal damage. When the wielder confirms a critical hit with the weapon, the target becomes fatigued for 5 rounds. Construction",
      "requirements": "Craft Magic Arms and Armor, pain strike APG , touch of fatigue ;"
    },
    "Seaborne": {
      "source": "Ultimate Equipment pg. 147",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A seaborne weapon functions easily in watery environments. With the weapon in hand, the wielder gains a bonus on Swim checks equal to twice the weapon's enhancement bonus. In addition, the wielder does not take the normal penalties to attack and damage rolls imposed by being underwater, as if he were subject to the spell freedom of movement Construction",
      "requirements": "Craft Magic Arms and Armor, freedom of movement , touch of the sea ( Advanced Player's Guide );"
    },
    "Shock": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a shock weapon is sheathed in crackling electricity that deals an extra 1d6 points of electricity damage on a successful hit. The electricity does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, call lightning or lightning bolt ;"
    },
    "Skewering": {
      "source": "Advanced Class Origins pg. 28",
      "aura": "faint divination",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on light or one-handed piercing melee weapons. Weapons with this enhancement are particularly devastating in the hands of a swashbuckler. Anytime the weapon threatens a critical hit, the wielder can spend 1 panache point as an immediate action to automatically confirm the critical hit. When the swashbuckler confirms a critical hit in this fashion, she doesn't regain panache for confirming the critical hit, though she can regain panache normally if the attack is a killing blow. Construction",
      "requirements": "Craft Wondrous Item, true strike ;"
    },
    "Slithering": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "moderate transmutation",
      "cl": "11th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon. A slithering weapon can bend and flex when swung at a target, allowing it to fit through narrow gaps and around difficult angles with greater ease and making the weapon difficult to strike. When a slithering weapon is used to attack a creature with cover, the target's cover bonus to Armor Class is halved. In addition, the wielder adds the weapon's enhancement bonus to her CMD against attempts to disarm or sunder her slithering weapon. If the wielder is squeezing in a narrow space, she takes only half the normal penalty on attack rolls with her slithering weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, fluid form APG ;"
    },
    "Smashing": {
      "source": "Melee Tactics Toolbox pg. 27",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee bludgeoning weapons. A smashing weapon deals an additional 2d6 points of damage to inanimate objects, including when it is used to sunder armor and weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, bull's strength ;"
    },
    "Spell Storing": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "strong evocation and varies",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A spell storing weapon allows a spellcaster to store a single targeted spell of up to 3rd level in the weapon. (The spell must have a casting time of 1 standard action.) Anytime the weapon strikes a creature and the creature takes damage from it, the weapon can immediately cast the spell on that creature as a free action if the wielder desires. (This special ability is an exception to the general rule that casting a spell from an item takes at least as long as casting that spell normally.) Once the spell has been cast from the weapon, a spellcaster can cast any other targeted spell of up to 3rd level into it. The weapon magically imparts to the wielder the name of the spell currently stored within it. A randomly rolled spell storing weapon has a 50% chance of having a spell stored in it already. This special ability can only be placed on melee weapons. A spell storing weapon emits a strong aura of the evocation school, plus the aura of the spell currently stored. Construction",
      "requirements": "Craft Magic Arms and Armor, creator must be a caster of at least 12th level;"
    },
    "Spirit-Hunting": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A spirit-hunting weapon excels against enemies with either the mystery or spirit class feature (but has no effect against a shaman who has a temporary bond to the appropriate spirit by way of the wandering spirit class feature or similar effect). Against a designated foe, the weapon's enhancement bonus is 2 better than its actual bonus. It also deals 2d6 additional points of damage against such foes. When combined with abilities like bane or blood-hunting , the enhancement bonus increases granted by these abilities do not stack, but an additional 1d6 points of damage are added to the additional damage for each special ability beyond the first. (For example, a bane spirit-hunting weapon would deal 3d6 additional points of damage, and a bane blood-hunting spirit-hunting weapon would deal 4d6 additional points of damage.) To randomly determine a weapon's designated foe, roll on the following table. Other designated foes are possible, but most of these weapons are tuned against creatures with the following mysteries or spirits. d% Designated Foe   01–10 Battle   11–20 Bones   21–30 Flame   31–40 Heavens   41–50 Life   51–60 Lore   61–70 Nature   71–80 Stone   81–90 Waves   91–00 Wind Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon nature's ally I ;"
    },
    "Sticky": {
      "source": "Melee Tactics Toolbox pg. 27",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on reach weapons, piercing melee weapons, and weapons from the flail fighter weapon training group. When a sticky weapon scores a critical hit against a target, instead of rolling to confirm the critical threat, the wielder can deal normal damage and attempt a steal combat maneuver check against the target of the attack. This combat maneuver doesn't provoke an attack of opportunity, and the wielder gains a +2 bonus on the combat maneuver check. Construction",
      "requirements": "Craft Magic Arms and Armor, Improved Steal, spider climb ;"
    },
    "Summon Bane": {
      "source": "Monster Summoner's Handbook pg. 21",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A summon bane weapon excels against summoned creatures, including those summoned by conjuration (summoning) spells (such as summon monster and summon nature's ally spells), those summoned by conjuration (calling) spells (such as planar ally and planar binding ), and eidolons. Against such summoned creatures, the weapon's enhancement bonus is +2 better than its normal bonus. It also deals an extra 2d6 points of damage against such foes. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster IV or summon nature's ally IV ;"
    },
    "Thawing": {
      "source": "Ultimate Equipment pg. 148",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A thawing weapon thrust into a nonmagical frozen object of Medium size or smaller melts the ice from it. When used against a creature with the cold subtype, it deals an extra 1d6 points of damage. The wielder of a thawing weapon receives a +2 competence bonus on saving throws against ice-based effects, and the weapon itself is immune to cold damage. Construction",
      "requirements": "Craft Magic Arms and Armor, heat metal ;"
    },
    "Throwing": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A melee weapon crafted with this ability gains a range increment of 10 feet and can be thrown by a wielder proficient in its normal use. Construction",
      "requirements": "Craft Magic Arms and Armor, magic stone ;"
    },
    "Thundering": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A thundering weapon creates a cacophonous roar like abilities thunder whenever it strikes a target with a successful critical hit. The sonic energy does not harm the wielder. A thundering weapon deals an extra 1d8 points of sonic damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d8 points of sonic damage instead, and if the multiplier is ×4, add an extra 3d8 points of sonic damage. Subjects dealt critical hits by a thundering weapon must make a successful DC 14 Fortitude save or be deafened permanently. Construction",
      "requirements": "Craft Magic Arms and Armor, blindness/deafness ;"
    },
    "Training": {
      "source": "Inner Sea Intrigue pg. 52",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Popular among those who seek to impersonate skilled warriors, a training weapon grants one combat feat to the wielder as long as the weapon is drawn and in hand. The feat is chosen when this special ability is placed on the weapon. That feat cannot be used as a prerequisite for any other feats and functions for the wielder only if she meets its prerequisites. Once chosen, the feat stored in the weapon cannot be changed. Construction",
      "requirements": "Craft Magic Arms and Armor, magic weapon , creator must have the chosen combat feat and its prerequisites;"
    },
    "Unaligned": {
      "source": "Planar Adventures pg. 48",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Typically forged by aeons or other creatures that eschew commonly held structures of morality, unaligned weapons quell the effects of extreme alignments on the wielder. The wielder counts her Hit Dice as 4 lower than her actual total HD when someone attempts to detect her alignment using detect chaos , detect evil , detect good , detect law , or similar spells or effects. Furthermore, if the wielder is an outsider and is targeted by a spell or effect with an alignment descriptor that deals additional damage to or has an additional effect on outsiders (such as holy smite ), she adds a bonus equal to the unaligned weapon's enhancement bonus on saving throws she attempts against that spell or effect. Finally, the wielder takes no penalties on her Charisma-, Intelligence-, or Wisdom-based checks from a plane's mildly aligned or strongly aligned traits, regardless of her actual alignment. Construction",
      "requirements": "Craft Magic Arms and Armor, undetectable alignment ;"
    },
    "Underwater": {
      "source": "Aquatic Adventures pg. 63",
      "aura": "faint divination",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can be placed only on a melee bludgeoning or slashing weapon. Melee attacks with the weapon don't take the usual –2 penalty for attacking underwater, and they deal full damage. Construction",
      "requirements": "Craft Magic Arms and Armor, freedom of movement ;"
    },
    "Valiant": {
      "source": "Ultimate Equipment pg. 149",
      "aura": "faint divination",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. When a cavalier wielding a valiant weapon targets a foe with his challenge ability, the valiant weapon deals an additional 1d6 points of damage against that foe. The wielder receives a +2 bonus on combat maneuver checks made to disarm or sunder a challenged foe's weapon as well as a +4 bonus to his CMD against disarm and sunder attacks from that foe. Construction",
      "requirements": "Craft Magic Arms and Armor, true strike ;"
    },
    "Vampiric": {
      "source": "Horror Adventures pg. 214 , Weapon Master's Handbook pg. 30",
      "aura": "faint necromancy",
      "cl": "5th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on piercing or slashing melee weapons. The first time each round that the wielder hits a living target with a vampiric weapon, the weapon restores an amount of hit points to the wielder equal to 1/2 the damage dealt to the target, to a maximum equal to the wielder's number of Hit Dice. If the damage was more than enough to kill the target, any excess damage doesn't count toward the amount healed. A creature can regain no more than 2 hit points per Hit Die from a vampiric weapon each day. A new owner gains no healing from a vampiric weapon until she owns it for 24 consecutive hours, and a wielder can be attuned to only one vampiric or greater vampiric weapon at a time. Finally, a wielder healed by a vampiric weapon can't exceed her maximum hit point total, though excess healing also doesn't count toward the daily limit of hit points she can regain. Both living and undead creatures can benefit from the healing. A vampiric weapon automatically converts the stolen energy into positive or negative energy, as appropriate for the wielder. Construction",
      "requirements": "Craft Magic Arms and Armor, cure moderate wounds , inflict moderate wounds , vampiric touch ;"
    },
    "Vicious": {
      "source": "Ultimate Equipment pg. 149 , PRPG Core Rulebook pg. 469",
      "aura": "moderate necromancy",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. When a vicious weapon strikes an opponent, it creates a flash of disruptive energy that resonates between the opponent and the wielder. This energy deals an extra 2d6 points of damage to the opponent and 1d6 points of damage to the wielder. Construction",
      "requirements": "Craft Magic Arms and Armor, enervation ;"
    },
    "Virulent": {
      "source": "Monster Codex pg. 177",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A virulent weapon magically intensifies any poison it delivers. The saving throw DC of any poison applied to either a virulent weapon or any ammunition fired from it increases by a number equal to the weapon's enhancement bonus. The duration of the poison increases by a number of rounds equal to the virulent weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, pernicious poison UM ;"
    },
    "Prehensile": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "none;",
      "price": "1,250",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a whip. A prehensile whip can, as a swift action, be attached to an object as if it were a grappling hook. The whip can then be used to climb surfaces or to swing across a room or any open area. By spending 1 panache point as a free action, a swashbuckler increases a prehensile whip's reach to 20 feet for a single attack, and can use the whip with his precise strike ability even though it's not a light or onehanded piercing weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, rope trick ;"
    },
    "Concealed, Lesser": {
      "source": "Spymaster's Handbook pg. 30",
      "aura": "faint transmutation",
      "cl": "5th",
      "price": "1,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed on only light or one-handed melee weapons. A lesser concealed weapon functions as a concealed weapon (above), but can transform into only a mundane object of the same size and general shape of the weapon (determined at the weapon's creation). A melee weapon cannot have both this special ability and the concealed special ability Construction",
      "requirements": "Craft Magic Arms and Armor, major creation ;"
    },
    "Impervious": {
      "source": "Ultimate Equipment pg. 144",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "+1,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " An impervious weapon is warded from damage and decay. A metallic weapon cannot rust and a wooden weapon cannot rot or warp, even by magical or supernatural means. An impervious weapon gains double the normal bonus to its hardness and hit points for each point of its enhancement bonus. The break DC for an impervious weapon and the wielder's combat maneuver defense against sunder maneuvers against the impervious weapon each gain a bonus equal to twice the weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, fabricate , make whole ;"
    },
    "Exclusionary": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "faint necromancy",
      "cl": "1st",
      "slot": "none;",
      "price": "1,875",
      "enhancement": 2,
      "weight": " ",
      "Description": " When the wielder of an exclusionary weapon damages a creature with it, she can choose to not affect that creature with any channel energy ability she uses within the next minute. The maximum number of targets the wielder can exclude at one time is equal to her Wisdom bonus plus the enhancement bonus of the exclusionary weapon. If the wielder of an exclusionary weapon strikes a creature that would cause her to go over this limit, she loses the ability to exclude the target she has been excluding for the longest amount of time. Construction",
      "requirements": "Craft Magic Arms and Armor, Selective Channeling, sanctuary ;"
    },
    "Glamered": {
      "source": "Ultimate Equipment pg. 142",
      "aura": "moderate illusion",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "+2,000",
      "enhancement": 2,
      "weight": " ",
      "Description": " A glamered weapon can be commanded to change its shape and appearance to assume the form of another object of similar size. The weapon retains all its properties (including weight) when so disguised but does not radiate magic. Only true seeing or similar magic reveals the true nature of a glamered weapon while it is disguised. After a glamered weapon is used to attack, this special ability is suppressed for 1 minute. Construction",
      "requirements": "Craft Magic Arms and Armor, disguise self , magic aura ;"
    },
    "Resizing": {
      "source": "Giant Hunter's Handbook pg. 33",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "none;",
      "price": "2,000",
      "enhancement": 2,
      "weight": " ",
      "Description": " A resizing weapon instantly shrinks or grows to suit the size of any creature that picks it up unless it is currently wielded by another creature. It reverts to its original size 1 round after it leaves its wielder's possession. Construction",
      "requirements": "Craft Magic Arms and Armor, resize item ;"
    },
    "Sacrosanct": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Taking the form of a deity's favored weapon, a sacrosanct weapon serves as both a martial implement and the corresponding deity's holy (or unholy) symbol. Once per day when the wielder uses the sacrosanct weapon to channel energy, she can increase the radius of the channel energy to 40 feet. They wielder must be able to channel positive or negative energy to use this ability. Alternatively, the wielder can expend one use of mythic power to use this ability instead of expending its daily use. When using mythic power to activate this ability, it can be done at will. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, the crafter must be able to channel energy;"
    },
    "Sneaky": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "moderate necromancy",
      "cl": "7th",
      "slot": "none;",
      "price": "2,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon. Once per day as a free action, the wielder of a sneaky weapon can designate a single foe within his melee reach as his prey. If the wielder has the sneak attack class feature, he adds his sneak attack damage to the next attack he makes against his prey, even if the wielder is not flanking and the target is not denied its Dexterity bonus to AC, as long as that attack is made before the end of the wielder's next turn. If the wielder is a rogue or slayer with the hunter's surprise talent, he can use that talent one additional time per day. Construction",
      "requirements": "Craft Magic Arms and Armor, doom ;"
    },
    "Liberating (WMH)": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate abjuration",
      "cl": "10th",
      "price": "+3,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " As a standard action, the wielder of a liberating weapon can free herself or an adjacent creature from spells and abilities that inhibit movement, such as paralysis, solid fog , slow , and web . The wielder attempts a combat maneuver check while holding the weapon (DC = 15 + either the spell's caster level or the creature's HD); success dispels the effect. Only a single attempt can be made against each spell or effect. Construction",
      "requirements": "Craft Magic Arms and Armor, dispel magic , freedom of movement ;"
    },
    "Concealed": {
      "source": "Spymaster's Handbook pg. 30",
      "aura": "moderate transmutation",
      "cl": "10th",
      "price": "3,750",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a light or one-handed melee weapon. A concealed weapon alters its shape at its wielder's command, transforming into a non-weapon object of the wielder's choice. This object must be a mundane item whose size and shape is similar to that of the concealed weapon or smaller, and it must be sized for a creature of the same size as the weapon's intended wielder. For example, a Medium short sword can transform into a quill sized for a Medium creature, but it cannot transform into a saw sized for a Small creature. A concealed weapon cannot transform into a consumable item, and if its alternate form is that of a container, any contents stored within the concealed weapon's alternate form are ejected into the wielder's space when the weapon transforms back to its original form. While transformed, a concealed weapon doesn't register as magical, as per magic aura , though it retains the weight, hit points, and any hardness of its original form. A concealed weapon cannot assume the form of an object made from a special material (such as adamantine) unless it is already made of that material. For instance, a wooden club cannot transform into a mithral frying pan, but a mithral dagger can. Transforming a concealed weapon into a mundane form requires a standard action, while returning it to its weapon form requires a move action. This transformation lasts until it is changed back into its original form or has been left unattended for 8 hours, whichever comes sooner. Construction",
      "requirements": "Craft Magic Arms and Armor, major creation ;"
    },
    "Advancing": {
      "source": "Ultimate Equipment pg. 134",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This ability can only be placed on melee weapons. Once per round, when the wielder damages a creature in melee with an advancing weapon, she can take a 5-foot step as a swift action after the attack but before the end of her turn. This movement does not count against her ability to move or take a 5-foot step earlier or later in the round, though using this ability imposes a –2 penalty on all attack rolls until the start of her next turn. This ability may not be used in conjunction with any other ability or effect that allows moving as part of an attack. Construction",
      "requirements": "Craft Magic Arms and Armor, feather step ( Advanced Player's Guide );"
    },
    "Anarchic": {
      "source": "Ultimate Equipment pg. 135 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An anarchic weapon is infused with the power of chaos. It makes the weapon chaotically aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of lawful alignment. It bestows one permanent negative level ( Core Rulebook 562) on any lawful creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, chaos hammer , creator must be chaotic;"
    },
    "Anchoring": {
      "source": "Ultimate Equipment pg. 135",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be added to a melee weapon or a thrown weapon. An anchoring weapon pins a target in place and prevents it from moving. As a swift action, the weapon can be fixed in place in a point in space, functioning as an immovable rod . This ability can also be used when the wielder hits a creature with a melee attack using an anchoring weapon. This anchors the target to the weapon, preventing it from moving away from the weapon. The target is not entangled or paralyzed; it simply cannot move from its location without first destroying the weapon or making a successful DC 30 Strength check as a full-round action to move with the weapon up to 10 feet. An anchoring weapon remains motionless and cannot be used to attack while it is anchoring a creature. An anchoring weapon has no effect on amorphous creatures, including elementals, oozes, and creatures in gaseous or liquid form. It also cannot anchor incorporeal creatures unless the weapon also has the ghost touch special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, levitate ;"
    },
    "Axiomatic": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An axiomatic weapon is infused with lawful power. It makes the weapon law-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against chaotic creatures. It bestows one permanent negative level ( Core Rulebook 562) on any chaotic creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, order's wrath , creator must be lawful;"
    },
    "Burning": {
      "source": "Monster Codex pg. 57",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A burning weapon causes an unattended flammable object to ignite when struck (Fortitude DC 13 negates for magic items), dealing 1d6+1 points of fire damage to the object each round after it's ignited. An item made mostly or entirely out of wood is even more susceptible to this effect, taking 2d6+2 points of fire damage. This effect lasts for 1d4 rounds. A creature that ends its turn in the same space as a burning object takes 1d6+1 points of fire damage. Up to three times per day, the bearer of a burning weapon can, on command, cause a single object that has been ignited by the weapon to burn even brighter, increasing the duration of its burning effect by 1d4+1 rounds and causing the fire to expand in a burst that extends 5 feet from the object. This burst of fire deals 1d6+1 points of fire damage to each creature in that area, and it can ignite unattended flammable objects within that area as if they had been hit with the weapon. Fire giants often make use of burning weapons in their fervid crusades against other races. Construction",
      "requirements": "Craft Magic Arms and Armor, elemental touch APG ;"
    },
    "Corrosive Burst": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A corrosive burst weapon functions as a corrosive weapon that explodes with searing acid upon striking a successful critical hit. The acid does not harm the wielder. In addition to the extra acid damage from the corrosive special ability, a corrosive burst weapon deals an extra 1d10 points of acid damage on a successful critical hit. If the weapon's critical modifier is 3, add an extra 2d10 points of acid damage instead, and if the modifier is \u001f4, add an extra 3d10 points. Even if the corrosive ability is not active, the weapon still deals its extra acid damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Culling": {
      "source": "Melee Tactics Toolbox pg. 26",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on melee slashing weapons. When a culling weapon is used to make an attack using the Cleave or Great Cleave feat, it deals an additional 2d6 points of damage on both the initial attack and any additional attacks granted by Cleave or Great Cleave. The weapon also applies the bonus 2d6 points of damage to successful attacks granted by use of the Cleaving Finish and Improved Cleaving Finish feats. Construction",
      "requirements": "Cleave, Craft Magic Arms and Armor, divine favor ;"
    },
    "Defiant": {
      "source": "Ultimate Equipment pg. 140",
      "aura": "strong abjuration",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A defiant weapon helps its wielder stay alive in desperate conditions. It stays in its wielder's hand even if she is panicked, stunned, or unconscious. She adds the weapon's enhancement bonus as a bonus on checks to stabilize when dying and on saving throws to end ongoing conditions such as disease, poison, and hold person . If the wielder possesses Heroic Defiance, Heroic Recovery, Improved Great Fortitude, Improved Iron Will, or Improved Lightning Reflexes, she gains a number of additional daily uses equal to the weapon's enhancement bonus that can be used on any of these feats. Construction",
      "requirements": "Craft Magic Arms and Armor, Heroic Defiance, break enchantment , stabilize ;"
    },
    "Dispelling Burst": {
      "source": "Ultimate Equipment pg. 140",
      "aura": "strong abjuration",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A dispelling burst weapon functions like a dispelling weapon but may store dispel magic or greater dispel magic . In addition, these spells can be discharged as a free action when the wielder of a dispelling burst weapon confirms a critical hit. When the wielder does so, the bonus to the check made to dispel (including from dispelling strike, spell sunder, or sunder enchantment) increases by an amount equal to the weapon's enhancement bonus or the weapon's critical multiplier (whichever is higher). If a dispelling burst weapon confirms a critical hit while it is not currently storing a dispel magic or greater dispel magic spell, yet if the wielder has either spell prepared (or is a spontaneous caster able to cast either spell), she may cast either spell into the weapon as a swift action and then immediately discharge it into the target as a free action. Construction",
      "requirements": "Craft Magic Arms and Armor, greater dispel magic , creator must be a caster of at least 12th level;"
    },
    "Disruption": {
      "source": "Ultimate Equipment pg. 140 , PRPG Core Rulebook pg. 469",
      "aura": "strong conjuration",
      "cl": "14th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A disruption weapon is the bane of all undead. Any undead creature struck in combat must succeed at a DC 14 Will save or be destroyed. A disruption weapon must be a bludgeoning melee weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, heal ;"
    },
    "Distracting, Greater": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "moderate enchantment",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Weapons with this special ability cause foes struck by them to have exceptional difficulty controlling their magic. Any time a creature that has been struck by a greater distracting weapon would have to succeed at a concentration check to complete a spell or use a special ability or item, the DC of that check increases by 10. This distraction lasts for 1 minute. Once a greater distracting weapon affects a creature in this way, that creature can't be affected by a distracting or greater distracting effect for 24 hours. If a greater distracting weapon is used on a creature already affected by a distracting weapon's effect, the two effects do not stack; the distracting effect ends, and the creature is affected by the greater distracting weapon's effect instead. Construction",
      "requirements": "Craft Magic Arms and Armor, qualm UC ;"
    },
    "Flaming Burst": {
      "source": "Ultimate Equipment pg. 141 , PRPG Core Rulebook pg. 469",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A flaming burst weapon functions as a flaming weapon that also explodes with flame upon striking a successful critical hit. The fire does not harm the wielder. In addition to the extra fire damage from the flaming ability (see above), a flaming burst weapon deals an extra 1d10 points of fire damage on a successful critical hit. If the weapon's critical multiplier is \u001f3, add an extra 2d10 points of fire damage instead, and if the multiplier is \u001f4, add an extra 3d10 points of fire damage. Even if the flaming ability is not active, the weapon still deals its extra fire damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor and fireball , flame blade , or flame strike ;"
    },
    "Furyborn": {
      "source": "Ultimate Equipment pg. 142",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A furyborn weapon draws power from the anger and frustration the wielder feels when battling foes that refuse to die. Each time the wielder damages an opponent with the weapon, its enhancement bonus increases by +1 when making attacks against that opponent (to a maximum total enhancement bonus of +5). This extra enhancement bonus goes away if the opponent dies, the wielder uses the weapon to attack a different creature, or 1 hour passes. Construction",
      "requirements": "Craft Magic Arms and Armor, rage ;"
    },
    "Fury-Born": {
      "source": "Advanced Race Guide pg. 142",
      "aura": "Faint enchantment",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A fury-born weapon draws power from the anger and frustration the wielder feels when battling foes that refuse to die. Each time the wielder damages an opponent with the weapon, its enhancement bonus increases by +1 when making attacks against that opponent (maximum total enhancement bonus of +5). This extra enhancement bonus goes away if the opponent dies, the wielder uses the weapon to attack a different creature, or 1 hour passes. Only melee weapons can have the fury-born ability. Construction",
      "requirements": "Craft Magic Arms and Armor, rage ;"
    },
    "Glorious": {
      "source": "Ultimate Equipment pg. 142",
      "aura": "moderate evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A glorious weapon glows with a dazzling light equal to a daylight spell when drawn. The wielder cannot suppress this light, though it can be temporarily suppressed by any effect that can suppress daylight . A glorious weapon flashes with light, and any creature the wielder attacks in melee is automatically dazzled until the beginning of the wielder's next turn. When a glorious weapon confirms a critical hit, the target is blinded until the beginning of the wielder's next turn (DC 14 Will negates); if the weapon's critical multiplier is greater than ×2, this blindness lasts 1 additional round per multiple over ×2. Only a melee weapon can have the glorious ability. Construction",
      "requirements": "Craft Magic Arms and Armor, blindness/deafness , daylight , flare ;"
    },
    "Harvesting": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate necromancy",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A harvesting weapon siphons away mythic power from one mythic creature to empower another. Whenever a mythic wielder confirms a critical hit against another mythic creature, the weapon leeches away one use of the target's mythic power and transfers it to the wielder. If the wielder already has her maximum number of uses of mythic power, the target's use of mythic power is still leeched, but the wielder doesn't gain it. The weapon can do this a number of times per day equal to the enhancement bonus of the weapon. If the harvesting weapon is a legendary item (see page 169), the wielder can have the mythic power that is leeched replenish one of that weapon's uses of legendary power. Only melee weapons can have this ability. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, steal power ;"
    },
    "Heretical": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A heretical weapon functions as a\r fervent weapon, but when wielded\r against a member of the religion to\r which it is attuned, the weapon's\r enhancement bonus is +2 better\r than its actual bonus. It also deals an\r extra 2d6 points of damage against\r followers of the designated religion.\r This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, align weapon , weapon of awe APG , creator must be a member of the attuned religion;"
    },
    "Holy": {
      "source": "Ultimate Equipment pg. 143 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A holy weapon is imbued with holy power. This power makes the weapon good-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of evil alignment. It bestows one permanent negative level on any evil creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including by restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, holy smite , creator must be good;"
    },
    "Icy Burst": {
      "source": "Ultimate Equipment pg. 143 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An icy burst weapon functions as a frost weapon that also explodes with frost upon striking a successful critical hit. The frost does not harm the wielder. In addition to the extra damage from the frost ability, an icy burst weapon deals an extra 1d10 points of cold damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d10 points of cold damage instead, and if the multiplier is ×4, add an extra 3d10 points. Even if the frost ability is not active, the weapon still deals its extra cold damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, chill metal or ice storm ;"
    },
    "Igniting": {
      "source": "Ultimate Equipment pg. 143",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An igniting weapon functions as a flaming weapon that also causes the target to catch fire ( Core Rulebook 444) upon striking it with a successful critical hit. The target does not get a saving throw to avoid catching fire, but can make a save each round on its turn to put out the fire. The flaming ability must be active for the weapon to set enemies on fire. Construction",
      "requirements": "Craft Magic Arms and Armor, flame blade , flame strike , or fireball ;"
    },
    "Impact": {
      "source": "Ultimate Equipment pg. 143",
      "aura": "moderate transmutation",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons that are not light weapons. An impact weapon delivers a potent kinetic jolt when it strikes, dealing damage as if the weapon were one size category larger. In addition, any bull rush combat maneuver the wielder attempts while wielding the weapon gains a bonus equal to the weapon's enhancement bonus; this includes all bull rush attempts, not only those in which a weapon is used, such as Bull Rush Strike, Shield Slam, or Unseat. Construction",
      "requirements": "Craft Magic Arms and Armor, bull's strength , lead blades ( Advanced Player's Guide ), righteous might or giant form I ;"
    },
    "Invigorating": {
      "source": "Ultimate Equipment pg. 144",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. After an attack with this weapon drops a living foe (kills it or drops it to negative hit points), the weapon infuses its wielder with vigor. If its wielder is fatigued, the weapon removes the fatigue. If exhausted, the wielder becomes fatigued instead. If neither exhausted nor fatigued, the wielder gains a +2 morale bonus on attack rolls and a +10 foot enhancement bonus to all modes of movement possessed until the end of the wielder's next turn. Construction",
      "requirements": "Craft Magic Arms and Armor, good hope ;"
    },
    "Ki Intensifying": {
      "source": "Ultimate Equipment pg. 144",
      "aura": "strong transmutation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " The weapon channels and amplifies the wielder's ki , allowing her to use her special ki attacks through the weapon as though they were unarmed attacks. These attacks include the monk's ki strike, quivering palm, and the Stunning Fist feat. The save DC for ki abilities used through the weapon increases by half the enhancement bonus of the weapon (minimum 1). After a successful strike with a ki intensifying weapon, the wielder can spend 1 ki point as a swift action to perform a combat maneuver to bull rush, disarm, reposition, or trip as a free action without provoking attacks of opportunity. Any bonuses or penalties applicable to the weapon attack also apply to this combat maneuver check. The wielder cannot move from her space as a part of the chosen maneuver. Only melee weapons can have the ki intensifying ability. It cannot be placed on an amulet of mighty fist or similar non-weapon item. Weapons with the ki focus ability can be upgraded to be ki intensifying Construction",
      "requirements": "Craft Magic Arms and Armor, creator must be a monk;"
    },
    "Legbreaker": {
      "source": "Magical Marketplace pg. 15",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A legbreaker weapon reduces the base land speed of a struck creature by 10 feet for 1d4 rounds. Multiple hits from a legbreaker weapon do not reduce a creature's land speed further, but they do extend the duration of the penalty. This speed penalty can be removed with a successful DC 15 Heal check. On a critical hit, in addition dealing critical damage and impeding the victim's speed, the wielder may perform a free trip combat maneuver against the struck creature. This ability can only be placed on bludgeoning melee weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, touch of gracelessness APG ;"
    },
    "Liberating (UI)": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "strong abjuration",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon. A liberating weapon grants its wielder a competence bonus equal to the weapon's enhancement bonus on Sense Motive checks, and this bonus is doubled when attempting a Sense Motive check to sense enchantment ( Core Rulebook 104 ). This increased bonus also applies on Spellcraft checks to identify an enchantment spell as it is being cast. When a liberating weapon is used to attack a creature under direct mental control, such as from possession, charm effects, or compulsion effects like command and dominate person , the weapon deals nonlethal damage and grants the target a new saving throw against the effect, with a morale bonus on the save equal to the weapon's enhancement bonus. If this save succeeds, the effect is suppressed for 10 minutes. If the target is affected by multiple such effects, the weapon's wielder chooses which effect the target can attempt a second save against. If the target fails this save, the effect is not suppressed and the target is immune to this effect of the same liberating weapon for 24 hours. Construction",
      "requirements": "Craft Magic Arms and Armor, break enchantment, greater dispel magic ;"
    },
    "Lifesurge": {
      "source": "Ultimate Equipment pg. 144",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A lifesurge weapon boosts and sustains the wielder's life energy while he is in the throes of combat. The wielder gains a bonus on saving throws against necromantic effectsincluding the ability damage, ability drain, and energy drain powers of the undeadequal to the weapon's enhancement bonus. In addition, whenever the wielder receives temporary hit points from any source, he adds the weapon's enhancement bonus to these temporary hit points; this does not stack for temporary hit points from multiple sources, and these points are lost if the lifesurge weapon is not being wielded. In combat, the weapon's critical threat range is doubled abilities against undead; this does not stack with the keen special ability or Improved Critical. Whenever a lifesurge weapon confirms a critical hit against an undead creature, it erupts with 1d8 points of positive energy (2d8 for weapons with a critical multiplier of ×3, 3d8 if it is ×4); the wielder may choose to deal this as damage to an undead target or to absorb half this amount as healing, with the remaining positive energy dissipating. Construction",
      "requirements": "Craft Magic Arms and Armor, Channel Smite, cure serious wounds , death ward , disrupt undead ;"
    },
    "Negating": {
      "source": "Ultimate Equipment pg. 145",
      "aura": "moderate abjuration",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A negating weapon briefly nullifies some forms of damage reduction when it damages a creature. Whenever a negating weapon damages a foe with DR/chaotic, DR/evil, DR/good, DR/lawful, or DR/magic, it reduces the value of that damage reduction by 5 points for 1 round. For example, a +1 negating lance hitting a creature with DR 10/good and lawful reduces the creature's DR to 5/good and lawful. If the creature has a component to its damage reduction other than the alignment types listed above, that component is unaffected. Thus, if the +1 negating lance above hits a demon with DR 10/good and cold iron, it would leave the demon with DR 10/cold iron and 5/good for 1 round. The effects of multiple negating weapons (or multiple hits from the same weapon) do not stack. This ability can only be placed on melee weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, dispel chaos , evil , good , or law ;"
    },
    "Obliviating": {
      "source": "Inner Sea Intrigue pg. 52",
      "aura": "moderate enchantment",
      "cl": "10th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on bludgeoning melee weapons. Whenever the wielder deals critical hit damage or sneak attack damage with an obliviating weapon, the victim loses all memory of the previous 1d6 minutes unless it succeeds at a DC 16 Fortitude saving throw. If it fails the saving throw, it becomes flat-footed until the start of its next turn. Construction",
      "requirements": "Craft Magic Arms and Armor, modify memory ;"
    },
    "Peaceful": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "moderate enchantment",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A creature that has taken nonlethal damage from a peaceful weapon becomes shaken for 1 round each time it deals lethal damage to another living creature. The duration stacks with multiple attacks, but this effect can't cause the affected creature to become frightened (even if it is affected by other fear effects). If the affected creature's nonlethal damage is completely healed, this prevents subsequent attacks from extending the duration of the shaken condition, but doesn't end the shaken condition from attacks already made. Construction",
      "requirements": "Craft Magic Arms and Armor, calm emotions, cure light wounds ;"
    },
    "Phase Locking": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "moderate abjuration",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A phase locking weapon interferes with dimensional travel. A creature damaged by a phase locking weapon is affected as though by the dimensional anchor spell for 1 round. Construction",
      "requirements": "Craft Magic Arms and Armor, dimensional anchor ;"
    },
    "Planestriking": {
      "source": "Planar Adventures pg. 48",
      "aura": "moderate abjuration",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A planestriking weapon functions as a planar weapon, ignoring up to 5 points of damage reduction when used against an outsider. In addition, when the wielder of a planestriking weapon is on a plane other than his home plane, his planestriking weapon ignores up to 10 points of damage reduction when used against outsiders native to the plane. Construction",
      "requirements": "Craft Magic Arms and Armor, dismissal ;"
    },
    "Potent": {
      "source": "Mythic Adventures pg. 143",
      "aura": "strong transmutation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " As a swift action, the wielder can expend one use of mythic power to increase the weapon's enhancement bonus by half his mythic tier (minimum 1, to a maximum of a +6 enhancement bonus) and give it the ability to bypass damage reduction. These benefits last for 1 round. Melee and ranged weapons can have this ability, but not ammunition. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, greater heroism , greater magic weapon ;"
    },
    "Quaking": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "faint evocation",
      "cl": "6th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on melee bludgeoning weapons. The wielder of a quaking weapon can strike the ground as a standard action to perform a trip combat maneuver that applies to all foes within a 5-foot-radius spread, a 10-foot cone, or a 20-foot line along the ground. The wielder can trip creatures of any size this way. This trip maneuver attempt provokes attacks of opportunity unless the wielder has some feat or ability that prevents it, and the wielder can never be knocked prone as a result of failing this special trip combat maneuver check. Construction",
      "requirements": "Craft Magic Arms and Armor, greater thunderstomp ACG ;"
    },
    "Runeforged": {
      "source": "Rise of the Runelords Anniversary Edition pg. 423 , Pathfinder #5: Sins of the Saviors pg. 57",
      "aura": "strong (two variable schools)",
      "cl": "13th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " During Thassilon's height, many of the empire's greatest soldiers, mercenaries, and arcane assassins wielded weapons infused with two allied schools of magic that worked together to grant the wielder additional prowess over practitioners of an opposing school of magic. Weapons steeped in enchantment and illusion magic, for example, held great power over wielders of transmutation. Such weapons were often banned in Thassilon, so wary were the runelords of their propagation, yet all seven kept champions and assassins armed with runeforged weapons targeting their enemies' weaknesses in secret. Each runeforged weapon opposes a school of magic. T he wielder gains a +2 morale bonus on all saving throws against spells from the weapon's opposed magic. All runeforged weapons are, to a certain degree, empathic. They enhance sin or virtue in those who wield them, so a fighter armed with a dominant weapon becomes more domineering than before, for example. Anyone wielding a runeforged weapon takes a –2 penalty on all Diplomacy checks, as her vices or virtues are magnified at the expense of personality. No weapon can have more than one runeforged weapon quality at a time, and a creature that carries two runeforged weapons (even those o f the same type) takes a –5 penalty on all attack rolls, Will saving throws, and skill checks, as her mind is constantly assailed by multiple empathic urges. Each of the seven Thassilonian schools of magic is opposed by a single runeforged weapon qualityeach of these being the combination of that school's opposition schools. The seven correct component combinations and the type of runeforged weapon each combination creates are listed below. Note that the first name for each type of weapon listed is its sinful name the second is the name a virtuous character can use to refer to the weapon. In any event, a runeforged weapon functions the same, regardless of whether it magnifies a wielder's sin or virtue. A wielder who is considered sinful or virtuous (see page 416) with the same type of sin/virtue as a runeforged weapon he wields becomes more aware of danger around himgaining a +2 insight bonus on Initiative checks and a +1 dodge bonus to AC. The specific effects of each of the seven types of runeforged weapons are listed below.",
      "covetous/charitable (opposes evocation)": ": A union of conjuration and abjuration magic, a covetous weapon functions as a bane weapon against evokers and creatures with the fire subtype. As long as the weapon is wielded, the wielder gains fire resistance 5.",
      "dominant/commanding (opposes transmutation)": ": A union of enchantment and illusion magic, a dominant weapon functions as a bane weapon against transmuters and against creatures with the shapechanger subtype. As long as the weapon is carried, it can absorb up to three harmful transmutation effects (such as baleful polymorph or petrification ) inflicted on the wielder per day.",
      "jealous/trusting (opposes necromancy)": ": A union of abjuration and enchantment magic, a jealous weapon functions as a bane weapon against necromancers and against undead created by necromancy spells (not against self-manifested undead or undead created by the create spawn special ability). As long as the weapon is carried, it can absorb up to 3 negative levels inflicted on the wielder per day.",
      "miserly/generous (opposes illusion)": ": A union of transmutation and conjuration magic, a miserly weapon functions as a bane weapon against illusionists and creatures from the Plane of Shadow. The first three times each day that this weapon strikes an illusion, it automatically makes a dispel magic attempt to dispel the illusion.",
      "parasitic/symbiotic (opposes enchantment)": ": A union of necromancy and transmutation magic, a parasitic weapon functions as a bane weapon against enchanters and against creatures that are charmed, dominated, or otherwise under another creature's magic control. The first time each day that this weapon strikes a creature under the effects of an enchantment spell, it automatically makes a dispel magic attempt to dispel the enchantment. If the attempt is successful, it siphons that energy into the wielder, healing her of 6d6 points of damage (hit points in excess of maximum are gained as temporary hit points that last for 1 hour).",
      "sadistic/compassionate (opposes abjuration)": ": A union of evocation and necromancy magic, a sadistic weapon functions as a bane weapon against abjurers and any creatures with an active abjuration spell effect. A sadistic weapon shrouds its wielder in an aura of mock magicwhen the wielder is subjected to a dispelling effect, that dispelling attempt instead targets only the aura of mock magic. If the aura is dispelled, it replenishes again in 24 hours.",
      "tyrannical/liberal (opposes conjuration)": ": A union of illusion and evocation magic, a tyrannical weapon functions as a bane weapon against conjurers and summoned monsters. The first three times each day that the weapon scores a critical hit against a creature with the extraplanar subtype, the weapon casts dismissal at the creature struck. Construction",
      "requirements": "see sourcebook;"
    },
    "Sharding": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate conjuration",
      "cl": "10th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on melee or thrown weapons. The wielder of a sharding weapon can make a special ranged attack with the weapon in place of any melee attack. To do this, the wielder goes through the motion of throwing the weapon without releasing it. The weapon splits off a duplicate of itself that flies as if thrown by the wielder at the intended target. The duplicate gains a range increment of 10 feet for this purpose, but uses the same proficiency and otherwise functions the same as the original weapon. The duplicate vanishes after hitting or missing its target. Construction",
      "requirements": "Craft Magic Arms and Armor, major creation ;"
    },
    "Shattering": {
      "source": "Dungeoneer's Handbook pg. 28",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A shattering weapon functions as a breaking weapon that also explodes with a resounding crash upon striking a successful critical hit. In addition to the extra damage from the breaking ability, a shattering weapon deals an extra 1d10 points of damage to objects and crystalline creatures on a successful critical hit. If the weapon's critical multiplier is ×3, it deals an extra 2d10 points of damage instead, and if the multiplier is ×4, it deals an extra 3d10 points instead. When used against a crystalline creature, this damage stacks with bane and similar weapon special abilities (though the damage from the breaking ability still doesn't). Even if the breaking ability is not active, the weapon still deals its extra damage on a successful critical hit. A shattering weapon ignores the hardness of objects with a hardness of 10 or lower. Construction",
      "requirements": "Craft Magic Arms and Armor, break or shatter ;"
    },
    "Shocking Burst": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A shocking burst weapon functions as a shock weapon that explodes with electricity upon striking a successful critical hit. The electricity does not harm the wielder. In addition to the extra electricity damage from the shock ability, a shocking burst weapon deals an extra 1d10 points of electricity damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d10 points of electricity damage instead, and if the multiplier is ×4, add an extra 3d10 points. Even if the shock ability is not active, the weapon still deals its extra electricity damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, call lightning or lightning bolt ;"
    },
    "Silencing": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "moderate illusion",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A silencing weapon makes no noise when drawn or when used to attack. In addition, after hitting a creature, the wielder can surround that creature with an aura that muffles all sounds coming from it until the beginning of the wielder's next turn. The target can still hear and speak (including uttering command words or casting spells with verbal components), but is much harder to hear. The DC of Perception checks to hear the sound of battle increases from –10 to 10, as long as the only combatants are the wielder of the silencing weapon and targets affected by the weapon's muffling ability. If the wielder confirms a critical hit with a silencing weapon, the target is also encased in a mobile aura of magical silence (Will DC 13 negates), which lasts a number of rounds equal to the critical multiplier of the weapon. The save DC increases by 2 for each critical multiplier of the weapon higher than ×2. This silence fills the target's space but doesn't extend beyond it. Construction",
      "requirements": "Craft Magic Arms and Armor, silence ;"
    },
    "Stalking": {
      "source": "Ultimate Equipment pg. 148",
      "aura": "moderate divination",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " The longer the wielder of a stalking weapon studies a target, the more effective her strike. As a standard action, a character wielding a stalking weapon can command it to study a creature within 60 feet. The wielder must have line of effect and line of sight to that target. When the wielder attacks the studied creature, on a successful hit the stalking weapon deals +1d6 points of bonus damage per consecutive round spent studying a target, up to a number of bonus dice equal to the stalking weapon's enhancement bonus. This bonus damage is precision damage and only applies to the first successful hit against that creature. If the wielder attacks a creature other than the studied creature, commands the weapon to study a different creature, or ends her turn more than 60 feet from the studied creature, the weapon loses all bonus damage dice against the previously studied creature. Construction",
      "requirements": "Craft Magic Arms and Armor, hunter's eye , true strike ;"
    },
    "Toxic": {
      "source": "Agents of Evil pg. 26",
      "aura": "moderate transmutation",
      "cl": "7th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Weapons with the toxic special ability reinforce the effects of applied poisons. The save DC of a poison applied to the weapon and delivered via an attack increases by 2. In addition, each time such a weapon strikes a target, there is a 25% chance that the poison dose is not expended in the attack and can be used to make an additional attack. A single dose of poison can be preserved by this property only once. Construction",
      "requirements": "Craft Magic Arms and Armor, accelerate poison APG , pernicious poison UM ;"
    },
    "Treasonous": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "strong conjuration",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A treasonous weapon functions\r as a patriotic weapon, but\r when wielded against a\r member of the nationality to\r which it is attuned, the weapon's\r enhancement bonus is +2 better\r than its actual bonus. It also\r deals an extra 2d6 points of damage against members of the\r designated nationality. This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I , weapon of\r awe APG , creator must be a member of the attuned nationality;"
    },
    "Truthful": {
      "source": "Ultimate Intrigue pg. 239",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon. A truthful weapon unerringly pierces concealment provided by illusions, allowing the wielder to ignore the miss chance provided by illusions such as blur, displacement , and invisibility . Attacks with a truthful weapon against a creature affected by mirror image or a similar figment always attack the real target. This ability allows the wielder to ignore the miss chance, not to otherwise detect the target. When attacking an invisible creature, for instance, the wielder might still need to guess the target's location. In addition to its other abilities, a truthful weapon functions as a special kind of dispelling UE weapon against figments and shadow conjuration effects; if the wielder makes an attack against such an effect, the weapon automatically attempts to use the stored dispel magic against the illusion. If the attempt fails, the wielder is not aware of the attempt, and unless she disbelieves the illusion or the illusion's duration ends, the weapon continues to impart that it is storing dispel magic (though she is free to cast dispel magic on the weapon again if she has another reason to believe the effect was expended and failed to dispel an illusion). Construction",
      "requirements": "Craft Magic Arms and Armor, greater dispel magic, true strike ;"
    },
    "Unholy": {
      "source": "Ultimate Equipment pg. 149 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An unholy weapon is imbued with unholy power. This power makes the weapon evil-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of good alignment. It bestows one permanent negative level on any good creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, unholy blight , creator must be evil;"
    },
    "Unseen": {
      "source": "Ultimate Intrigue pg. 239",
      "aura": "moderate illusion",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon. Upon command, an unseen weapon can be made invisible, including any scabbard, sheath, or similar accessory used to hold the weapon. A careful search will still reveal its presence, but purely visual examination will not. While invisible, an unseen weapon causes its wielder to take a –1 penalty on attack rolls unless she has the Blind-Fight feat or is able to see invisible objects. On the first attack made with an unseen weapon during a combat, the defender is denied its Dexterity bonus to Armor Class unless it has the Blind-Fight feat, is able to see invisible objects, or is specifically aware that the wielder is using an unseen weapon. An unseen weapon is considered to have total concealment for attacks or effects directed at it, such as combat maneuver checks made to disarm, steal APG , or sunder it and disintegrate or rusting grasp Construction",
      "requirements": "Craft Magic Arms and Armor, greater invisibility ;"
    },
    "Vampiric, Greater": {
      "source": "Horror Adventures pg. 214",
      "aura": "moderate necromancy",
      "cl": "8th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability functions as the vampiric special ability, except that the daily limit of healing from greater vampiric weapons is 5 hit points per Hit Die of the owner. A wielder can be attuned to only one vampiric or greater vampiric weapon at a time. Construction",
      "requirements": "Craft Magic Arms and Armor, cure moderate wounds , inflict moderate wounds , vampiric touch ;"
    },
    "Wounding": {
      "source": "Ultimate Equipment pg. 149 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A wounding weapon deals 1 point of bleed damage when it hits a creature. Multiple hits from a wounding weapon increase the bleed damage. Bleeding creatures take the bleed damage at the start of their turns. Bleeding can be stopped by a successful DC 15 Heal check or through the application of any spell that cures hit point damage. A critical hit does not multiply the bleed damage. Creatures immune to critical hits are immune to the bleed damage dealt by this weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, bleed ;"
    },
    "Transformative": {
      "source": "Ultimate Equipment pg. 149 , Advanced Player's Guide pg. 289",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "+5,000",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A transformative weapon alters its shape at its wielder's command, becoming any other melee weapon of the same general shape and handedness; the weapon's categorization as simple, martial, or exotic is irrelevant. For example, a Medium transformative longsword can take the shape of any other Medium one-handed melee weapon, such as a scimitar, flail, or trident, but not a Medium light or two-handed melee weapon (such as a Medium short sword or a Medium greatsword). It can even take the shape of comparable weapons of different size categories. For example, a Small greatsword is a two-handed slashing weapon for a Small character, but is a one-handed slashing weapon for a Medium character, which is very similar to a Medium longsword; a Small transformative greatsword can thus become an actual Medium longsword, usable by a Medium creature without the –2 penalty for using a weapon of the wrong size. The weapon retains all of its abilities, including enhancement bonuses and weapon special abilities, except those prohibited by its current shape. For example, a keen transformative weapon functions normally in the form of a piercing or slashing weapon, but cannot use the keen special ability when in the shape of a bludgeoning weapon. When unattended, the weapon reverts to its true shape. Construction",
      "requirements": "Craft Magic Arms and Armor, major creation ;"
    },
    "Dueling": {
      "source": "Ultimate Equipment pg. 141 , Advanced Player's Guide pg. 287",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "+7,000",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A dueling weapon (which must be a weapon that can be used with the Weapon Finesse feat) gives the wielder a +4 enhancement bonus on initiative checks, provided the weapon is drawn and in hand when the Initiative check is made. It provides a +2 bonus on disarm checks and feint checks, a +2 bonus to CMD to resist disarm attempts, and a +2 to the DC to perform a feint against the wielder. Construction",
      "requirements": "Craft Magic Arms and Armor, cat's grace ;"
    },
    "Transformative, Greater": {
      "source": "Inner Sea Intrigue pg. 52",
      "aura": "strong transmutation",
      "cl": "15th",
      "slot": "none;",
      "price": "7,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " A greater transformative weapon becomes any other weapon the wielder desires when a command word is spoken. The weapon cannot become ammunition, but can freely change between simple, martial, exotic, light, one-handed, twohanded, melee, and ranged. The weapon retains all of its enhancement bonuses and weapon special abilities. However, abilities prohibited by its current shape do not function. For example, a keen greater transformative weapon functions normally in the form of a piercing or slashing weapon, but cannot use the keen special ability when in the shape of a bludgeoning weapon. A double weapon that loses the double quality cannot use the abilities on one of its ends (wielder's choice), whereas a non-double weapon that gains the double quality applies all its abilities to only one end. When unattended for 1 day, the weapon reverts to its true shape. Construction",
      "requirements": "Craft Magic Arms and Armor, polymorph any object ;"
    },
    "Exhausting": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "strong necromancy",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This ability can be placed only on melee weapons. An exhausting weapon can bring a great weariness to opponents in battle. On a critical hit, the wielder can choose to forgo the additional damage dice to instead sap the struck creature's strength and stamina, causing it to become exhausted. Opponents that are already exhausted don't suffer any additional effects, and creatures immune to the effects of exhaustion or to critical hits are not affected. Construction",
      "requirements": "Craft Magic Arms and Armor, ray of exhaustion ;"
    },
    "Flamboyant, Greater": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "moderate transmutation",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can be placed only on one-handed or light piercing melee weapons. A greater flamboyant weapon is nearly identical to a flamboyant weapon, but its reservoir holds 3 panache points instead of 1. A weapon cannot have both this special ability and the flamboyant special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, greater heroism , creator must be a panache user;"
    },
    "Gory": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "strong necromancy",
      "cl": "15th",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " A gory weapon functions as a wounding ( Pathfinder RPG Ultimate Equipment 149) weapon, except it deals 1d2 points of bleed damage when it strikes. Additionally, when the wielder confirms a critical hit with this weapon, he can attempt an Intimidate check to demoralize the target as an immediate action with a circumstance bonus equal to his character level. Construction",
      "requirements": "Craft Magic Arms and Armor, bleed , inflict serious wounds ;"
    },
    "Nullifying": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "strong abjuration",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A nullifying weapon suppresses a creature's spell resistance for a short amount of time. Anytime the weapon strikes a creature with spell resistance and the creature takes damage from the weapon, the target's spell resistance is reduced by 1 for 1 minute. On a confirmed critical hit, its spell resistance is instead reduced by an amount equal to the weapon's critical multiplier. Multiple hits from a nullification weapon stack. Construction",
      "requirements": "Craft Magic Arms and Armor, antimagic field ;"
    },
    "Redeemed": {
      "source": "Champions of Purity pg. 30",
      "aura": "strong abjuration and evocation [good]",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " A redeemed weapon was once a corrupt unholy weapon. The\r taint of evil has been purged from it, however, and the weapon\r is now in all ways a holy weapon, dealing an additional 2d6\r points of damage against all creatures of evil alignment. In\r addition, the wielder gains a sacred bonus on saving throws\r equal to the weapon's enhancement bonus against the spells\r and abilities of evil outsiders and a +5 competence bonus on\r Knowledge (planes) checks to identify evil outsiders and their\r special powers or vulnerabilities. When the redeemed weapon\r special ability is added to an unholy weapon, the weapon loses\r the unholy property and gains the redeemed property, and the\r crafter must pay the price of adding a +1 enhancement bonus\r to the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, consecrate , holy smite , creator must be good;"
    },
    "Repositioning": {
      "source": "Ultimate Equipment pg. 147",
      "aura": "moderate enchantment",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A repositioning weapon grants the wielder a +2 enhancement bonus on combat maneuver checks to reposition a foe ( Advanced Player's Guide 322). I f the wielder confirms a critical hit with the weapon, he can attempt to reposition his opponent as a free action. These reposition attempts still provoke attacks of opportunity as normal. A weapon cannot have both the anchoring and repositioning special abilities. Construction",
      "requirements": "Craft Magic Arms and Armor, telekinesis ;"
    },
    "Speed": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " When making a full-attack action, the wielder of a speed weapon may make one extra attack with it. The attack uses the wielder's full base attack bonus, plus any modifiers appropriate to the situation. (This benefit is not cumulative with similar effects, such as a haste spell.) Construction",
      "requirements": "Craft Magic Arms and Armor, haste ;"
    },
    "Spellstealing": {
      "source": "Ultimate Equipment pg. 148",
      "aura": "strong divination",
      "cl": "13th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can only be placed on melee weapons. A spellstealing weapon allows its wielder to siphon protective magic from a target and transfer it to herself. When the wielder rolls a critical threat against a target, she can forgo confirming the critical hit and instead automatically learn which spells or magical effects are active upon the target. The wielder may then make a caster level check to steal her choice of one of those effects, using the spellstealing weapon's caster level plus its enhancement bonus, against a DC of 11 + the caster level of the effect. If the check succeeds, the target immediately loses the benefits of that effect and the wielder gains the effect for 1 minute (or until the effect expires, whichever comes first). If the spellstealing weapon has a critical multiplier greater than ×2, the wielder may attempt to steal one additional spell effect per additional multiple beyond ×2 (two effects for ×3, and so on). Construction",
      "requirements": "Craft Magic Arms and Armor, greater arcane sight , limited wish ;"
    },
    "Umbral": {
      "source": "Ultimate Intrigue pg. 239",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can be placed only on a melee weapon with a hilt or handle. An umbral weapon does not reflect any sources of ambient light and is perpetually cloaked in shadow. It is considered to have concealment for the purposes of attacks or effects directed at the weapon, such as combat maneuver checks made to disarm, steal APG or sunder it and disintegrate or rusting grasp . The wielder gains darkvision 30 feet while grasping the hilt or handle of the weapon, even if the weapon is not drawn. Upon command, an umbral weapon radiates darkness in a 20-foot radius, causing illumination in the area to drop by one step (from bright light to normal light, normal light to dim light, or dim light to darkness). Due to the darkvision granted by the weapon, the wielder's vision is not impaired by darkness created by an umbral weapon. The darkness shed by an umbral weapon is considered a 2nd-level spell effect for the purpose of comparing its effect to the effects of magical light sources. This darkness suppresses light spells, but can't be used to counter or dispel them. The weapon must be drawn and in the wielder's hand to radiate darkness. The darkness ends immediately if the weapon is dropped, disarmed, sheathed, or otherwise stowed. Construction",
      "requirements": "Craft Magic Arms and Armor, darkness, darkvision ;"
    },
    "Brilliant Energy": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "strong transmutation",
      "cl": "16th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " A brilliant energy weapon has its significant portion transformed into light, although this does not modify the item's weight. It always gives off light as a torch (20- foot radius). A brilliant energy weapon ignores nonliving matter. Armor and shield bonuses to AC (including any enhancement bonuses to that armor) do not count against it because the weapon passes through armor. (Dexterity, deflection, dodge, natural armor, and other such bonuses still apply.) A brilliant energy weapon cannot harm undead, constructs, or objects. Construction",
      "requirements": "Craft Magic Arms and Armor, gaseous form , continual flame ;"
    },
    "Dancing": {
      "source": "Ultimate Equipment pg. 138 , PRPG Core Rulebook pg. 469",
      "aura": "strong transmutation",
      "cl": "15th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " As a standard action, a dancing weapon can be loosed to attack on its own. It fights for 4 rounds using the base attack bonus of the one who loosed it and then drops. While dancing, it cannot make attacks of opportunity, and the activating character it is not considered armed with the weapon. The weapon is considered wielded or attended by the activating character for all maneuvers and effects that target items. While dancing, the weapon shares the same space as the activating character and can attack adjacent foes (weapons with reach can attack opponents up to 10 feet away). The dancing weapon accompanies the activating character everywhere, whether she moves by physical or magical means. If the activating character has an unoccupied hand, she can grasp it while it is attacking on its own as a free action; when so retrieved, the weapon can't dance (attack on its own) again for 4 rounds. This special ability can only be placed on melee weapons. Construction",
      "requirements": "Craft Magic Arms and Armor, animate objects ;"
    },
    "Flying": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "strong transmutation",
      "cl": "16th",
      "slot": "none;",
      "price": "",
      "enhancement": 5,
      "weight": " ",
      "Description": " This ability can be placed only on melee weapons. A flying weapon acts as a dancing weapon, but while dancing it can be directed to attack foes up to 30 feet away. Additionally, at any time (even if the weapon is not dancing), the last wielder to draw the weapon can will it to return to him as a swift action. It flies up to 500 feet per round to return to its wielder, making one sunder attempt per round to penetrate any barrier it can't fly around and a combat maneuver check (using its last wielder's CMB) against the CMD of any creature that attempts to hold or restrain it (bursting free on a successful check). When it returns to its wielder, the weapon flies into an empty hand or, if its wielder does not have a free hand, falls at his feet. If the weapon can't return after 4 rounds, it falls inert. Construction",
      "requirements": "Craft Magic Arms and Armor, animate object ;"
    },
    "Spell Siphon": {
      "source": "Melee Tactics Toolbox pg. 27",
      "aura": "strong transmutation",
      "cl": "15th",
      "slot": "none;",
      "price": "",
      "enhancement": 5,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons. A spell siphon weapon allows the wielder to siphon a single combat spell from a target. When the wielder rolls a critical threat against the target, she can forgo confirming the critical hit (dealing normal damage) to instead automatically learn what combat spells are active on the target. For the purposes of this ability, a combat spell is any spell that grants a bonus to Strength, Dexterity, Constitution, movement, or Armor Class, or on attack rolls, damage rolls, or saving throws. The wielder can then attempt a check to siphon one of the combat spells of her choice. This check uses either the wielder's caster level or the wielder's base attack bonus plus the weapon's enhancement bonus, and is attempted against a DC of 11 + the targeted spell's caster level. If the wielder succeeds, the target immediately loses access to the spell being siphoned, and the wielder gains the effects of the spell for its remaining duration or 1 minute, whichever is shorter. If the spell siphon weapon has a critical multiplier greater than ×2, the wielder can attempt to siphon one additional combat spell for each additional multiplier beyond 2 (two spells for ×3, three for ×4, and so on). Construction",
      "requirements": "Craft Magic Arms and Armor, greater arcane sight , limited wish ;"
    },
    "Vorpal": {
      "source": "Ultimate Equipment pg. 149 , PRPG Core Rulebook pg. 469",
      "aura": "strong necromancy and transmutation",
      "cl": "18th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 5,
      "weight": " ",
      "Description": " This potent and feared ability allows the weapon to sever the heads of those it strikes. Upon a roll of natural 20 (followed by a successful roll to confirm the critical hit), the weapon severs the opponent's head (if it has one) from its body. Some creatures, such as many aberrations and all oozes, have no heads. Others, such as golems and undead creatures other than vampires, are not affected by the loss of their heads. Most other creatures, however, die when their heads are cut off. A vorpal weapon must be a slashing melee weapon. If you roll this special ability randomly for an inappropriate weapon, reroll. Construction",
      "requirements": "Craft Magic Arms and Armor, circle of death , keen edge ;"
    }
  },
  "Ranged": {
    "Adaptive": {
      "source": "Ultimate Equipment pg. 134",
      "aura": "faint transmutation",
      "cl": "1st",
      "slot": "weapon quality;",
      "price": "+500",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can only be placed on composite bows. An adaptive bow responds to the strength of its wielder, acting as a bow with a strength rating equal to its wielder's Strength bonus. The wielder can fire it with a lesser Strength bonus (and cause less damage) if desired. Construction",
      "requirements": "Craft Magic Arms and Armor, warp wood ;"
    },
    "Dry Load": {
      "source": "Ultimate Equipment pg. 140 , Ultimate Combat pg. 141",
      "aura": "faint abjuration",
      "cl": "3rd",
      "slot": "weapon quality;",
      "price": "+750",
      "enhancement": 1,
      "weight": " ",
      "Description": " This weapon special ability can only be applied to alchemical or metal firearm cartridges. Dry load cartridges can be used to load guns underwater or in other airless environments, such as a vacuum. This special ability protects the cartridge's contents as it is being loaded into a firearm and creates a residual bubble of air that surrounds that firearm, further protecting the ammunition and allowing the firearm with this ammunition loaded in it to be fired in an airless environment. After the cartridge is loaded, the bubble of air lasts for 3 abilities minutes or until the firearm is fired, whichever occurs first. A firearm loaded with this ammunition still takes the –2 penalty on attack rolls when fired underwater for every 5 feet of water the bullet passes through, in addition to the normal penalties to range. When firing a dry load cartridge underwater or in an airless environment, a misfire that results in a firearm explosion occurs normally. The listed price is for 50 dry load cartridges. Construction",
      "requirements": "Craft Magic Arms and Armor, air bubble ( Ultimate Combat );"
    },
    "Sniping (normal)": {
      "source": "Ranged Tactics Toolbox pg. 26",
      "aura": "faint illusion",
      "cl": "5th",
      "slot": "none;",
      "price": "937",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on projectile weapons. Most sniping weapons are dull-colored and marked with symbols of death. The wielder of a sniping weapon gains a +5 competence bonus on Stealth checks to remain hidden after sniping with it. Construction",
      "requirements": "Craft Magic Arms and Armor, invisibility , silence ;"
    },
    "Allying": {
      "source": "Ultimate Equipment pg. 135 , Advanced Player's Guide pg. 286",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " An allying weapon allows the wielder to transfer some or all of the weapon's enhancement bonus to one weapon being used by an ally of the wielder. The wielder must have line of sight to the intended ally. As a free action, at the start of her turn before using her weapon, the wielder chooses how to allocate her weapon's enhancement bonus. The bonus to the ally's weapon lasts until the allying weapon's wielder's next turn. The enhancement bonus from the allying weapon does not stack with the enhancement bonus on the ally's weapon (if any). Construction",
      "requirements": "Craft Magic Arms and Armor, magic weapon ;"
    },
    "Ambushing": {
      "source": "Ultimate Wilderness pg. 246",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. If the wielder spends at least 1 minute preparing a hiding place or when she uses the sniping rules ( Core Rulebook 106 ), she adds the weapon's enhancement bonus as a competence bonus on Stealth checks. An ambushing weapon deals an additional 1d6 points of damage on a successful hit during a surprise round or against a creature that is unaware of the wielder's presence. This extra damage is precision damage; it is not multiplied on a critical hit but does stack with other forms of precision damage. Construction",
      "requirements": "Craft Magic Arms and Armor, cat's grace , invisibility ;"
    },
    "Bane": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A bane weapon excels against certain foes. Against a designated foe, the weapon's enhancement bonus is +2 better than its actual bonus. It also deals an extra 2d6 points of damage against such foes. To randomly determine a weapon's designated foe, roll on the following table. d% Designated Foe   01–05 Aberrations   06–09 Animals   10–16 Constructs   17–22 Dragons   23–27 Fey   28–60 Humanoids (pick one subtype)   61–65 Magical beasts   66–70 Monstrous humanoids   71–72 Oozes   73–88 Outsiders (pick one subtype)   89–90 Plants   91–98 Undead   99–100 Vermin Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Beaming": {
      "source": "Blood of Shadows pg. 21",
      "aura": "faint evocation",
      "cl": "10th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Only ranged weapons can have the beaming ability. Once per day, as a swift action, a beaming weapon creates a number of glowing orbs equal to the weapon's enhancement bonus. The orbs float around the wielder's head like a halo and fire rays of light at the wielder's foes. Once per round when the wielder makes an attack or full-attack with the beaming weapon, the wielder can expend one orb as a free action to fire a beam of searing light at any target within range. The orbs remain until expended or until the wielder sleeps. Construction",
      "requirements": "Craft Magic Arms and Armor, searing light ;"
    },
    "Bewildering": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "moderate transmutation",
      "cl": "7th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Three times per day, when the wielder of a bewildering weapon makes a successful attack with this weapon, in addition to dealing the weapon's normal damage, the wielder can inflict the confused condition on that enemy for 1d6 rounds. The target can attempt a DC 17 Will saving throw each round to end this effect. Construction",
      "requirements": "Craft Magic Arms and Armor, confusion ;"
    },
    "Blood-Hunting": {
      "source": "Advanced Class Guide pg. 212",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A blood-hunting weapon excels against enemies with the bloodline class feature. Against a designated foe, the weapon's enhancement bonus is 2 better than its actual bonus. It also deals an additional 2d6 points of damage against such foes. When combined with abilities like bane or spirit-hunting , the enhancement bonus increases granted by these abilities don't stack, but an extra 1d6 points of damage are added to the additional damage for each special ability beyond the first. (For example, a bane blood-hunting weapon would deal 3d6 additional points of damage, and a bane blood-hunting spirit-hunting weapon would deal 4d6 additional points of damage.) To randomly determine a weapon's designated foe, roll on the following table. Other designated foes are possible, but most of these weapons are tuned against creatures with the following bloodlines. d% Designated Foe   01–05 Aberrant   06–15 Abyssal   16–30 Arcane   31–35 Celestial   36–40 Destined   41–50 Draconic   51–60 Elemental   61–70 Fey   71–80 Infernal   81–90 Undead   91–100 Other Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Breaking": {
      "source": "Dungeoneer's Handbook pg. 28",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a breaking weapon deals an extra 2d6 points of damage against inanimate objects and crystalline creatures on a successful hit and ignores the hardness of objects with a hardness of 5 or lower. When used against a crystalline creature, the damage from this effect does not stack with bane or similar weapon special abilities. This effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, break or shatter ;"
    },
    "Called": {
      "source": "Ultimate Equipment pg. 137",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A called weapon can be teleported to the wielder's hand as a swift action that does not provoke attacks of opportunity, even if the weapon is in the possession of another creature. This ability has a maximum range of 100 feet, and effects that block teleportation prevent the return of a called weapon. A called weapon must be in a creature's possession for at least 24 hours for this ability to function. Construction",
      "requirements": "Craft Magic Arms and Armor, teleport ;"
    },
    "Catalytic": {
      "source": "Monster Codex pg. 177",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability can be placed only on a corrosive or corrosive burst weapon ( Pathfinder RPG Ultimate Equipment 138). When the wielder of a catalytic weapon hits a creature, the weapon triggers a devastating chemical reaction that burns the struck creature. The creature struck must succeed at a DC 15 Fortitude save, or take 1d6 points of acid damage at the start of its turn for 1d4 rounds. Successive hits with the catalytic weapon increase the duration but don't add to the damage. The creature can attempt to neutralize the reaction as a full-round action as if it were on fire (including bonuses for dropping and rolling on the ground or jumping into water). Anyone who hits a creature subject to this chemical reaction with a natural weapon or unarmed strike takes 1d6 points of acid damage. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Clustershot": {
      "source": "Elves of Golarion pg. 23",
      "aura": "weak transmutation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " These arrows are inscribed with a spiral groove down the length of the haft and an eye-glyph on the head. They are designed to maintain accuracy when firing multiple arrows at the same time (such as with the Manyshot feat) by steering their paths toward the impact point of the first arrow. For a clustershot arrow to function, all arrows fired in the attack must have this property. If the first arrow can deal sneak attack damage or is a critical hit, the remaining arrows from that shot can deal half normal sneak attack damage, and if they critically hit deal half normal critical hit damage. Construction",
      "requirements": "Craft Magic Arms and Armor, magic weapon ;"
    },
    "Compassionate": {
      "source": "Champions of Purity pg. 30",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A compassionate weapon has the power to save a foe from\r the brink of death. When a successful hit from a compassionate\r weapon would bring a creature to –1 or fewer hit points,\r that creature is automatically stabilized. This ability can be\r suppressed at will as a free action. Construction",
      "requirements": "Craft Magic Arms and Armor, stabilize ;"
    },
    "Conductive": {
      "source": "Ultimate Equipment pg. 137 , Advanced Player's Guide pg. 286",
      "aura": "moderate necromancy",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A conductive weapon is able to channel the energy of a spelllike or supernatural ability that relies on a melee or ranged touch attack to hit its target (such as from a cleric's domain granted power, sorcerer's bloodline power, oracle's mystery revelation, or wizard's arcane school power). When the wielder makes a successful attack of the appropriate type, he may choose to expend two uses of his magical ability to channel it through the weapon to the struck opponent, which suffers the effects of both the weapon attack and the special ability. (If the wielder has unlimited uses of a special ability, she may channel through the weapon every round.) For example, a paladin who strikes an undead opponent with her conductive greatsword can expend two uses of her lay on hands ability (a supernatural melee touch attack) to deal both greatsword damage and damage from one use of lay on hands. A given character can use this weapon special ability only once per round (even if she has several conductive weapons), and the power works only with magical abilities of the same type as the weapon (melee or ranged). Construction",
      "requirements": "Craft Magic Arms and Armor, spectral hand ;"
    },
    "Conserving": {
      "source": "Ultimate Equipment pg. 137",
      "aura": "moderate conjuration",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This ability cannot be placed on firearms. Only projectile weapons can be made conserving . When the wielder misses with a ranged attack, the fired ammunition teleports unharmed to its quiver, case, or pouch. If the ammunition in question would be destroyed for other reasons than merely being launched, such as an arrow that breaks apart in flight, this special ability does not function and the ammunition is destroyed as normal. Effects that block teleportation prevent this special ability from working. Construction",
      "requirements": "Craft Magic Arms and Armor, abundant ammunition ( Ultimate Combat ), dimension door ;"
    },
    "Corrosive": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a corrosive weapon becomes slick with acid that deals an extra 1d6 points of acid damage on a successful hit. The acid does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Cruel": {
      "source": "Ultimate Equipment pg. 138 , Advanced Race Guide pg. 124",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When the wielder strikes a creature that is frightened, shaken, or panicked with a cruel weapon, that creature becomes sickened for 1 round. When the wielder uses the weapon to knock unconscious or kill a creature, he gains 5 temporary hit points that last for 10 minutes. Construction",
      "requirements": "Craft Magic Arms and Armor, cause fear , death knell ;"
    },
    "Cunning": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate divination",
      "cl": "6th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability allows a weapon to find chinks in a foe's defenses using the wielder's knowledge of the target. Whenever the weapon's attack is a critical threat, the wielder gains a +4 bonus on the confirmation roll if she has 5 or more ranks in a Knowledge skill that would be used to identify the creature's type, or a +6 bonus instead if she has 15 or more ranks. Construction",
      "requirements": "Craft Magic Arms and Armor, true strike ;"
    },
    "Deceptive": {
      "source": "Pathfinder Society Primer pg. 14",
      "aura": "moderate illusion",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A deceptive weapon's shape blurs and appears to bend\r unpredictably. When the weapon is in hand, the wielder gains a\r bonus on Bluff checks to feint equal to the enhancement bonus\r of the weapon. In addition, when the wielder successfully\r confirms a critical hit with a deceptive weapon against an\r opponent, she can attempt to feint against that opponent as an\r immediate action. Construction",
      "requirements": "Craft Magic Arms and Armor, dazzling blade RG ;"
    },
    "Distance": {
      "source": "Ultimate Equipment pg. 140 , PRPG Core Rulebook pg. 469",
      "aura": "moderate divination",
      "cl": "6th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on a ranged weapon. A distance weapon has double the range increment of other weapons of its kind. Construction",
      "requirements": "Craft Magic Arms and Armor, clairaudience/clairvoyance ;"
    },
    "Distracting": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "faint enchantment",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Weapons with this special ability cause foes struck by them to have difficulty controlling their magic. Any time a creature that has been struck by a distracting weapon would have to succeed at a concentration check to complete a spell or use a special ability or item, the DC of that check increases by 5. This distraction lasts for 1 minute. Once a distracting weapon affects a creature in this way, that creature can't be affected by a distracting effect for 24 hours, though it can be affected by a greater distracting effect. Construction",
      "requirements": "Craft Magic Arms and Armor, qualm UC ;"
    },
    "Driving": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate evocation",
      "cl": "10th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. A driving weapon can be used to perform bull rush and trip combat maneuvers in its first range increment. A successful ranged bull rush does not require the wielder to move to push the target farther than 5 feet. A ranged trip that fails by 10 or more cannot result in the attacker being knocked prone. Construction",
      "requirements": "Craft Magic Arms and Armor, telekinetic charge UC ;"
    },
    "Drowscourge": {
      "source": "Faction Guide pg. 59",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Invented by the Lantern Bearers, this enhancement can be added to a magic weapon with at least a +1 bonus. Against driders and creatures with the drow subtype, the weapon's enhancement bonus is +1 better. The bearer is able to detect drow once per day (similar to detect animals or plants ) and gain darkvision (as the spell) once per day. Construction",
      "requirements": "Craft Magic Arms and Armor, darkvision , detect evil , summon monster I ;"
    },
    "Fervent": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A fervent weapon thrums with the divine power of a specific\r deity or set of deities. If the wielder is an adherent of the deity\r or deities, she gains several benefits. First, the wielder gains a\r +4 insight bonus on Bluff, Disguise, and Sleight of Hand checks\r to conceal the weapon from members of other religions. On a\r successful hit against a flat-footed target of a different religion,\r the target must succeed at DC 13 Will save or be shaken for 1\r minute. Finally, the wielder receives a +2 bonus to confirm critical\r hits against members of other religions. The creator of a fervent weapon must be within one step\r of the religion to be attuned to the weapon, along either the\r lawful/chaotic axis or the good/evil axis. The target religion must\r be determined at the weapon's creation and cannot be altered. Construction",
      "requirements": "Craft Magic Arms and Armor, align weapon ;"
    },
    "Flaming": {
      "source": "Ultimate Equipment pg. 141 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a flaming weapon is sheathed in fire that deals an extra 1d6 points of fire damage on a successful hit. The fire does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor and fireball , flame blade , or flame strike ;"
    },
    "Frost": {
      "source": "Ultimate Equipment pg. 142 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a frost weapon is sheathed in a terrible, icy cold that deals an extra 1d6 points of cold damage on a successful hit. The cold does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, chill metal or ice storm ;"
    },
    "Ghost Touch": {
      "source": "Ultimate Equipment pg. 142 , PRPG Core Rulebook pg. 469",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A ghost touch weapon deals damage normally against incorporeal creatures, regardless of its bonus. An incorporeal creature's 50% reduction in damage from corporeal sources does not apply to attacks made against it with ghost touch weapons. The weapon can be picked up and moved by an incorporeal creature at any time. A manifesting ghost can wield the weapon against corporeal foes. Essentially, a ghost touch weapon counts as both corporeal or incorporeal. This special ability can only be placed on melee weapons and ammunition. Construction",
      "requirements": "Craft Magic Arms and Armor, plane shift ;"
    },
    "Healer's Sorrow": {
      "source": "Elves of Golarion pg. 23",
      "aura": "weak necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " The sickly gray wood of this arrow seems quite fragile and delicate. Created from pale necromantic bone or casket wood, this arrow splinters when it impacts, embedding pieces of itself in the target and making the wound resistant to magical healing. Removing the splinters requires 10 minutes and a DC 25 Heal check. Until the splinters are removed, all magical healing effects used on the target restore only half as many hit points as normal. This applies whether the target requires positive or negative energy for healing. Construction",
      "requirements": "Craft Magic Arms and Armor, death knell ;"
    },
    "Huntsman": {
      "source": "Ultimate Equipment pg. 143 , Advanced Player's Guide pg. 288",
      "aura": "moderate divination",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A huntsman weapon helps its wielder locate and capture quarry. When the weapon is held in hand, the wielder gains the weapon's enhancement bonus on Survival checks made to track any creature the weapon has damaged in the past day. It also deals +1d6 points of damage to creatures the wielder has tracked with Survival in the past day. Construction",
      "requirements": "Craft Magic Arms and Armor, detect animals or plants ;"
    },
    "Inspired": {
      "source": "Advanced Class Guide pg. 214",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on simple weapons, hand crossbows, rapiers, shortbows, short swords, and sword canes UE . In the hands of an investigator, an inspired weapon reduces the cost of using inspiration on attack rolls made with the weapon. The weapon's wielder needs to expend only one use of inspiration to augment his attack rolls with this weapon, as with the combat inspiration investigator talent. If the wielder already has the combat inspiration talent, the wielder must still expend one use of inspiration, but in addition to adding the result of the inspiration roll to the attack roll, the investigator adds twice the result of the inspiration roll to the weapon's damage roll. Construction",
      "requirements": "Craft Magic Arms and Armor, good hope ;"
    },
    "Jurist": {
      "source": "Ultimate Equipment pg. 144 , Advanced Player's Guide pg. 288",
      "aura": "faint transmutation",
      "cl": "4th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When an inquisitor wielder uses her judgment class ability while wielding a jurist weapon, it grants her an enhancement bonus on her Perception checks and to CMD. The bonus is +1 on the first round of her judgment, and increases by +1 each round, to a maximum of +3 on the third and following rounds. Construction",
      "requirements": "Craft Magic Arms and Armor, owl's wisdom ;"
    },
    "Kinslayer": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A kinslayer weapon is enhanced with enmity against all those\r born into the wielder's familial line. Against creatures related to\r the wielder, this weapon's enhancement bonus is +2 better than\r its actual bonus. It also deals an extra 2d6 points of damage\r against such creatures. This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, detect relations ;"
    },
    "Limning": {
      "source": "Ultimate Equipment pg. 145",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " When a limning weapon is wielded, a pale glow outlines it. On a successful strike against a creature affected by a means of magical concealment, the weapon outlines the creature in faerie fire (as the spell) for 1 round. Magical means of concealment include blur , displacement , invisibility , and similar effects, whether from a spell, spell-like ability, or supernatural means, but not those provided by extraordinary abilities. A limning weapon has no special effect against creatures merely hiding or concealed by nonmagical means, or those hidden by environmental conditions (even magical) such as darkness or fog. Construction",
      "requirements": "Craft Magic Arms and Armor, faerie fire ;"
    },
    "Lucky": {
      "source": "Ultimate Equipment pg. 145 , Ultimate Combat pg. 142",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on one-handed or two-handed firearms. A lucky firearm has its own magical reservoir of grit (see Ultimate Combat ). Usually this grit is stored within the marks of an engraving or in a trinket that hangs from the firearm. Often these marks take the form of holy symbols or fetishes, but such a reservoir can take just about any form. This reservoir holds 1 grit point, which is refreshed at the start of each day. Whether or not the wielder of a lucky firearm has any deeds (see Ultimate Combat ), she can always spend 1 grit point from the lucky firearm to reroll an attack from it that would result in a misfire. When the wielder does so, she must take the second result, even if that attack roll also results in a misfire. Construction",
      "requirements": "Craft Magic Arms and Armor, heroism , creator must be a grit user;"
    },
    "Merciful": {
      "source": "Ultimate Equipment pg. 145 , PRPG Core Rulebook pg. 469",
      "aura": "faint conjuration",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A merciful weapon deals an extra 1d6 points of damage, but all damage it deals is nonlethal damage. On command, the weapon suppresses this ability until told to resume it (allowing it to deal lethal damage, but without any bonus damage from this ability). Construction",
      "requirements": "Craft Magic Arms and Armor, cure light wounds ;"
    },
    "Miserable": {
      "source": "Agents of Evil pg. 26",
      "aura": "moderate conjuration",
      "cl": "8th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A miserable weapon cuts through the energy resistance of certain foes. Miserable weapons must be crafted with a designated creature type (just like bane weapons), and each time they deal damage to their designated foes, their magic halves the creatures' natural energy resistances for 1 round. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Mythic Bane": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A mythic bane weapon works exactly like a bane weapon, except it has a higher bonus and deals extra damage against any creature with the mythic subtype. This ability stacks with the bane weapon special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, divine favor ;"
    },
    "Patriotic": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate conjuration",
      "cl": "10th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A patriotic weapon radiates with the collective power and\r strength of a particular nation of people. If the wielder is a\r member of that nationality, he gains several benefits. First,\r the wielder gains a +4 insight bonus on Bluff, Disguise, and\r Sleight of Hand checks to conceal the weapon from members\r of other nationalities. On a successful hit against a flat-footed\r target of a different nationality, the target must succeed at DC\r 13 Will save or be shaken for 1 minute. Finally, the wielder\r receives a +2 bonus to confirm critical hits against members of\r other nationalities. The nationality affected must be determined at the patriotic weapon's creation and cannot be altered. At the GM's discretion,\r the nationality named may be a specified human ethnicity, such\r as Chelaxian or Shoanti. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I ;"
    },
    "Planar": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A planar weapon is effective against all types of extradimensional beings, able to pierce their resistance to physical harm. When used to attack outsiders, a planar weapon ignores 5 points of their damage reduction. Construction",
      "requirements": "Craft Magic Arms and Armor, plane shift ;"
    },
    "Plummeting": {
      "source": "Ultimate Wilderness pg. 247",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. A flying creature hit with a plummeting weapon must immediately attempt a DC 20 Fly check with a penalty equal to twice the weapon's enhancement bonus; if it fails, it loses 10 feet of altitude. On a confirmed critical hit, the creature loses 10 feet of altitude if it succeeds at its Fly check, and it falls 1d4×10 feet on a failed check. If a flying creature's loss of altitude results in it striking the ground or another solid surface, it takes falling damage as appropriate and is no longer flying. Construction",
      "requirements": "Craft Magic Arms and Armor, bestow curse , fly ;"
    },
    "Reliable": {
      "source": "Ultimate Equipment pg. 146 , Ultimate Combat pg. 142",
      "aura": "moderate transmutation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on firearms. A reliable firearm is enchanted so that it is less likely to jam than other firearms. This enchantment reduces the misfire value of the affected firearm by 1 (minimum 0). This reduction occurs after any increases are calculated for firing with the broken condition, or for any other effect that might increase the misfire value of a firearm. Construction",
      "requirements": "Craft Magic Arms and Armor, mending ;"
    },
    "Returning": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on a weapon that can be thrown. A returning weapon flies through the air back to the creature that threw it. It returns to the thrower just before the creature's next turn (and is therefore ready to use again in that turn). Catching a returning weapon when it comes back is a free action. If the character can't catch it, or if the character has moved since throwing it, the weapon drops to the ground in the square from which it was thrown. Construction",
      "requirements": "Craft Magic Arms and Armor, telekinesis ;"
    },
    "Rusting": {
      "source": "Magical Marketplace pg. 15",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A weapon with the rusting special ability is so badly tarnished that no amount of cleaning can restore it. Although the weapon constantly sheds flecks of rust and corroded metal, it remains structurally sound. When the wielder confirms a critical hit with a rusting weapon, she can forgo any extra damage to instead deal normal damage to the target and affect the target or the target's armor with the rusting grasp spell. A rusting weapon cannot be used against unattended inanimate objects. A rusting weapon is immune to mundane or magical rust, including the attack of a rust monster. Construction",
      "requirements": "Craft Magic Arms and Armor, rusting grasp ;"
    },
    "Sacred": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "strong transmutation",
      "cl": "16th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A sacred weapon is filled with divine energy, and acts as a holy symbol. When wielded by a creature that can cast divine spells, the weapon automatically displays an image of that creature's holy symbol, often as a glowing rune on the weapon's blade or along its haft. Additionally, if the wielder has the blessings class feature, whenever he channels energy, he can choose one ally or ally's weapon within the area of the channeled energy and bestow upon that creature or weapon the benefits of one of his minor blessings at a cost of one use of that blessing. Construction",
      "requirements": "Craft Magic Arms and Armor, imbue with spell ability ;"
    },
    "Sapping": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "faint enchantment",
      "cl": "5th",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed on only weapons that deal nonlethal damage. A sapping weapon deals an additional 2d6 points of nonlethal damage. When the wielder confirms a critical hit with the weapon, the target becomes fatigued for 5 rounds. Construction",
      "requirements": "Craft Magic Arms and Armor, pain strike APG , touch of fatigue ;"
    },
    "Seeking": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "strong divination",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be placed on ranged weapons. A seeking weapon veers toward its target, negating any miss chances that would otherwise apply, such as from concealment. The wielder still has to aim the weapon at the right square. Arrows mistakenly shot into an empty space, for example, do not veer and hit invisible enemies, even if they are nearby. Construction",
      "requirements": "Craft Magic Arms and Armor, true seeing ;"
    },
    "Shadowshooting": {
      "source": "Blood of Shadows pg. 26",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can only be added to ranged projectile weapons (including slings and sling-like weapons). Black smoke constantly wafts from the firing mechanism of a shadowshooting weapon. A shadowshooting weapon never needs to be reloaded; after a shot is fired, this smoke immediately coalesces into the ammunition required to fire the weapon again. This doesn't prevent a shadowshooting weapon from firing ordinary projectiles appropriate to the weapon. Ammunition created by this ability is only quasi-real, and the first time each round an opponent is hit by a piece of ammunition that this ability has created, it can attempt a Will saving throw to disbelieve (DC = 15 + the weapon's enhancement bonus). A failed Will saving throw means the weapon deals damage normally, while success means the weapon deals minimum damage against that opponent for 1 round. Construction",
      "requirements": "Craft Magic Arms and Armor, reloading hands UC , shadow weapon UM ;"
    },
    "Shock": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Upon command, a shock weapon is sheathed in crackling electricity that deals an extra 1d6 points of electricity damage on a successful hit. The electricity does not harm the wielder. The effect remains until another command is given. Construction",
      "requirements": "Craft Magic Arms and Armor, call lightning or lightning bolt ;"
    },
    "Sparkfly Crystal Arrow": {
      "source": "Elves of Golarion pg. 23",
      "aura": "weak evocation",
      "cl": "3rd",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " The fat crystal head of this arrow contains tiny motes of light; on closer scrutiny, they are actually tiny glowing insects similar to fireflies, held in stasis. When the arrow hits a target, it shatters the crystal and releases the insects, which distract the target with their aggressive flight. The creature takes a –1 penalty on attacks and checks for the next minute or until they rid themselves of the flying pests (such as by diving into water, suffering a damaging area attack, and so on). The lights reduce a target's concealment by one step (turning a 50% miss chance from total concealment into a 20% miss chance from concealment, and concealment into no concealment at all). Construction",
      "requirements": "Craft Magic Arms and Armor, faerie fire ;"
    },
    "Spell Hurling": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on melee weapons that are designed to be thrown. If the wielder has the spellstrike class feature (such as from levels in the magus class), he can throw a spell hurling weapon to deliver a touch spell. If the spell hurling weapon hits, the touch spell targets the creature or object struck (if possible). Regardless of whether the weapon hits, any remaining touches with that spell are harmlessly discharged. Construction",
      "requirements": "Craft Magic Arms and Armor, spectral hand , creator must have the spellstrike class feature;"
    },
    "Spirit-Hunting": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A spirit-hunting weapon excels against enemies with either the mystery or spirit class feature (but has no effect against a shaman who has a temporary bond to the appropriate spirit by way of the wandering spirit class feature or similar effect). Against a designated foe, the weapon's enhancement bonus is 2 better than its actual bonus. It also deals 2d6 additional points of damage against such foes. When combined with abilities like bane or blood-hunting , the enhancement bonus increases granted by these abilities do not stack, but an additional 1d6 points of damage are added to the additional damage for each special ability beyond the first. (For example, a bane spirit-hunting weapon would deal 3d6 additional points of damage, and a bane blood-hunting spirit-hunting weapon would deal 4d6 additional points of damage.) To randomly determine a weapon's designated foe, roll on the following table. Other designated foes are possible, but most of these weapons are tuned against creatures with the following mysteries or spirits. d% Designated Foe   01–10 Battle   11–20 Bones   21–30 Flame   31–40 Heavens   41–50 Life   51–60 Lore   61–70 Nature   71–80 Stone   81–90 Waves   91–00 Wind Construction",
      "d%": "",
      "designated foe": "",
      "requirements": "Craft Magic Arms and Armor, summon nature's ally I ;"
    },
    "Summon Bane": {
      "source": "Monster Summoner's Handbook pg. 21",
      "aura": "moderate conjuration",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A summon bane weapon excels against summoned creatures, including those summoned by conjuration (summoning) spells (such as summon monster and summon nature's ally spells), those summoned by conjuration (calling) spells (such as planar ally and planar binding ), and eidolons. Against such summoned creatures, the weapon's enhancement bonus is +2 better than its normal bonus. It also deals an extra 2d6 points of damage against such foes. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster IV or summon nature's ally IV ;"
    },
    "Thundering": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A thundering weapon creates a cacophonous roar like abilities thunder whenever it strikes a target with a successful critical hit. The sonic energy does not harm the wielder. A thundering weapon deals an extra 1d8 points of sonic damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d8 points of sonic damage instead, and if the multiplier is ×4, add an extra 3d8 points of sonic damage. Subjects dealt critical hits by a thundering weapon must make a successful DC 14 Fortitude save or be deafened permanently. Construction",
      "requirements": "Craft Magic Arms and Armor, blindness/deafness ;"
    },
    "Training": {
      "source": "Inner Sea Intrigue pg. 52",
      "aura": "faint transmutation",
      "cl": "3rd",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Popular among those who seek to impersonate skilled warriors, a training weapon grants one combat feat to the wielder as long as the weapon is drawn and in hand. The feat is chosen when this special ability is placed on the weapon. That feat cannot be used as a prerequisite for any other feats and functions for the wielder only if she meets its prerequisites. Once chosen, the feat stored in the weapon cannot be changed. Construction",
      "requirements": "Craft Magic Arms and Armor, magic weapon , creator must have the chosen combat feat and its prerequisites;"
    },
    "Unaligned": {
      "source": "Planar Adventures pg. 48",
      "aura": "faint abjuration",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Typically forged by aeons or other creatures that eschew commonly held structures of morality, unaligned weapons quell the effects of extreme alignments on the wielder. The wielder counts her Hit Dice as 4 lower than her actual total HD when someone attempts to detect her alignment using detect chaos , detect evil , detect good , detect law , or similar spells or effects. Furthermore, if the wielder is an outsider and is targeted by a spell or effect with an alignment descriptor that deals additional damage to or has an additional effect on outsiders (such as holy smite ), she adds a bonus equal to the unaligned weapon's enhancement bonus on saving throws she attempts against that spell or effect. Finally, the wielder takes no penalties on her Charisma-, Intelligence-, or Wisdom-based checks from a plane's mildly aligned or strongly aligned traits, regardless of her actual alignment. Construction",
      "requirements": "Craft Magic Arms and Armor, undetectable alignment ;"
    },
    "Veering": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "faint evocation",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. Veering weapons feature feathers or carved images of wings or winged creatures in their construction. Attacks with a veering weapon ignore a target's bonus to AC from partial cover and reduce the target's bonus to AC from cover and soft cover by 2. A veering weapon bestows no benefit against targets with total cover. Construction",
      "requirements": "Craft Magic Arms and Armor, magic missile ;"
    },
    "Virulent": {
      "source": "Monster Codex pg. 177",
      "aura": "faint necromancy",
      "cl": "5th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " A virulent weapon magically intensifies any poison it delivers. The saving throw DC of any poison applied to either a virulent weapon or any ammunition fired from it increases by a number equal to the weapon's enhancement bonus. The duration of the poison increases by a number of rounds equal to the virulent weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, pernicious poison UM ;"
    },
    "Phantom Ammunition": {
      "source": "Advanced Class Guide pg. 215",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "1,000",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability can be placed only on ammunition. Ammunition with this weapon special ability dissolves 1 round after it is fired. Additionally, if the projectile strikes true, the wound closes after the ammunition disintegrates. The weapon deals normal damage, but leaves behind no visible trace of foul play. The listed price is for 50 pieces of phantom ammunition. Construction",
      "requirements": "Craft Magic Arms and Armor, disintegrate , make whole ;"
    },
    "Impervious": {
      "source": "Ultimate Equipment pg. 144",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "+1,500",
      "enhancement": 1,
      "weight": " ",
      "Description": " An impervious weapon is warded from damage and decay. A metallic weapon cannot rust and a wooden weapon cannot rot or warp, even by magical or supernatural means. An impervious weapon gains double the normal bonus to its hardness and hit points for each point of its enhancement bonus. The break DC for an impervious weapon and the wielder's combat maneuver defense against sunder maneuvers against the impervious weapon each gain a bonus equal to twice the weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, fabricate , make whole ;"
    },
    "Exclusionary": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "faint necromancy",
      "cl": "1st",
      "slot": "none;",
      "price": "1,875",
      "enhancement": 1,
      "weight": " ",
      "Description": " When the wielder of an exclusionary weapon damages a creature with it, she can choose to not affect that creature with any channel energy ability she uses within the next minute. The maximum number of targets the wielder can exclude at one time is equal to her Wisdom bonus plus the enhancement bonus of the exclusionary weapon. If the wielder of an exclusionary weapon strikes a creature that would cause her to go over this limit, she loses the ability to exclude the target she has been excluding for the longest amount of time. Construction",
      "requirements": "Craft Magic Arms and Armor, Selective Channeling, sanctuary ;"
    },
    "Glamered": {
      "source": "Ultimate Equipment pg. 142",
      "aura": "moderate illusion",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "+2,000",
      "enhancement": 1,
      "weight": " ",
      "Description": " A glamered weapon can be commanded to change its shape and appearance to assume the form of another object of similar size. The weapon retains all its properties (including weight) when so disguised but does not radiate magic. Only true seeing or similar magic reveals the true nature of a glamered weapon while it is disguised. After a glamered weapon is used to attack, this special ability is suppressed for 1 minute. Construction",
      "requirements": "Craft Magic Arms and Armor, disguise self , magic aura ;"
    },
    "Resizing": {
      "source": "Giant Hunter's Handbook pg. 33",
      "aura": "faint transmutation",
      "cl": "5th",
      "slot": "none;",
      "price": "2,000",
      "enhancement": 1,
      "weight": " ",
      "Description": " A resizing weapon instantly shrinks or grows to suit the size of any creature that picks it up unless it is currently wielded by another creature. It reverts to its original size 1 round after it leaves its wielder's possession. Construction",
      "requirements": "Craft Magic Arms and Armor, resize item ;"
    },
    "Sacrosanct": {
      "source": "Mythic Adventures pg. 143",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 1,
      "weight": " ",
      "Description": " Taking the form of a deity's favored weapon, a sacrosanct weapon serves as both a martial implement and the corresponding deity's holy (or unholy) symbol. Once per day when the wielder uses the sacrosanct weapon to channel energy, she can increase the radius of the channel energy to 40 feet. They wielder must be able to channel positive or negative energy to use this ability. Alternatively, the wielder can expend one use of mythic power to use this ability instead of expending its daily use. When using mythic power to activate this ability, it can be done at will. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, the crafter must be able to channel energy;"
    },
    "Liberating (WMH)": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate abjuration",
      "cl": "10th",
      "price": "+3,500",
      "enhancement": 1,
      "weight": " ",
      "Description": " As a standard action, the wielder of a liberating weapon can free herself or an adjacent creature from spells and abilities that inhibit movement, such as paralysis, solid fog , slow , and web . The wielder attempts a combat maneuver check while holding the weapon (DC = 15 + either the spell's caster level or the creature's HD); success dispels the effect. Only a single attempt can be made against each spell or effect. Construction",
      "requirements": "Craft Magic Arms and Armor, dispel magic , freedom of movement ;"
    },
    "Sniping (improved)": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "moderate illusion",
      "cl": "10th",
      "slot": "none;",
      "price": "3,750",
      "enhancement": 1,
      "weight": " ",
      "Description": " This special ability functions as sniping , except the wielder gains a +10 competence bonus on Stealth checks to remain hidden after sniping with the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, invisibility , silence ;"
    },
    "Anarchic": {
      "source": "Ultimate Equipment pg. 135 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An anarchic weapon is infused with the power of chaos. It makes the weapon chaotically aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of lawful alignment. It bestows one permanent negative level ( Core Rulebook 562) on any lawful creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, chaos hammer , creator must be chaotic;"
    },
    "Anchoring": {
      "source": "Ultimate Equipment pg. 135",
      "aura": "moderate transmutation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be added to a melee weapon or a thrown weapon. An anchoring weapon pins a target in place and prevents it from moving. As a swift action, the weapon can be fixed in place in a point in space, functioning as an immovable rod . This ability can also be used when the wielder hits a creature with a melee attack using an anchoring weapon. This anchors the target to the weapon, preventing it from moving away from the weapon. The target is not entangled or paralyzed; it simply cannot move from its location without first destroying the weapon or making a successful DC 30 Strength check as a full-round action to move with the weapon up to 10 feet. An anchoring weapon remains motionless and cannot be used to attack while it is anchoring a creature. An anchoring weapon has no effect on amorphous creatures, including elementals, oozes, and creatures in gaseous or liquid form. It also cannot anchor incorporeal creatures unless the weapon also has the ghost touch special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, levitate ;"
    },
    "Axiomatic": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An axiomatic weapon is infused with lawful power. It makes the weapon law-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against chaotic creatures. It bestows one permanent negative level ( Core Rulebook 562) on any chaotic creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, order's wrath , creator must be lawful;"
    },
    "Burning": {
      "source": "Monster Codex pg. 57",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A burning weapon causes an unattended flammable object to ignite when struck (Fortitude DC 13 negates for magic items), dealing 1d6+1 points of fire damage to the object each round after it's ignited. An item made mostly or entirely out of wood is even more susceptible to this effect, taking 2d6+2 points of fire damage. This effect lasts for 1d4 rounds. A creature that ends its turn in the same space as a burning object takes 1d6+1 points of fire damage. Up to three times per day, the bearer of a burning weapon can, on command, cause a single object that has been ignited by the weapon to burn even brighter, increasing the duration of its burning effect by 1d4+1 rounds and causing the fire to expand in a burst that extends 5 feet from the object. This burst of fire deals 1d6+1 points of fire damage to each creature in that area, and it can ignite unattended flammable objects within that area as if they had been hit with the weapon. Fire giants often make use of burning weapons in their fervid crusades against other races. Construction",
      "requirements": "Craft Magic Arms and Armor, elemental touch APG ;"
    },
    "Corrosive Burst": {
      "source": "Ultimate Equipment pg. 138 , Advanced Player's Guide pg. 287",
      "aura": "moderate evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A corrosive burst weapon functions as a corrosive weapon that explodes with searing acid upon striking a successful critical hit. The acid does not harm the wielder. In addition to the extra acid damage from the corrosive special ability, a corrosive burst weapon deals an extra 1d10 points of acid damage on a successful critical hit. If the weapon's critical modifier is 3, add an extra 2d10 points of acid damage instead, and if the modifier is \u001f4, add an extra 3d10 points. Even if the corrosive ability is not active, the weapon still deals its extra acid damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, acid arrow ;"
    },
    "Cyclonic": {
      "source": "Ranged Tactics Toolbox pg. 26",
      "aura": "faint conjuration",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons or ammunition. A cyclonic weapon or piece of ammunition feels as though it were surrounded by gentle winds pulling it in all directions. When the wielder makes a ranged attack with a cyclonic weapon, a sheath of whirling air surrounds the weapon or the ammunition fired and prevents the attack from being impaired by wind, water, and other liquid or gaseous environmental factors. Construction",
      "requirements": "Craft Magic Arms and Armor, air bubble UC ;"
    },
    "Dazzling": {
      "source": "Ranged Tactics Toolbox pg. 26",
      "aura": "faint evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on firearms or firearm ammunition. Whenever a dazzling weapon is fired, it emits an explosive flash that dazzles all foes adjacent to the bullet's path or within or adjacent to the cone of a scatter shot. This condition lasts a number of rounds equal to the weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, flare burst APG ;"
    },
    "Designating (lesser)": {
      "source": "Ultimate Equipment pg. 140",
      "aura": "moderate enchantment",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on ranged weapons or ammunition. Each time a ranged weapon or ammunition with this ability hits a creature, its magic designates the target. Allies gain a +2 morale bonus on melee attack and melee damage rolls against the designated target for 1 round. Multiple successful shots fired at the same target do not increase the bonuses or their duration. Construction",
      "requirements": "Craft Magic Arms and Armor, instant enemy ( Advanced Player's Guide );"
    },
    "Distracting, Greater": {
      "source": "Advanced Class Guide pg. 213",
      "aura": "moderate enchantment",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Weapons with this special ability cause foes struck by them to have exceptional difficulty controlling their magic. Any time a creature that has been struck by a greater distracting weapon would have to succeed at a concentration check to complete a spell or use a special ability or item, the DC of that check increases by 10. This distraction lasts for 1 minute. Once a greater distracting weapon affects a creature in this way, that creature can't be affected by a distracting or greater distracting effect for 24 hours. If a greater distracting weapon is used on a creature already affected by a distracting weapon's effect, the two effects do not stack; the distracting effect ends, and the creature is affected by the greater distracting weapon's effect instead. Construction",
      "requirements": "Craft Magic Arms and Armor, qualm UC ;"
    },
    "Endless Ammunition": {
      "source": "Ultimate Equipment pg. 141",
      "aura": "moderate conjuration",
      "cl": "9th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Only bows and crossbows can be made into endless ammunition weaponsfirearms and other projectile weapons cannot. Each time an endless ammunition weapon is nocked, a single nonmagical arrow or bolt is spontaneously created by the magic, so the weapon's wielder never needs to load the weapon with ammunition. If the wielder attempts to load the weapon with other ammunition, the created arrow or bolt immediately vanishes and the wielder can load the weapon as normal. This ability does not reduce the amount of time required to load or fire the weapon. The created arrow or bolt vanishes if removed from the weapon; it persists only if fired. Unlike normal bow and crossbow ammunition, these arrows and bolts are always destroyed when fired. Construction",
      "requirements": "Craft Magic Arms and Armor, minor creation ;"
    },
    "Flaming Burst": {
      "source": "Ultimate Equipment pg. 141 , PRPG Core Rulebook pg. 469",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A flaming burst weapon functions as a flaming weapon that also explodes with flame upon striking a successful critical hit. The fire does not harm the wielder. In addition to the extra fire damage from the flaming ability (see above), a flaming burst weapon deals an extra 1d10 points of fire damage on a successful critical hit. If the weapon's critical multiplier is \u001f3, add an extra 2d10 points of fire damage instead, and if the multiplier is \u001f4, add an extra 3d10 points of fire damage. Even if the flaming ability is not active, the weapon still deals its extra fire damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor and fireball , flame blade , or flame strike ;"
    },
    "Glitterwake": {
      "source": "Ranged Tactics Toolbox pg. 26",
      "aura": "strong conjuration",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. Three times per day as a swift action, the wielder can activate a glitterwake weapon to cause her next ranged attack with the weapon to scatter a wake of glittering dust. The dust clings to the target struck and all creatures within 10 feet of the attack's trajectory, and all creatures affected by the dust take a –20 penalty on Stealth checks while the dust persists. The dust also outlines invisible creatures and objects as glitterdust . Creatures in the area of glittering dust when the attack is made are dazzled unless they succeed at a DC 13 Will save. The dust lasts a number of minutes equal to the weapon's enhancement bonus. Construction",
      "requirements": "Craft Magic Arms and Armor, glitterdust ;"
    },
    "Heretical": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A heretical weapon functions as a\r fervent weapon, but when wielded\r against a member of the religion to\r which it is attuned, the weapon's\r enhancement bonus is +2 better\r than its actual bonus. It also deals an\r extra 2d6 points of damage against\r followers of the designated religion.\r This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, align weapon , weapon of awe APG , creator must be a member of the attuned religion;"
    },
    "Holy": {
      "source": "Ultimate Equipment pg. 143 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A holy weapon is imbued with holy power. This power makes the weapon good-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of evil alignment. It bestows one permanent negative level on any evil creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including by restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, holy smite , creator must be good;"
    },
    "Icy Burst": {
      "source": "Ultimate Equipment pg. 143 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An icy burst weapon functions as a frost weapon that also explodes with frost upon striking a successful critical hit. The frost does not harm the wielder. In addition to the extra damage from the frost ability, an icy burst weapon deals an extra 1d10 points of cold damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d10 points of cold damage instead, and if the multiplier is ×4, add an extra 3d10 points. Even if the frost ability is not active, the weapon still deals its extra cold damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, chill metal or ice storm ;"
    },
    "Igniting": {
      "source": "Ultimate Equipment pg. 143",
      "aura": "strong evocation",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An igniting weapon functions as a flaming weapon that also causes the target to catch fire ( Core Rulebook 444) upon striking it with a successful critical hit. The target does not get a saving throw to avoid catching fire, but can make a save each round on its turn to put out the fire. The flaming ability must be active for the weapon to set enemies on fire. Construction",
      "requirements": "Craft Magic Arms and Armor, flame blade , flame strike , or fireball ;"
    },
    "Peaceful": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "moderate enchantment",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A creature that has taken nonlethal damage from a peaceful weapon becomes shaken for 1 round each time it deals lethal damage to another living creature. The duration stacks with multiple attacks, but this effect can't cause the affected creature to become frightened (even if it is affected by other fear effects). If the affected creature's nonlethal damage is completely healed, this prevents subsequent attacks from extending the duration of the shaken condition, but doesn't end the shaken condition from attacks already made. Construction",
      "requirements": "Craft Magic Arms and Armor, calm emotions, cure light wounds ;"
    },
    "Penetrating": {
      "source": "Magical Marketplace pg. 23",
      "aura": "moderate evocation",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This weapon special ability can only be placed on ammunition. A creature struck by a piece of penetrating ammunition must succeed at a DC 17 Fortitude save or the ammunition proceeds to travel into another creature in line. The attacker must be able to trace a line starting at her space and passing through both targets to make this additional attack. The second attack is made at a –4 penalty, in addition to any modifiers for added range. Construction",
      "requirements": "Craft Wondrous Item, mirror strike UC ;"
    },
    "Phase Locking": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "moderate abjuration",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A phase locking weapon interferes with dimensional travel. A creature damaged by a phase locking weapon is affected as though by the dimensional anchor spell for 1 round. Construction",
      "requirements": "Craft Magic Arms and Armor, dimensional anchor ;"
    },
    "Planestriking": {
      "source": "Planar Adventures pg. 48",
      "aura": "moderate abjuration",
      "cl": "9th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A planestriking weapon functions as a planar weapon, ignoring up to 5 points of damage reduction when used against an outsider. In addition, when the wielder of a planestriking weapon is on a plane other than his home plane, his planestriking weapon ignores up to 10 points of damage reduction when used against outsiders native to the plane. Construction",
      "requirements": "Craft Magic Arms and Armor, dismissal ;"
    },
    "Potent": {
      "source": "Mythic Adventures pg. 143",
      "aura": "strong transmutation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " As a swift action, the wielder can expend one use of mythic power to increase the weapon's enhancement bonus by half his mythic tier (minimum 1, to a maximum of a +6 enhancement bonus) and give it the ability to bypass damage reduction. These benefits last for 1 round. Melee and ranged weapons can have this ability, but not ammunition. Construction",
      "requirements": "Craft Magic Arms and Armor, Mythic Crafter, greater heroism , greater magic weapon ;"
    },
    "Runeforged": {
      "source": "Rise of the Runelords Anniversary Edition pg. 423 , Pathfinder #5: Sins of the Saviors pg. 57",
      "aura": "strong (two variable schools)",
      "cl": "13th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " During Thassilon's height, many of the empire's greatest soldiers, mercenaries, and arcane assassins wielded weapons infused with two allied schools of magic that worked together to grant the wielder additional prowess over practitioners of an opposing school of magic. Weapons steeped in enchantment and illusion magic, for example, held great power over wielders of transmutation. Such weapons were often banned in Thassilon, so wary were the runelords of their propagation, yet all seven kept champions and assassins armed with runeforged weapons targeting their enemies' weaknesses in secret. Each runeforged weapon opposes a school of magic. T he wielder gains a +2 morale bonus on all saving throws against spells from the weapon's opposed magic. All runeforged weapons are, to a certain degree, empathic. They enhance sin or virtue in those who wield them, so a fighter armed with a dominant weapon becomes more domineering than before, for example. Anyone wielding a runeforged weapon takes a –2 penalty on all Diplomacy checks, as her vices or virtues are magnified at the expense of personality. No weapon can have more than one runeforged weapon quality at a time, and a creature that carries two runeforged weapons (even those o f the same type) takes a –5 penalty on all attack rolls, Will saving throws, and skill checks, as her mind is constantly assailed by multiple empathic urges. Each of the seven Thassilonian schools of magic is opposed by a single runeforged weapon qualityeach of these being the combination of that school's opposition schools. The seven correct component combinations and the type of runeforged weapon each combination creates are listed below. Note that the first name for each type of weapon listed is its sinful name the second is the name a virtuous character can use to refer to the weapon. In any event, a runeforged weapon functions the same, regardless of whether it magnifies a wielder's sin or virtue. A wielder who is considered sinful or virtuous (see page 416) with the same type of sin/virtue as a runeforged weapon he wields becomes more aware of danger around himgaining a +2 insight bonus on Initiative checks and a +1 dodge bonus to AC. The specific effects of each of the seven types of runeforged weapons are listed below.",
      "covetous/charitable (opposes evocation)": ": A union of conjuration and abjuration magic, a covetous weapon functions as a bane weapon against evokers and creatures with the fire subtype. As long as the weapon is wielded, the wielder gains fire resistance 5.",
      "dominant/commanding (opposes transmutation)": ": A union of enchantment and illusion magic, a dominant weapon functions as a bane weapon against transmuters and against creatures with the shapechanger subtype. As long as the weapon is carried, it can absorb up to three harmful transmutation effects (such as baleful polymorph or petrification ) inflicted on the wielder per day.",
      "jealous/trusting (opposes necromancy)": ": A union of abjuration and enchantment magic, a jealous weapon functions as a bane weapon against necromancers and against undead created by necromancy spells (not against self-manifested undead or undead created by the create spawn special ability). As long as the weapon is carried, it can absorb up to 3 negative levels inflicted on the wielder per day.",
      "miserly/generous (opposes illusion)": ": A union of transmutation and conjuration magic, a miserly weapon functions as a bane weapon against illusionists and creatures from the Plane of Shadow. The first three times each day that this weapon strikes an illusion, it automatically makes a dispel magic attempt to dispel the illusion.",
      "parasitic/symbiotic (opposes enchantment)": ": A union of necromancy and transmutation magic, a parasitic weapon functions as a bane weapon against enchanters and against creatures that are charmed, dominated, or otherwise under another creature's magic control. The first time each day that this weapon strikes a creature under the effects of an enchantment spell, it automatically makes a dispel magic attempt to dispel the enchantment. If the attempt is successful, it siphons that energy into the wielder, healing her of 6d6 points of damage (hit points in excess of maximum are gained as temporary hit points that last for 1 hour).",
      "sadistic/compassionate (opposes abjuration)": ": A union of evocation and necromancy magic, a sadistic weapon functions as a bane weapon against abjurers and any creatures with an active abjuration spell effect. A sadistic weapon shrouds its wielder in an aura of mock magicwhen the wielder is subjected to a dispelling effect, that dispelling attempt instead targets only the aura of mock magic. If the aura is dispelled, it replenishes again in 24 hours.",
      "tyrannical/liberal (opposes conjuration)": ": A union of illusion and evocation magic, a tyrannical weapon functions as a bane weapon against conjurers and summoned monsters. The first three times each day that the weapon scores a critical hit against a creature with the extraplanar subtype, the weapon casts dismissal at the creature struck. Construction",
      "requirements": "see sourcebook;"
    },
    "Sharding": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate conjuration",
      "cl": "10th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can be placed only on melee or thrown weapons. The wielder of a sharding weapon can make a special ranged attack with the weapon in place of any melee attack. To do this, the wielder goes through the motion of throwing the weapon without releasing it. The weapon splits off a duplicate of itself that flies as if thrown by the wielder at the intended target. The duplicate gains a range increment of 10 feet for this purpose, but uses the same proficiency and otherwise functions the same as the original weapon. The duplicate vanishes after hitting or missing its target. Construction",
      "requirements": "Craft Magic Arms and Armor, major creation ;"
    },
    "Shattering": {
      "source": "Dungeoneer's Handbook pg. 28",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A shattering weapon functions as a breaking weapon that also explodes with a resounding crash upon striking a successful critical hit. In addition to the extra damage from the breaking ability, a shattering weapon deals an extra 1d10 points of damage to objects and crystalline creatures on a successful critical hit. If the weapon's critical multiplier is ×3, it deals an extra 2d10 points of damage instead, and if the multiplier is ×4, it deals an extra 3d10 points instead. When used against a crystalline creature, this damage stacks with bane and similar weapon special abilities (though the damage from the breaking ability still doesn't). Even if the breaking ability is not active, the weapon still deals its extra damage on a successful critical hit. A shattering weapon ignores the hardness of objects with a hardness of 10 or lower. Construction",
      "requirements": "Craft Magic Arms and Armor, break or shatter ;"
    },
    "Shocking Burst": {
      "source": "Ultimate Equipment pg. 147 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A shocking burst weapon functions as a shock weapon that explodes with electricity upon striking a successful critical hit. The electricity does not harm the wielder. In addition to the extra electricity damage from the shock ability, a shocking burst weapon deals an extra 1d10 points of electricity damage on a successful critical hit. If the weapon's critical multiplier is ×3, add an extra 2d10 points of electricity damage instead, and if the multiplier is ×4, add an extra 3d10 points. Even if the shock ability is not active, the weapon still deals its extra electricity damage on a successful critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, call lightning or lightning bolt ;"
    },
    "Silencing": {
      "source": "Ultimate Intrigue pg. 238",
      "aura": "moderate illusion",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A silencing weapon makes no noise when drawn or when used to attack. In addition, after hitting a creature, the wielder can surround that creature with an aura that muffles all sounds coming from it until the beginning of the wielder's next turn. The target can still hear and speak (including uttering command words or casting spells with verbal components), but is much harder to hear. The DC of Perception checks to hear the sound of battle increases from –10 to 10, as long as the only combatants are the wielder of the silencing weapon and targets affected by the weapon's muffling ability. If the wielder confirms a critical hit with a silencing weapon, the target is also encased in a mobile aura of magical silence (Will DC 13 negates), which lasts a number of rounds equal to the critical multiplier of the weapon. The save DC increases by 2 for each critical multiplier of the weapon higher than ×2. This silence fills the target's space but doesn't extend beyond it. Construction",
      "requirements": "Craft Magic Arms and Armor, silence ;"
    },
    "Sniping": {
      "source": "Magical Marketplace pg. 25",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability can only be placed on ranged weapons. Whenever the wielder attempts to make a sneak attack with a sniping weapon, the maximum distance she can be from her target increases to 45 feet. This ability does not stack with other abilities that increase the distance at which a ranged sneak attack may be made. Construction",
      "requirements": "Craft Magic Arms and Armor, longshot UC ;"
    },
    "Stalking": {
      "source": "Ultimate Equipment pg. 148",
      "aura": "moderate divination",
      "cl": "10th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " The longer the wielder of a stalking weapon studies a target, the more effective her strike. As a standard action, a character wielding a stalking weapon can command it to study a creature within 60 feet. The wielder must have line of effect and line of sight to that target. When the wielder attacks the studied creature, on a successful hit the stalking weapon deals +1d6 points of bonus damage per consecutive round spent studying a target, up to a number of bonus dice equal to the stalking weapon's enhancement bonus. This bonus damage is precision damage and only applies to the first successful hit against that creature. If the wielder attacks a creature other than the studied creature, commands the weapon to study a different creature, or ends her turn more than 60 feet from the studied creature, the weapon loses all bonus damage dice against the previously studied creature. Construction",
      "requirements": "Craft Magic Arms and Armor, hunter's eye , true strike ;"
    },
    "Toxic": {
      "source": "Agents of Evil pg. 26",
      "aura": "moderate transmutation",
      "cl": "7th",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " Weapons with the toxic special ability reinforce the effects of applied poisons. The save DC of a poison applied to the weapon and delivered via an attack increases by 2. In addition, each time such a weapon strikes a target, there is a 25% chance that the poison dose is not expended in the attack and can be used to make an additional attack. A single dose of poison can be preserved by this property only once. Construction",
      "requirements": "Craft Magic Arms and Armor, accelerate poison APG , pernicious poison UM ;"
    },
    "Treasonous": {
      "source": "Quests and Campaigns pg. 30",
      "aura": "strong conjuration",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " A treasonous weapon functions\r as a patriotic weapon, but\r when wielded against a\r member of the nationality to\r which it is attuned, the weapon's\r enhancement bonus is +2 better\r than its actual bonus. It also\r deals an extra 2d6 points of damage against members of the\r designated nationality. This extra damage is not multiplied on\r a critical hit. Construction",
      "requirements": "Craft Magic Arms and Armor, summon monster I , weapon of\r awe APG , creator must be a member of the attuned nationality;"
    },
    "Unholy": {
      "source": "Ultimate Equipment pg. 149 , PRPG Core Rulebook pg. 469",
      "aura": "moderate evocation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 2,
      "weight": " ",
      "Description": " An unholy weapon is imbued with unholy power. This power makes the weapon evil-aligned and thus bypasses the corresponding damage reduction. It deals an extra 2d6 points of damage against all creatures of good alignment. It bestows one permanent negative level on any good creature attempting to wield it. The negative level remains as long as the weapon is in hand and disappears when the weapon is no longer wielded. This negative level cannot be overcome in any way (including restoration spells) while the weapon is wielded. Construction",
      "requirements": "Craft Magic Arms and Armor, unholy blight , creator must be evil;"
    },
    "Transformative, Greater": {
      "source": "Inner Sea Intrigue pg. 52",
      "aura": "strong transmutation",
      "cl": "15th",
      "slot": "none;",
      "price": "7,500",
      "enhancement": 2,
      "weight": " ",
      "Description": " A greater transformative weapon becomes any other weapon the wielder desires when a command word is spoken. The weapon cannot become ammunition, but can freely change between simple, martial, exotic, light, one-handed, twohanded, melee, and ranged. The weapon retains all of its enhancement bonuses and weapon special abilities. However, abilities prohibited by its current shape do not function. For example, a keen greater transformative weapon functions normally in the form of a piercing or slashing weapon, but cannot use the keen special ability when in the shape of a bludgeoning weapon. A double weapon that loses the double quality cannot use the abilities on one of its ends (wielder's choice), whereas a non-double weapon that gains the double quality applies all its abilities to only one end. When unattended for 1 day, the weapon reverts to its true shape. Construction",
      "requirements": "Craft Magic Arms and Armor, polymorph any object ;"
    },
    "Sniping (greater)": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "strong illusion",
      "cl": "15th",
      "slot": "none;",
      "price": "8,437",
      "enhancement": 2,
      "weight": " ",
      "Description": " This special ability functions as sniping , except the wielder gains a +15 competence bonus on Stealth checks to remain hidden after sniping with the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, invisibility , silence ;"
    },
    "Gory": {
      "source": "Dirty Tactics Toolbox pg. 24",
      "aura": "strong necromancy",
      "cl": "15th",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " A gory weapon functions as a wounding ( Pathfinder RPG Ultimate Equipment 149) weapon, except it deals 1d2 points of bleed damage when it strikes. Additionally, when the wielder confirms a critical hit with this weapon, he can attempt an Intimidate check to demoralize the target as an immediate action with a circumstance bonus equal to his character level. Construction",
      "requirements": "Craft Magic Arms and Armor, bleed , inflict serious wounds ;"
    },
    "Lucky, Greater": {
      "source": "Ultimate Equipment pg. 145 , Ultimate Combat pg. 142",
      "aura": "strong enchantment",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can only be placed on one-handed or two-handed firearms. A greater lucky firearm is nearly identical to a lucky firearm, but its reservoir holds 3 grit points instead of 1. A firearm cannot have both this special ability and the lucky special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, greater heroism , creator must be a grit user;"
    },
    "Redeemed": {
      "source": "Champions of Purity pg. 30",
      "aura": "strong abjuration and evocation [good]",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " A redeemed weapon was once a corrupt unholy weapon. The\r taint of evil has been purged from it, however, and the weapon\r is now in all ways a holy weapon, dealing an additional 2d6\r points of damage against all creatures of evil alignment. In\r addition, the wielder gains a sacred bonus on saving throws\r equal to the weapon's enhancement bonus against the spells\r and abilities of evil outsiders and a +5 competence bonus on\r Knowledge (planes) checks to identify evil outsiders and their\r special powers or vulnerabilities. When the redeemed weapon\r special ability is added to an unholy weapon, the weapon loses\r the unholy property and gains the redeemed property, and the\r crafter must pay the price of adding a +1 enhancement bonus\r to the weapon. Construction",
      "requirements": "Craft Magic Arms and Armor, consecrate , holy smite , creator must be good;"
    },
    "Reliable (greater)": {
      "source": "Ultimate Equipment pg. 147 , Ultimate Combat pg. 142",
      "aura": "strong enchantment",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can only be placed on firearms. A greater reliable firearm is enchanted so as to be less likely to jam than other firearms. The greater reliable special ability reduces the misfire value of the affected firearm by 4 (minimum 0). This reduction occurs after any increases are calculated for firing with the broken condition, or for any other effect that might increase the misfire value of a firearm. A firearm with the greater reliable special ability cannot have the reliable special ability. Construction",
      "requirements": "Craft Magic Arms and Armor, make whole ;"
    },
    "Sonic Boom": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "moderate evocation",
      "cl": "8th",
      "slot": "none;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can be placed only on firearms and firearm ammunition. Attacks with a sonic boom weapon deal an additional 1d6 points of sonic damage to the target and 1d6 points of sonic damage to all creatures adjacent to the bullet's path within one range increment of the wielder, or adjacent to the cone of a scatter shot. Creatures that take sonic damage from the boom must succeed at a DC 16 Fortitude save or be deafened for 1 minute. Construction",
      "requirements": "Craft Magic Arms and Armor, shout ;"
    },
    "Speed": {
      "source": "Ultimate Equipment pg. 148 , PRPG Core Rulebook pg. 469",
      "aura": "moderate transmutation",
      "cl": "7th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " When making a full-attack action, the wielder of a speed weapon may make one extra attack with it. The attack uses the wielder's full base attack bonus, plus any modifiers appropriate to the situation. (This benefit is not cumulative with similar effects, such as a haste spell.) Construction",
      "requirements": "Craft Magic Arms and Armor, haste ;"
    },
    "Tailwind": {
      "source": "Ranged Tactics Toolbox pg. 27",
      "aura": "moderate evocation",
      "cl": "12th",
      "slot": "none;",
      "price": "",
      "enhancement": 3,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. Whenever a tailwind weapon is used to make a ranged attack, the weapon or its projectile is pushed along by a powerful tailwind that fills its space. This tailwind acts similarly to the gust of wind spell, except it has an instantaneous duration and doesn't affect creatures. However, it can still extinguish unprotected flames and accomplish anything a sudden burst of wind could. The tailwind negates range penalties to the weapon's attack until it reaches the end of the wind's range (60 feet); each whole range increment beyond 60 feet applies a penalty to the attack as normal. Construction",
      "requirements": "Craft Magic Arms and Armor, gust of wind ;"
    },
    "Brilliant Energy": {
      "source": "Ultimate Equipment pg. 136 , PRPG Core Rulebook pg. 469",
      "aura": "strong transmutation",
      "cl": "16th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " A brilliant energy weapon has its significant portion transformed into light, although this does not modify the item's weight. It always gives off light as a torch (20- foot radius). A brilliant energy weapon ignores nonliving matter. Armor and shield bonuses to AC (including any enhancement bonuses to that armor) do not count against it because the weapon passes through armor. (Dexterity, deflection, dodge, natural armor, and other such bonuses still apply.) A brilliant energy weapon cannot harm undead, constructs, or objects. Construction",
      "requirements": "Craft Magic Arms and Armor, gaseous form , continual flame ;"
    },
    "Designating (greater)": {
      "source": "Ultimate Equipment pg. 140",
      "aura": "moderate enchantment",
      "cl": "12th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " This special ability can only be placed on ranged weapons or ammunition. Each time a ranged weapon or ammunition with this ability hits a creature, its magic designates the target. Allies gain a +4 morale bonus on melee attack rolls and a +6 morale bonus on melee damage rolls against the designated target for 1 round. Multiple successful shots fired at the same target do not increase the bonuses or their duration. Construction",
      "requirements": "Craft Magic Arms and Armor, instant enemy ( Advanced Player's Guide );"
    },
    "Nimble Shot": {
      "source": "Ultimate Equipment pg. 146",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " This special ability can only be placed on ranged weapons. A nimble shot weapon doesn't provoke attacks of opportunity when fired. Construction",
      "requirements": "Craft Magic Arms and Armor, bow spirit ( Advanced Player's Guide );"
    },
    "Second Chance": {
      "source": "Ultimate Equipment pg. 147",
      "aura": "moderate abjuration",
      "cl": "11th",
      "slot": "weapon quality;",
      "price": "",
      "enhancement": 4,
      "weight": " ",
      "Description": " This special ability can only be placed on bows. Once per round, when a shot made with this weapon misses its target, as a free action the weapon's wielder can cause that shot to swerve and try to hit the target again. The arrow fired gets a second attack at the same attack bonus as the first attack it made. Construction",
      "requirements": "Craft Magic Arms and Armor, ricochet shot ( Ultimate Combat );"
    },
    "Heart-Piercing": {
      "source": "Weapon Master's Handbook pg. 30",
      "aura": "moderate evocation",
      "cl": "10th",
      "price": "",
      "enhancement": 5,
      "weight": " ",
      "Description": " This special ability can be placed only on piercing ranged weapons. It functions as vorpal except that a heart-piercing weapon can pierce the target's heart (if it has one), killing it instantly. Construction",
      "requirements": "Craft Magic Arms and Armor, finger of death , keen edge ;"
    },
    "Interfering": {
      "source": "Ranged Tactics Toolbox pg. 26",
      "aura": "strong transmutation",
      "cl": "18th",
      "slot": "none;",
      "price": "",
      "enhancement": 5,
      "weight": " ",
      "Description": " This special ability can be placed only on ranged weapons. The wielder can make attacks of opportunity with an interfering weapon as if he threatened all spaces within the weapon's first range increment or 30 feet, whichever is closer. However, the wielder cannot make multiple ranged attacks of opportunity with an interfering weapon against a creature that moves out of multiple threatened spaces within range using a single move action, even if the wielder has Combat Reflexes or other effects that allow multiple attacks of opportunity. Construction",
      "requirements": "Craft Magic Arms and Armor, litany of warding UC ;"
    }
  }
}