{
  "orders": { 
  
    "Order of the Asp": {
      "Edicts": " An order of the asp cavalier must endeavor to enhance her prestige, wealth, and power, as well as that of her patrons. She must endeavor to maximize her profits and efficiency, directing hirelings and even sacrificing them when doing so would further her goals and make her appear exceptional by comparison.",
      "Challenge": " Whenever an order of the asp cavalier issues a challenge, she receives a +1 morale bonus on attack and damage rolls made against the target of the challenge so long as it is entangled, exhausted, fatigued, flanked, nauseated, prone, shaken, staggered, or denied its Dexterity bonus to AC. This bonus increases by 1 for every 4 levels the cavalier has.",
      "Skills": " An order of the asp cavalier adds Knowledge (local) and Sleight of Hand to her list of class skills. The cavalier gains a bonus on Knowledge (local) checks equal to half her cavalier level (minimum +1) as long as the check involves her patrons or organization. She also reduces her armor check penalty when using Sleight of Hand by an amount equal to half her cavalier level (to a minimum of 0).",
      "Order Abilities": " An order of the asp cavalier gains the following abilities.",
      "Indiscriminate (Ex)": " At 2nd level, whenever the order of the asp cavalier uses Intimidate to demoralize one or more creatures, she can attempt to demoralize an equal number of allies within 30 feet as a free action. While within 30 feet of an ally with the shaken condition, the cavalier gains a +1 morale bonus on saving throws. At 6th level and every 6 levels thereafter, this bonus increases by 1. The cavalier can perform a dirty trick combat maneuver against creatures with the shaken condition without provoking an attack of opportunity.",
      "Command the Meek (Ex)": " At 8th level, the cavalier treats all of her allies with the shaken condition as though they had the same teamwork feats as the cavalier for the purpose of determining whether the cavalier receives a bonus from her teamwork feats. Her allies do not receive any bonuses from these feats unless they actually have the feats themselves. The allies' positioning and actions must still meet the prerequisites listed in the teamwork feat for the cavalier to receive the listed bonus. When the cavalier uses tactician, greater tactician, or mighty tactician, the duration doubles for any creatures that have no more than half the cavalier's Hit Dice or that have the shaken condition when she activates the ability.",
      "Better You Than Me (Ex)": " At 15th level, the cavalier can interpose an adjacent ally in the way of an incoming attack as an immediate action, gaining cover against the attack. The attack must target only the cavalier, and she must choose to use this ability before seeing the result of the attack roll. The ally must have the shaken condition or have no more than half the Hit Dice of the cavalier, and the ally gains a Reflex save to negate this ability's effect entirely (DC = 10 + half the cavalier's level + the higher of her Strength modifier or Charisma modifier). If the attack hits, the damage is split evenly between the cavalier and the ally. If the ally's save was a natural 1, the ally takes all of the damage, including any associated effects (bleed, poison, etc.). An ally can purposefully fail this saving throw, but cannot purposefully roll a natural 1."
    },
    "Order of the Beast (ACG)": {
      "Edicts": " An order of the beast cavalier must strive to protect nature—including animals and magical beasts— from the encroachment of civilization and from those that seek to harm it. He can slay enraged animals and magical beasts only when attempts to calm or pacify them fail.",
      "Challenge": " Whenever an order of the beast cavalier issues a challenge, his mount gains a +1 circumstance bonus on melee attack rolls against the target of his challenge whenever the cavalier is threatening the target. This bonus increases by 1 for every 4 cavalier levels.",
      "Skills": " An order of the beast cavalier adds Knowledge (nature) and Survival to his list of class skills. When the cavalier uses Survival to follow tracks, he gains a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " An order of the beast cavalier gains the following abilities as he increases in level.",
      "Wild Empathy (Ex)": " At 2nd level, the cavalier can improve the attitude of an animal. This ability functions as the . The cavalier uses his level as his effective druid level when using this ability.",
      "Wild Mount Shape (Su)": " At 8th level, an order of the beast cavalier gains the ability to turn his mount into a different Medium or Large animal and back again once per day. His options for new forms include all creatures with the animal type. This ability functions as , except as noted here. The effect lasts for 1 hour per cavalier level, or until the cavalier chooses to change his mount back. Changing the mount's form (to a different animal or back to normal) requires the cavalier to touch his mount as a standard action that does not provoke an attack of opportunity. The form chosen must be that of an animal the cavalier is familiar with. The mount does not change size, but does receive the bonuses (not the penalty) presented in",
      "beast shape II": "for the Large animal. The cavalier can use this ability an additional time per day at 10th level and every 4 levels thereafter (to a maximum of four times per day at 18th level). At 15th level, the cavalier can use wild mount shape to change his mount into a Medium or Large dragon. When taking this form, the cavalier's wild mount shape now functions as , except as above.",
      "Ferocious Charge (Ex)": " At 15th level, the cavalier is the embodiment of nature's fury. When the cavalier charges a creature, he can attempt an Intimidate check to demoralize his enemy as a free action. If he succeeds, the target is frightened."
    },
    "Order of the Beast (ISC)": {
      "Edicts": " The cavalier wreaks havoc wherever he goes. An order of the beast cavalier must never show mercy and, when crossed, exacts the maximum possible revenge. The cavalier must seek out conflict at every juncture and cannot avoid a fight if provoked. That which he cannot steal, pillage, or claim, he must completely destroy or desecrate.",
      "Challenge": " Whenever an order of the beast cavalier issues a challenge, he receives a +1 morale bonus on all damage rolls while using",
      "Skills": " An order of the beast cavalier adds Disable Device (Dex) and Stealth (Dex) to his list of class skills. An order of the beast cavalier can make Disable Device checks untrained. If he has ranks in the skill, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1) when using it to sabotage, jam, or destroy a device.",
      "Order Abilities": " A cavalier belonging to the order of the beast gains the following abilities as he increases in level.",
      "Vandal (Ex)": " At 2nd level, the cavalier gains as a bonus feat. In addition, when dealing damage to objects (including when using the sunder combat maneuver), he adds half his cavalier level to the damage roll. If an order of the beast cavalier successfully breaks an object, he receives a +2 morale bonus on all attack rolls until the end of his next turn.",
      "Havoc (Ex)": " At 8th level, the cavalier's mount gains the trample monster special ability. If the cavalier's mount has trample from another source, damage from the mount's trample attack instead increases as though the mount were one size category larger (see Table 3–1 on page 302 of the",
      "Pathfinder RPG Bestiary": "); this does not alter the damage dealt by the mount's slam attack. A creature that attempts a Reflex saving throw to avoid damage from the mount's trample attack provokes an attack of opportunity from the cavalier.",
      "Unstoppable Ravager (Ex)": " At 15th level, the cavalier becomes an unstoppable engine of destruction. If the cavalier's current hit points drop below 0, he does not fall unconscious. Instead, he continues to act so long as his negative hit point total does not exceed the amount of damage he dealt to an enemy on a single melee attack during the last round. The cavalier receives no Constitution check to stabilize while using this ability, and automatically takes 1 point of damage each round. When his current negative hit points exceed his negative Constitution score, the amount of damage he must deal to continue to act is now equal to the difference between his current negative hit point total and his negative Constitution score. Additionally, the cavalier can no longer benefit from magical healing (save for a or spell), and he immediately dies once he can no longer take an action due to this ability."
    },
    "Order of the Blossom": {
      "Edicts": " The cavalier cannot refuse a fey's request for aid unless it will interfere with his existing duties, or he believes the fey seeks to directly oppose his other aims and goals. He must strive to prevent gates to the First World from being exploited or corrupted. If the cavalier encounters",
      "Challenge": " Whenever an order of the blossom cavalier issues a challenge, the target of the challenge takes a –1 penalty on saving throws against spells and spell-like abilities used by fey or by the cavalier. This penalty increases by 1 for every 4 levels the cavalier has. An order of the blossom cavalier can't issue a challenge against any creature of the fey type unless that creature has the blighted fey template.",
      "Skills": " An order of the blossom cavalier adds Disguise and Knowledge (nature) to his list of class skills. An order of the blossom cavalier can attempt Knowledge (nature) skill checks untrained. Whenever an order of the blossom cavalier attempts a Bluff check to feint in combat, he receives a bonus on the check equal to half his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the blossom gains the following abilities as he increases in level.",
      "Sneak Attack (Ex)": " At 2nd level, an order of the blossom cavalier can make a sneak attack, as the rogue ability of the same name. At 2nd level, his sneak attack damage is +1d6. This damage increases by 1d6 at 8th level and every 6 levels thereafter. If the cavalier gets a sneak attack bonus from another source, the bonus damage stacks.",
      "Fey Enchantments (Sp)": " At 8th level, an order of the blossom cavalier learns to use the following spell-like abilities: , , , and , with a caster level equal to his cavalier level. He can use these spell-like abilities a total of three times per day, in any combination (such as by casting three times, or once and twice). The saving throw DC for these spell-like abilities is 10 + half the cavalier's level + his Charisma modifier. At 16th level, the cavalier can use his spell-like abilities seven times per day, and he adds and to the list. Curse of the First World (Su): At 15th level, an order of the blossom cavalier channels pandemonium through his weapon. His melee attacks count as chaotic-aligned for the purpose of overcoming damage reduction. In addition, whenever he confirms a critical hit against a target under an enchantment effect, that target is confused for 1d6 rounds. Each round the confused creature rolls to determine its action, it rolls twice and the cavalier chooses which result to use. This is a mind-affecting effect."
    },
    "Order of the Blue Rose": {
      "Edicts": " The cavalier must guard against needless violence, protecting both the land and its people from wars they neither started nor wish to fight. He must seek to stop conflict with a minimum of bloodshed, to encourage peaceful resolutions to disagreements between intelligent creatures, and to mend the wounds opened by battle. He must also honor quarter when he gives it, protecting captives who have surrendered from his own allies if need be.",
      "Challenge": " Whenever an order of the blue rose cavalier issues a challenge, he receives a +1 morale bonus on attack rolls made against the target of his challenge, if the target is an intelligent creature to whom the cavalier offered the chance to surrender (by taking a standard action to offer terms). This bonus increases by +1 for every four levels the cavalier possesses (to a maximum of +5 at 17th level).",
      "Skills": " An order of the blue rose cavalier adds Knowledge (history) (Int) and Knowledge (nobility) (Int) to his list of class skills. Whenever an order of the blue rose cavalier uses Diplomacy to try to mediate a dispute between two parties that do not include him, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the blue rose gains the following abilities as he increases in level.",
      "Flat of the Blade (Ex)": " At 2nd level, the cavalier of the order of the blue rose gains the ability to moderate his attacks in order to take an enemy alive. He no longer takes a –4 penalty when attacking with a lethal weapon to deal nonlethal damage. When dealing nonlethal damage, the cavalier receives a +2 bonus on damage rolls. When the cavalier makes use of this ability, he must attempt to subdue his target without killing it; dealing lethal damage after using this ability, or allowing his allies to kill the target, is considered a violation of his edicts.",
      "Inner Peace (Ex)": " At 8th level, the cavalier has learned that while not all things in the world will go as he wishes, he must remain calm and centered. Once per day as an immediate action, the cavalier may ignore an amount of damage from a single source (one attack, spell, or effect) equal to his cavalier level plus his Charisma modifier. He can only ignore hit point damage in this fashion. The cavalier can use this ability one additional time per day at 12th level and every four levels thereafter (to a maximum of four times per day at 20th level).",
      "Shield of Blades (Ex)": " At 15th level, the cavalier gains an expert sense of impending violence around him. When taking the total defense action, the cavalier can extend his protection to those around him, granting a +2 circumstance bonus to AC to all adjacent allies. In addition, while taking the total defense action, as an immediate action, the cavalier can attempt to deflect an attack by making an attack roll opposed by the attacker's original attack roll. If successful, the attack is deflected and deals no damage."
    },
    "Order of the Cockatrice": {
      "Edicts": " The cavalier must keep his own interests and aims above those of all others. He must always accept payment when it is due, rewards when earned, and an even (or greater) share of loot. The cavalier must take every opportunity to increase his own stature, prestige, and power.",
      "Challenge": " Whenever an order of the cockatrice cavalier issues a challenge, he receives a +1 morale bonus on all melee damage rolls made against the target of his challenge as long as he is the only creature threatening the target (not counting his mount). This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the cockatrice cavalier adds Appraise (Int) and Perform (Cha) to his list of class skills. In addition, an order of the cockatrice cavalier adds his Charisma modifier to the DC on another creature's attempt to demoralize him through Intimidate (in addition to his Wisdom modifier, as normal).",
      "Order Abilities": " A cavalier that belongs to the order of the cockatrice gains the following abilities as he increases in level.",
      "Braggart (Ex)": " At 2nd level, the cavalier can spend a standard action to extol his own accomplishments and battle prowess. He receives as a bonus feat. He does not need a weapon in hand to use this ability. The cavalier receives a +2 morale bonus on melee attack rolls made against demoralized targets.",
      "Steal Glory (Ex)": " At 8th level, the cavalier can steal the glory from another creature's successful strike. Whenever a creature other than the cavalier scores a critical hit against a target that the cavalier is threatening, he can make an attack of opportunity against the same target.",
      "Moment of Triumph (Ex)": " At 15th level, the cavalier can, as a free action, declare a moment of triumph. For 1 round, the cavalier receives a competence bonus equal to his Charisma modifier on all ability checks, attack rolls, damage rolls, saving throws, and skill checks. This bonus is also added to his AC. In addition, any critical threats he makes are automatically confirmed. The cavalier can use this ability once per day."
    },
    "Order of the Dragon": {
      "Edicts": " The cavalier must remain loyal to his allies and must always work to further the aims of the group. He must protect his allies from harm and defend their honor when called into doubt.",
      "Challenge": " Whenever an order of the dragon cavalier issues a challenge, his allies receive a +1 circumstance bonus on melee attack rolls against the target of his challenge whenever he is threatening the target. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the dragon cavalier adds Perception (Wis) and Survival (Wis) to his list of class skills. In addition, whenever an order of the dragon cavalier uses Survival to provide food and water for his allies or to protect his allies from harsh weather, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier that belongs to the order of the dragon gains the following abilities as he increases in level.",
      "Aid Allies (Ex)": " At 2nd level, whenever an order of the dragon cavalier uses the aid another action to assist one of his allies, the ally receives a +3 bonus to his Armor Class, attack roll, saving throw, or skill check. At 8th level, and every six levels thereafter, this bonus increases by an additional +1.",
      "Strategy (Ex)": " At 8th level, the cavalier can spend a standard action to grant one of a number of bonuses to all allies within 30 feet (including himself). The allies must be able to see or hear the cavalier to receive this bonus. The cavalier can grant a +2 dodge bonus to AC for 1 round, a +2 morale bonus on all attack rolls for 1 round, or the ability to move up to their speed as an immediate action once. The cavalier can grant a different bonus to each ally within range, but allies can only benefit from this ability once per combat.",
      "Act as One (Ex)": " At 15th level, the cavalier can spend a standard action to move up to his speed and make a melee attack. All allies within 30 feet can also move up to their speed and make a melee attack as an immediate action. This movement and attack can be made as a charge if the movement qualifies. All attacks are made at a +2 bonus (this stacks with the bonus from a charge) and all participants receive a +2 dodge bonus to their AC for 1 round. A cavalier can use this ability once per combat."
    },
    "Order of the Eastern Star": {
      "Edicts": " The cavalier must preserve the secrets of his order while acting to protect civilization against occult threats. He must thwart the schemes of otherworldly horrors and must give his order a full accounting of any potential threats.",
      "Challenge": " Whenever a cavalier of the order of the eastern star issues a challenge, he receives a +1 dodge bonus to AC and a +1 insight bonus on saves against the attacks and abilities of the target of his challenge. He must be wearing light armor and carrying no more than a light load to receive these bonuses. These bonuses increase by 1 for every 4 class levels the cavalier possesses.",
      "Skills": " A cavalier belonging to the order of the eastern star adds Knowledge (arcana) and Knowledge (planes) to his class skills. He can attempt Knowledge (arcana) and Knowledge (planes) checks untrained. If he has ranks in these skills, as long as a check involves knowledge of the occult or supernatural, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Feats": " A cavalier of this order gains",
      "Order Abilities": " A cavalier belonging to this order gains the following abilities as he increases in level.",
      "Guarded (Ex)": " At 2nd level, the cavalier gains DR 1/— and a +2 morale bonus on saving throws when wearing light armor or no armor and fighting defensively or using . At 6th level and every 4 levels thereafter, this DR increases by 1. He loses the benefits of this ability if carrying a medium or heavier load.",
      "Pierce the Guard (Ex)": " At 8th level, when attacking with a light or one-handed weapon, the cavalier ignores the penalty for fighting defensively or using on his first melee attack roll each round. If fighting with two weapons, he ignores the penalty for the first attack with each weapon, as long as the off-hand weapon is a light weapon. The cavalier can't use this ability with double weapons.",
      "One Purpose (Ex)": " At 15th level, the cavalier's mount shares the benefits of the cavalier's guarded ability as long as both are wearing light or no armor and carrying no more than a light load. The cavalier must fight defensively or use to grant these benefits, but the mount need not. In addition, the mount gains all the benefits of the cavalier's challenge, regardless of what barding it wears."
    },
    "Order of the Eclipse": {
      "Edicts": " The samurai cannot create light where it is not necessary—anything that can be done in darkness should be. The samurai must belong to a military organization (within Kaoling this is likely to be a warband commanded by a senior samurai, who in turn answers to Warlord Tsung-cha Kavangaki or one of the Council of Nine). The samurai must enforce his place within this order and societies that recognize its authority, obeying those senior to him without question and demanding total obedience from those beneath him. The samurai must take every opportunity to extinguish the lights of his foes.",
      "Challenge": " The order of the eclipse samurai gains a +1 bonus on all Intimidate checks made against the target of his challenge. This bonus increases by 1 for every four levels the samurai possesses.",
      "Skills": " An order of the eclipse samurai adds Perception (Wis) and Survival (Wis) to his list of class skills. In addition, whenever he makes a Perception check to notice an invisible creature or object, he receives a bonus on the check equal to 1/2 his samurai level (minimum +1).",
      "Order Abilities": " A samurai that belongs to the order of the eclipse gains the following abilities as he increases in level.",
      "Dark Rider (Su)": " At 2nd level, whenever the samurai is on his mount, both he and his mount share any of the following senses if either of them possesses it: darkvision, low-light vision, scent, and see in darkness. This applies regardless of the source of the sense (including senses gained from spells or magic items), but only while the samurai is mounted. If the samurai and mount both have a sense but one has an improved version (such as a samurai with darkvision with a range of 60 feet riding a mount that has darkvision with a range of 90 feet), both receive the improved version of the sense.",
      "Eclipsing Blade (Sp)": " At 8th level, the samurai can cast on a weapon he is holding. The does not affect the vision of any order of the eclipse samurai, or that of their mounts. The spell immediately ends if the weapon leaves the samurai's hand. He may do this once per day, plus one additional time per day for every four levels he possesses above 8th (to a maximum of four times per day at 20th level).",
      "See in Darkness (Ex)": " At 15th level the samurai can see perfectly in darkness, even magical darkness, as the universal monster ability of the same name."
    },
    "Order of the Eel": {
      "Edicts": " The cavalier must greet all strangers with an open mind and show a willingness to cooperate with others. The cavalier must never turn down the opportunity to forge alliances or strike bargains, so long as the terms of such agreements remain fair. The cavalier must punish those who have reneged on bargains struck with the cavalier or others of his order.",
      "Challenge": " Whenever an order of the eel cavalier issues a challenge, allies of a different race than the cavalier receive a +1 circumstance bonus on attack rolls against the target of his challenge whenever he is threatening the target. This bonus increases by +1 for every 4 levels the cavalier has.",
      "Skills": " An order of the eel cavalier adds Knowledge (local) (Int) and Perception (Wis) to his list of class skills. An order of the eel cavalier can attempt Knowledge (local) skill checks untrained. In addition, whenever an order of the eel cavalier uses Diplomacy to negotiate the terms of an agreement, he receives a bonus on the check equal to half his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the eel gains the following abilities as he increases in level.",
      "Temporary Alliance (Ex)": " At 2nd level, an order of the eel cavalier gains the ability to create a meaningful, if temporary, alliance with another individual. As a full-round action, the cavalier enters into an alliance with a willing creature that has an Intelligence score of 4 or higher. The creature thereafter receives a +1 competence bonus on attack rolls against targets the cavalier threatens and on saving throws against spells and effects generated by those targets. These bonuses last for 1 hour for every 2 cavalier levels the order of the eel cavalier has or until the cavalier creates a new alliance with a different creature. A cavalier can have only one alliance active at a time; if he creates a new alliance while under the effects of an existing alliance, the existing alliance immediately ends and the new one takes effect.",
      "Rally Allies (Ex)": " At 8th level, an order of the eel cavalier inspires diverse groups of allies against their common enemies, bringing them together based on their similarities while downplaying their differences. As a swift action, the cavalier can grant a competence bonus on weapon damage rolls to all allies within 30 feet. The bonus is equal to the number of distinct races in the ally group, including the cavalier's race, up to a maximum bonus equal to the cavalier's Charisma modifier (minimum +1). This bonus lasts for 1 round. The cavalier can use this ability once per day, plus one additional time per day at 12th level and every 4 levels thereafter.",
      "Share the Danger (Su)": " At 15th level, an order of the eel cavalier can form a pact to share danger with an ally. As a full-round action, the cavalier enters into this pact with a willing creature that has an Intelligence score of 4 or higher. The cavalier and his partner each gain a deflection bonus to AC equal to the cavalier's Charisma modifier (minimum +1). A partner that takes damage from attacks and effects that deal hit point damage (including from special abilities) takes only half damage, and the other half of the damage is dealt to the other partner in the pact. Forms of harm that do not involve hit points, such as charm effects, ability score damage and drain, negative levels, and death effects, are not affected. If either partner in the pact suffers a reduction of hit points from a lowered Constitution score, the reduction is not split, as it is not hit point damage. This effect ends if the cavalier makes a new pact (at which point the existing pact immediately ends), if the partners in the pact move more than 1,000 feet apart, or if either partner in the pact takes a swift action to dissolve the partnership. Damage already divided is not reassigned when the pact ends."
    },
    "Order of the Ennead Star": {
      "Edicts": " The cavalier is a merciless champion of the law, and if he must crush dreams, coerce obedience, or slay in the name of law, that is a small price to pay for peace and progress. The cavalier must bring lawbreakers to justice, and when that is not possible, he must serve as executioner of that justice. He must also uphold the tenets of his",
      "Challenge": " An order of the Ennead Star cavalier gains bonuses when he challenges a creature of chaotic alignment with an Intelligence score of 3 or higher or one that the cavalier has witnessed committing a crime against local laws within the past hour. Against such a targets of his challenge, he receives a +1 morale bonus on attack rolls. He also gains this bonus on Intimidate checks to demoralize such targets. This bonus increases by 1 for every 4 class levels that the cavalier has.",
      "Skills": " An order of the Ennead Star cavalier adds Knowledge (local) (Int) and Perception (Wis) to his list of class skills. Additionally, he gains a circumstance bonus on Perception checks to act in a surprise round equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the Ennead Star gains the following abilities as he increases in level.",
      "Oppress (Sp)": " At 2nd level, when the cavalier deals damage to an opponent with his , as a swift action he learns whether that creature's alignment is chaotic, as if he had cast and studied the creature for 3 rounds. Additionally, if he learns that a creature is chaotic by using this ability, he gains a +1 morale bonus on attack rolls against it. This bonus does not stack with itself, but it does stack with the bonus from the cavalier's challenge.",
      "Subjugate (Ex)": " At 8th level, whenever the cavalier confirms a critical hit with a melee weapon against a creature of chaotic alignment with an Intelligence score of 3 or higher, or against a creature that the cavalier has witnessed committing a crime within the past hour, he adds his Charisma modifier to the total critical hit damage. If the critical hit kills the creature or renders it unconscious, as an immediate action the cavalier can attempt an Intimidate check to demoralize all foes within 15 feet who can see him. This ability can be used only once per combat.",
      "Hand of the Law (Ex)": " At 15th level, the cavalier can declare himself an enforcer of martial law as a swift action. For a number of rounds equal to his Charisma modifier, the cavalier can ignore difficult terrain and gains an additional +2 bonus on attack rolls while charging. Any creatures the cavalier demoralizes while this ability is in effect are shaken for a number of additional rounds equal to the cavalier's Charisma modifier. Additionally, when these creatures attack the cavalier, attempt saving throws against the cavalier's abilities, or attempt opposed skill checks against the cavalier, they take a –3 penalty for being shaken (instead of –2). A cavalier can use this ability only once per combat."
    },
    "Order of the First Law": {
      "Edicts": " The cavalier must strive to protect atheists and all those who reject the gods. He must never have a patron deity or willingly serve agents of the divine. He must protect the common folk from suffering due to the actions of divine agents.",
      "Challenge": " Whenever an order of the First Law cavalier issues a challenge, each round that he makes an attack against the target of his challenge, he gains 1 temporary hit point on his turn. These temporary hit points last up to 1 hour. The number of temporary hit points gained per round increases by 1 for every 4 levels the cavalier possesses.",
      "Skills": " An order of the First Law cavalier adds Heal (Wis) and Knowledge (religion) (Int) to his list of class skills. An order of the First Law cavalier can attempt Knowledge (religion) skill checks untrained. If he has ranks in the skill, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1) when making checks to identify members of religious faiths or religious paraphernalia.",
      "Order Abilities": " A cavalier belonging to the order of the First Law gains the following abilities as he increases in level.",
      "Rejection of Faith (Ex)": " At 2nd level, the cavalier must refuse all divine magic, including helpful effects or spells. As long as he has not benefited from divine magic in the past 24 hours, he receives a +2 morale bonus on one saving throw of his choice. Each day he can change the saving throw to which this bonus applies.",
      "Threat of Reason (Ex)": " At 8th level, whenever the cavalier threatens a space occupied by a divine spellcaster, the spellcaster must add 4 to the DC of any concentration checks, dispel checks, or caster level checks she attempts.",
      "Godslayer (Ex)": " At 15th level, whenever the cavalier makes a melee attack against the target of his challenge and that target is a divine spellcaster, the cavalier gains a bonus on attack and damage rolls equal to his Charisma modifier. This damage is multiplied on a critical hit."
    },
    "Order of the Flame": {
      "Edicts": " The cavalier must pursue glory for himself and those with whom he associates. He must strive to heap glory upon his name, no matter the costs. He must challenge and defeat an ever-increasing host of rivals to further cement his illustrious reputation.",
      "Challenge": " A cavalier of the order of the flame becomes ever more emboldened with each glorious victory. As an immediate action after reducing the target of his challenge to 0 hit points or fewer, the cavalier can elect to issue a glorious challenge to an opponent within 15 feet.",
      "Skills": " A cavalier of the order of the flame adds Knowledge (local) and Survival to his class skills. Whenever the cavalier's current hit point total matches or exceeds his maximum hit point total, he gains a bonus on Intimidate checks equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier of the order of the flame gains the following abilities as he increases in level.",
      "Glorious Challenge": " A glorious challenge does not count against the cavalier's number of challenges per day, but otherwise acts like a cavalier's challenge class feature. When he issues a glorious challenge, the cavalier takes a –2 penalty to AC for the duration of the glorious challenge (this penalty stacks with the usual –2 AC penalty against opponents other than the target of the cavalier's challenge). The cavalier gains a morale bonus on melee damage rolls against the target of his glorious challenge equal to 2 × the number of consecutive glorious challenges he has issued thus far. As long as he continues to defeat targets of his glorious challenges and there are more opponents in range, the cavalier can continue to issue glorious challenges indefinitely, with the penalty to AC and the bonus on damage rolls increasing with each subsequent foe. For example, a 5th-level cavalier that has just issued his third glorious challenge after defeating the original target of his challenge takes a –6 penalty to AC (–8 against creatures other than the target of his glorious challenge) and gains a +11 bonus on melee damage rolls (a +5 bonus from his base challenge ability plus a +6 morale bonus for three consecutive glorious challenges). : A cavalier of the order of the flame adds Knowledge (local) and Survival to his class skills. Whenever the cavalier's current hit point total matches or exceeds his maximum hit point total, he gains a bonus on Intimidate checks equal to 1/2 his cavalier level (minimum +1). : A cavalier of the order of the flame gains the following abilities as he increases in level.",
      "Foolhardy Rush": " At 2nd level, the cavalier can charge across the battlefield at a moment's notice. Whenever the cavalier attempts an initiative check, as long as he rolls an 11 or higher on the die, he can move up to his base speed as an immediate action and he is not considered flat-footed. If the cavalier takes an action to move during his next turn, he subtracts the number of feet moved during the initiative check from his total movement.",
      "Daunting Success": " At 8th level, whenever the cavalier confirms a critical hit with a melee weapon, as an immediate action he can attempt an Intimidate check to demoralize all foes within 15 feet who can see him. This ability can be used only once per combat.",
      "Blaze of Glory": " At 15th level, the cavalier can declare a blaze of glory as a standard action. For a number of rounds equal to his Charisma modifier, the cavalier increases his base speed by 10 feet, can ignore difficult terrain while charging, and gains a +4 bonus on his attack rolls (instead of +2). A cavalier can use this ability only once per combat."
    },
    "Order of the Green": {
      "Edicts": " The cavalier knows his place in the natural order and strives to defend the balance of nature. He must be willing to allow nature to take its course, and he must stop all those who would do harm to its delicate balance. He will not tolerate aberrant creatures, undead, or the irresponsible and greedy consumption of natural resources. He may be farsighted and seek to establish agreements that lead to lasting protection of the natural world, but resorts to violence if it is the most effective way to enforce such protection.",
      "Challenge": " An order of the Green cavalier can't issue a challenge against any creature of the animal or plant type. Whenever he issues a challenge, he receives a +1 morale bonus on attack rolls against the target of his challenge. This bonus increases by 1 for every 4 levels the cavalier has. If the target of his challenge is of the aberration or undead type, each round he can roll his first attack roll against the target creature twice and take the higher result.",
      "Skills": " An order of the Green cavalier gains Knowledge (nature) and Survival as class skills. In addition, whenever an order of the Green cavalier attempts a Survival check to track foes of the aberration or undead type, he receives a bonus on the check equal to half his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the Green gains the following abilities.",
      "Favored Terrain (Ex)": " At 2nd level, an order of the Green cavalier chooses a favored terrain from the list of . He gains this as a favored terrain, as the ranger class feature of the same name. At 8th level and every 6 levels thereafter, he selects another favored terrain. In addition, at each such interval, the skill bonus in any one favored terrain (including the one just selected, if so desired) increases by 2.",
      "Cut the Corruption (Su)": " At 8th level, an order of the Green cavalier can touch a weapon and enhance it as a free action once per day. For 1 minute, the weapon glows with a deep-green light and deals an additional 1d6 points of damage against aberrations and undead. This damage does not stack with the additional damage granted by the weapon special ability. At 16th level, the cavalier can use this ability a second time each day.",
      "End of the Cycle (Su)": " At 15th level, things killed by an order of the Green cavalier tends to stay dead. When the cavalier kills a creature, it is treated as if it were killed by a death effect for the purposes of magic that can restore it to life. In addition, it's placed under the effects of a permanent effect (using the cavalier's level as the spell's caster level)."
    },
    "Order of the Guard": {
      "Edicts": " An order of the guard cavalier must strive to protect his ward to the best of his ability, even if doing so costs the cavalier his life. The cavalier must always receive some compensation for his services, be it money, a favor, or other payment. A member of the order of the guard must carry out the orders stipulated in his contract or dictated by his employer as long as doing so does not violate other elements of the order's code or a previously agreed upon contract.",
      "Challenge": " At the start of each day, an order of the guard cavalier must declare a person or object (including an easily defined group of objects, such as a series of chests or a collection of books) that he is dedicated to protecting that day, typically the subject he has been hired to protect; the selected item is known as the cavalier's ward. Whenever the cavalier issues a challenge, he receives a +1 morale bonus to AC against the target of his challenge so long as the cavalier is physically located between his ward and the target. This bonus increases by 1 for every 4 levels the cavalier possesses.",
      "Skills": " An order of the guard cavalier adds Knowledge (geography) and Perception to his list of class skills. Additionally, an order of the guard cavalier receives a bonus on Knowledge (nobility) checks equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " An order of the guard cavalier gains the following abilities as he increases in level.",
      "Prepared for the Journey (Ex)": " At 2nd level, the cavalier can prepare for the terrain through which he will be traveling with 48 hours of study and customization of his equipment. He can select any terrain type from the list available to a . While in the selected terrain, the cavalier gains a +2 bonus on initiative checks and on Knowledge (geography), Perception, Stealth, and Survival skill checks. At 8th level and every 6 levels thereafter, this bonus increases by 1. Additionally, when calculating overland movement speed in the selected terrain, the cavalier and his mount treat trackless terrain as though it contains a road or trail, and terrain with a road or trail as though it were a highway. If traveling along a highway, the cavalier and his mount can travel for 10 hours before needing to attempt Constitution checks for a forced march.",
      "Close at Hand (Ex)": " At 8th level, when the cavalier is within 30 feet of his ward, he gains a +1 morale bonus on attack rolls, damage rolls, and saving throws. If his ward is captured, stolen, or otherwise in the possession or control of the cavalier's enemies, the cavalier loses these benefits. In their place, he gains the effects of a or spell (depending on the nature of his ward) targeting his ward and lasting 24 hours. When moving toward his ward, the cavalier and his mount increase their speed by 10 feet. At 12th level and every 4 levels thereafter, the bonus on attack and damage rolls and on saving throws increases by 1 and the bonus to speed increases by 5 feet.",
      "Quick Retort (Ex)": " At 15th level, the cavalier can strike out at those who mean his ward harm. Whenever a creature attacks the cavalier's ward, or attempts to steal, sunder, or otherwise wrest control of it from the cavalier or his allies, the attacking creature provokes an attack of opportunity from the cavalier. The cavalier receives a +2 bonus on attacks of opportunity he makes against such creatures."
    },
    "Order of the Hammer": {
      "Edicts": " The cavalier must continually strive to prove her own strength as well as the strength of those she is allied with, especially when faced with adversity or by those who would seek to best the cavalier's brawn.",
      "Challenge": " An order of the hammer cavalier can attempt a free grapple check or free sunder combat maneuver check anytime she takes the full-attack action against the target of her challenge. This free combat maneuver does not provoke an attack of opportunity.",
      "Skills": " An order of the hammer cavalier adds Acrobatics (Dex) and Knowledge (local) (Int) to her list of class skills. In addition, whenever the cavalier uses Acrobatics to jump, she can add her Strength bonus to the check in addition to her Dexterity modifier, and she receives a bonus on Acrobatics checks to jump equal to 1/2 her cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the hammer gains the following abilities as she increases in level.",
      "Mighty Bash (Ex)": " At 2nd level, the cavalier does not provoke attacks of opportunity when she attacks foes while unarmed so long as she is dealing nonlethal damage. In addition, the cavalier's unarmed strikes deal more nonlethal damage than usual; she is treated as having a number of equal to her cavalier level for the purpose of determining how much nonlethal damage her unarmed strikes deal. For example, a 12th-level cavalier of the order of the hammer would deal 2d6 points of nonlethal damage with her unarmed strike. The cavalier must still select the feat if she wants to deal lethal damage with her unarmed strike, and lethal damage dealt with her unarmed strike is not increased by this ability.",
      "Crushing Grapple (Ex)": " At 8th level, the cavalier gains as a bonus feat, even if she does not meet the prerequisites. She does not take the –5 penalty on grapple checks to put an opponent in a chokehold.",
      "Inspiring Flex (Ex)": " At 15th level, the cavalier can display her own brawn to inspire greater strength in his allies. As a standard action, she can grant herself and any allies within 30 feet a +4 morale bonus on melee attack rolls, combat maneuver checks, Fortitude saves, and Strength checks. The cavalier can maintain her inspiring flex as a free action, and she can use this ability for a number of rounds per day equal 1/2 her cavalier level; this duration need not be continuous."
    },
    "Order of the Hero": {
      "Edicts": " The cavalier must choose an area, whether it's a settlement or nation, and vows to slay any monster threatening that area. He must fulfill any pledge he makes to slay a beast, tracking it to its lair if necessary, and forsaking any new quarry until his current target is slain. The cavalier must attempt to ensure that no lasting damage is dealt to his domain in the pursuit of his prey.",
      "Challenge": " Whenever an order of the hero cavalier issues a challenge, he receives a +1 morale bonus on melee damage rolls against the target of his challenge if it is at least one size category larger than he is. This bonus increases by 1 for every 4 cavalier levels he has.",
      "Skills": " An order of the hero cavalier adds Knowledge (arcana) (Int) and Knowledge (nature) (Int) to his list of class skills. In addition, whenever an order of the hero cavalier uses a Knowledge check to identify a monster, he gains a bonus on this check equal to half his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier who belongs to the order of the hero gains the following abilities as he increases in level.",
      "Monster Expert (Ex)": " At 2nd level, the cavalier learns how to dodge the attacks of his monstrous foes and the traps in their lairs. He gains a bonus equal to his Charisma bonus on Fortitude and Reflex saves against abilities and spells that have an area of effect.",
      "Resist Energy (Su)": " At 8th level, the cavalier can steel himself against harmful energies. Once per day as a move action, he chooses one of the following: acid, cold, electricity, or fire. He gains energy resistance 5 against the chosen type for 1 minute. At 12th, 16th, and 20th levels, the resistance increases by 5, and the cavalier gains an additional daily use of this ability.",
      "Counterstriking Challenge (Ex)": " At 15th level, once per day when he challenges a Large or larger creature, the cavalier can also prepare to interrupt the creature's special attacks. The challenged target provokes an attack of opportunity from the cavalier whenever it activates an extraordinary or a supernatural attack (such as a breath weapon or gaze attack). If the cavalier deals damage with this attack, the creature must succeed at a Will save (DC = 10 + half the cavalier's level + his Charisma modifier) or it fails to activate the special attack and loses the action it took to do so. The cavalier can perform three such attacks of opportunity over the course of a counterstriking challenge."
    },
    "Order of the Land": {
      "Edicts": " The cavalier must always strive to protect the common folk from the depredations of oppressive regimes. He must not decline any duty or mission because he is not properly equipped for it.",
      "Challenge": " Whenever an order of the land cavalier issues a challenge, he receives a +1 morale bonus on ranged attack rolls against the target of his challenge. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the land cavalier adds Knowledge (local) (Int) and Survival (Wis) to his list of class skills. In addition, whenever an order of the land cavalier makes a Survival check to avoid getting lost, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the land gains the following abilities as he increases in level.",
      "Adaptive Strike (Ex)": " At 2nd level, the cavalier receives as a bonus feat. As a swift action, he can cause an armed opponent to become flat-footed against any attacks he makes during that round with an improvised weapon. This ability can be used once per combat.",
      "Terrain Training (Ex)": " At 8th level, the cavalier may select a terrain type from the . As a standard action, he can shout orders that grant all allies within 60 feet a competence bonus equal to his Charisma modifier on initiative checks and Knowledge (geography), Perception, and Survival checks while they are in this terrain for a number of rounds equal to 1/2 his cavalier level. At 12th level and every four levels thereafter, the cavalier may select a new terrain type that this ability can affect.",
      "Wild Charge (Ex)": " At 15th level, the cavalier and his mount can ignore difficult terrain for the purpose of making a charge attack. In addition, if the charge attack is successful and both he and his opponent are occupying squares with difficult terrain, the cavalier gains a +2 competence bonus when using his mighty charge ability to make a bull rush, disarm, sunder, or trip combat maneuver."
    },
    "Order of the Lion": {
      "Edicts": " The cavalier must protect the life and lands of his sovereign at all costs. He must obey the commands of his sovereign without question. He must strive to expand the power and prestige of his realm.",
      "Challenge": " Whenever an order of the lion cavalier issues a challenge, he receives a +1 dodge bonus to his AC against attacks made by the target of his challenge. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the lion cavalier adds Knowledge (local) (Int) and Knowledge (nobility) (Int) to his list of class skills. An order of the lion cavalier can make Knowledge (nobility) skill checks untrained. If he has ranks in the skill, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1) as long as the check involves his sovereign.",
      "Order Abilities": " A cavalier belonging to the order of the lion gains the following abilities as he increases in level.",
      "Lion's Call (Ex)": " At 2nd level, an order of the lion cavalier gains the ability to rally his allies. As a standard action, he can give an encouraging speech which grants all allies within 60 feet a competence bonus on their saving throws against fear equal to his Charisma modifier and a +1 competence bonus on attack rolls for a number of rounds equal to his cavalier level. If an ally within range is under the effect of a spell or ability that causes him to be frightened or panicked, he can immediately make another saving throw to resist the effect (if allowed).",
      "For the King (Ex)": " At 8th level, an order of the lion cavalier can call out to his allies, inspiring them to greatness. As a swift action, the cavalier can grant a competence bonus equal to his Charisma modifier on all attack and damage rolls to all allies within 30 feet. This bonus lasts for 1 round. This ability can be used once per combat.",
      "Shield of the Liege (Ex)": " At 15th level, an order of the lion cavalier can protect those around him. Allies that are adjacent to the cavalier receive a +2 shield bonus to their AC. In addition, as an immediate action, the cavalier can redirect an attack made at a creature adjacent to himself, as long as the creature making the attack is within the cavalier's reach. This ability must be declared before the attack roll is made. The attack is made against the cavalier's AC and defenses, even if the creature could not normally reach or attack the cavalier. The cavalier loses any cover or concealment bonuses when subject to the redirected attack."
    },
    "Order of the Monument": {
      "Edicts": " The cavalier must strive to protect the settlement, all those who reside within it, and those travelers who hail from it. He must adhere to the settlement's laws even while away from its borders and promote its populace's overarching ideals and values whenever possible.",
      "Challenge": " Whenever an order of the monument cavalier issues a challenge, he gains a +1 dodge bonus to his AC against attacks made by the target of his challenge when the cavalier is flanked, as well as a +1 morale bonus on saving throws against fear and mind-affecting effects. This bonus increases by 1 for every 4 levels the cavalier has.",
      "Skills": " An order of the monument cavalier adds Knowledge (local) and Knowledge (religion) to his list of class skills. An order of the monument cavalier chooses one of these two skills. He can attempt skill checks with his chosen skill untrained. If he has ranks in the skill, he receives a bonus on the check equal to half his cavalier level (minimum +1) as long as the check involves his chosen settlement or a faith with a significant presence in his chosen settlement.",
      "Order Abilities": " A cavalier belonging to the order of the monument gains the following as he increases in level.",
      "Sworn Defender (Ex)": " At 2nd level, the cavalier gains a +1 morale bonus on saving throws to resist effects created by creatures whose alignments are at least two steps away from his settlement's alignment (e.g., a cavalier of a lawful good settlement and an opponent of neutral alignment). If the creature's alignment is three or more steps away from his settlement's alignment, the bonus increases to +2.",
      "Protector of the People (Ex)": " At 8th level, the cavalier can inspire the people around him as a swift action. Each creature within 30 feet that is either a resident of his chosen settlement or whose alignment is within one step of the cavalier's settlement gains a morale bonus on saving throws equal to the cavalier's Charisma modifier for 1 round. This bonus doubles if a creature meets both requirements. The cavalier can use this ability once per day, plus one additional time per day at 12th level and every 4 levels thereafter.",
      "Bastion of the Monument (Ex)": " At 15th level, the cavalier defends his homeland with unmatched ferocity. As a swift action, the cavalier can declare an opponent an enemy of his settlement. This grants the cavalier and his allies a +4 bonus on attack rolls, damage rolls, and ability and skill checks against the opponent, as well as on saving throws to resist effects originating from that opponent. The cavalier can end this ability as a swift action. He can use this ability for a number of rounds per day equal to half his cavalier level. This duration need not be continuous but must be used in 1-round increments."
    },
    "Order of the Paw": {
      "Edicts": " The cavalier must strive to protect his community from rampaging monsters and fearsome conquers alike. His first priority is to aid halfling communities, but he also is sworn to protect those who cannot protect themselves from such threats in the wild. He must never take any action that would put a halfling community or an innocent creature in jeopardy. An order of the paw cavalier must take either a wolf or a dog as his mount.",
      "Challenge": " Whenever an order of the paw cavalier issues a challenge, his mount gains a +1 dodge bonus to AC as long it is threatening the target of the cavalier's challenge and the cavalier is riding the mount. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the paw cavalier adds Knowledge (nature) and Survival to his list of class skills. He can make Knowledge (nature) checks untrained. Also, an order of the paw cavalier is adept at following tracks while mounted, using his mount's speed rather than his own to determine the penalty for tracking while moving, whether he is mounted or not.",
      "Order Abilities": " A cavalier belonging to the order of the paw gains the following abilities as he increases in level.",
      "Danger Ward (Ex)": " At 2nd level, the cavalier can ready his allies for impending danger. As a standard action, he can ready all allies within 30 feet of the danger ahead, granting a bonus on a single type of saving throw (Fortitude, Reflex or Will) that he chooses when he grants this boon. At any point in the next minute, when these allies fail a saving throw of that type, they can choose to reroll the saving throw with a +4 competence bonus as an immediate action, but must take the results of the reroll even if it is worse. He can use this ability up to three times per day, once for each type of saving throw.",
      "Canine Ferocity (Ex)": " At 8th level, when the cavalier uses his wolf or dog mount to perform a bull rush or overrun maneuver, the mount is considered to be one size category larger for the purposes of determining the size of creature it is maneuvering against and the mount's CMB. He also receives a bonus feat, chosen from the following list: , , , , , or . He must qualify for the feat selected.",
      "Giant Slayer (Ex)": " At 15th level, when the cavalier hits the target of his challenge with a melee attack, and that target is at least two size categories larger than the cavalier, he gains a bonus on damage rolls equal to 1/2 his cavalier level. This damage is multiplied on a critical hit."
    },
    "Order of the Penitent": {
      "Edicts": " The cavalier must be merciful to wrongdoers and show unfettered fairness whenever he passes judgment. He must assume that only the most heinous monsters are irrevocably evil, and must deliver all foes capable of fair trial to the appropriate local law enforcers.",
      "Challenge": " Whenever an order of the penitent cavalier issues a challenge, he receives a +1 morale bonus to his CMD against combat maneuvers made by the target of his challenge whenever he is threatening the target. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the penitent cavalier adds Escape Artist (Dex) and Sense Motive (Wis) to his list of class skills. Whenever he makes an Escape Artist check, the cavalier may add his Strength bonus to the check in addition to his Dexterity modifier.",
      "Order Abilities": " An order of the penitent cavalier gains the following abilities as he increases in level.",
      "Expert Captor (Ex)": " At 2nd level, as long as he has rope, the cavalier can tie up a grappled opponent, even if the opponent is not pinned, otherwise restrained, or unconscious, and he does not take the usual –10 penalty on his combat maneuver check to do so. When determining the DC to escape bonds secured by the cavalier, the cavalier's Combat Maneuver Bonus increases by 1/2 his cavalier level.",
      "Adept Disarmer (Ex)": " At 8th level, the cavalier gains as a bonus feat. In addition, whenever he makes a successful disarm check, as long as he has at least one hand free and the dropped item can be held in one hand, he can automatically pick up the dropped item in his free hand.",
      "Saving Grace (Ex)": " At 15th level, whenever he would strike a creature with a melee attack that deals lethal damage and would bring the creature's hit points below 0, the cavalier can, as a free action, change the type of damage dealt to nonlethal damage. The cavalier can use this ability once per round."
    },
    "Order of the Reins": {
      "Edicts": " The cavalier must do everything in his power to keep a caravan or traveling group safe once he has agreed to protect it. He must see that any allied animal injured under his watch is healed, or personally give it a merciful death if survival is not an option. He must not let any animal under his command suffer needlessly.",
      "Challenge": " Whenever an order of the reins cavalier issues a challenge, all allied animals, animal companions, familiars, and mounts within 60 feet gain a +1 bonus on attack rolls and a +2 bonus to AC against the target. This bonus increases by 1 for every additional 4 levels the cavalier has.",
      "Skills": " An order of the reins cavalier adds Appraise and Perception to his list of class skills. Any animal that the cavalier is riding can use the cavalier's Handle Animal modifier in place of its own Acrobatics and Swim skill modifiers as long as the cavalier is mounted on it.",
      "Order Abilities": " A cavalier belonging to the order of the reins gains the following abilities as he increases in level.",
      "Control the Herd (Ex)": " At 2nd level, the cavalier can direct multiple animals with one forceful command. The cavalier can handle a number of nonhostile, riderless animals equal to his cavalier level with a single use of the Handle Animal skill, so long as the commanded animals can see or hear the cavalier. The handled animals must all be ordered to perform the same trick. If an animal in the group does not know the trick the cavalier is commanding them to perform, the cavalier is considered to be pushing that animal. The cavalier cannot use this ability on animals more than two size categories smaller than he is. Using this ability requires a move action, though if the cavalier is pushing any animal as described above, it requires a full-round action.",
      "Teamwork Tricks (Ex)": " At 8th level as a free action, the cavalier can use control the herd to handle allied and riderless animals and animal companions. Friendly and helpful animals that the cavalier commands with Handle Animal or his control the herd ability are considered to know any tasks or tricks the cavalier's mount knows, in addition to any tasks or tricks they already know.",
      "Stampede (Ex)": " At 15th level, as a standard action, the cavalier can incite any riderless and nonhostile animals and animal companions within 60 feet of him to stampede. Each affected creature gains a +4 bonus to AC (this bonus stacks with the benefits of the cavalier's challenge), the trample universal monster rule, and a bonus to damage equal to half the cavalier's level for 1 round. The save DC against an incited animal's trample attack is 10 + half the cavalier's level + his Charisma modifier. Incited creatures attack whatever targets the cavalier directs them to unless commanded otherwise by a bonded master (in the case of a familiar or animal companion)."
    },
    "Order of the Saddle": {
      "Restriction": " Only horse-riding cavaliers are eligible to join this order.",
      "Edicts": " The cavalier must care for her mount before herself. She must show mercy to any noncombatants or less intelligent creatures who serve her opponents. She must teach any who ask about how to better communicate with their mounts. The only meat she may eat must come from animals that have been humanely raised and slaughtered. She must strive to ensure her community lives in harmony with the land it occupies and that it doesn't cause unnecessary suffering to the animals under its care.",
      "Challenge": " Whenever an order of the saddle cavalier issues a challenge and is astride her mount, she can charge the target of her challenge—moving and attacking as if with a standard charge—and then move again as if using",
      "Skills": " An order of the saddle cavalier adds Knowledge (nature) and Perception to her list of class skills. When she uses Survival to track a creature or find food and water for herself and her mount, she receives a bonus on the check equal to 1/2 her cavalier level (minimum +1).",
      "Order Abilities": " A cavalier that belongs to the order of the saddle gains the following abilities as she increases in level.",
      "Mounted Synergy (Ex)": " At 2nd level, the cavalier receives as a bonus feat and, whenever she is mounted, gains a +2 bonus on initiative checks as long as her mount is conscious and mobile.",
      "Stalwart Mount (Su)": " At 8th level, the cavalier's mount becomes healthier and more robust. It gains as a bonus feat (if it already has , or takes this as a feat later, the hit points granted by the feat are doubled) and gains a +2 bonus on saving throws.",
      "Protective Partner (Ex)": " At 15th level, the cavalier wreaks terrible vengeance on those who would try to harm her mount. Whenever an opponent attacks the cavalier's mount, the attacking creature provokes an attack of opportunity from the cavalier. The cavalier receives a +2 bonus on attack rolls and damage rolls when she makes these attacks of opportunity."
    },
    "Order of the Scales": {
      "Edicts": " The cavalier must fulfill all binding agreements he makes with others. If a bargain becomes impossible to fulfill, he must satisfactorily compensate all aggrieved or adversely affected parties involved in the bargain. When serving as a judge or arbiter, the cavalier must make fair, impartial judgments, and if unable to do so, must recuse himself at the earliest possibility. If authorized to enforce an agreement, the cavalier must wholeheartedly strive to accomplish this, remaining unswayed by threats, bribery, and other deterrents.",
      "Challenge": " Whenever an order of the scales cavalier issues a challenge, he receives a +1 morale bonus on combat maneuvers and attacks of opportunity made against the target of his challenge. This bonus increases by 1 for every 4 levels the cavalier possesses.",
      "Skills": " An order of the scales cavalier adds Knowledge (local) (Int) and Linguistics (Int) to his list of class skills. He gains a bonus equal to half his level (minimum +1) on Sense Motive checks to determine whether someone is bluffing and to determine whether a creature's behavior is being inf luenced by an enchantment.",
      "Order Abilities": " A cavalier belonging to the order of the scales gains the following abilities as he increases in level.",
      "Mobile Wall (Ex)": " At 2nd level, the cavalier receives Step Up as a bonus feat. He can use this feat while mounted by succeeding at a DC 15 Ride check, directing his mount to move rather than himself. The cavalier gains a +1 bonus to his CMD against attempts to tumble through squares he threatens. At 6th level, and every 4 levels thereafter, this bonus increases by an additional +1.",
      "Seek Retribution (Ex)": " At 8th level, once per day after receiving a request for aid from a legal authority or an aggrieved party regarding the breaking of an oath, whenever the cavalier encounters the oath-breaking creature, he can choose to vehemently exact retribution. As a swift action, the cavalier can grant himself a competence bonus equal to his Charisma modifier on all attack rolls, weapon damage rolls, and opposed checks against the oathbreaking creature. These bonuses last for 1 round per level.",
      "Sworn Oathkeeper (Ex)": " At 15th level, the cavalier can formally witness an oath or agreement between two creatures. If either creature breaks or reneges on the agreement and the cavalier becomes aware of this, he gains the bonuses from his seek retribution ability against that creature at all times. This ability ends when the creature fulfills the conditions of the oath or receives just punishment for breaking the oath. The maximum number of witnessed oaths cavalier can have active at a time is equal to his Charisma modifier (minimum 1)."
    },
    "Order of the Seal": {
      "Edicts": " The cavalier must guard his sworn charge with all he has: his health, his honor, and his very life. If his charge is a place, he must keep intruders out. If it is a thing, he must keep it safe from thieves—and restore the item to its rightful place if taken.",
      "Challenge": " An order of the seal cavalier can make a free bull rush or trip combat maneuver anytime he takes the full-attack action against the target of his challenge. This free combat maneuver does not provoke an attack of opportunity.",
      "Skills": " An order of the seal cavalier adds Disable Device (Dex) and Linguistics (Int) to his list of class skills. Whenever the cavalier uses Bluff to conceal information about his sworn charge, he receives a competence bonus equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the seal gains the following abilities as he increases in level.",
      "Keeper (Ex)": " At 2nd level, once per day the cavalier must select a location, or a secret that he has sworn to protect. If he chooses a location, he gains a +2 morale bonus on attack rolls when directly defending his charge. If he chooses a secret, he gains a +2 morale bonus on saving throws and opposed checks to resist revealing information about his charge. He gains these bonuses until he picks a new object, location, or secret to protect.",
      "I Shall Not Be Moved (Ex)": " At 8th level, the cavalier can draw on his dedication to overcome physical weakness. Whenever the cavalier does not move more than a 5-foot step, he receives a +2 dodge bonus to his CMD to resist bull rush, overrun, reposition, and trip combat maneuvers until his next turn.",
      "Staggering Assault (Ex)": " At 15th level, the cavalier can drive opponents back without giving ground. As a full-round action, the cavalier can make a single attack at his highest attack bonus. If the attack hits, the attack does damage as normal, and the cavalier may attempt a bull rush against the target. The cavalier gains a bonus on the bull rush combat maneuver check equal to half the amount of damage dealt on the initial attack."
    },
    "Order of the Shield": {
      "Edicts": " The cavalier must protect the lives and prosperity of the common folk, shielding them from the deprivations of those who would seek to cause them harm or exploit them. He must give charity when it is warranted and aid when needed. He must take no action that would cause harm or hardship to those who cannot defend themselves.",
      "Challenge": " Whenever an order of the shield cavalier issues a challenge, he receives a +1 morale bonus on attack rolls made against the target of his challenge if the target makes an attack against a target other than the cavalier. This bonus lasts for 1 minute. The bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the shield cavalier adds Heal (Wis) and Knowledge (local) (Int) to his list of class skills. Whenever an order of the shield cavalier uses the Heal skill on a creature other than himself, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the shield gains the following abilities as he increases in level.",
      "Resolute (Ex)": " At 2nd level, whenever the cavalier takes damage from a melee or ranged attack while wearing heavy armor, the cavalier can convert 1 point of lethal damage to 1 point of nonlethal damage. He can use this ability once each time he takes damage. This ability cannot be used to convert ability damage, ability drain, or energy damage to nonlethal damage. At 6th level, and every four levels thereafter, the amount of damage the cavalier can convert increases by 1.",
      "Stem the Tide (Ex)": " At 8th level, the cavalier receives as a bonus feat, even if he does not meet the prerequisites. Instead of making a combat maneuver check to stop the creature from moving, a cavalier with this ability can elect to make a normal attack instead. If the attack hits and deals damage, the target must stop moving, just as if the cavalier had made a successful combat maneuver check.",
      "Protect the Meek (Ex)": " At 15th level, the cavalier can move to intercept foes. As an immediate action, he can move up to his speed (or his mount's speed, if mounted) and make a single melee attack. This movement provokes attacks of opportunity as normal. The cavalier must end his movement adjacent to an enemy. On his next turn, the cavalier is staggered and cannot use this ability again for 1 round."
    },
    "Order of the Shroud": {
      "Edicts": " The cavalier must protect the common folk from the scourge of the undead. He must seek out and destroy the restless dead and give aid to those haunted by them. He must protect those who cannot defend themselves, and root out sources that birth the corruption of life and death.",
      "Challenge": " Whenever an order of the shroud cavalier issues a challenge to an undead creature, he receives a +1 morale bonus on attack rolls against the target of his challenge for 1 minute. The bonus increases by 1 for every 4 class levels the cavalier possesses.",
      "Skills": " An order of the shroud cavalier adds Knowledge (local) (Int) and Knowledge (religion) (Int) to his list of class skills. An order of the shroud cavalier can attempt Knowledge (religion) checks untrained. If he has ranks in that skill, as long as a Knowledge (religion) check involves undead or haunts, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the shroud gains the following abilities as he increases in level.",
      "Spiritual Shield (Su)": " At 2nd level, the cavalier can call upon the spirits of the fallen for protection. Once per day as an immediate action when attacked by an undead target of his challenge, the cavalier can gain a deflection bonus equal to his Charisma modifier to his AC against that attack. The cavalier must decide to use this ability before the attack roll.",
      "Destroyer of the Undead (Su)": " At 8th level, the cavalier's weapons are treated as having the cavalier's alignment for the purpose of overcoming the damage reduction of undead creatures. Against an undead target of his challenge, the cavalier automatically overcomes all damage reduction that undead possesses.",
      "Stand Against Darkness (Ex or Su)": " At 15th level, the cavalier can take revenge on undead that dare strike him or those he seeks to protect. Whenever an undead creature that is the subject of his challenge hits the cavalier or an adjacent ally with a melee attack, the creature provokes an attack of opportunity from the cavalier. The cavalier gains a +2 morale bonus on attacks of opportunity provoked as a result of this ability. If an undead subject of the cavalier's challenge threatens a critical hit against the cavalier, the cavalier gains a deflection bonus equal to his Charisma modifier against the confirmation roll. This bonus functions as a supernatural ability."
    },
    "Order of the Songbird": {
      "Edicts": " The samurai must never destroy art unless doing so is part of an artful act or performance of her own. She must respect the skill of her opponents and never desecrate or purposefully humiliate a foe. If she takes a sapient life, she must create a piece of art, performance, or poem in honor of the fallen creature or creatures in order to memorialize what she has taken from the world.",
      "Challenge": " An order of the songbird samurai gains a +1 dodge bonus to AC and a +1 sacred bonus on saves against the attacks and abilities of the target of her challenge. This bonus increases by 1 for every 4 class levels the samurai has. The samurai must be wearing light or no armor, not using a shield, and carrying no more than a light load to gain this benefit.",
      "Skills": " An order of the songbird samurai adds Knowledge (religion) (Int) and Perform (Cha) to her list of class skills. The samurai adds half her level to Craft checks and Profession (gardener) checks.",
      "Order Abilities": " A samurai belonging to the order of the songbird gains the following abilities.",
      "Versatile Performance (Ex)": " At 2nd level, the order of the songbird samurai gains the benefits of the bard's versatile performance ability with one Perform skill.",
      "Poetic Inspiration (Ex)": " At 8th level, an order of the songbird samurai can speak a few words as a swift action, inspiring allies to great deeds. Allies within 30 feet who can hear the samurai gain a competence bonus equal to her Charisma modifier on attack and weapon damage rolls for 1 round. This ability can be used once per combat.",
      "Beautiful Strike (Su)": " At 15th level, once per day when the order of the songbird samurai confirms a critical hit against the target of her challenge, she can declare it a beautiful strike without spending an action. The damage dealt by the attack becomes nonlethal damage, and the target must succeed at a Will save (DC = 10 + half the samurai's class level + her Charisma modifier) or be charmed as per (caster level equals the samurai's class level)."
    },
    "Order of the Staff": {
      "Edicts": " The cavalier cannot refuse a spellcaster's request for aid unless it will interfere with his existing duties, or he believes the spellcaster seeks to directly oppose the cavalier's aims and goals.",
      "Challenge": " Whenever an order of the staff cavalier issues a challenge, his target takes a –1 penalty on saving throws against spells and spell-like abilities for 1 round after the cavalier successfully damages the target. This penalty increases by 1 for every four levels the cavalier possesses.",
      "Skills": " An order of the staff cavalier adds Knowledge (arcana) (Int) and Knowledge (nature) (Int) to his list of class skills. He may use Knowledge (arcana) to identify spells being cast by arcane spellcasters as if he were using Spellcraft, and may do the same with Knowledge (nature) for divine spellcasters. If the cavalier readies an action to strike a creature when it casts a spell, and identifies the spell to be cast with the appropriate Knowledge check, he gains a +1 bonus on the attack roll.",
      "Order Abilities": " A cavalier who belongs to the order of the staff gains the following abilities as he increases in level.",
      "Spell Aid (Ex)": " At 2nd level, whenever the cavalier uses the aid another action to assist one of his allies, the ally receives a +2 competence bonus on the next concentration check, dispel check, or caster level check she makes (whichever comes first). At 8th level and every six levels thereafter, this bonus increases by an additional +1.",
      "Arcane Vessel (Ex)": " At 8th level, whenever the cavalier gains a bonus on attack rolls, saving throws, or damage rolls from a spell or spell-like ability cast by another creature, the cavalier also gains a number of temporary hit points equal to the level of the spell or spell-like ability. Temporary hit points gained from this ability from different spells stack, but only to a maximum number of temporary hit points equal to the cavalier's level. These temporary hit points last for 10 minutes.",
      "Synchronized Smash (Ex)": " At 15th level, the cavalier can utilize the power of his spellcasting allies to make devastating attacks against the allies' targets. If the cavalier is adjacent to an enemy affected by a targeted or area spell or spell-like ability cast by one of the cavalier's allies, he can make an immediate attack of opportunity against the affected creature. If the cavalier is also affected by the spell (such as by being caught in the area of the same spell), during the rest of that round he automatically confirms any critical hits made against the affected creature while using this ability."
    },
    "Order of the Star": {
      "Edicts": " The cavalier must strive to protect the faith and all those who follow its teachings, from priest to common man. He must adhere to the strictures of the faith, promote its cause whenever possible, and serve the agents of the divine.",
      "Challenge": " Whenever an order of the star cavalier issues a challenge, he receives a +1 morale bonus on all his saving throws as long as he is threatening the target of his challenge. This bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the star cavalier adds Heal (Wis) and Knowledge (religion) (Int) to his list of class skills. An order of the star cavalier can make Knowledge (religion) skill checks untrained. If he has ranks in the skill, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1) as long as the check involves his chosen faith.",
      "Order Abilities": " An order of the star cavalier gains the following abilities as he increases in level.",
      "Calling (Ex)": " At 2nd level, the cavalier can make a short prayer as a standard action, filling him with confidence in his abilities. At any point in the next minute, he can receive a competence bonus on an ability check, attack roll, saving throw, or skill check equal to his Charisma modifier. He must declare that he is using this bonus before the roll is made. He can use this ability up to four times per day, once for each type of check or roll. In addition, the cavalier adds 1/2 his cavalier level to any levels of paladin or cleric he might possess for the purposes of determining the effects of or",
      "For the Faith (Ex)": " At 8th level, the cavalier can call upon his faith to bolster himself in combat. As a free action, the cavalier can call out the name of his deity, granting him a morale bonus on attack rolls equal to his Charisma modifier for 1 round. In addition, any allies within 30 feet that share his faith also receive half this bonus (minimum +1). The cavalier can use this ability once per day, plus one additional time per day at 12th level and every four levels thereafter.",
      "Retribution (Ex)": " At 15th level, the cavalier can take retribution on those who dare to strike an agent of his faith. Whenever an enemy makes a successful melee attack against the cavalier or an adjacent ally devoted to the same faith as the cavalier, the enemy provokes an attack of opportunity from the cavalier. The cavalier receives a +2 morale bonus on the attack of opportunity. If the attack made by the enemy was a critical hit, the cavalier may treat the enemy as the target of his challenge for the attack of opportunity. The cavalier can use this ability once per round."
    },
    "Order of the Sword": {
      "Edicts": " The cavalier must show courage in the face of danger, mercy to those who have wronged him, and charity to the poor and the meek. He must be just and honorable at all times and in all things. He must defend his honor and, above all else, the honor of those he serves.",
      "Challenge": " Whenever an order of the sword cavalier issues a challenge, he receives a +1 morale bonus on attack rolls against the target of his challenge so long as he is astride his mount. The bonus increases by +1 for every four levels the cavalier possesses.",
      "Skills": " An order of the sword cavalier adds Knowledge (nobility) (Int) and Knowledge (religion) (Int) to his list of class skills. Whenever the cavalier uses Sense Motive to oppose a Bluff check, he receives a competence bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " An order of the sword cavalier receives the following abilities as he increases in level.",
      "By My Honor (Ex)": " At 2nd level, the cavalier must select one alignment. As long as he maintains the selected alignment, he receives a +2 morale bonus to one saving throw of his choice.",
      "Mounted Mastery (Ex)": " At 8th level, the cavalier ignores the armor check penalty when using the Ride skill, regardless of whether or not the creature he is riding is his mount. Whenever he makes a charge attack while mounted, he receives a +4 dodge bonus to his AC to avoid attacks set against his charge. When making such an attack, he can add his mount's Strength modifier to the damage roll, in addition to his own. He also receives a bonus feat, chosen from the following list: , , , , , or . He must qualify for the feat selected.",
      "Knight's Challenge (Ex)": " At 15th level, the cavalier can make a knight's challenge once per day. This functions like a normal challenge, but the cavalier adds his Charisma bonus on all attack rolls and damage rolls made against the target of his challenge. In addition, he receives a +4 circumstance bonus on attack rolls made to confirm critical hits against the target of his knight's challenge."
    },
    "Order of the Tome": {
      "Edicts": " An order of the tome cavalier must protect written knowledge (or at least approved knowledge) at all costs. Some are also devoted to the destruction of proscribed knowledge and are equally zealous in the pursuit of its destruction. Most of these cavaliers believe that the preservation of a written work is more important than a single life, even their own, as it ensures future generations benefit from its wisdom.",
      "Challenge": " Whenever an order of the tome cavalier issues a challenge, he receives a +2 bonus on all saving throws against spells or spell-like abilities cast by the subject of his challenge and a +2 bonus on all Bluff and Sense motive checks involving the subject of his challenge.",
      "Skills": " An order of the tome cavalier adds Knowledge (arcana), Knowledge (religion), and Linguistics to his list of class skills. Furthermore, he can use Linguistics untrained. If he has ranks in Linguistics, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier belonging to the order of the tome gains the following abilities as he increases in level.",
      "Specialized Knowledge (Ex)": " At 2nd level, an order of the tome cavalier chooses either Knowledge (arcana) or Knowledge (religion). He can make the chosen skill checks untrained. He cannot change his chosen skill later. If he has ranks in his chosen skill, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1) as long as that check involves a book, tome, scroll, or any other form of written knowledge.",
      "Powerful Knowledge (Ex)": " At 8th level, the cavalier gains the ability to read scrolls and cast arcane or divine spells from a scroll as if he had a caster level of his cavalier level –4. He can decipher all scrolls, using his Linguistics skill in place of Spellcraft, and does not need to cast",
      "read magic": "in order to decipher a scroll. Which type of spell the cavalier can cast is based on the Knowledge skill he chose for specialized knowledge. If he chose Knowledge (arcana), he can cast any arcane spells from a scroll. If he chose Knowledge (religion), he can cast any divine spells from a scroll. Furthermore, he gains a +1 bonus to an ability score for purposes of determining the level of spells he can cast from a scroll, and this bonus increases by +1 at 10th level and every 5 levels thereafter (to a maximum of +4 at 20th level). The ability score that gains the bonus is dependent on which skill the cavalier picked for his specialized knowledge ability. If the cavalier picked Knowledge (arcana), he gains the bonus to Intelligence. If he picked Knowledge (religion), he gains the bonus to Wisdom.",
      "Defensive Knowledge (Ex)": " At 15th level, an order of the tome cavalier can grant nearby allies some of the boons of his cavalier challenge. While allies are adjacent to the cavalier, they gain a +2 bonus on all saving throws against spells or spell-like abilities cast by the subject of the cavalier's challenge. In addition, as an immediate action, a number of times per day equal to the cavalier's Intelligence modifier (minimum 1) or Wisdom modifier (minimum 1), the cavalier can allow an ally adjacent to him to reroll a single failed saving throw against a spell or spell-like ability from the target of his challenge. The ally must be able to see and hear the cavalier in order to gain this reroll. The ability score that determines how many times per day a cavalier can use this ability depends on which Knowledge skill the cavalier picked for specialized knowledge. If the cavalier picked Knowledge (arcana), the number of times per day this ability can be used is based on Intelligence. If he picked Knowledge (religion) it is based on Wisdom."
    },
    "Order of the Warrior": {
      "Edicts": " The samurai must protect the life and lands of his lord with his life. He must be truthful and courageous, respectful to his elders and his masters, and loyal to his friends and liege. He must conduct himself with honor and dignity.",
      "Challenge": " Whenever an order of the warrior samurai declares a challenge, he receives damage reduction 1/— against attacks made by the target of his challenge. This DR increases by +1 for every four levels the samurai possesses.",
      "Skills": " An order of the warrior samurai adds Knowledge (history) (Int) and Knowledge (nobility) (Int) to his list of class skills. An order of the warrior samurai can make Knowledge (nobility) checks untrained. If he has ranks in the skill, he receives a bonus on the check equal to 1/2 his samurai level (minimum +1) as long as the check involves the nobles or politics of his land.",
      "Order Abilities": " A samurai who belongs to the order of the warrior gains the following abilities as he increases in level.",
      "Honor in All Things (Ex)": " At 2nd level, the order of the warrior samurai draws strength from his sense of honor. Whenever the samurai makes a skill check or saving throw, he can call upon his honor as a free action to grant him a +4 morale bonus on the roll. He can use this ability once per day at 2nd level, plus one additional time per day for every four levels beyond 2nd (maximum of five times per day at 18th level).",
      "Way of the Samurai (Ex)": " At 8th level, the order of the warrior samurai's sense of honor and loyalty drives him to accomplish seemingly impossible tasks. The samurai can, as a standard action, focus his mind and will. Once during the next minute, he can choose to roll an attack roll, skill check, or saving throw three times and take the best result. He must decide to use this ability before the roll is made. Using this ability expends one daily use of his resolve.",
      "Strike True (Ex)": " At 15th level, the order of the warrior samurai can use his years of training and focus to make the perfect strike. When he uses this ability, the samurai makes an attack as normal. If the attack hits, it is a critical threat. The samurai must roll to confirm the critical as normal. The attack deals the maximum amount of damage, although additional dice from weapon qualities, sneak attack, and additional dice from a critical hit are rolled normally. The damage from this attack ignores any damage reduction the target might have and also causes the target to become blinded, deafened, sickened, or staggered for 1d4 rounds (the samurai's choice). Making this attack is a standard action. The samurai can use this ability once per day."
    },
    "Order of the Waves": {
      "Edicts": " The cavalier must perpetually seek out and explore new places and secrets under the sea, stopping only to fight to protect his newfound treasures and his people from undersea threats (typically evil undersea races like sahuagin, but alternatively goodly or neutral enemy races for cavaliers from evil races).",
      "Challenge": " Whenever a cavalier of the order of the waves issues a challenge, he receives a +1 morale bonus on his saving throws as long as he is underwater. This bonus increases by 1 for every 4 class levels the cavalier has.",
      "Skills": " A cavalier belonging to the order of the waves adds Knowledge (geography) and Perception to his class skills. He can attempt Knowledge (geography) checks untrained, but if he has ranks in the skill, he adds half his cavalier level (minimum 1) to all Knowledge (geography) checks that involve finding an underwater location.",
      "Order Abilities": " A cavalier belonging to this order gains the following abilities as he increases in level.",
      "Waverider (Ex)": " At 2nd level, the cavalier gains a swim speed equal to his unmodified base land speed. If he already has a swim speed, his swim speed increases by 10 feet, and if he and his mount both have a swim speed, the mount's swim speed also increases by 10 feet. He gains a +1 morale bonus on damage rolls when underwater.",
      "Current's Rush (Ex)": " At 8th level, the cavalier gains a +2 bonus on attack rolls when charging in the same direction as a current that's currently pushing him, as well as a +1 bonus on damage rolls for every 10 feet of the current's speed (maximum +6 points of damage).",
      "Explore the Seas (Ex)": " At 15th level, the cavalier gains as a bonus feat and adds two oceanic zones to his native range instead of one. When exploring a new location underwater, he gains a +2 morale bonus on initiative checks and Perception checks, and can always act in the surprise round."
    },
    "Order of the Whip": {
      "Edicts": " The cavalier must seek out those weaker than himself to punish and torture. He must force others to obey his commands without question. He must strive to cause pain and suffering wherever possible. Since these edicts are evil, he must be of an evil alignment.",
      "Challenge": " Whenever an order of the whip cavalier issues a challenge, he receives a +1 morale bonus on all melee damage rolls against the target of his challenge as long as he damaged the creature in the previous round. This bonus increases by +1 for every 4 levels the cavalier has (to a maximum of +5 at 17th level).",
      "Skills": " An order of the whip cavalier adds Knowledge (local) and Knowledge (nobility) to his list of class skills. Whenever an order of the whip cavalier uses Intimidate to force another creature to do what he says, he receives a bonus on the check equal to 1/2 his cavalier level (minimum +1).",
      "Order Abilities": " A cavalier who belongs to the order of the whip gains the following abilities as he increases in level.",
      "Whip Crack (Ex)": " At 2nd level, the cavalier becomes proficient with a whip and gains as a bonus feat. When a creature whose number of Hit Dice is less than or equal to 1/2 the cavalier's level takes nonlethal damage from the cavalier's whip, it is shaken for 1 round. This does not stack with other fear effects.",
      "Inspiring Pain (Ex)": " At 8th level, the cavalier can inspire brutal malice among his allies. As a swift action, the cavalier can allow allies within 30 feet to deal nonlethal damage with their weapons without taking the usual –4 penalty (the weapon must still be capable of dealing nonlethal damage). Affected allies gain a +2 bonus on nonlethal weapon damage rolls. This effect lasts for 1 round and can be used once every 5 minutes.",
      "Assert Authority (Ex)": " At 15th level, the cavalier demonstrates his ruthlessness against those who strike the cavalier or his slaves. Whenever an enemy makes a melee attack against the cavalier or one of his adjacent slaves or servants, that enemy provokes an attack of opportunity from the cavalier, and the cavalier gains a +2 morale bonus on this attack of opportunity. If the enemy's attack was a confirmed critical hit, the cavalier counts the enemy as if it were the target of his challenge for this attack of opportunity."
    },
    "Order of Vengeance": {
      "Edicts": " The cavalier must seek retaliation (legal or otherwise) for any unjustified harm to her person or property. She may not forgive even the slightest insult.",
      "Challenge": " Whenever a cavalier of the order of vengeance issues a challenge against a creature whose kind she has encountered in the past 24 hours, the cavalier gains a +1 morale bonus on attack rolls made against the target of her challenge. This bonus increases by +1 for every 4 levels the cavalier possesses.",
      "Skills": " A cavalier of the order of vengeance adds Knowledge (local) and Knowledge (nobility) to her list of class skills. Whenever the cavalier uses Diplomacy to gather information, she receives a bonus on the check equal to 1/2 her cavalier level (minimum +1).",
      "Order Abilities": " A cavalier that belongs to the order of vengeance gains the following abilities as she increases in level.",
      "Air Grievances (Ex)": " At 2nd level, when the cavalier attempts to demoralize an opponent using Intimidate, the cavalier gains a bonus on her Intimidate check equal to 1/2 her cavalier level. At 8th level and every 6 levels thereafter, the penalties a cavalier's target takes for being demoralized increase by 1.",
      "Eye for an Eye (Ex)": " At 8th level, the cavalier gains as a bonus feat. The cavalier can grant a (in place of a teamwork feat) to her allies using the tactician ability.",
      "Retribution (Ex)": " At 15th level, the cavalier can take retribution on those who dare to strike an agent of his faith. Whenever an enemy makes a successful melee attack against the cavalier or an adjacent ally devoted to the same faith as the cavalier, the enemy provokes an attack of opportunity from the cavalier. The cavalier receives a +2 morale bonus on the attack of opportunity. If the attack made by the enemy was a critical hit, the cavalier may treat the enemy as the target of his challenge for the attack of opportunity. The cavalier can use this ability once per round"
    },
    "Ronin": {
      "Becoming Ronin": " Normally, when a samurai wishes to change his order, he must undergo a lengthy process that requires him to adhere to the edicts of his new order for a period of time before receiving any benefits. This is not the case with ronin. Once a samurai decides to become a ronin, he immediately loses all of the bonuses, skills, and abilities of his old order and gains those of the ronin order. If he wishes to once again dedicate himself to another order, he must do so using the normal rules.",
      "Edicts": " Ronin follow their own personal code of ethics and honor. As such, their edicts are extremely flexible and subject to change. Each ronin should determine his own edicts, which should include at least three provisions. These edicts are subject to GM approval.",
      "Challenge": " Whenever a ronin is the target of a challenge, a smite, a quarry, or similar effect, and he issues a challenge against that character in return, the ronin receives a +1 morale bonus on attack rolls made against the target of his challenge and a +1 dodge bonus to his AC against attacks made by the target of his challenge. These bonuses increase by +1 for every four class levels the samurai possesses (to a maximum of +6 at 20th level).",
      "Skills": " A ronin adds Knowledge (local) (Int) and Survival (Wis) to his list of class skills.",
      "Order Abilities": " A ronin samurai gains the following abilities as he increases in level.",
      "Self Reliant (Ex)": " At 2nd level, the ronin learns to rely solely on himself, even in the most difficult of times. Whenever the ronin fails a Will saving throw against an effect with a duration greater than 1 round, he can attempt another saving throw at the end of the second round of the effect. If he makes this saving throw, it has the same effect as if he had made the original save (negating part or all of the effect). In addition, whenever a ronin is brought below 0 hit points, on his next turn he can roll twice to stabilize, taking the better result.",
      "Without Master (Ex)": " At 8th level, the ronin's fierce independence allows him to overcome staggering odds. The ronin can summon up this willpower as an immediate action, and can use it in one of three ways. He can use his willpower whenever an attack would reduce him to fewer than 0 hit points but wouldn't kill him, to instead be at 1 hit point and conscious. He can use his willpower after making an attack roll to confirm a critical hit in order to reroll the confirmation roll. Finally, he can use his willpower to take 10 on a skill check during combat, even if the situation or the skill would not normally allow him to take 10. A ronin can use this ability once during a combat.",
      "Chosen Destiny (Ex)": " At 15th level, the ronin is the master of his own destiny. Whenever the ronin makes a saving throw against a charm or compulsion effect, he may roll twice and take the better result. In addition, once per day, the ronin can treat any one d20 roll as if the result were a natural 20. He must declare the use of this ability before the roll is made."
    }
  }
}