{ "basic": {
    "Accurate Strike": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 2 points from his arcane pool as a swift action to resolve all of his melee weapon attacks until the end of his turn as melee touch attacks."
    },
    "Aquatic Agility": {
      "prerequisites": "magus 6",
      "benefits": "As an immediate action, the magus can spend 1 point from his arcane pool to gain the benefitss of water breathing for 1 round per level. During this time, he can ignore the effects of rough water and underwater combat on his attacks and movement."
    },
    "Arcane Accuracy": {
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to grant himself an insight bonus equal to his Intelligence bonus on all attack rolls until the end of his turn."
    },
    "Arcane Cloak": {
      "benefits": "The magus can expend 1 point from his arcane pool to add his Intelligence bonus to Stealth checks and Bluff checks to create a diversion in order to hide. This bonus lasts for 1 minute."
    },
    "Flamboyant Arcana": {
      "Derring-Do": "At 1st level, a magus can spend 1 panache point when she makes an Acrobatics, Climb, Escape Artist, Fly, Ride, or Swim check to roll 1d6 and add the result to the check. She can do this after she makes the check but before the result is revealed. If the result of the d6 roll is a natural 6, she rolls another 1d6 and adds it to the check. She can continue to do this as long as she rolls natural 6s, up to a number of times equal to her Dexterity modifier (minimum 1).",
      "Opportune Parry and Riposte": "At 1st level, when an opponent makes a melee attack against the magus, she can spend 1 panache point and expend a use of an attack of opportunity to attempt to parry that attack. The magus makes an attack roll as if she were making an attack of opportunity; for each size category the attacking creature is larger than the magus, the magus takes a –2 penalty on this roll. If her result is greater than the attacking creature’s result, the creature’s attack automatically misses. The magus must declare the use of this ability after the creature’s attack is announced, but before its attack roll is made. Upon performing a successful parry and if she has at least 1 panache point, the magus can as an immediate action make an attack against the creature whose attack she parried, provided that creature is within her reach."
    },
    "Arcane Edge": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 1 point from his arcane pool as an immediate action after hitting a target with a slashing or piercing weapon in order to deal an amount of bleed damage equal to his Intelligence modifier (minimum 0)."
    },
    "Arcane Redoubt": {
      "benefits": "As a swift action, the magus can expend 1 point from his arcane pool to treat his shield bonus to AC (including any enhancement bonus) as a bonus to touch AC until the beginning of his next turn."
    },
    "Arcane Redoubt, Greater": {
      "prerequisites": "magus 12, arcane redoubt",
      "benefits": "Whenever the magus uses his arcane redoubt magus arcana, he may spend an additional point from his arcane pool in order to apply his shield bonus to AC (including any enhancement bonus) as a bonus on Reflex saves until the beginning of his next turn. If he is targeted with an effect requiring a Reflex save while using this power, he may spend 2 points from his arcane pool as an immediate action to grant himself evasion, or 4 points to grant himself improved evasion."
    },

    "Arcane Scent": {
      "benefits": "The magus can sniff out other spellcasters. By spending 1 point from his arcane pool, the magus gains the scent special quality for 1 hour per magus level. This scent can only detect creatures capable of casting spells or using spell-like abilities. Additionally, while this effect persists, the magus can attempt a Spellcraft check as a move action to determine the highest level spell a detected creature is capable of casting (DC = 10 + the creature’s caster level). The magus can only attempt this Spellcraft check once per creature per 24 hours."
    },
    "Bane Blade": {
      "prerequisites": "magus 15",
      "benefits": "Whenever the magus enhances his weapon using his arcane pool, he may spend 1 additional point from his arcane pool to add the bane special ability to the weapon."
    },
    "Broad Study": {
      "prerequisites": "magus 6, levels in another spellcasting class",
      "benefits": "The magus selects another one of his spellcasting classes. The magus can use his spellstrike and spell combat abilities while casting or using spells from the spell list of that class. This does not allow him to cast arcane spells from that class’s spell list without suffering the normal chances of arcane spell failure, unless the spell lacks somatic components."
    },

    "Close Range": {
      "benefits": "The magus can deliver ray spells that feature a ranged touch attack as melee touch spells. He can use a ranged touch attack spell that targets more than one creature (such as scorching ray), but he makes only one melee touch attack to deliver one of these ranged touch effects; additional ranged touch attacks from that spell are wasted and have no effect. These spells can be used with the spellstrike class feature."
    },
    "Concentrate": {
      "benefits": "The magus can reroll any concentration check he has just made with a +4 bonus. He must use this ability after the roll is made, but before the roll’s outcome is determined. The magus must take the second roll, even if it is worse. The magus can use this ability once per day."
    },
    "Critical Strike": {
      "prerequisites": "magus 12",
      "benefits": "Whenever the magus scores a critical hit with a melee weapon, he may cast a spell with a range of touch as a swift action, then make a touch attack with that spell against the target of the critical hit as a free action. The magus can use this ability once per day."
    },

    "Devoted Blade": {
      "prerequisites": "magus 12",
      "benefits": "Whenever the magus enhances his weapon using his arcane pool, he may spend 1 additional point from his arcane pool to add either the anarchic, axiomatic, holy, or unholy special ability to the list of available options. A magus may only add one of these abilities if it matches his own alignment."
    },
    "Dispelling Strike": {
      "prerequisites": "magus 9",
      "benefits": "The magus can spend 1 or more points from his arcane pool as a swift action to imbue his weapon with a special power. If the weapon strikes a creature within the next minute, that creature is the subject of a targeted dispel magic using the magus’s level as the caster level, except that this effect cannot dispel a spell of a level higher than the number of arcane pool points expended to activate this ability (treat higher-level spells as if they do not exist and apply the dispel attempt to the remaining spells with the highest caster level). Once the strike is made, the power dissipates, even if the dispel attempt is unsuccessful."
    },
    "Disruptive": {
      "prerequisites": "magus 6",
      "benefits": "The magus gains Disruptive as a bonus feat."
    },
    "Distant Spellstrike": {
      "prerequisites": "magus 12, ranged spellstrike",
      "benefits": "The range of any spell the magus delivers through a ranged weapon attack increases to the maximum range of the weapon if that is greater than the spell’s range."
    },
    "Divinatory Strike": {
      "benefits": "Whenever the magus scores a critical hit against an opponent with a melee attack, he can gain preternatural insight into his foe’s strengths and weaknesses as though he had rolled a natural 20 on a Knowledge check to identify the creature struck. Any bonuses or penalties the magus normally applies to such a Knowledge check are applied to this ability, including his Intelligence modifier, ranks in the requisite Knowledge skill, and other applicable modifiers. Depending on the final calculated outcome of this ability and the CR of the creature struck, the magus may still be unable to glean information about his enemy. This ability works even if the magus has already attempted a Knowledge check to identify the creature."
    },
    "Enduring Blade": {
      "prerequisites": "magus 6",
      "benefits": "Whenever the magus enchants his weapon using his arcane pool, he may spend 1 additional point from his arcane pool to increase the duration to 1 minute per magus level."
    },
    "Empowered Magic": {
      "prerequisites": "magus 6",
      "benefits": "The magus can cast one spell per day as if it were modified by the Empower Spell feat. This does not increase the casting time or the level of the spell."
    },
    "Familiar": {
      "benefits": "The magus gains a familiar, using his magus level as his effective wizard level. This familiar follows the rules for familiars presented in the arcane bond wizard class feature."
    },

    "Ghost Blade": {
      "prerequisites": "magus 9",
      "benefits": "Whenever the magus enchants his weapon using his arcane pool, he may spend 1 additional point from his arcane pool to add the brilliant energy and ghost touch special abilities to the list of available options."
    },
    "Hasted Assault": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to move more quickly. This functions as haste, but only targets the magus and lasts for a number of rounds equal to the magus’s Intelligence bonus."
    },
    "Intuitive Protection": {
      "prerequisites": "magus 3",
      "benefits": "When a conjuration (summoning) spell is cast by an opponent and the magus successfully identifies the spell with a Spellcraft check, he can spend 1 point form his arcane pool as an immediate action to cast protection from chaos/evil/good/law (chosen when using this ability) on himself; this lasts a number of rounds equal to his magus level."
    },
    "Ki Arcana": {
      "prerequisites": "magus 6, must also have levels in a class that grants a ki pool",
      "benefits": "The magus may use points from his arcana pool and ki points from a ki pool granted by another class interchangeably."
    },
    "Lingering Pain": {
      "benefits": "The magus can expend 1 point from his arcane pool as an immediate action after hitting a target with a weapon attack. All damage from that attack (including damage from a spell cast using the spellstrike ability) is considered continuous damage for the purposes of any concentration checks made by the target prior to the beginning of the magus’s next turn."
    },
    "Maneuver Mastery": {
      "benefits": "The magus has mastered one combat maneuver. He selects one maneuver when selecting this arcana. Whenever he is attempting the selected maneuver, he uses his magus level in place of his base attack bonus (in addition to any base attack bonus gained from other classes).",
      "Special": "A magus can select this magus arcana more than once. Its effects do not stack. Each time he selects this arcana, he selects another combat maneuver."
    },
    "Maximized Magic": {
      "prerequisites": "magus 12",
      "benefits": "The magus can cast one spell per day as if it were modified by the Maximize Spell feat. This does not increase the casting time or the level of the spell."
    },
    "Natural Spell Combat": {
      "benefits": "The magus can use his spell combat class feature with a natural attack of his choice. If he does, he gains a +2 bonus on concentration checks. If the natural attack is made with an appendage that would normally hold a weapon (such as a claw attack), the magus cannot wield a weapon in that appendage while making natural attacks with it. If the natural attack is a bite or other attack that does not require a free appendage to make, the magus can use the natural attack in addition to all of the attacks he could make with his melee weapon, if he has one."
    },
    "Planar Hunter": {
      "prerequisites": "magus 9",
      "benefits": "Whenever the magus enhances his weapon using his arcane pool, he can spend 1 additional point from his arcane pool to add the planar special ability to his weapon, or 2 additional points to add the phase locking special ability."
    },


    "Pool Strike, Arcing": {
      "prerequisites": "magus 12, pool strike",
      "benefits": "The magus can expend 1 additional point from his arcane pool when using the pool strike arcana. If his attack hits, the magus can target a number of enemies within 15 feet equal to his Intelligence modifier (minimum 0) with a ranged touch attack as a free action. Those struck take the same energy damage as the primary target of the pool strike, including increased damage on a critical hit."
    },

    "Pool Strike, Clinging": {
      "prerequisites": "magus 9, pool strike",
      "benefits": "The magus can expend 1 additional point from his arcane pool when making a pool strike. A single target of his pool strike takes energy damage as normal from the pool strike and also takes half this amount of damage at the beginning of its turn on the following round."
    },
    "Pool Strike": {
      "benefits": "The magus can expend 1 point from his arcane pool as a standard action to charge his free hand with energy. He can make a melee touch attack with that hand as a free action as part of activating this ability. If the touch attack hits, it releases the charge and deals 2d6 points of energy damage (acid, cold, electricity, or fire, chosen when he spends the arcane pool point to activate this ability). He can use this ability with the spellstrike class feature. If he misses with this attack, he can hold the charge for up to 1 minute before it dissipates. At 6th level, and every three levels thereafter, the amount of damage dealt by this attack increases by 1d6."
    },

    "Pool Strike, Thunderous": {
      "prerequisites": "magus 6, pool strike",
      "benefits": "The magus can expend 1 additional point from his arcane pool when making a pool strike. His pool strike deals sonic damage and deafens a single target for 1 round (DC 10 + 1/2 magus level + Intelligence modifier)."
    },
    "Prescient Attack": {
      "prerequisites": "magus 6",
      "benefits": "The magus can expend 1 point from his arcane pool as an immediate action after hitting a target with a weapon attack, allowing him to anticipate his opponent’s defenses. The target is denied its Dexterity bonus against the magus’s attacks until the end of the magus’s next turn."
    },
    "Prescient Defense": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 1 point from his arcane pool as an immediate action after hitting a target with a weapon attack, granting him a premonition of his enemy’s intentions. The magus gains a bonus to his AC and on Reflex saves equal to his Intelligence modifier (minimum 0) against attacks by that opponent until the beginning of his next turn."
    },
    "Quickened Magic": {
      "prerequisites": "magus 15",
      "benefits": "The magus can cast one spell per day as if it were modified by the Quicken Spell feat. This does not increase the level of the spell."
    },
    "Reach Spellstrike": {
      "prerequisites": "magus 9, ranged spellstrike",
      "benefits": "The magus can deliver spells with a range of touch with ranged spellstrike up to a maximum range of close (25 feet + 5 feet per 2 caster levels)."
    },
    "Reflection": {
      "prerequisites": "magus 15",
      "benefits": "The magus can sacrifice 1 or more points from his arcane pool as an immediate action to reflect a spell back at its caster. This functions as spell turning, but only if the targeted spell is of a level equal to or lower than the number of points expended. If insufficient points are expended, they instead grant an insight bonus on any saving throws allowed by the spell, equal to the number of points spent."
    },
    "Rod Mastery": {
      "benefits": "Whenever the magus uses a rod, he calculates the DC for any spell it contains using his Intelligence modifier (minimum 0) instead of the minimum modifier needed to cast a spell of that level."
    },
    "Rod Wielder": {
      "benefits": "The magus adds his Intelligence bonus (minimum 0) on caster level checks made to overcome spell resistance when using a spell contained within a rod or when making a spellstrike attack channeled through a rod."
    },
    "Scroll Mastery": {
      "prerequisites": "magus 6",
      "benefits": "Whenever the magus uses a scroll, he may expend 1 point from his arcane pool to allow him to calculate the DC for any spell contained on the scroll using his Intelligence modifier, instead of the minimum modifier needed cast a spell of that level."
    },
    "Silent Magic": {
      "benefits": "The magus can cast one spell per day as if it were modified by the Silent Spell feat. This does not increase the casting time or the level of the spell."
    },
    "Spell Blending": {
      "benefits": "When a magus selects this arcana, he must select one spell from the wizard spell list that is of a magus spell level he can cast. He adds this spell to his spellbook and list of magus spells known as a magus spell of its wizard spell level. He can instead select two spells to add in this way, but both must be at least one level lower than the highest-level magus spell he can cast.",
      "Special": "A magus can select this magus arcana more than once."
    },
    "Spell Shield": {
      "benefits": "The magus can expend a point from his arcane pool as an immediate action to grant himself a shield bonus to AC equal to his Intelligence bonus until the end of his next turn."
    },
    "Spell Trickery": {
      "prerequisites": "magus 12",
      "benefits": "When the magus successfully performs a dirty trick combat maneuver, he can cast an illusion or enchantment spell he has prepared with a casting time of 1 standard action or less as a swift action."
    },
    "Spell-Scars": {
      "benefits": "The magus can use special scar-based tattoos called spell-scars on his skin to cast or prepare spells, much like scrolls. He can cast a spell from a spell-scar exactly like casting from a scroll; the ink and scars vanish when the spell is cast. The magus can also prepare spells from his spell-scars without expending them, similar to a wizard using the Spell Mastery feat."
    },
    "Spellbreaker": {
      "prerequisites": "magus 9",
      "benefits": "The magus gains Spellbreaker as a bonus feat."
    },
    "Still Magic": {
      "benefits": "The magus can cast one spell per day as if it were modified by the Still Spell feat. This does not increase the casting time or the level of the spell."
    },

    "Vision-Clouding Strike": {
      "prerequisites": "magus 9, fetchling",
      "benefits": "The magus can expend 1 or more points from his arcane pool as a swift action to empower his weapon with shadowy energy that dissipates within 1 minute. A creature struck with the weapon must succeed at a Will save (DC = 1/2 the magus’s level + his Intelligence modifier) or treat the magus as being in an area of dim light for 1d4 rounds, plus 1 additional round for each arcane pool point expended. True seeing penetrates this effect, but darkvision and similar darkness-penetrating effects do not."
    },
    "Wand Mastery": {
      "benefits": "Whenever the magus uses a wand, he calculates the DC for any spell it contains using his Intelligence modifier, instead of the minimum modifier needed to cast a spell of that level."
    },
    "Wand Wielder": {
      "benefits": "The magus can activate a wand or staff in place of casting a spell when using spell combat."
    },

    "Extemporaneous Metamagic": {
      "prerequisites": "Special (see below)",
      "benefits": "Choose a single metamagic feat that uses a spell slot one level higher than the spell’s actual level, such as Enlarge Spell or Merciful Spell. The magus can cast one spell per day as if it were modified by that metamagic feat without preparing it ahead of time. This does not increase the casting time or the level of the spell. A magus can take this arcana more than once, each time selecting a different metamagic feat. The magus must meet all requirements of the metamagic feat.At 6th level a magus that selects this arcana can choose a single metamagic feat that uses a spell slot up to two levels higher than the spell’s actual level, such as Persistent Spell or Sickening Spell. At 12th level a magus that selects this arcana can choose a single metamagic feat that uses a spell slot up to three levels higher than the spell’s actual level, such as Widen Spell or Dazing Spell."
    },
    "Philosopher’s Alloy": {
      "benefits": "When the magus enhances her weapon using her arcane pool, she may spend 1 additional point from her arcane pool to duplicate the qualities of either cold iron or silver. This infusion does not modify the weapon’s hardness, its hit points, or its weight, but the weapon is considered to be made of the special material for purposes of bypassing damage reduction. Only a single metal type may be infused at one time. At 9th level, the infusion may instead duplicate the abilities of adamantine for purposes of bypassing damage reduction, and for bypassing hardness less than 20 when sundering weapons or attacking objects."
    },
    "Rending the Shroud": {
      "benefits": "Whenever the magus makes a successful melee attack, she may spend 1 point from her arcane pool as a swift action to reduce her target’s spell resistance with no save allowed. The target’s spell resistance is reduced by the magus’s Intelligence modifier for a number of rounds equal to ½ her magus level. Multiple uses of rending the shroud do not lower the target’s spell resistance further, but do reset the duration to ½ the magus’s level."
    },
    "Unseelie Hunter": {
      "benefits": "Whenever the magus enhances her weapon using her arcane pool, she may spend 1 additional point from her arcane pool to temporarily infuse that weapon with aetherplasm, causing it to shed light. When the magus hits with the infused weapon the target is affected as if by a faerie fire spell. At 6th level, when the magus hits with the infused weapon, the magus can choose to spend 1 additional point to instead effect the target as if by a glitterdust spell."
    },
    "Animate Weapon": {
      "benefits": "The magus can expend 1 point from her arcane pool as a swift action to imbue a single weapon she touches with the ability to fight on its own for a number of rounds equal to her magus class level. The weapon deals its standard damage, including any bonuses and abilities it gains from magical enchantments. It strikes with a base attack bonus equal to her magus class level + her Intelligence modifier. If the base attack bonus is high, enough it can gain multiple attacks. The weapon never gains a flanking bonus, nor does it provide one for another attacker, and her feats do not aid its attacks. It acts on her initiative count. The weapon can influence at a speed of 30 feet with perfect maneuverability (using her class level + her intelligence modifier for any influence skill checks). It must remain within 100 feet of her. She can direct it to attack a foe as a free action when she first uses this ability to animate the weapon, but on subsequent rounds, she must use a move action to set it against a new foe. If its current foe is defeated, the weapon automatically moves to attack the closest enemy. The weapon never willingly attempts to move farther than 100 feet from the magus. The weapon’s Armor Class, hit points, and hardness are as normal for its size. It does not gain attacks of opportunity, nor does it provoke them, unless an opponent tries to grapple it. In that case, it gains an attack of opportunity against any would-be grapplers. The weapon can only make one attack of opportunity each round. The weapons CMB and CMD are equal to its base attack bonus and size modified only by her Intelligence Modifier. It gains no Strength/Dexterity bonus or penalty."
    },
    "Athame Knowledge": {
      "benefits": "The magus forms a much closer relationship with his weapon. The power turns her weapon almost into an extension of his body. The magus can spend 1 point from her arcane pool as a swift action to reach out into the history of the weapon to learn its secrets, casting her mind back through time and space. For a moment, she literally embodies the weapon’s history and use. Consequently, the magus gains the use of one feat of her choice that directly improves her use of the weapon, such as Weapon Focus or Improved Critical. The magus must meet all of the feat’s prerequisitess to gain it; a magus with the black blade class ability uses her magus class level in place of her base attack bonus. The feat remains with her for one minute per magus class level."
    },
    "Athame Surge": {
      "prerequisites": "magus 6",
      "benefits": "An magus can transform her weapon into a glittering weapon of pure energy by channeling her spell slots directly into it. The magus can expend a single spell slot to increase her weapon’s enhancement bonus on attacks and damage by an amount equal to half the slot’s level. This bonus can improve the weapon’s enhancement bonus on attack rolls and damage rolls, or it can be spent on weapon special abilities that are expressed as an enhancement bonus. This bonus lasts for 1 minute per magus class level, and the magus can use only one spell slot in this manner at a time. If a magus activates this ability while a previous use of it is still in effect, the new bonus replaces the old one—it does not stack."
    },
    "Augment Physical Prowess": {
      "benefits": "The magus can expend 1 point from her arcane pool as a swift action to draw upon her magical abilities to strengthen her limbs, sharpen her reflexes, or enhance her toughness for a number of rounds equal to her magus class level. She gains a +2 inherent bonus to Strength, Dexterity, or Constitution. She chooses which ability to increase when she expends the point from her arcane pool."
    },
    "Black Blade Riposte": {},
    "Born to the Black Blade": {
      "prerequisites": "Black blade class ability",
      "benefits": "Her black blade is always ready for a battle, and she can sense its keening thirst as combat draws near. In addition, her deep connection to the weapon also allows you to channel and control spells with greater ability than normal; she gains a +2 bonus on initiative and a +1 bonus on the Difficulty Class of all spells she cast when using her spell combat class ability."
    },
    "Bounding Step": {
      "prerequisites": "magus 6",
      "benefits": "The magus can expend 1 point from her arcane pool as a swift action to move through the air. In essence, she can fly for short distances merely by invoking the power of this ability speed for a number of rounds equal to her magus class level. When she moves, she is considered to be flying through the air. At the end of her movement, she lands. She can choose to take a double move when she uses this feat, and she can move directly up, or horizontally from the roof of one building to another, or across a castle’s moat. The total distance she moves cannot exceed her total movement allowance, but she can go in any direction she wants. She can even jump safely down. If she is not over a solid surface when her movement ends, she falls as normal. She may use the run action in conjunction with this ability."
    },
    "Charge of the Magi": {
      "prerequisites": "magus 9",
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action when charging, so she can turn herself into a living projectile that blasts her opponent with a jolt of arcane power. She makes a charge as normal. If her attack hits, she deals an extra 1d6 points of force damage plus an additional 1d6 for every 3 magus levels she possesses in addition to her attack’s normal damage, and her foe must make a Fortitude save (DC 10 + half her magus class level + her Intelligence modifier) or be knocked prone. This extra damage is doubled on a critical hit, in addition upon a critical hit a +2 circumstance bonus is added to the DC of the save. When making this charge, she is considered to be flying. She can move over pits and other hazards, but she lands in the space where her charge ends and suffers any drawbacks for standing there after resolving her attack. If she misses the ability is expended."
    },
    "Damage Shield": {
      "benefits": "The magus can spend 1 point from her arcane pool as a immediate action to resist damage from each attack she is subject to in a single round. She reduces all damage dealt to her for each individual attack by her magus class level for 1 full round."
    },
    "Doublefire Wand": {
      "prerequisites": "magus 15, wand wielder arcana",
      "benefits": "The magus can activate two wands or activate two staff abilities at once in place of casting a spell when using spell combat."
    },

    "Eldritch Athame": {
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to transforms her weapon into a weapon of pure magical energy for 1 minute per magus class level. She can cause it to adopt a new form suitable to the opponent at hand. The weapon retains any magical qualities it had in its normal form. The magus can choose to return it to its normal form before that time. The weapon can become any weapon that is the same size or one category larger or smaller than its base form. The magus gains proficiency with that specific weapon during that time. A magus can transform the weapon into a ranged weapon, but she must supply ammunition as normal."
    },
    "Energy Burst": {
      "prerequisites": "magus 12",
      "benefits": "The magus can spend 2 points from her arcane pool as a swift action to create a burst of energy that fills a 30-foot spread centered on her. This energy is of a type chosen at the time she selects this major arcana and once chosen it cannot be changed (acid, cold, electricity, fire, or sonic). This burst of energy deals 1d6 points of damage per magus class level (maximum of 20d6). Anyone in this area must make Reflex saves (DC 10 + half her + her Intelligence modifier) for half damage. The magus is immune to the effects and damage from her own energy burst."
    },
    "Energy Web": {
      "prerequisites": "magus 15",
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to create a tangible web of searing energy that wraps and tangles around her weapon. When she attacks, this web clings to her opponent and continues to damage the foe for a number of rounds equal to half her magus class level. She creates a web of pure energy that can burn, shock, or freeze an opponent. This energy is of a type chosen at the time she selects this major arcana and once chosen it cannot be changed (acid, cold, electricity, fire, or sonic). If she makes a successful melee attack before this ability’s duration ends, she transfers the web of energy to her opponent. He takes 1d6 points of energy damage per two magus class levels she possesses in each round, at the start of her turn, until this ability’s duration ends. She also gains this extra damage on the attack that transfers the web to the target. Her opponent may make a Reflex save (DC 10 + half her magus class level + her Intelligence modifier) to avoid the web; If he succeeds, the magus deals the extra energy damage with her attack but he avoids becoming trapped in the web and does not take any further damage from it. A creature caught in an energy web can escape by taking a move action and making a successful Escape Artist check against a Difficulty Class equal to the Reflex save DC needed to avoid it."
    },
    "Flattening Strike": {
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to hammer her foe with a concussive strike that sends ripples of raw, arcane energy through him, forcing him to tumble to the ground. In addition to dealing normal damage with her next attack the target must make a Fortitude save (DC 10 + half her magus class level + her Intelligence modifier) or she knocks her opponent backward 5 feet for every two magus class levels she possesses (minimum 5’) and the foe is knocked prone. If her strike misses, this use of the ability is wasted."
    },
    "Force Adept": {
      "prerequisites": "magus with the spellblade archetype",
      "benefits": "A spellblade magus can as a swift action cast a mage hand spell at will if the spellblade magus is at least 9th level she can spend 1 point from her arcane pool as a swift action to cast a telekinesis spell as part of that swift action."
    },
    "Free Step": {
      "benefits": "The magus can expend 1 point from her arcane pool as a swift action to strengthen her legs and improve her agility, granting a +10 foot enhancement bonus to her speed for a number of rounds equal to her magus class level. She can walk up vertical surfaces at her base land speed. She does not gain the ability to hang upside down, making it impossible for her to move along any surface that is more than a 90- degree slope with respect to the ground. She can also make a double move and run when moving in this manner. If she does not end her move on a horizontal surface, she falls as normal. She suffers attacks of opportunity and other effects for moving along a surface as normal."
    },
    "Malice": {
      "prerequisites": "magus hexcrafter archetype",
      "benefits": "A hexcrafter magus’s attacks are enhanced by the spiteful link between her and her opponent. Her melee attacks deal +2d6 damage to any opponent that is currently under the effects of one of her hexes."
    },
    "Maneuvering Strike": {
      "prerequisites": "Maneuver mastery arcana",
      "benefits": "The magus can spend 1 point from her arcane pool as a free action so that her next combat maneuver does not provoke an attack of opportunity."
    },

    "Necromantic Strike": {
      "prerequisites": "magus 15",
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to imbue his weapon with a shimmering halo of black, necromantic energy, allowing her to disrupt her opponent’s life force. This energy is also baneful to undead creatures, allowing her to destroy them with a single, savage blow. She deals an extra 2d6 points of damage with her next attack as the necromantic energy weakens her living foe. In addition, her opponent must make a Fortitude save (DC 10 + half her magus class level + her Intelligence modifier). On a failed save, the opponent takes 1d6 points of Strength and Constitution damage. This is a negative energy effect."
    },
    "Nigh Irresistible Strike": {
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to channel arcane energy through her weapon, which allows the power to flow into her opponent and disrupt his magical defenses. As a free action before resolving an attack, she may declare that she is using this ability. If she hits, roll and apply damage as normal. In addition, if the target fails a Will Save (DC 10 + half her magus class level + her Intelligence Modifier) the target’s spell resistance, energy resistance, or damage reduction is reduced by her magus class level for a number of rounds equal to her magus class level.",
      "Special": "A creature or object that saves against this ability is immune to the effects of her resistant strike for 24 hours."
    },
    "Opportune Strike": {
      "prerequisites": "magus 15, critical strike arcana",
      "benefits": "Whenever the magus scores a hit with a melee weapon when making an attack of opportunity, he may cast a spell with a range of touch as an immediate action, and then make a touch attack with that spell against the target of the attack of opportunity as a free action. The magus can use this ability once per day."
    },

    "Overcome Circumstances": {
      "benefits": "The magus can expend 1 or more point from her arcane pool as a free action to shrug off detrimental effects. She can immediately attempt a second saving throw to shrug off one unwanted condition even if she fails this save she ignores one debilitating conditions per point expended that she is currently under the effect of for 1 round per magus class level, that time counts as part of each condition’s duration. Once this benefits lapses, the remaining conditions return for the remainder of their durations. She cannot delay or shrug off the dead condition."
    },
    "Searing Shield": {
      "prerequisites": "Spell shield arcana",
      "benefits": "When she activates her spell shield and an opponent attacks her and misses her newly improved Armor Class but would hit the Armor Class total she had before applying the shield’s benefitss, the foe suffers 2d6 points of fire damage. In this case, her foe strikes her shield’s fiery, burning aura."
    },

    "Serpent-Eyed Strike": {
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action so that her attack creates a hypnotic pattern, weaving an arcane matrix that lulls her foe into quite a state of distraction. With his defenses down, she can strike him more easily. She chooses a single target that she can see. This foe must make a Will save (DC 10 + half her magus class level + her Intelligence modifier) or the foe lose his Dexterity bonus to Armor Class against her attacks (and only her attacks) for 1d6 rounds. This is a mind-affecting ability."
    },
    "Shield Caster": {
      "prerequisites": "Medium armor class ability",
      "benefits": "The magus gains proficiency with bucklers and light shields without incurring the normal arcane spell failure chance. Like any other arcane spellcaster, a magus wearing heavy armor or using a heavy shield incurs a chance of arcane spell failure if the spell in question has a somatic component unless he possess the heavy armor class feature."
    },
    "Slice Through Wardings": {
      "prerequisites": "magus 12, dispelling strike",
      "benefits": "The magus can spend 1 point from her arcane pool to make a single attack as a standard action that ignores all a foe’s magic-based protections (Armor Class bonuses, stoneskin, and so on). The magus cannot use this ability to ignore spells or effects that take affect when a foe is attacked, like fire shield. The character must declare his use of this ability before making the attack."
    },

    "Song of Arcane Triumph": {
      "prerequisites": "Elf, half elf",
      "benefits": "The mighty song of arcane triumph allows a magus to channel the raw energy of her magical power into her elven music. The magus can spend 1 point from her arcane pool as a swift action to sing a litany of triumph on a single successful hit. The opponent that his attack struck suffers 1d6 points of sonic per magus class level (maximum 20d6) in addition to normal damage. A Fortitude save (DC 10 + half her magus class level + her Intelligence modifier) halves the sonic damage this effect deals. On a critical hit, double this damage (unlike other bonus damage). Apply this extra damage even if the opponent is immune to critical hits."
    },
    "Song of Death’s Herald": {
      "prerequisites": "Elf, half elf",
      "benefits": "The grim, terrible song of death’s herald foretells the doom of the magus’s foe. The magus can spend 1 point from her arcane pool as a swift action to select a single opponent within her line of sight that can hear his words for 1 round per magus class level. The target need not understand the bladesong’s language. The intent and meaning behind the song transcends such barriers. Creatures with an Intelligence of 4 or less are immune to this ability. The target of this ability must make a Will save (DC 10 + half her magus class level + her Intelligence modifier). On a failed save, the magus’s weapon forms a deadly link to the target. The magus sings of each of his attacks against the target before he completes it, but she exactly predicts the result of each stroke. Her target takes a –2 morale penalty to Armor Class on all attacks by the magus. In addition, the magus increases her critical threat range by one (do this before doubling the range due to the keen quality and other effects) against her target, and she deals an additional 1d6 points of sonic damage against the foe."
    },
    "Song of the Blade Dance": {
      "prerequisites": "Elf, half elf",
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action to sing a song that enhances the flow of magic through his weapon for one round per magus class level. Her weapon pulses with the music, allowing her to enter a fighting dance that bewilders her enemies and sharpens her combat talents. While in this dance, she gains a +2 dodge bonus to Armor Class, a +1 bonus on attacks, and a +2 bonus on initiative."
    },
    "Song of Victory": {
      "prerequisites": "Elf, half elf",
      "benefits": "The elves have many songs that speak of their great victories. The magus can spend 1 point from her arcane pool as a swift action to inject the triumphant emotions behind such tunes with magical energy, causing them to lift his allies’ hearts while crushing her enemies’ hopes for 1 round per magus class level. All her allies within 60 feet receive a +2 morale bonus on attacks, checks, and saves. Enemies with an Intelligence score within this same area must make Will saves (DC 10 + half her magus class level + her Intelligence modifier) or take a –1 morale penalty on attacks. The magus does not gain the benefitss of this ability—only her allies gain them."
    },
    "Stalwart": {
      "prerequisites": "magus hexcrafter archetype",
      "benefits": "A hexcrafter magus can use mental and physical resiliency to avoid certain attacks. If she makes a Fortitude or Will saving throw against an attack that has a reduced effect on a successful save, she instead avoids the effect entirely. This ability can only be used if the hexcrafter magus is wearing light armor, medium armor, or no armor. A helpless hexcrafter magus does not gain the benefits of the stalwart ability."
    },
    "Ultimate Eldritch Athame": {
      "prerequisites": "magus 15, eldritch athame arcana",
      "benefits": "As a free action, the magus can cause his weapon to manifest new powers as she literally sculpts its magical form with her arcana. Once per round as a free action, the magus can alter the weapon’s magical properties. She can choose to spend its total enhancement bonus on weapon traits and powers, or she can devote them to an enhancement bonus on attack rolls and damage rolls (+5 maximum as normal). For example, an magus’s weapon is a +5 weapon and has been given the frost (+1), keen (+1), and speed (+3) special abilities. The eldritch blade could alter the +5 bonus spent on abilities to gain a different set of powers, such as dancing (+4) and flaming (+1). This change is permanent until the magus changes them yet again."
    },

    "Vampiric Thirst": {
      "prerequisites": "Black blade class ability or can cast vampiric touch, pool strike",
      "benefits": "The magus can spend 1 point from her arcane pool as a free action so that the damage dealt by her pool strike grants her temporary hit points equal to the damage she deals with her pool strike. She can’t gain more than the subject’s current hit points + the subject’s Constitution score (which is enough to kill the subject). The temporary hit points disappear 1 hour later."
    },

    "Wave of Mutilation": {
      "prerequisites": "magus 6",
      "benefits": "The magus can spend 1 point from her arcane pool as a swift action transforming a single cut of her weapon into a scything wave of energy that tears through her enemies’ ranks. She unleashes magical force in a single sweep of her weapon in a 30-foot cone. Roll damage for her attack as normal except the damage type is changed to force and apply it to all targets in the cone’s area. Her opponents can make Reflex saves (DC 10 + half her magus class level + her Intelligence modifier) for half damage."
    },
    "Arcane Critical": {
      "benefits": "Whenever the magus scores a critical hit, he earns a single temporary point he may add to his arcane pool. If this point is not used by the end of the magus’s next round, it is lost.",
      "Special": "The magus may use this ability once per day for every 4 levels (minimum 1/day)."
    },
    "Arcane Focus": {
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to reduce the penalties to attack rolls he suffers when using spell combat to -1. This effect lasts for 1 minute."
    },
    "Critical Spell": {
      "prerequisites": "magus 9",
      "benefits": "Whenever the magus scores a critical hit with a spell’s attack roll without delivering the spell through a weapon strike, he may immediately take a single melee weapon attack as a free action. The weapon strike may be made against any foe within the magus’s reach. The magus can use this ability once per day."
    },
    "Elemental Assault": {
      "prerequisites": "magus 12",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to imbue himself with elemental energy. This functions as elemental aura and lasts for a number of rounds equal to the magus’s Intelligence modifier."
    },
    "Enduring Arcana": {
      "benefits": "When the magus expends a point from his arcane pool to grant enhancement bonuses or properties to his weapon, the bonuses and properties last for 1 minute/level."
    },
    "Enduring Warding": {
      "prerequisites": "Warding arcana",
      "benefits": "When the magus expends a point from his arcane pool to grant enhancement bonuses or properties to his armor, the bonuses and properties last for 1 minute/level."
    },
    "Warding": {
      "benefits": "The magus may expend 1 point from his arcane pool as a swift action to grant any armor he is wearing a +1 enhancement bonus to AC for 1 minute. For every four levels beyond 1st, the armor gains another +1 enhancement bonus, to a maximum of +5 at 17th level. These bonuses can be added to the armor, stacking with existing armor enhancement to a maximum of +5. Multiple uses of this ability do not stack with themselves. A magus of 5th level or higher can use these bonuses to add any of the following armor properties fortification (light, moderate of heavy), ghost touch, invulnerability, and spell resistance. Adding these properties consumes an amount of bonus equal to the property’s base price modifier. The magus can also grant the following properties using the listed bonus cost"
    },
    "Enruned Dagger": {
      "benefits": "The magus may expend a point from his arcane pool to scribe a rune of power on a light weapons with which the magus is proficient. While the rune is in place, the magus can use the hand holding that weapon to complete somatic components of magus spells he casts, and it is considered to have that hand free for purposes of spell combat. The rune lasts 10 minutes per level."
    },
    "Enruned Great Weapon": {
      "benefits": "The magus may expend two points from his arcane pool to scribe a rune of power on a 2-handed weapon with which the magus is proficient. While the rune is in place, when the magus is holding that weapon with two hands, he can use one of the two hands holding the weapon to complete somatic components of magus spells he casts, and it is considered to have one hand free for purposes of spell combat. The rune lasts 10 minutes per level."
    },
    "Enruned Shield": {
      "benefits": "The magus may expend a point from his arcane pool to scribe a rune of power on a shield with which the magus is proficient. While the rune is in place, the magus can use the hand holding that shield to complete somatic components of magus spells he casts, and is considered to have that hand free for purposes of spell combat. The rune lasts 10 minutes per level."
    },
    "Force Magic Device": {
      "benefits": "The magus can expend one point from his arcane pool to gain a +8 bonus on a single Use Magic Device check."
    },
    "Greater Enduring Arcana": {
      "prerequisites": "Enduring arcana arcana",
      "benefits": "When the magus expends a point from his arcane pool to grant enhancement bonuses or properties to his weapon, the bonuses and properties last for 10 minutes/level."
    },

    "Greater Enduring Warding": {
      "prerequisites": "Warding arcana, enduring warding arcana",
      "benefits": "When the magus expends a point from his arcane pool to grant enhancement bonuses or properties to his armor, the bonuses and properties last for 10 minutes/level."
    },

    "Greater Enrune Dagger": {
      "benefits": "The duration of a rune the magus inscribes from the enruned dagger arcana increases to 1 hour/level."
    },
    "Greater Enrune Great Weapon": {
      "benefits": "The duration of a rune the magus inscribes from the enruned great weapon arcana increases to 1 hour/level."
    },
    "Greater Enrune Shield": {
      "benefits": "The duration of a rune the magus inscribes from the enruned shield arcana increases to 1 hour/level."
    },
    "Harmonic Blending": {
      "benefits": "When a magus selects this arcana, he must select one spell from the bard spell list that is at least one level lower than the highest magus spell level he can cast. He adds this spell to his spellbook and list of magus spells known as a magus spell one level higher than its bard spell level. He can instead select two spells to add in this way, but both must be at least two levels lower than the highest-level magus spell he can cast.",
      "Special": "A magus can select this magus arcana more than once."
    },
    "Heroic Assault": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to augment his actions with arcane energy. This functions as heroism, but only targets the magus and lasts for a number of rounds equal to the magus’s Intelligence modifier."
    },
    "Imbue Spell": {
      "benefits": "The magus can imbue a specific weapon with the mystic pattern of a spell that has a range of touch. The magus must know the spell, and it cannot be the highest level of spell the magus can cast. Imbuing this spell into a weapon is done at the same time the magus prepares spells for the day, and cannot be changed until the magus next prepares spells for the day."
    },
    "Invisible Assault": {
      "prerequisites": "magus 12",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to briefly become invisible. This functions as greater invisibility, but only targets the magus and lasts until the end of the magus’s next round."
    },
    "Jinx Blending": {
      "benefits": "When a magus selects this arcana, he must select one spell from the witch spell list that is at least one level lower than the highest magus spell level he can cast. He adds this spell to his spellbook and list of magus spells known as a magus spell one level higher than its witch spell level. He can instead select two spells to add in this way, but both must be at least two levels lower than the highest-level magus spell he can cast.",
      "Special": "A magus can select this magus arcana more than once."
    },
    "Mounted Assault": {
      "prerequisites": "magus 6",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to summon a mount for himself. This functions as phantom steed, with the magus automatically mounted. Only the magus can ride the steed, and it lasts a number of minutes equal to his Intelligence modifier."
    },
    "Mystic Power": {
      "prerequisites": "Tovenaar magus archetype",
      "benefits": "The tovenaar may expend one point from his arcane pool as a swift action to regain one expended use of an ability from an inquisition that has a limited number of uses per day."
    },
    "Piercing Strike": {
      "benefits": "The magus gains a +3 bonus to caster level checks made to penetrate the SR of a creature the magus has damaged with a weapon since the beginning of the magus’s last round. This bonus does not stack with itself."
    },
    "Protected Assault": {
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to protect himself from an opposing alignment."
    },
    "Resistant Assault": {
      "prerequisites": "magus 6",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to protect himself from attacks from one energy type. This functions as resist energy against an energy type of the magus’ choice. The protection can only target the magus, and lasts a number of rounds equal to his Intelligence modifier."
    },
    "Split Arcana": {
      "prerequisites": "magus 6",
      "benefits": "When the magus expends a point from his arcane pool to grant enhancement bonuses or properties to a weapon, he may split the bonuses between two weapons. This otherwise follows all the normal rules for the magus adding enhancement bonuses and properties to weapons."
    },
    "Staff Mastery": {
      "benefits": "The magus can use all his arcana that apply to casting a spell to spells activated from a magic staff. Additionally, any feat that increases the magus’s attack rolls with a quarterstaff also increase his UMD check to activate a magic staff, and any feat that increases the magus’s damage with a quarterstaff also increases the damage dealt to one creature (selected by the magus) effected by any spell activated from a magic staff."
    },
    "Versatile Combatant": {
      "prerequisites": "magus 9",
      "benefits": "The magus can expend 1 point from his arcane pool as a swift action to augment his combat skill. The magus selects one feat for which he meets all the prerequisitess. The magus is considered to have that feat for a number of rounds equal to the magus’s Intelligence modifier. The magus can only access one feat at a time using this magus arcane; if he uses it to select a new feat, any previously gained feat is immediately lost."
    },
    "Wand Lord": {
      "benefits": "When a magus activates a wand, he may expend one or more points form his arcane pool. For every point expended, the caster level of the spell produced by the wand is increased by 2, to a maximum of the magus’s level."
    },
    "Weapon Diligence": {
      "benefits": "The magus can hone his familiarity with a specific weapon to direct his mental focus. The magus selects one weapon. When wielding that weapon, the magus gains a +3 bonus to all concentration checks. If the magus is 10th level or higher, the bonus increases to +6."
    }
  }
}