{
    "curses": {
        "Aboleth": {
        "description": "Your mind is marked by aboleth tampering, either as a result of a close encounter with one of these creatures while you were a child, or even through an ancestor, close family member, or one of your sisters or brothers in faith this associate's interaction with the aboleths may be all that it takes to infect you. You take a -2 penalty on saving throws against mind-affecting effects and addcharm personandhypnotismto your list of 1st-level oracle spells known.", 
        "At 5th level": "addminor imageto your list of 2nd-level oracle spells known.", 
        "At 10th level": "addmodify memoryto your list of 4th-level oracle spells known.", 
        "At 15th level": "addveilto your list of 6th-level oracle spells known."
        },
        "Acursed": {
        "description": "You are cursed with misfortune and sorrow, and you cannot gain benefit from morale bonuses. However, you gain a +4 bonus to all saving throws against curse effects.", 
        "At 5th level": "addill omenAPGto your list of spells known.", 
        "At 10th level": "addgreater brandAPGto your list of spells known.", 
        "At 15th level": "you are immune to curse effects except for your own oracle curse."
        },
        "Blackened": {
        "description": "Your hands and forearms are shriveled and blackened, as if you had plunged your arms into a blazing fire, and your thin, papery skin is sensitive to the touch. You take a -4 penalty on weapon attack rolls, but you addburning handsto your list of spells known.", 
        "At 5th level": "addscorching rayandflaming sphereto your list of spells known.", 
        "At 10th level": "addwall of fireto your list of spells known and your penalty on weapon attack rolls is reduced to -2.", 
        "At 15th level": "adddelayed blast fireballto your list of spells known."
        },
        "Clouded Vision": {
        "description": "Your eyes are obscured, making it difficult for you to see. You cannot see anything beyond 30 feet, but you can see as if you had darkvision.", 
        "At 5th level": "this distance increases to 60 feet.", 
        "At 10th level": "you gain blindsense out to a range of 30 feet.", 
        "At 15th level": "you gain blindsight out to a range of 15 feet."
        },
        "Cold-Blooded": {
        "description": "Your blood turns sluggish without sufficient heat, and you must seek warmth and shelter earlier than most. This oracle curse is common among lizardfolk and other oracles with the reptilian subtype. You take a -4 penalty on saves against cold spells and effects, and whenever you fail such a saving throw, you are staggered for 1 round. You can survive without food four times longer than a typical creature of your species before you begin to starve.", 
        "At 5th level": "poisons affecting you have their onset time doubled and last half as long if they end after a set time (for example, a poison with a frequency of 1/round for 6 rounds would instead have a frequency of 1/round for 3 rounds). Poisons with no onset time gain an onset time of 1 round.", 
        "At 10th level": "whenever an action you have readied is triggered, you can take an additional move action at half your speed along with your readied action even if you have already taken a move action that round.", 
        "At 15th level": "you can take an additional move action a number of times per day equal to your Charisma modifier. You can take these additional move actions only on your turn, and can take only one of these extra move actions per turn."
        },
        "Consumed": {
        "description": "Your connection to Abaddon and the daemons that call it home has left you diminished but still able to scorn many mortal frailties. Whenever you take lethal hit point damage, you take an additional number of points of nonlethal damage equal to 1/2 the lethal damage you took. You automatically stabilize when brought below 0 hit points.", 
        "At 5th level": "whenever you make a saving throw against a disease or poison effect, roll twice and use the higher roll as your result.", 
        "At 10th level": "you can go without food or water for a number of days equal to your oracle level before suffering any ill effects due to starvation or thirst.", 
        "At 15th level": "whenever a creature within 30 feet takes damage while in combat, you automatically gain 1 temporary hit point. You can benefit from this ability a number of times per round equal to your Charisma modifier, and you can gain a total number of temporary hit points in this way equal to your oracle level. Temporary hit points gained this way disappear after 1 hour."
        },
        "Covetous": {
        "description": "You find yourself drawn to the luster of wealthy living. You must wear fine nonmagical clothing and jewelry worth at least 50 gp + 100 gp per character level you have beyond 1st. If you do not have sufficient wealth to purchase this additional equipment, you feel a strong desire (but are not compelled) to sell existing items or steal from others to obtain it. You are sickened whenever you do not meet this requirement; you are also sickened for 24 hours after anything worth 25 gp x your character level or more is taken from you against your will. Use Magic Device becomes a class skill for you.", 
        "At 5th level": "you gain a +4 insight bonus on Appraise checks, Spellcraft checks to identify magic items, and Use Magic Device checks.", 
        "At 10th level": "you addfabricateto your list of spells known.", 
        "At 15th level": "you add half your oracle level to your CMD against steal combat maneuvers and to the DC of Sleight of Hand checks to take items from you."
        },
        "Deaf": {
        "description": "You cannot hear and suffer all of the usual penalties for being deafened. You cast all of your spells as if they were modified by the Silent Spell feat. This does not increase their level or casting time.", 
        "At 5th level": "you receive a +3 competence bonus on Perception checks that do not rely upon hearing, and the initiative penalty for being deaf is reduced to -2.", 
        "At 10th level": "you gain scent and you do not suffer any penalty on initiative checks due to being deaf.", 
        "At 15th level": "you gain tremorsense out to a range of 30 feet."
        },
        "Deep One": {
        "description": "The lure of the ocean tugs at your soul. You reduce your base land speed by 5 feet. You gain a swim speed equal to your land speed, and if you already have a swim speed, you increase it by 10 feet.", 
        "At 5th level": "your natural armor bonus increases by 1 as your skin thickens.", 
        "At 10th level": "you gain a +1 bonus to your caster level when casting spells underwater and when casting spells with the water descriptor.", 
        "At 15th level": "you gain the benefits offreedom of movementwhile underwater."
        },
        "Demonic": {
        "description": "Your heart is cursed with the pull of the Abyss. You cannot cast spells with the good or lawful descriptors, nor can you summon good or lawful creatures. Good and lawful creatures instinctively distrust you, and you take a -4 penalty on all Diplomacy checks against such creatures. You gain a +2 bonus on all Bluff and Intimidate checks. Diplomacy is not a class skill for you, but Bluff or Intimidate (choose one) is.", 
        "At 5th level": "you gain a +4 bonus to all saving throws against fear effects.", 
        "At 10th level": "you gain immunity to poison.", 
        "At 15th level": "any weapon you wield is treated as chaotic and evil for the purposes of overcoming damage reduction."
        },
        "Elemental Imbalance": {
        "description": "You wield an element's might, but you are vulnerable to its opposite. Choose air, earth, fire, or water. If you select air, you gain vulnerability to acid, cannot benefit from any acid resistance or immunity, and cannot cast spells with the acid or earth descriptors. If you select earth, you gain vulnerability to electricity, cannot benefit from any electricity resistance or immunity, and cannot cast spells with the air or electricity descriptors. If you select fire, you gain vulnerability to cold, cannot benefit from any cold resistance or immunity, and cannot cast spells with the cold or water descriptors. If you select water, you gain vulnerability to fire, cannot benefit from any fire resistance or immunity, and cannot cast spells with the fire descriptor.As you advance in level, add the following spells to your oracle spells known based on your chosen element. At 1st level, addburning hands(fire),grease(earth),hydraulic pushAPG(water), orshocking grasp(air) to your spells known.", 
        "At 5th level": "addfrigid touchUM(water),glitterdust(earth),levitate(air), orscorching ray(fire) to your spells known.", 
        "At 10th level": "addball lightningAPG(air),calcific touchAPG(earth),ice storm(water), orwall of fire(fire) to your spells known.", 
        "At 15th level": "addchain lightning(air),contagious flameAPG(fire),flesh to stone(earth), orfreezing sphere(water) to your spells known."
        },
        "Ghoul": {
        "description": "While your actual dietary needs don't change, you crave the flesh of sentient creatures. You can only go without food for 12 hours before you begin to starve, and when you do starve, the DC of the Constitution check to avoid taking damage increases by 5. If you feed on fresh, raw flesh (no older than 1 hour) from a creature of your own race, you gain a +1 morale bonus on all saving throws for 24 hours.", 
        "At 5th level": "you addghoul touchto your list of 2nd-level oracle spells known.", 
        "At 10th level": "you become immune to paralysis and disease.", 
        "At 15th level": "you gain the effects ofheroes' feastwhenever you feed on the raw flesh of a sentient creature, and the effects of thisheroes' feastdouble if the flesh you eat comes from a member of your own race (this effect applies no more often than once per day)."
        },
        "God-Meddled": {
        "description": "The isle of Iblydos is populated and watched over by hero-gods, some of whom are known for entangling mortals in their own affairs. The gods' interference in your life has left you with strange, unpredictable powers dependent on divine whim. Bizarre side effects occur whenever you are affected by a spell from a divine caster for better or for worse. Once per round, when a creature casts a divine spell including you as a target, roll 1d20 and consult the table below. The effect resulting from this roll begins at the end of that enemy's turn. This effect targets only you, even if other creatures were included as targets of the triggering spell.", 
        "At 5th level": "you gain a +2 competence bonus on saving throws to resist divine spells.", 
        "At 10th level": "you become immune to the confused condition.", 
        "At 15th level": "you gain a +4 competence bonus on saving throws to resist mind-affecting effects.God-Meddled Roll a d20,  on a 1 You provoke an attack of opportunity from one enemy adjacent to you. If no enemy is adjacent, the closest enemy can move its full movement speed in your direction as a free action. If multiple enemies qualify, the GM determines which creature attacks or moves. This movement does not trigger attacks of opportunity On a .2-3Y our movement speed is halved for 1 round On a .4-5 You are deafened for 1 round On a .6-7 You are knocked prone On a 8-10 You shrink by one size category for 1 round, asreduce person. On a 11-13 You grow by one size category for 1 round, asenlarge person. On a 14-15 Your caster level is treated as 1 higher for the purpose of spell durations for 1 round. On a 16-17 Creatures in squares adjacent to you are pushed 10 feet away from the space you occupy. On a 18-19 You are able to understand all languages for 1 round.20You gain the benefits ofhastefor 1 round. d20Effect1You provoke an attack of opportunity from one enemy adjacent to you. If no enemy is adjacent, the closest enemy can move its full movement speed in your direction as a free action. If multiple enemies qualify, the GM determines which creature attacks or moves. This movement does not trigger attacks of opportunity On a .2-3Y our movement speed is halved for 1 round On a .4-5Y ou are deafened for 1 round On a .6-7Y ou are knocked prone On a .8-10 You shrink by one size category for 1 round, asreduce person. On a 11-13 You grow by one size category for 1 round, asenlarge person. On a 14-15 Your caster level is treated as 1 higher for the purpose of spell durations for 1 round. On a 16-17 Creatures in squares adjacent to you are pushed 10 feet away from the space you occupy. On a 18-19 You are able to understand all languages for 1 round. On a 20 You gain the benefits ofhastefor 1 round."
        },
        "Haunted": {
        "description": "Malevolent spirits follow you wherever you go, causing minor mishaps and strange occurrences (such as unexpected breezes, small objects moving on their own, and faint noises). Retrieving any stored item from your gear requires a standard action, unless it would normally take longer. Any item you drop lands 10 feet away from you in a random direction. Addmage handandghost soundto your list of spells known.", 
        "At 5th level": "addlevitateandminor imageto your list of spells known.", 
        "At 10th level": "addtelekinesisto your list of spells known.", 
        "At 15th level": "addreverse gravityto your list of spells known."
        },
        "Hellbound": {
        "description": "Infernal influence grants you profane insight and weighs on your soul. You cannot cast spells with the good or chaotic descriptors, and you can't summon good or chaotic creatures. Good and chaotic creatures instinctively distrust you, and you take a -4 penalty on all Diplomacy checks against such creatures. You gain a +2 bonus on all Bluff and Intimidate checks.", 
        "At 5th level": "you gain a +4 bonus to all saving throws against charm effects.", 
        "At 10th level": "you gain immunity to fire.", 
        "At 15th level": "any weapon you wield is treated as lawful and evil for the purposes of overcoming damage reduction."
        },
        "Hive": {
        "description": "You were exposed at a young age (perhaps even before you were born) to the alien species known as the hive, but this exposure did not result in a full-blown infestation by these otherworldly monsters. Others (including animals) find the unsightly spines and rough growths that periodically emerge from your flesh to be disturbing and distracting, and you take a -4 penalty on Bluff, Diplomacy, Handle Animal, and Ride checks. Once per day as a standard action, you can cough up an ovoid, leathery sphere that can be hurled as a flask of acid, though it becomes inert after 24 hours.", 
        "At 5th level": "you gain the benefits ofendure elementsin hot environments and are immune to infestations (save for those from the hive itself ).", 
        "At 10th level": "your skin deformities grow numerous enough to increase your natural armor bonus by 1.", 
        "At 15th level": "you gain acid resistance 20."
        },
        "Hunger": {
        "description": "Ravenous hunger wracks your body in stressful situations. You gain none of the benefits from spells or magic items that provide nourishment, such asgoodberry,heroes' feast, or aring of sustenance. You also gain a bite attack that deals an amount of piercing damage appropriate for your size (1d8 for a Large creature, 1d6 for Medium, 1d4 for Small) as a secondary natural attack. You begin each combat with the sickened condition until you deal damage with your bite attack.", 
        "At 5th level": "you gain the grab monster special ability on bite attacks against creatures smaller than yourself.", 
        "At 10th level": "your bite attack deals damage as if you were one size category larger.", 
        "At 15th level": "you gain the blood drain monster special ability with your bite, dealing 1d2 points of Constitution damage at the end of a turn if you grapple a foe."
        },
        "Infested": {
        "description": "Insects, spiders, grubs, and other vermin plague you constantly. They crawl in your hair, fill your clothes, and f ly or crawl into your mouth, nose, and ears. You take a –4 penalty on Diplomacy checks, and when you first meet someone, the person’s initial attitude toward you starts one level lower than normal. Animals shy away from you—you take a –4 penalty on Handle Animal checks. You gain a +2 bonus on Fortitude saves versus poisons from insects, scorpions, and spiders, as well as the distraction ability of swarms of such creatures", 
        "At 7th level": "your bonus on poison and distraction saves increases to +4, and you gain DR 10/— against all swarm damage.",
        "At 13th level": "you add swarm skinAPG to your list of spells known.", 
        "At 17th level": "you become immune to the swarm damage and the distraction ability of insect, scorpion, and spider swarms."
        },
        "Lame": {
        "description": "One of your legs is permanently wounded, reducing your base land speed by 10 feet if your base speed is 30 feet or more. If your base speed is less than 30 feet, your speed is reduced by 5 feet. Your speed is never reduced due to encumbrance.", 
        "At 5th level": "you are immune to the fatigued condition (but not exhaustion).", 
        "At 10th level": "your speed is never reduced by armor.", 
        "At 15th level": "you are immune to the exhausted condition."
        },
        "Legalistic": {
        "description": "The shackles of Hell impose savage consequences should you violate a covenant, but also imbue you with remarkable guile. Whenever you break your word (either purposefully or unintentionally), you become sickened for 24 hours or until you meet your obligation, whichever comes first. However, once per day, you can make a vow to yourself that grants a +4 morale bonus on any one roll you make while trying to fulfill a promise made to another individual.", 
        "At 5th level": "you gain a +3 competence bonus on Diplomacy, Intimidate, and Sense Motive checks while talking to an individual one-on-one.", 
        "At 10th level": "you can make a new saving throw each minute to resist mind-affecting effects as your subconscious searches for loopholes.", 
        "At 15th level": "any creature that violates its freely given word to you takes a penalty to AC, to spell resistance, and on saving throws against your attacks and abilities equal to your Charisma modifier (minimum 1) for 24 hours."
        },
        "Lich": {
        "description": "Every living spellcaster hides a secret in their flesh a unique, personalized set of conditions that, when all are fulfilled in the correct order, can trigger the transformation into a lich. Normally, one must expend years and tens of thousands of gold pieces to research this deeply personalized method of attaining immortality. Yet, in a rare few cases, chance and ill fortune can conspire against an unsuspecting spellcaster. You have unknowingly) fulfilled most (but not all) of the ritualistic components to achieve lichdom. You have yet to turn into an undead creature, but you are close. You take damage from positive energy and heal from negative energy as if you were undead.", 
        "At 5th level": "addcontrol undeadto your list of 2nd-level oracle spells known.", 
        "At 10th level": "addundead anatomy IUMto your list of 3rd-level oracle spells known andundead anatomy IIUMto your list of 5th-level oracle spells known.", 
        "At 15th level": "you are immune to death effects."
        },
        "Lycanthropy": {
        "description": "You suffer from a minor form of lycanthropy. The exact animal your body and mind are aligned with can vary, but you should choose an animal that matches your faith thematically. In times of stress or unease, you cannot speak only growl and snarl like an animal. This ability works similarly to the tongues curse, but whenever you are in combat, you cannot speak at all. This does not interfere with spellcasting but does apply to spells that are language dependent. A character under the effects ofspeak with animalscan understand you, and you can communicate with such characters normally. You can speak with animals when in this condition. Choose one type of animal commonly associated with lycanthropy (such as rats, wolves, or bears); you gain a +4 bonus on Handle Animal checks with these creatures.", 
        "At 5th level": "addcharm animalto your list of 1st-level oracle spells known andanimal messengerto your list of 2nd-level oracle spells known.", 
        "At 10th level": "addbeast shape Ito your list of 3rd-level oracle spells known andbeast shape IIto your list of 5th-level oracle spells known.", 
        "At 15th level": "you gain damage reduction 5/silver, and if you already have this type of damage reduction, it increases in value by 5 (to a maximum of DR 15/silver)."
        },
        "Plagued": {
        "description": "You suffer from minor ailments and sicknesses. While you struggle to resist new diseases, you have grown accustomed to the many inconveniences of sickness. You take a -1 penalty on all saving throws against disease or infestation effects, but you are immune to the sickened condition.", 
        "At 5th level": "addpox pustulesAPGto your list of 2nd-level oracle spells known.", 
        "At 10th level": "increase the save DC of any disease effect you create by +2, and you raise the number of saves required to recover naturally from these diseases by 1.", 
        "At 15th level": "you are immune to the effects of disease and infestations, but you can still function as a carrier for sickness."
        },
        "Possessed": {
        "description": "Another mind shares your body, interfering with your control, and it's more difficult for you to concentrate as a result. You take a -2 penalty on all concentration checks, and concentrating to maintain a spell duration provokes attacks of opportunity. Whenever a foe attempts to use an effect to possess or dominate you and the effect allows a saving throw to negate, you may roll twice and take the better of the two results.", 
        "At 5th level": "if you become dazed or stunned, you can choose instead to become confused for twice the duration the daze or stun effect would have normally lasted.", 
        "At 10th level": "addpossessionOAto your list of 5th-level oracle spells known.", 
        "At 15th level": "addgreater object possessionOAto your list of 7th-level oracle spells known."
        },
        "Powerless Prophecy": {
        "description": "You are forewarned of danger but can't act to prevent it. You gain uncanny dodge, as the rogue class feature. However, you can't take any actions in a surprise round, including free actions, except for flash of insight (see Revelations below). In the absence of a surprise round, you are staggered for the entire first round of combat.", 
        "At 5th level": "you gain a +4 insight bonus on initiative checks.", 
        "At 10th level": "you gain improved uncanny dodge as the rogue ability, using your oracle level as your rogue level.", 
        "At 15th level": "you gain a +4 insight bonus on all your saving throws and to your AC during surprise rounds and when you are otherwise unaware of an attack."
        },
        "Pranked": {
        "description": "Capricious fey constantly bedevil you, playing pranks on you such as tying your shoelaces together, hiding your gear, making inappropriate noises or smells at formal events, and mimicking your voice to tell embarrassing lies. In addition to any social consequences of such mischief, you take a -4 penalty on initiative checks. Furthermore, whenever you attempt to retrieve a stored item from your gear, there's a 25% chance that you fail to find it with that action. Addfaerie fireandghost soundto your list of spells known.", 
        "At 5th level": "addglitterdustandminor imageto your list of spells known.", 
        "At 10th level": "addconfusionto your list of spells known as a 5th-level spell.", 
        "At 15th level": "addproject imageto your list of spells known. A possessed oracleUMcan select this curse in place of the haunted curse."
        },
        "Promethean": {
        "description": "Your body is falling apart, forcing you to rely on mechanical augmentations or replacements to keep yourself alive. You take 1 point of Constitution damage each day, but you also ignore the first point of Strength, Dexterity, or Constitution damage you take for the remainder of that day.", 
        "At 5th level": "you gain a +2 bonus on all saving throws on effects that cause ability damage, ability drain, or ability score penalties.", 
        "At 10th level": "this bonus increases to +6.", 
        "At 15th level": "any effect that would normally deal ability drain on you instead deals ability damage whenever you successfully save against the effect."
        },
        "Putrid": {
        "description": "Your presence stagnates water and befouls all liquids carried on your person, including magical items such as potions, and unattended sources of still water within 10 feet. Creatures who drink such a liquid are nauseated for 1 round (though potions and similar liquids still convey their usual benefits as well). Affected liquids remain stagnant for 1 hour after leaving your presence.Purify food and drinkcan cleanse a stagnant potion or water with a successful caster level check (DC = 15 + double the potion's caster level).", 
        "At 5th level": "you become immune to the nauseated effects created by liquids your presence has befouled.", 
        "At 10th level": "your body is covered in noxious slime, and each creature adjacent to you at the beginning of its turn must succeed at a Fortitude save (DC = 10 + half your oracle level + your Charisma modifier) or become sickened for 1 round.", 
        "At 15th level": "your slime coating grants you DR 10/ ."
        },
        "Reclusive": {
        "description": "You are reclusive and paranoid to the point that your allies cannot easily help you in times of stress or unease. Whenever you are in combat, your allies must succeed at a melee touch attack to affect you with touch spells, and you must attempt saving throws to resist all spells cast by anyone other than yourself, even those cast by allies. Instantaneous spells you cast only on yourself affect you as though your caster level were 1 higher.", 
        "At 5th level": "any spells you cast only on yourself affect you as if they were modified by the Extend Spell feat. This does not increase their level or casting time.", 
        "At 10th level": "you are immune to charm spells and spell-like abilities.", 
        "At 15th level": "you gain spell resistance equal to 10 + your oracle level."
        },
        "Scourge": {
        "description": "You are a blight on the natural world. Bizarre natural hazards develop within a 300-ft radius around you whenever you linger in a natural area for more than 10 minutes, aslesser curse terrain. You cannot choose the hazards or their locations. However, your movement is unimpeded by undergrowth, as adruid's woodland stride ability, as plants wither away in your footsteps.", 
        "At 5th level": "addfeast of ashesto your list of 2nd-level oracle spells known.", 
        "At 10th level": "addexplosion of rotto your list of 4th-level oracle spells known.", 
        "At 15th level": "addswarm skinto your list of 6th-level oracle spells known."
        },
        "Shadowbound": {
        "description": "Your pigmentation is oddly colorless, and your eyes are highly sensitive to light. You are blinded for 1 round when exposed to normal or bright light and dazzled while in such a lit area. You gain darkvision to a range of 30 feet.", 
        "At 5th level": "the range of your darkvision increases by 30 feet.", 
        "At 10th level": "addshadow conjurationto your list of 4th-level oracle spells known andshadow evocationto your list of 5th-level oracle spells known.", 
        "At 15th level": "addshadow walkto your list of 6th-level oracle spells known."
        },
        "Shattered Psyche": {
        "description": "Your mind is crowded with dozens of voices, fragmented snippets of your past lives. You take a -2 penalty on all Intelligence-based skill checks, Wisdombased skill checks, and concentration checks. You gain a +4 competence bonus on saving throws made against mind-affecting effects.", 
        "At 5th level": "you're immune to charm effects.", 
        "At 10th level": "you're immune to compulsion effects.", 
        "At 15th level": "you're immune to all mind-affecting effects."
        },
        "Site-Bound": {
        "description": "You bond with a particular 10-foot square, and must remain within 1,500 feet of that site or immediately become sickened. You must succeed at a DC 15 Fortitude save each minute you spend outside of the boundary or become nauseated. For every hour spent outside of the boundary, you also take 1d4 points of Constitution damage (no save). When within range of your bonded site, you gain a +1 bonus to your caster level when casting oracle spells.", 
        "At 5th level": "the radius increases to 2,250 feet.", 
        "At 10th level": "the radius increases to 3,000 feet and the bonus to your caster level when casting oracle spells within the boundary increases by 1.", 
        "At 15th level": "you can move up to 1 mile from your bonded site."
        },
        "Song-Bound": {
        "description": "(Merfolkonly) Whenever you speak, you are compelled to sing loudly, and you draw out even short utterances with vocal scales or simple melodies. You cannot speak in less than a loud voice, although you may choose not to speak. You can perform the countersong bardic performance (using Perform [sing] only) for a number of rounds per day equal to your oracle level. If you gain the bardic performance class feature, these rounds are in addition to any other bardic performance rounds you gain, but they can be used only for the countersong bardic performance.", 
        "At 5th level": "addcommandandsuggestionto your list of spells known.", 
        "At 10th level": "add 1 to the difficulty class of saving throws against language-dependent spells you cast.", 
        "At 15th level": "add greatercommandandmass suggestionto your list of spells known."
        },
        "Tongues": {
        "description": "In times of stress or unease, you speak in tongues. Pick one of the following languages: Abyssal, Aklo, Aquan, Auran, Celestial, Ignan, Infernal, or Terran. Whenever you are in combat, you can only speak and understand the selected language. This does not interfere with spellcasting, but it does apply to spells that are language dependent. You gain the selected language as a bonus language.", 
        "At 5th level": "pick an additional language to speak in combat and add it to your list of known languages.", 
        "At 10th level": "you can understand any spoken language, as if under the effects oftongues, even during combat.", 
        "At 15th level": "you can speak and understand any language, but your speech is still restricted during combat."
        },
        "Toxic Blood": {
        "description": "Your body is ravaged by a potent, slow-acting poison that resists all treatment. Whenever you must attempt a Fortitude save to resist a poison effect, roll twice and take the lowest result. Additionally, you need one more consecutive successful save to end an ongoing poison. You lose any immunity to poison you have upon receiving this curse, and you become immune to delay poison and neutralize poison, as well as other attempts to suppress or remove the poison from which you are suffering. You gain the poison use ability.", 
        "At 5th level": "you are so envenomed that your touch becomes poisonous. Once per day for every 4 oracle levels you have, you can deliver a unique contact poison as a touch attack or via an unarmed strike or natural weapon. This poison deals 1d2 points of Dexterity damage per round for 5 rounds. Poisoned creatures can attempt a Fortitude save (DC = 10 + 1/2 your oracle level + your Charisma modifier) each round. Success negates the damage and ends the affliction.", 
        "At 10th level": "the poison deals 1d3 points of Dexterity damage per round for 7 rounds.", 
        "At 15th level": "you can expend a use of your poison touch to transfer any poison effect you are currently experiencing from yourself to another creature. The touched creature must immediately attempt a saving throw against the poison (using the poison's initial DC and duration for a single dose, regardless of how many doses are currently affecting you). If the creature fails its save, the poison ceases to act on you, as if you had succeeded at all the necessary saves (this bypasses your immunity to effects that remove poison)."
        },
        "Vampirism": {
        "description": "You crave the taste of fresh, warm blood. You take damage from positive energy and heal from negative energy as if you were undead.", 
        "At 5th level": "you gain channel resistance +4.", 
        "At 10th level": "you addvampiric touchto your list of 3rd-level oracle spells known andundead anatomy IIUMto your list of 5th-level oracle spells known.", 
        "At 15th level": "you gain damage reduction 5/magic."
        },
        "Wasting": {
        "description": "Your body is slowly rotting away. You take a -4 penalty on Charisma-based skill checks, except for Intimidate. You gain a +4 competence bonus on saves made against disease.", 
        "At 5th level": "you are immune to the sickened condition (but not nauseated).", 
        "At 10th level": "you gain immunity to disease.", 
        "At 15th level": "you are immune to the nauseated condition."
        },
        "Wolfscarred Face": {
        "description": "Your face is deformed, as though you were born with a wolf 's muzzle instead of an ordinary nose and jaw. Many mistake you for a werewolf, and in areas plagued by lycanthropes, you must take pains to hide your face. You have a severe speech impediment, and any spells you cast with a verbal component have a 20% chance of failing, wasting your action but not expending the spell. You gain a natural bite attack that deals 1d4 points of damage if you are a Medium creature or 1d3 points of damage if you are Small.", 
        "At 5th level": "you addmagic fangto your list of known spells and your bite damage increases to 1d6 if you are Medium or 1d4 if you are Small.", 
        "At 10th level": "the damage dealt by your bite attack increases to 1d8 if you are Medium or 1d6 if you are Small.", 
        "At 15th level": "you addgreater magic fangto your list of known spells and the damage dealt by your bite attack increases to 2d6 if you are Medium or 1d8 if you are Small."
        },
        "Wrecker": {
        "description": "The destructive power of the Abyss and its teeming hordes of demons seeps from your very pores and into your belongings and surroundings. Held objects gain the broken condition when you use or equip them but regain their actual condition if employed by anyone else. If a held item is restored to unbroken condition, it becomes broken again the following round. Disable Device becomes a class skill for you and you can make Disable Device checks to destroy nonmagical traps as a move action without the need to use tools or take any action beyond simply touching it.", 
        "At 5th level": "whenever you attempt to damage an object with a melee attack, reduce its hardness by an amount equal to your oracle level before determining the damage you deal with that attack.", 
        "At 10th level": "any attacks you make against objects and constructs automatically bypass any damage reduction they may possess except epic.", 
        "At 15th level": "whenever you are dealt damage by an attack with a manufactured weapon, you can require the weapon's wielder to make a Reflex save (DC 10 + 1/2 your oracle level + your Charisma modifier) to avoid having the weapon collapse into dust immediately after striking you (magical weapons receive an additional saving throw against this effect)."
        },
        "Wrecking Mysticism": {
        "description": "divine entity has blessed you with a source of eldritch power that erodes your fortitude, increasing by 50% the duration of any poison, sickened condition, or nauseated condition affecting you. Whenever you would gain a mystery spell, you can gainMagical Tailas a bonus feat instead. Once this choice has been made, it cannot be changed. You cannot replace a bonus spell granted to you by an oracle archetype with Magical Tail, even if it replaces a mystery spell.", 
        "At 5th level": "addminor imageandventriloquismto your list of spells known.", 
        "At 10th level": "addmagic jarto your list of spells known.", 
        "At 15th level": "addproject imageto your list of spells known."
        }

        },
        "mysteries": {
            "Ancestor": {
                "source": "Ultimate Magic pg. 53",
                "deities": ": Erastil, Irori, Pharasma.",
                "class skills": ": An oracle with the ancestor mystery adds Linguistics, and all Knowledge skills to her list of class skills.",
                "bonus spells": ": unseen servant (2nd), spiritual weapon (4th), heroism (6th), spiritual ally (8th), telekinesis (10th), greater heroism (12th), ethereal jaunt (14th), vision (16th), astral projection (18th).",
          "revelations": {
          "Ancestral Weapon (Su)": "You can summon a simple or martial weapon from your family's history that is appropriate for your current size. You are considered proficient with this weapon. At 3rd level, the weapon is considered masterwork. At 7th level, 15th level, and 19th level, the weapon gains a cumulative +1 enhancement bonus. At 11th level, the weapon gains the ghost touch weapon property. You can use this ability for a number of minutes per day equal to your oracle level. This duration does not need to be consecutive, but it must be used in 1-minute increments. The weapon disappears after 1 round if it leaves your grasp.",
          "Blood of Heroes (Su)": "As a move action, you can call upon your ancestors to grant you extra bravery in battle. You gain a +1 morale bonus on attack rolls, damage rolls, and Will saves against fear for a number of rounds equal to your Charisma bonus. At 7th level, this bonus increases to +2, and at 14th level this bonus increases to +3. You can use this ability once per day, plus one additional time per day at 5th level, and every five levels thereafter.",
          "Phantom Touch (Su)": "As a standard action, you can perform a melee touch attack that causes a living creature to become shaken. This ability lasts for a number of rounds equal to 1/2 your oracle level (minimum 1 round). You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Sacred Council (Su)": "As a move action, you can call upon your ancestors to provide council. This advice grants you a +2 bonus on any one d20 roll. This effect lasts for 1 round. You can use this ability a number of times per day equal to your Charisma bonus.",
          "Spirit of the Warrior (Su)": "You can summon the spirit of a great warrior ancestor and allow it to possess you, becoming a mighty warrior yourself. You gain a +4 enhancement bonus to Strength, Dexterity, and Constitution, and a +4 natural armor bonus to AC. Your base attack bonus while possessed equals your oracle level (which may give you additional attacks), and you gain the Improved Critical feat with a weapon of your choice. You can use this ability for 1 round for every 2 oracle levels you possess. This duration does not need to be consecutive, but it must be spent in 1-round increments. You must be at least 11th level to select this revelation.",
          "Spirit Shield (Su)": "You can call upon the spirits of your ancestors to form a shield around you that blocks incoming attacks and grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this shield causes arrows, rays, and other ranged attacks requiring an attack roll against you to have a 50% miss chance. You can use this shield for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Spirit Walk (Su)": "You can become incorporeal and invisible. While in this form, you can move in any direction and pass through solid objects. You can take no action other than to move while in this form. You remain in this form for a number of rounds equal to your oracle level, but you can end this effect prematurely as a standard action. You can use this ability once per day at 11th level, and twice per day at 15th level. You must be at least 11th level to select this revelation.",
          "Storm of Souls (Su)": "You can summon the spirits of your ancestors to attack in a ghostly barrage—their fury creates physical wounds on creatures in the area. The storm has a range of 100 feet and is a 20-foot-radius burst. Objects and creatures in the area take 1d8 hit points of damage for every two oracle levels you possess. Undead creatures in the area take 1d8 points of damage for every oracle level you possess. A successful Fortitude save reduces the damage to half. You must be at least 7th level to select this revelation. You can use this ability once per day, plus one additional time per day at 11th level and every four levels thereafter.",
          "Voice of the Grave (Su)": "You can speak with the dead, as per the spell, for a number of rounds per day equal to your oracle level. These rounds do not need to be consecutive. At 5th level, and every five levels thereafter, the dead creature you question takes a cumulative –2 penalty on its Will save to resist this effect.",
          "Wisdom of the Ancestors (Su)": "Once per day, you can enter a trance in which you commune with the spirits of your ancestors. This trance lasts for 10 minutes, which must be uninterrupted and during which you can take no other actions. When you come out of this trance, you have gained mystical insight into the future. At 1st level, this insight acts as an augury spell with 80% effectiveness. At 5th level, the insight takes the form of a divination with 90% effectiveness. At 8th level, the knowledge you gain is equivalent to a commune spell. None of these spell effects require material components."
          },      
          "final revelation": ": Upon reaching 20th level, you become one with the spirits of your ancestors. You gain a bonus on Will saving throws equal to your Charisma modifier, blindsense out to a range of 60 feet, and a +4 bonus on your caster level for all divination spells. You can cast astral projection as a spell-like ability once per day without requiring material components."
              },
              "Apocalypse": {
                "source": "Monster Codex pg. 56 Among fire giants, the rare but blessed oracles of the apocalypse are favored emissaries of the divine.",
                "deities": ": Gorum, Rovagug.",
                "class skills": ": An oracle with the apocalypse mystery adds Bluff, Disguise, Survival, and Stealth to her list of class skills.",
                "bonus spells": ": deathwatch (2nd), summon swarm (4th), explosive runes (6th), ice storm (8th), insect plague (10th), circle of death (12th), vision (14th), incendiary cloud (16th), meteor swarm (18th).",
          "revelations": {
          "Defy Elements (Ex)": "Choose one energy type (acid, cold, fire, electricity, or sonic). You gain resistance 5 to the selected energy type. At 5th level and every 5 levels thereafter, you can choose an additional energy type for which to gain resistance 5, or you can choose a previously chosen energy type and increase that resistance by 5 (to a maximum resistance of 20 for any one energy type).",
          "Destructive Roots (Su)": "You can root yourself to your current spot and cause the world around you to fall apart. As a standard action, you can cause the ground in a 5-foot radius burst centered on you to crumble and rupture, becoming difficult terrain. As a move action on subsequent rounds, you can continue to concentrate on this area as though concentrating on a spell; doing so increases the radius of difficult terrain by 5 feet (maximum 30-foot-radius). You immediately cease concentrating if you move from the square you started in when you activated this ability. Difficult terrain created by this ability remains for 24 hours before returning to its original state. You must be at least 7th level to select this revelation.",
          "Doomsayer (Su)": "As a standard action, you can utter a dire prophecy that strikes fear in your enemies and causes them to become shaken. To be affected, an enemy must be within 30 feet and able to hear you. This effect persists as long as the enemy is within 30 feet and you use a move action each round to continue your doomsaying. This ability cannot cause a creature to become frightened or panicked, even if the target was already shaken from another effect. This is a mind-affecting fear effect that relies on audible components. At 15th level, continuing your doomsaying each round is a swift action instead. You must be at least 7th level to select this revelation.",
          "Dust to Dust (Su)": "Once per day as a standard action, you can cause the weapons around you to shatter in their wielders' hands. When you use this ability, attempt a single sunder combat maneuver, using your caster level in place of your base attack bonus and your Charisma modifier in place of Strength. Every creature except you in a 10-foot radius that is wielding a manufactured weapon is targeted by the same attempt. You deal an amount of damage to each weapon affected equal to 1d4 × your Charisma modifier (minimum 1d4). At 11th level, this damage increases to 1d6 × your Charisma modifier (minimum 1d6). At 10th level, you can use this ability twice per day.",
          "Erosion Touch (Su)": "As the nature mystery revelation.",
          "Near Death (Su)": "As the bones mystery revelation.",
          "Pass the Torch (Su)": "Once per day as a swift action, you can channel the energy of the apocalypse into your body, causing you to ignite. You take 1d4 points of fire damage when you activate this ability and again at the beginning of your turn until you end the effect. Any creature that begins its turn adjacent to you takes 1d6 points of fire damage as the fire spreads, plus 1 additional point of fire damage for each previous round you have had this ability active. For example, adjacent creatures take 1d6+5 points of damage if you have had this ability active for 5 rounds. You can use this ability for a number of rounds equal to 1/2 your oracle level, and you can end this ability as a free action. At 5th level and every 5 levels thereafter, you can use this ability one additional time per day.",
          "Power of the Fallen (Sp)": "You can touch a dying creature and channel its life energy into another living creature. This ability acts as death knell , except you can choose any ally (including yourself ) within 30 feet to gain the benefit of this effect, and you can apply the +2 enhancement bonus to either Strength, Dexterity, or Constitution. You can use this ability a number of times per day equal to your Charisma modifier. You must be at least 5th level to select this revelation.",
          "Spell Blast (Su)": "As a swift action whenever you confirm a critical hit against an opponent with a spell that requires an attack roll, you can immediately attempt to bull rush your opponent in any direction. You don't provoke an attack of opportunity for this bull rush attempt.",
          "Unstoppable Overrun (Ex)": "You can attempt overrun combat maneuvers against opponents that are up to two size categories larger than you. At 5th level, you gain Improved Overrun as a bonus feat. At 10th level, you gain Greater Overrun as a bonus feat. You don't need to meet the prerequisites to gain these feats."
          },
          "final revelation": ": Upon reaching 20th level, you become a herald of the apocalypse and wield the awesome power to fulf ill such prophecy. Anytime you successfully cast a spell or use an ability that bestows 1 or more negative levels, the effect bestows 1d4 additional negative levels. Whenever you conf irm a critical hit against a creature (including with a melee, ranged, or spell attack), as a swift action you can curse the target of your attack, as the bestow curse spell, except the target doesn't receive a Will saving throw to negate the effects and spell resistance does not apply against this ability."
              },
              "Ascetic": {
                "source": "Villain Codex pg. 104",
                "deities": ": Gozreh, Irori",
                "class skills": ": An oracle with the ascetic mystery adds Acrobatics (Dex), Climb (Str), Escape Artist (Dex), and Swim (Str) to her list of class skills.",
                "bonus spells": ": stone fist APG (2nd), glide APG (4th), force punch UM (6th), ethereal fists OA (8th), contact other plane (10th), legend lore (12th), vision (14th), frightful aspect UC (16th), iron body (18th).",
                  "revelations": {
                    "Absence of Body (Su)": "You require half as much food and water to survive as a normal member of your race. Additionally, each time you hold your breath, you can do so for an additional number of rounds equal to your oracle level. At 15th level, you no longer need to eat or drink and can hold your breath for 10 times as long (2 minutes per point of Constitution, plus 1 additional minute per oracle level).",
                    "Absence of Form (Sp)": "You gain feather fall as a spell-like ability, which you can use a number of rounds per day equal to your oracle level. The rounds do not need to be used consecutively. If you are in mid-fall when this ability's duration expires, you take falling damage as if you fell from the altitude you were at when the spell ended. At 10th level, you can also apply your daily rounds of this ability to use air walk.",
                    "Ascetic Armor (Su)": "You can use meditative techniques that temporarily cause attacks to bounce off your skin, as long as you aren't wearing armor or carrying a medium or heavy load. These techniques grant you a +4 armor bonus to AC. At 7th level, and every 4 levels thereafter, this bonus increases by 2. At 13th level, the techniques also grant DR 5/unarmed strikes or natural attacks. You can gain the benefits of ascetic armor for 1 hour per day per oracle level. The hours do not need to be consecutive, but you must spend them in 1-hour increments.",
                    "Fleet (Ex)": "You gain a +10-foot enhancement bonus to your base land speed. You lose this extra speed if you wear any armor or carry a medium or heavy load. At 7th level, and every 6 levels thereafter, this bonus increases by 10 feet. Oracles with the lame oracle curse can't select this revelation.",
                    "Martial Disciple (Su)": "Through meditation and study of monastic forms of combat, you have learned a lethal form of unarmed combat. You gain Improved Unarmed Strike as a bonus feat, even if you do not meet the prerequisites. You gain the unarmed strike damage of a monk of your oracle level. If you also have monk levels, those levels stack for the purpose of determining your unarmed strike damage.",
                    "Oracular Spellstrike (Su)": "By harnessing a synergy of unarmed combat and spellcasting, you have uncovered a means of channeling spell energy quickly through your unarmed strikes. This resembles the magus spellstrike ability, except it works with unarmed strikes only, no matter what other abilities you have. Additionally, it uses spells from the cleric spell list, not the magus spell list. You must be at least 7th level before selecting this revelation.",
                    "Rapid Convalescence (Su)": "You reduce the number of consecutive successful saves needed to recover from a disease or poison by 1 (to a minimum of 1). Additionally, you can sacrifice one of your unused spell slots for the day to gain an enhancement bonus equal to that spell slot's level on your next save to resist the effects of poison or disease, provided the save is attempted within 1 minute per level of spell expended.",
                    "Spell Deflection (Su)": "You can use a readied action to counterspell any spell being cast on you or an adjacent ally that requires a ranged touch attack (such as a ray). In order to successfully counter the spell, you must make an unarmed attack roll. If the result of this attack roll is higher than 20 + the spell's caster level, the spell is negated with no effect. At 17th level, any spell you successfully negate is reflected back at the caster with the same ranged touch attack result. You must be at least 11th level before selecting this revelation."
                  },
                  "final revelation": "No Final Revelation exists as printed for this mystery. According to the PFS Campaign Clarifications, listed here, this mystery grants the Monk ability 'Perfect Self' for its final revelation. This is not official errata. At 20th level, you become a magical creature. You are forevermore treated as an outsider rather than as a humanoid (or whatever your creature type was) for the purpose of spells and magical effects. Additionally, you gain damage reduction 10/chaotic, which allows you to ignore the first 10 points of damage from any attack made by a nonchaotic weapon or by any natural attack made by a creature that doesn't have similar damage reduction. Unlike other outsiders, you can still be brought back from the dead as if you were a member of your previous creature type."
                },
              "Battle": {
                "source": "Advanced Player's Guide pg. 45",
                "deities": ": Cayden Cailean, Gorum, Iomedae, Rovagug.",
                "class skills": ": An oracle with the battle mystery adds Intimidate, Knowledge (engineering), Perception, and Ride to her list of class skills.",
                "bonus spells": ": enlarge person (2nd), fog cloud (4th), magic vestment (6th), wall of fire (8th), righteous might (10th), mass bull's strength (12th), control weather (14th), earthquake (16th), storm of vengeance (18th).",
                "revelations": {
                  "Battlecry (Ex)": "As a standard action, you can unleash an inspiring battlecry. All allies within 100 feet who hear your cry gain a +1 morale bonus on attack rolls, skill checks, and saving throws for a number of rounds equal to your Charisma modifier. At 10th level, this bonus increases to +2. You can use this ability once per day, plus one additional time per day at 5th level and for every five levels thereafter.",
                  "Battlefield Clarity (Ex)": "Once per day, as an immediate action, whenever you fail a saving throw that causes you to become blind, deaf, frightened, panicked, paralyzed, shaken, or stunned, you may attempt that saving throw again, with a +4 insight bonus on the roll. You must take the second result, even if it is worse. At 7th and 15th level, you can use this ability one additional time per day.",
                  "Combat Healer (Su)": "Whenever you cast a cure spell (a spell with “cure” in its name), you can cast it as a swift action, as if using the Quicken Spell feat, by expending two spell slots. This does not increase the level of the spell. You can use this ability once per day at 7th level and one additional time per day for every four levels beyond 7th. You must be at least 7th level to select this revelation.",
                  "Iron Skin (Su)": "Once per day, your skin hardens and takes on the appearance of iron, granting you DR 10/adamantine. This functions as stoneskin, using your oracle level as the caster level. At 15th level, you can use this ability twice per day. You must be at least 11th level to select this revelation.",
                  "Maneuver Mastery (Ex)": "Select one type of combat maneuver. When performing the selected maneuver, you treat your oracle level as your base attack bonus (plus the BAB from other classes) when determining your CMB. At 7th level, you gain the Improved feat (such as Improved Trip) that grants you a bonus when performing that maneuver. At 11th level, you gain the Greater feat (such as Greater Trip) that grants you a bonus when performing that maneuver. You do not need to meet the prerequisites to receive these feats.",
                  "Resiliency (Ex)": "You are not disabled and you do not gain the staggered condition if you are reduced to exactly 0 hit points. At 7th level, you gain Diehard as a bonus feat. At 11th level, you do not lose a hit point when you take a standard action while disabled. You do not need to meet the prerequisite to receive the Diehard feat.",
                  "Skill at Arms (Ex)": "You gain proficiency in all martial weapons and heavy armor.",
                  "Surprising Charge (Ex)": "Once per day, you can move up to your speed as an immediate action. You can use this ability one additional time per day at 7th level and 15th level.",
                  "War Sight (Su)": "Whenever you roll for initiative, you can roll twice and take either result. At 7th level, you can always act in the surprise round, but if you fail to notice the ambush, you act last, regardless of your initiative result (you act in the normal order in following rounds). At 11th level, you can roll for initiative three times and take any one of the results.",
                  "Weapon Mastery (Ex)": "Select one weapon with which you are proficient. You gain Weapon Focus with that weapon. At 8th level, you gain Improved Critical with that weapon. At 12th level, you gain Greater Weapon Focus with that weapon. You do not need to meet the prerequisites to receive these feats."
                },
                "final revelation": "Upon reaching 20th level, you become an avatar of battle. You can take a full-attack action and move up to your speed as a full-round action (you can move before or after the attacks). Whenever you score a critical hit, you can ignore any DR the target might possess. You gain a +4 insight bonus to your AC for the purpose of confirming critical hits against you. When you are below 0 hit points, you do not die until your negative total is in excess of twice your Constitution score."
              },
              "Bones": {
                "source": "Advanced Player's Guide pg. 46",
                "deities": ": Norgorber, Pharasma, Urgathoa.",
                "class skills": ": An oracle with a bones mystery adds Bluff, Disguise, Intimidate, and Stealth to her list of class skills.",
                "bonus spells": ": cause fear (2nd), false life (4th), animate dead (6th), fear (8th), slay living (10th), circle of death (12th), control undead (14th), horrid wilting (16th), wail of the banshees (18th).",
                "revelations": {
                  "Armor of Bones (Su)": "You can conjure armor made of bones that grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this armor grants you DR 5/bludgeoning. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
                  "Bleeding Wounds (Su)": "Whenever a creature takes damage from one of your spells or effects that causes negative energy damage (such as inflict light wounds or the death's touch revelation), it begins to bleed, taking 1 point of damage each round. At 5th level, and every five levels thereafter, this damage increases by 1. The bleeding can be stopped by a DC 15 Heal check or any effect that heals damage.",
                  "Death's Touch (Su)": "You can cause terrible wounds to appear on a creature with a melee touch attack. This attack deals 1d6 points of negative energy damage +1 point for every two oracle levels you possess. If used against an undead creature, it heals damage and grants a +2 channel resistance for 1 minute. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
                  "Near Death (Su)": "You gain a +2 insight bonus on saves against diseases, mind-affecting effects, and poisons. At 7th level, this bonus also applies on saves against death effects, sleep effects, and stunning. At 11th level, the bonus increases to +4.",
                  "Raise the Dead (Su)": "As a standard action, you can summon a single skeleton or zombie to serve you. The undead creature has a number of Hit Dice equal to your oracle level. It remains for a number of rounds equal to your Charisma modifier. At 7th level, you can summon a bloody skeleton or fast zombie. At 15th level, you can summon an advanced skeleton or zombie. You can use this ability once per day plus one additional time per day at 10th level.",
                  "Resist Life (Su)": "You are treated as an undead creature when you are targeted by positive or negative energy. You are not subject to Turn Undead or Command Undead (or any other effect that specifically targets undead), unless you are actually an undead creature. At 7th level, you receive channel resistance +2. This bonus increases by +2 at 11th and 15th level.",
                  "Soul Siphon (Su)": "As a ranged touch attack, you can unleash a ray that causes a target to gain one negative level. The ray has a range of 30 feet. This negative level lasts for a number of minutes equal to your Charisma modifier. Whenever this ability gives a target a negative level, you heal a number of hit points equal to your oracle level. You can use this ability once per day, plus one additional time at 11th level and every four levels thereafter. You must be at least 7th level to select this revelation.",
                  "Spirit Walk (Su)": "As a standard action, you can become incorporeal and invisible. While in this form, you can move in any direction and through any object (except for those made of force). You can take no action other than to move while in this form. You remain in this form for a number of rounds equal to your oracle level, but you can end this effect prematurely with a standard action. You can use this ability once per day at 11th level, and twice per day at 15th level. You must be at least 11th level to select this revelation.",
                  "Undead Servitude (Su)": "You gain Command Undead as a bonus feat. You can channel negative energy a number of times per day equal to 3 + your Charisma modifier, but only to use Command Undead. You can take other feats to add to this ability, such as Improved Channeling, but not feats that alter this ability, such as Alignment Channel.",
                  "Voice of the Grave (Su)": "You can speak with dead, as per the spell, for a number of rounds per day equal to your oracle level. These rounds do not need to be consecutive. At 5th level, and every five levels thereafter, the dead creature takes a cumulative –2 penalty on its Will save to resist this effect."
                },
                "final revelation": "Upon reaching 20th level, you become a master of death. Once per round, you can cast bleed or stabilize as a free action. If you are brought to below 0 hit points, you automatically stabilize. You can cast animate dead at will without paying a material component cost (although you are still subject to the usual Hit Die control limit). Once per day, you can cast power word kill, but the spell can target a creature with 150 hit points or less."
              },
              "Dark Tapestry": {
                "source": "Ultimate Magic pg. 54",
                "deities": ": Lamashtu, Norgorber, Zon-Kuthon.",
                "class skills": ": An oracle with the dark tapestry mystery adds Disguise, Intimidate, Knowledge (arcana), and Stealth to her list of class skills.",
                "bonus spells": ": entropic shield (2nd), dust of twilight (4th), tongues (6th), black tentacles (8th), feeblemind (10th), planar binding (12th), insanity (14th), reverse gravity (16th), interplanetary teleport (18th).",
                "revelations": {
                  "Brain Drain (Su)": "You can take a standard action to violently probe the mind of a single intelligent enemy within 100 feet. The target receives a Will save to negate the effect and immediately knows the source of this harmful mental prying. Those who fail this save are wracked with pain, taking 1d4 points of damage for every oracle level you possess. After successfully attacking with this ability, you may use a full-round action to sort through the jumble of stolen thoughts and memories to make a single Knowledge check using the victim's skill bonus. The randomly stolen thoughts remain in your mind for a number of rounds equal to your Charisma modifier. Treat the knowledge gained as if you had used detect thoughts. This is a mind-affecting effect. You can use this ability once per day at 1st level, plus one additional time per day at 5th level and for every five levels beyond 5th.",
                  "Cloak of Darkness (Su)": "You conjure a cloak of shadowy darkness that grants you a +4 armor bonus and a +2 circumstance bonus on Stealth checks. At 7th level, and every four levels thereafter, these bonuses increase by +2. You can use this cloak for 1 hour per day per oracle level. The duration does not need to be consecutive, but it must be spent in 1-hour increments.",
                  "Dweller in Darkness (Sp)": "Once per day, you cast your psyche into the void of space to attract the attention of a terrible otherworldly being. The dweller in darkness behaves in all ways as if you had cast phantasmal killer. At 17th level, the dweller in darkness can be perceived by more than one creature, as if you had cast weird. You must be at least 11th level to choose this revelation.",
                  "Gift of Madness (Su)": "You tap into the unthinkable void between the stars and cause a single living creature within 30 feet to become confused for 1 round. A successful Will save negates the effect. This is a mind-affecting compulsion effect. At 7th level, the confusion lasts for a number of rounds equal to your oracle level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
                  "Interstellar Void (Su)": "You call upon the frigid depths of outer space to bring a terrible chill to your enemies. As a standard action, one target within 30 feet is cloaked in the void and takes 1d6 points of cold damage for every oracle level you possess. A successful Fortitude save halves this damage. At 10th level, the interstellar void is so extreme that a creature that fails its save is fatigued. At 15th level, a creature that fails its save is exhausted and stunned for 1 round. You can use this ability once per day plus one additional time per day at 10th level.",
                  "Many Forms (Su)": "As a standard action, you can assume the form of a Small or Medium humanoid, as the alter self spell. At 7th level, you can assume the form of a Small or Medium animal, as beast shape I. At 11th level, you can assume the form of a Small or Medium magical beast, as beast shape III. At 15th level, you can assume a variety of forms, as greater polymorph. You can use this ability for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 3rd level to select this revelation.",
                  "Pierce the Veil (Su)": "Your bond with the alien denizens of the Dark Tapestry allows you to see in even the deepest darkness. You gain darkvision 60 feet. At 11th level, you can see perfectly in darkness of any kind, even in absolute darkness or the darkness created by a deeper darkness spell.",
                  "Read the Tapestry (Sp)": "Once per day, you can spend 10 minutes meditating on the mysteries of the Dark Tapestry to send your mind to another plane and communicate with the strange or alien beings there. This functions as the contact other plane spell. You must be at least 7th level to select this revelation.",
                  "Touch of the Void (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of cold damage + 1 point for every two oracle levels you possess. At 7th level, the touched creature must also make a Fortitude saving throw or be fatigued for a number of rounds equal to 1/2 your oracle level. This has no effect on a creature that is already fatigued. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
                  "Wings of Darkness (Su)": "As a swift action, you can manifest a set of translucent, inky wings that grant you a fly speed of 60 feet with good maneuverability. You can use these wings for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. At 11th level, you can use these wings to fly as if with overland flight once per day. Used in this way, the ability lasts for up to 1 hour per level, and counts as your total use of this ability for the day. You must be at least 7th level to select this revelation."
                },
                "final revelation": "Upon reaching 20th level, you become a truly alien and unnatural creature. You gain damage reduction 5/— and immunity to acid, critical hits, and sneak attacks. Once per day, you can cast shapechange as a spell-like ability without requiring a material component."
              },
              "Dragon": {
                "source": "Legacy of Dragons pg. 8 Oracles who draw their power from the mysterious and primal might of dragons are usually solitary folk. They are deep thinkers and often quick of wit, but prideful and equally quick-tempered. Upon selecting this mystery, the oracle must select an energy type (acid, cold, electricity, or fire) to be her associated element, which impacts several revelations.",
                "deities": ": Dahak, General Susumu, Nalinivati, Ragadahn, Shizuru.",
                "class skills": ": An oracle with the dragon mystery adds Fly, Intimidate, Perception, and Knowledge (arcana) to her list of class skills. She can take ranks in Fly even if she does not have a method of flying under her own power.",
                "bonus spells": ": cause fear (2nd), resist energy (4th), fly (6th), fear (8th), spell resistance (10th), antimagic field (12th), true seeing (14th), form of the dragon III (16th), overwhelming presence (18th).",
                "revelations": {
                  "Breath Weapon (Su)": "The primal power of dragonkind seethes within you. You gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per 2 oracle levels you have (minimum 1d6; Reflex half). The shape of the breath weapon is either a 30-foot cone or a 60-foot line, selected when choosing this revelation. You can use this ability once per day at 1st level, plus one additional time at 5th level and one additional time per day for every 5 levels beyond 5th.",
                  "Draconic Resistance (Ex)": "Like the great dragons, you are not easily harmed by common means of attack. You gain resistance 5 against your chosen energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and your natural armor bonus increases to +2. At 15th level, your energy resistance increases to 20 and your natural armor bonus increases to +4.",
                  "Dragon Magic (Sp)": "Your draconic power grants you a limited form of access to arcane magic. Select one spell from the sorcerer/wizard spell list that is 2 levels lower than the highest-level spell you can cast, or two spells that are both at least 3 levels lower. You can cast each of the selected spells once per day as a spell-like ability. At 11th level, you can cast each selected spell twice per day.",
                  "Dragon Senses (Ex)": "Your senses take on a keen draconic edge. You gain either darkvision with a range of 60 feet or low-light vision. At 5th level, you can select darkvision with a range of 60 feet or low-light vision if you do not yet have both, or you can add 60 feet to the range of your darkvision. At 11th level, you gain blindsense with a range of 30 feet. If you already have blindsense, you instead increase its range by 30 feet. At 15th level, you gain either the scent ability or a +4 bonus on Perception checks.",
                  "Form of the Dragon (Su)": "Your kinship with dragonkind allows you to take on the form of a dragon. As a standard action, you can assume the form of a Medium dragon, as per form of the dragon I. At 15th level, you can assume the form of a Large dragon, as per form of the dragon II. At 19th level, you can assume the form of a Huge dragon, as per form of the dragon III. You can use this ability once per day, but the duration is 10 minutes per oracle level. If you are at least 15th level and choose to have this ability function as per form of the dragon I, the duration is instead 1 hour per oracle level. You must be at least 11th level to select this revelation. Rather than form of the dragon spells, you can choose for this revelation to act as form of the alien dragon I, II, and III (see page 29) or form of the exotic dragon I, II, and III (see page 30). This choice must be made when you first gain this revelation, and cannot be changed.",
                  "Presence of Dragons (Su)": "Those who would oppose you must overcome their fear of dragons or be struck with terror at your draconic majesty. As a swift action, you can manifest an aura of draconic might around yourself. Enemies within 30 feet who can see you when you activate this ability must attempt a Will save. Success means that the creature is immune to this ability for the following 24 hours. On a failed save, the opponent is shaken for 2d6 rounds. This is a mind-affecting fear effect. You can use this ability once per day at 1st level, plus one additional time per day at 5th level and for every 5 levels beyond 5th.",
                  "Scaled Toughness (Su)": "You can manifest the scaly toughness of dragonkind. Once per day as a swift action, you can harden your skin, giving it a scaly appearance and granting you DR 10/magic. During this time, you are also immune to paralysis and sleep effects. This effect lasts for a number of rounds equal to your oracle level. At 13th level, you can use this ability twice per day. You must be at least 7th level to select this revelation.",
                  "Tail Swipe (Ex)": "You express your wrath through sweeps of a wicked tail. You can grow a scaly tail. This tail can be used only to make attacks of opportunity, but it allows you to make one additional attack of opportunity each round. This tail attack deals an amount of bludgeoning damage equal to 1d8 (1d6 if you are Small) + your Strength modifier. At 10th level, you can attempt a free trip combat maneuver check against any creature damaged by your tail attack. This does not provoke an attack of opportunity.",
                  "Talons of the Dragon (Su)": "You fight with the fearsome talons of dragonkind. You can grow claws as a free action. These claws are treated as natural weapons, allowing you to perform two claw attacks as a full attack action using your full base attack bonus. Each of these attacks deals an amount of slashing damage equal to 1d4 (1d3 if you are Small) + your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage die increases by 1 step, to deal an amount of slashing damage equal to 1d6 (1d4 if you are Small) + your Strength modifier. At 11th level, these claws deal an additional 1d6 points of damage of your chosen energy type on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.",
                  "Wings of the Dragon (Su)": "Like the great dragons, you can take to the skies and terrorize opponents from above. As a swift action, you can manifest leathery dragon wings that grant you a fly speed of 60 feet (clumsy maneuverability). At 10th level, your maneuverability increases to poor. You can use these wings for 1 minute per day for each oracle level you have. This duration does not need to be consecutive, but it must be spent in 1-minute increments. At 11th level you can use these wings for 10 minutes per day for each oracle level you have. At 15th level, you can use the wings indefinitely. You must be at least 7th level to select this revelation."
                },
                "final revelation": "Upon reaching 20th level, your draconic destiny unfolds. You gain immunity to paralysis, sleep, and damage of your energy type. You count as a dragon for the purposes of spells and magical effects. If you have the breath weapon revelation, you can use your breath weapon an unlimited number of times per day, though no more often than once every 1d4+1 rounds."
              },
              "Elemental": {
                "source": "Elemental Master's Handbook pg. 28 Elemental oracles gain their powers from forces that balance or blend elements together.",
                "deities": ": Elemental Lords, Gozreh, Nethys, Yamatsumi",
                "class skills": ": An oracle with the elemental mystery adds Acrobatics, Climb, Stealth, and Swim to her list of class skills.",
                "bonus spells": ": Endure elements (2nd), resist energy (4th), elemental aura APG (6th), elemental body I (8th), elemental body II (10th), elemental body III (12th), elemental body IV (14th), create demiplane UM (16th), elemental swarm (18th).",
          "revelations": {
          "Dance of Whirling Water (Ex)": "You dance through the battlefield with all the grace and power of the waves, sweeping up enemies and tossing them away with the powers of air and water entwined. Whenever you succeed at an Acrobatics check to move through an enemy's square, you gain a competence bonus equal to half your oracle level (minimum +1) on trip combat maneuvers against that creature until the start of your next turn. At 11th level, you gain Whirlwind Attack as a bonus feat, and you can make bull rush combat maneuvers in place of any of the attacks granted by Whirlwind Attack; you cannot move with enemies bull rushed this way.",
          "Desert Mirage (Su)": "Air and fire shroud you from your enemies' vision and superheat your strikes in combat. You can surround yourself with heated air as a swift action, gaining concealment (as per the blur spell). At 7th level while you are using this ability, your melee attacks each deal an additional 2 points of fire damage. You can use this ability for 1 minute per oracle level per day; this duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 3rd level to select this revelation.",
          "Elemental Aegis (Su)": "When you take this revelation, choose one element: air, earth, fire, or water. You can conjure an enveloping, protective force made of this element that grants you a +4 armor bonus to AC (this manifests as a solid rush of air over your body, rocky plates covering your skin, and the like). At 7th level, and every 4 levels thereafter, this bonus increases by 2. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments. At 13th level, you receive an additional boon depending on the element you chose. If you chose air, you gain a +2 bonus on Reflex saving throws. If you chose earth, you gain a +2 bonus to CMD. If you chose fire, you gain fire resistance 2 (this stacks with any other fire resistance you have). If you chose water, you gain a +4 bonus on Swim checks.",
          "Elemental Allies (Su)": "The beings tied to the fundamental elements can hear your calls plainly when you seek aid from them. When casting summon monster spells to summon elementals with the air, earth, fire, or water subtype, you can cast the spell as a standard action instead of a casting time of 1 round. You can use this ability a number of times per day equal to your oracle level. You must be at least 7th level to select this revelation.",
          "Elemental Channeling (Su)": "You can heal and harm elemental beings. You gain Elemental Channel (your choice of air, earth, fire, or water) as a bonus feat. You gain the cleric's channel energy ability, as a cleric of your oracle level, but only to use Elemental Channel. The DC for this effect is 10 + half your oracle level + your Charisma modifier. At 5th, 10th, and 15th level, you gain Elemental Channel with one of the remaining elemental subtypes as a bonus feat. You can take other feats to add to this ability, such as Improved Channeling, but not feats that alter this ability, such as Alignment Channel. This revelation's effects do not stack with levels in other classes that grant the channel energy ability.",
          "Elemental Resistance (Ex)": "The forces of the Elemental Planes envelop and inure your flesh against hostile energy. You gain resistance 2 to acid, cold, electricity, and fire (this stacks with any other resistance you have of that type). This resistance increases to 5 at 7th level, 10 at 11th level, and 20 at 17th level. Flowing Step (Ex or Su) : Fire's hunger and water's flow grant you swiftness and elegance, and you move with breathtaking purpose and grace. You can increase your base speed by 10 feet. At 7th level, while using this ability, you can use Acrobatics to move at full speed through threatened squares or other creatures' squares without increasing the DC by 10. At 11th level, while using this ability, you can walk on liquid as if using water walk , and you are immune to damage caused by proximity to (but not immersion in) lava, magma, and similarly heated stone. You can use this ability for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments. Oracles with the lame oracle curse cannot select this revelation.",
          "Reforged Arms (Su)": "The forge's fire turns earthen ore into useful metal, and you can hone weapons in the same way. As a standard action, you can touch a metal or stone weapon and transform it into a masterwork equivalent if it is not already a masterwork or magical weapon. At 3rd level, you can also have the weapon act as if it were made of alchemical silver or cold iron (your choice when you activate this ability) for the purpose of bypassing damage reduction. At 7th level, 15th level, and 19th level, the weapon gains a cumulative +1 enhancement bonus, though this bonus does not stack with any enhancement bonus the weapon already has. At 11th level, you can have the weapon act as if it were made of adamantine rather than of alchemical silver or cold iron. This effect lasts for 1 minute per oracle level, and you can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Roiling Soil (Su)": "Combining your mastery of earth and water, you shape the battlefield in your favor, bending the terrain to benefit you and your allies and hinder any who might oppose you. The ground within 5 feet per 2 oracle levels you have shifts and rolls unpredictably; if you use this ability underwater, the surrounding waters churn. This area moves with you, and you and your allies are unaffected by the roiling terrain. Other creatures can move within the area at half speed with a successful DC 10 Acrobatics check. Failure means they stop moving for the round, while failure by 5 or more causes them to fall prone; if underwater, creatures gain the effects of being off-balance ( Pathfinder RPG Core Rulebook 433) instead of falling prone. This effect lasts a number of rounds equal to your oracle level, and you can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Sweeping Impact (Ex)": "You can shake the earth and buffet foes with the roaring force of wind you draw from the Elemental Plane of Air. When performing a bull rush as part of a charge, if you push the target at least 5 feet, you can attempt a trip combat maneuver against that creature as a free action. You are not tripped if you fail this check by 10 or more. At 7th level, you can bull rush or trip creatures two size categories larger than you; for every 4 levels you gain beyond 7th, you can bull rush or trip creatures an additional size category larger."
          }     
          , "final revelation": ": Upon reaching 20th level, your body undergoes an internal elemental shift, and you become a living conduit of the Elemental Planes. Your external appearance remains the same, although you may take on certain cosmetic elemental traits (such as smoldering hair or pebble-like skin). You become immune to critical hits and precision damage such as from sneak attacks. You no longer need to breathe, eat, or sleep."
              },
              "Flame": {
                "source": "Advanced Player's Guide pg. 47",
                "deities": ": Asmodeus, Sarenrae.",
                "class skills": ": An oracle with the flame mystery adds Acrobatics, Climb, Intimidate, and Perform to her list of class skills.",
                "bonus spells": ": burning hands (2nd), resist energy (4th), fireball (6th), wall of fire (8th), summon monster V (fire elementals only) (10th), fire seeds (12th), fire storm (14th), incendiary cloud (16th), fiery body (18th).",
          "revelations": {
          "Burning Magic (Su)": "Whenever a creature fails a saving throw and takes fire damage from one of your spells, it catches on fire. This fire deals 1 point of fire damage per spell level at the beginning of the burning creature's turn. The fire lasts for 1d4 rounds, but it can be extinguished as a move action if the creature succeeds at a Reflex save (using the spell's DC). Dousing the creature with water as a standard action grants a +2 bonus on this save, while immersing the creature in water automatically extinguishes the fire. Spells that do not grant a save do not cause a creature to catch on fire.",
          "Cinder Dance (Ex)": "Your base speed increases by 10 feet. At 5th level, you receive Nimble Moves as a bonus feat. At 10th level, you receive Acrobatic Steps as a bonus feat. You do not need to meet the prerequisites to receive these feats. Oracles with the lame oracle curse cannot select this revelation.",
          "Fire Breath (Su)": "As a standard action, you can unleash a 15-foot cone of flame from your mouth. This flame deals 1d4 points of fire damage per level. A Reflex save halves this damage. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter. The save DC is Charisma-based.",
          "Firestorm (Su)": "As a standard action, you can cause fire to erupt around you. You can create one 10-foot cube of fire per oracle level. These cubes can be arranged in any pattern you desire, but each cube must be adjacent to another and one must be adjacent to you. Any creature caught in these flames takes 1d6 points of fire damage per oracle level, with a Reflex save resulting in half damage. This fire lasts for a number of rounds equal to your Charisma modifier. You can use this ability once per day. You must be at least 11th level to select this revelation.",
          "Form of Flame (Su)": "As a standard action, you can assume the form of a Small fire elemental, as elemental body I . At 9th level, you can assume the form of a Medium fire elemental, as elemental body II . At 11th level, you can assume the form of a Large fire elemental, as elemental body III . At 13th level, you can assume the form of a Huge fire elemental, as elemental body IV . You can use this ability once per day, but the duration is 1 hour/level. You must be at least 7th level to select this revelation.",
          "Gaze of Flames (Su)": "You can see through fire, fog, and smoke without penalty as long as the light is sufficient to allow you to see normally. At 7th level, you can gaze through any source of flame within 10 feet per oracle level, as if using clairvoyance . You can use this ability for a number of rounds per day equal to your oracle level, but these rounds do not need to be consecutive.",
          "Heat Aura (Su)": "As a swift action, you can cause waves of heat to radiate from your body. This heat deals 1d4 points of fire damage per two oracle levels (minimum 1d4) to all creatures within 10 feet. A Reflex save halves the damage. In addition, your form wavers and blurs, granting you 20% concealment until your next turn. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter.",
          "Molten Skin (Ex)": "You gain resist fire 5. This resistance increases to 10 at 5th level and 20 at 11th level. At 17th level, you gain immunity to fire.",
          "Touch of Flame (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of fire damage +1 point for every two oracle levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, any weapon that you wield is treated as a flaming weapon.",
          "Wings of Fire (Su)": "As a swift action, you can manifest a pair of fiery wings that grant you a fly speed of 60 feet with average maneuverability. You can use these wings for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1 minute increments. You must be at least 7th level before selecting this revelation."
          },
          "final revelation": ": Upon reaching 20th level, you become a master of fire. You can apply any one of the following feats to any fire spell you cast without increasing the level or casting time: Enlarge Spell, Extend Spell, Silent Spell, or Still Spell. You do not need to possess these feats to use this ability."
              },
              "Godclaw": {
                "source": "Path of the Hellknight pg. 26 Many Godclaw signifers are oracles who embrace the unique Godclaw mystery. Oracles with the Godclaw mystery often take the clouded vision or legalistic curses ( Pathfinder Player Companion Blood of Fiends 26 ).",
                "deities": ": Abadar, Asmodeus, Iomedae, Irori, Torag.",
                "class skills": ": An oracle with the Godclaw mystery adds Bluff, Intimidate, Knowledge (local), and Perception to her list of class skills.",
                "bonus spells": ": cause fear (2nd), daze monster (4th), hold person (6th), order's wrath (8th), break enchantment (10th), forceful hand (12th), dictum (14th), shield of law (16th), imprisonment (18th).",
          "revelations": {
          "Abadar's Boon (Sp)": "You can spend 1 minute meditating on and communing with a masterwork object of any type. At the end of this time, you can speak with that item. This functions as per stone tell , except that it works with masterwork goods, and the item cannot tell you what it covers or conceals if that question is not applicable to it. You can speak with items in this way for a number of minutes equal to your oracle level. This duration does not need to be consecutive, but it must be used in 1-minute increments.",
          "Asmodeus's Boon (Sp)": "Whenever a creature fails a saving throw and takes damage from one of your spells, it is shaken for a number of rounds equal to the spell's level. Spells that do not allow saves do not cause creatures to become shaken. This does not stack with other fear effects.",
          "Armored Mind (Su)": "While you are wearing Hellknight plate ISWG or a signifer mask (see page 63), you gain a +2 bonus on Will saving throws to resist mind-affecting effects. Once per day at 7th level, you can reroll a Will saving throw against a mind-affecting effect and choose the more favorable result. At 11th level, the bonus on Will saving throws increases to +4.",
          "Might of the Godclaw (Su)": "You gain Deific Obedience ( Pathfinder Campaign Setting Inner Sea Gods 210 ) as a bonus feat, even if you don't meet its prerequisites. When you gain the feat, choose one Godclaw deity; you can perform that deity's daily obedience to gain its benefits. Whenever you would gain one of your deity's boons, you can instead gain the benefits of another Godclaw deity's obedience. You can choose to gain the benefits of a maximum of four Godclaw deities' obediences if you choose to forgo all three of your god's boons. You never need to spend more than 1 hour per day to perform your obedience. You must be at least 3rd level to select this revelation.",
          "Instant Armor (Su)": "Choose one type of heavy armor. You gain proficiency in that armor. At 3rd level, twice per day as an immediate action, you can instantly don or remove a suit of your chosen armor that you touch, causing it to teleport onto or off of your body. At 11th level, you can spend 1 minute placing a suit of your chosen armor into an extradimensional space. You can use this ability to immediately don or remove that armor, calling it from or removing it to that extradimensional space. While in the extradimensional space, the armor regains 1 hit point per hour when damaged.",
          "Iomedae's Boon (Su)": "As a move action, you can call upon your deities to grant you courage. You gain a +1 morale bonus on attack rolls, damage rolls, and Will saving throws against fear effects for a number of rounds equal to your Charisma bonus. At 7th level, this bonus increases to +2, and at 14th level this bonus increases to +3. You can use this ability once per day, plus one additional time per day at 5th level, and every 5 levels thereafter.",
          "Iron Order (Sp)": "Once per day, you can issue an order as per suggestion . Any creature of chaotic alignment has difficulty defying your command, taking a –4 penalty on its saving throw to resist it. At 15th level, your command function as per mass suggestion . If you are wearing Hellknight plate or a signifer mask, your command's target takes an additional –2 penalty on its saving throw to resist the order (regardless of the target's alignment; this stacks with the penalty chaotic creatures take). You must be at least 7th level to select this revelation.",
          "Irori's Boon (Su)": "Once per day as an immediate action, whenever you fail a saving throw that causes you to become blinded, deafened, frightened, panicked, paralyzed, shaken, or stunned, you can attempt that saving throw again with a +4 insight bonus on the roll. You must take the second result, even if it is worse. At 7th and 15th level, you can use this ability one additional time per day.",
          "Resiliency (Ex)": "Once per day, when you are brought below 0 hit points but not killed, you can act is if you are disabled for 1 round. At the end of your next turn, unless you are brought to above 0 hit points, you immediately fall unconscious and begin dying. At 7th level, you gain Diehard as a bonus feat, even if you do not meet the prerequisite. At 15th level, three times per day, if you are disabled and take a standard action (or any otherwise strenuous action), you avoid taking 1 point of damage if you succeed at a DC 15 Fortitude saving throw.",
          "Torag's Boon (Su)": "As a standard action, you can call upon Torag's protection to form a shield around you that blocks incoming attacks for a number of minutes equal to 1/2 your oracle level (minimum 1). The shield grants a +4 deflection bonus to your Armor Class. At 7th level, and again at 11th level and 15th level, this bonus increases by +1. At 19th level, the shield also grants you DR 2/chaos. The shield's duration does not need to be consecutive, but it must be spent in 1-minute increments."
          },
          "final revelation": ": Upon reaching 20th level, you can cast detect chaos, detect law , and discern lies at will as spell-like abilities, using your oracle level as your caster level. You no longer take armor check penalties for wearing armor, and your armor's maximum Dexterity bonus increases by 5. Once per day, you can cast crushing hand as a spell-like ability without requiring a focus component, treating your oracle level as your caster level. This hand manifests as a massive, spiked gauntlet."
              },
              "Heavens": {
                "source": "Advanced Player's Guide pg. 47",
                "deities": ": Desna, Gozreh, Pharasma, Sarenrae.",
                "class skills": ": An oracle with the heavens mystery adds Fly, Knowledge (arcana), Perception, and Survival to her list of class skills.",
                "bonus spells": ": color spray (2nd), hypnotic pattern (4th), daylight (6th), rainbow pattern (8th), overland flight (10th), chain lightning (12th), prismatic spray (14th), sunburst (16th), meteor swarm (18th).",
          "revelations": {
          "Awesome Display (Su)": "Your phantasmagoric displays accurately model the mysteries of the night sky, dumbfounding all who behold them. Each creature affected by your illusion (pattern) spells is treated as if its total number of Hit Dice were equal to its number of Hit Dice minus your Charisma modifier (if positive).",
          "Coat of Many Stars (Su)": "You conjure a coat of starry radiance that grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this armor grants you DR 5/slashing. You can use this coat for 1 hour per day per oracle level. The duration does not need to be consecutive; it can instead be spent in 1-hour increments.",
          "Dweller in Darkness (Sp)": "Once per day, you cast your psyche into the void of space to attract the attention of a terrible otherworldly being. The dweller in darkness behaves in all ways as if you had cast phantasmal killer . At 17th level, the dweller in darkness can be perceived by more than one creature, as if you had cast weird . You must be at least 11th level to choose this revelation.",
          "Guiding Star (Su)": "Whenever you can see the open sky at night, you can determine your precise location. When the night sky is visible to you, you may also add your Charisma modifier to your Wisdom modifier on all Wisdom-based checks. In addition, once per night while outdoors, you can cast one spell as if it were modified by the Empower Spell, Extend Spell, Silent Spell, or Still spell feat without increasing the spell's casting time or level.",
          "Interstellar Void (Su)": "You call upon the frigid depths of outer space to bring a terrible chill to your enemies. As a standard action, one target within 30 feet is cloaked in the void and takes 1d6 points of cold damage per level. A successful Fortitude save halves this damage. At 10th level, the interstellar void is so extreme that enemies who fail their saving throw are fatigued. At 15th level, creatures who fail their save are exhausted and stunned for 1 round. You can use this ability once per day plus one additional time per day at 10th level.",
          "Lure of the Heavens (Su)": "Your connection to the skies above is so strong that your feet barely touch the ground. At 1st level, you no longer leave tracks. At 5th level, you can hover up to 6 inches above the ground or even above liquid surfaces, as if levitating. At 10th level, you gain the ability to fly , as per the spell, for a number of minutes per day equal to your oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments.",
          "Mantle of Moonlight (Su)": "Your innate understanding of the moon renders you immune to lycanthropy. Additionally, you may disrupt a lycanthrope's connection to the moon with a successful touch attack. This action automatically forces the lycanthrope into its humanoid form, which it must remain in for a number of rounds equal to your oracle level. Upon reaching 5th level, you can use this ability to force others into a rage , as per the spell. Using this ability is a melee touch attack. You can use this ability once per day at 5th level plus one additional time per day for every 5 levels above 5th.",
          "Moonlight Bridge (Su)": "You summon a bridge of shimmering moonlight. The 10-foot-wide span touches the ground at a point adjacent to your position. From this point it can extend in any direction for 10 feet per oracle level. The path persists until you have crossed over the bridge or for 24 hours, whichever is shorter. You may summon a moonlight bridge a number of times per day equal to your Charisma bonus.",
          "Should the bridge be attacked, treat it as a wall of force Spray of Shooting Stars (Su)": "As a standard action, you can unleash a ball of energy that explodes in a 5-foot-radius burst dealing 1d4 points of fire damage per level. A successful Reflex save halves this damage. This attack has a range of 60 feet. You can fire one explosive ball per day, plus one additional ball per day at 5th level and for every 5 levels thereafter. You can fire more than one ball at a time, but creatures caught inside more than one simultaneous explosions only take damage once.",
          "Star Chart (Ex)": "Your copious notes contain a working model of the night sky expressed in artistic scribbles and arcane mathematical formulae. Once per day, you may spend 10 minutes contemplating your star chart to gain the benefit of the spell commune . You must be at least 7th level to select this revelation."
          },      
          "final revelation": ": Upon achieving 20th level, your rapport with the heavens grants you perfect harmony with the universe. You receive a bonus on all saving throws equal to your Charisma modifier. You automatically stabilize if you are below 0 hit points, are immune to fear effects, and automatically confirm all critical hits. Should you die, you are reborn 3 days later in the form of a star child, who matures over the course of 7 days (treat as the reincarnate spell)."
              },
              "Intrigue": {
                "source": "Ultimate Intrigue pg. 69",
                "deities": ": Calistria, Norgorber",
                "class skills": ": An oracle with the intrigue mystery adds Bluff, Disguise, Sleight of Hand, and Stealth to her list of class skills.",
                "bonus spells": ": charm person (2nd), false belief UI (4th), suggestion (6th), sending (8th), true seeing (10th), symbol of persuasion (12th), greater scrying (14th), mind blank (16th), overwhelming presence (18th).",
          "revelations": {
                "Assumed Form (Sp)": "You can change your appearance at will, as disguise self with a caster level equal to your oracle level. At 7th level, you can choose to actually transform, which works the same way but counts as a polymorph effect instead of an illusion and doesn't allow a Will save to disbelieve. At 11th level, the ability lasts until you dismiss it or use it again, allowing you to even keep it active while you sleep. At 15th level, when you use this ability as a polymorph effect, you can gain the size bonus to your ability scores and additional racial abilities as if using alter self", 
                "Desire Sight (Sp)": "As a standard action, you can learn the desires of any creature you can see within 100 feet, as if you had concentrated until the third round of detect desires . As usual for detect desires , the target can attempt a Will save to negate the effect. You can use this ability once per day at 1st level, plus one additional time per day at 5th level and for every 5 levels beyond 5th.",
                "Forgotten Presence (Sp)": "Once per day as an immediate action, you can cause a creature to forget that you were present for the last minute per oracle level, including forgetting all actions you took during that time, unless it succeeds at a Will save (DC 10 + 1/2 your oracle level + your Charisma modifier). Effects such as modify memory can restore the lost memories. At 15th level, you can use this ability twice per day. You must be at least 7th level to select this revelation.",
                "Gossip Guru (Sp)": "You sit in a web of intrigue like a spider, subtly tracing the course of rumors and gossip in order to understand the ties that bind those around you. You can use the rumormonger spell once per day as a spell-like ability, using your oracle level as your caster level. Each time you do so, it ends the duration of any previous activation. At 11th level, you can use this ability three times per day, and at 15th level, you can use it at will, but regardless, each use still ends the duration of any previous activation. You must be at least 7th level to select this revelation.",
                "Hidden Magic (Su)": "You gain the Conceal Spell feat as a bonus feat without needing to meet the prerequisites. At 7th level, you can also hide your use of spell trigger items using the Conceal Spell feat, though onlookers receive a +2 bonus on their skill checks to pierce your subterfuge. At 11th level, you can even hide the use of spell completion items using the Conceal Spell feat, though in this case, onlookers receive a +5 bonus on their skill checks to pierce your subterfuge.",
                "Mirrored Retreat (Su)": "Once per day as a full-round action, your form ripples and releases seven illusory duplicates, as mirror image , and then you can move up to your speed in any direction, while the duplicates move in seven other directions. The duplicates continue to retreat in their chosen direction, avoiding walls and other barriers but unable to open doors or interact with objects. The duplicates last for 1 minute per oracle level or until they take damage (they have the same AC as your touch AC and the same Reflex save as you, and they are immune to effects that allow a Fortitude or Will save). You can use this ability an additional time per day at 11th level and every 4 levels thereafter. This is a figment effect. You must be at least 7th level to select this revelation.",
                "Poetic Vengeance (Su)": "You constantly plot and scheme to take your revenge against those who wrong you. Once per day as an immediate action, after an enemy successfully affects you with an attack (whether with a spell, a physical attack, or any other sort of attack), you can force the enemy to take half the effects of its own attack unless it succeeds on a Will save (DC 10 + 1/2 your oracle level + your Charisma modifier). Any damage from the attack is halved, and non-damaging effects have a 50% chance to apply. If the non-damaging effect has a DC, the enemy receives a saving throw against it, at either the DC of the original effect or the DC of this ability, whichever is lower. At 10th level, you can use this ability twice per day, and at 20th level you can use it three times per day.",
                "Tracer Touch (Sp)": "Once per day, you can touch a creature or object and plant a scrying sensor on it, as if you had cast vicarious view . At 15th level, you can use this ability twice per day. You must be at least 11th level to select this revelation.",
                "Veiled Venom (Sp)": "The powers of intrigue veil your poisons and magic items from magical scrutiny. As a standard action, you can touch an object, granting it the benefits of the spells magic aura and obscure poison . You can use this ability at will, but each time you do, the effects of any previous use end.",
                "Whispered Glimpses (Su)": "The whispers of intrigue sing to you with glimpses of insight into others' presence and motives, granting you greater awareness than your own senses could manage. You can add your Charisma modifier instead of your Wisdom bonus on Perception and Sense Motive checks."
          },      
          "final revelation": ": Upon reaching 20th level, you become a master of intrigue. You can apply Silent Spell or Still Spell to any spell you cast without increasing the level or casting time. You do not need to possess these feats to use this ability."
              },
              "Juju": {
                "source": "Faiths and Philosophies pg. 14 , Pathfinder #39: The City of Seven Spears pg. 68",
                "deities": ": Wendo",
                "class skills": ": An oracle with the juju mystery adds Bluff, Intimidate, Knowledge (nature), Perform (oratory), and Survival to her list of class skills.",
                "bonus spells": ": speak with animals (2nd), hideous laughter (4th), fear (6th), charm monster (8th), mass suggestion (10th), contact other plane (as a 6th-level spell) (12th), summon nature's ally VII (14th), mass charm monster (16th), shapechange (18th).",
          "revelations": {
          "Beast Tongue (Ex)": "You can communicate with a single type of animal (birds, cats, snakes, fish, and so on) as if you were constantly using speak with animals . Although this ability grants you the ability to converse with such creatures, it grants you no special influence over them.",
          "Connaissance (Su)": "You can spend a full-round action to attune yourself to the spirit world, gaining the benefit of a moment of prescience spell with the insight bonus equal to one half your oracle level (minimum 1). You may use this ability a number of times per day equal to your Charisma modifier (minimum 1), but you may only have one connaissance effect active at a time.",
          "Ensnare the Soul (Su)": "Your magic turns others into zombie-like servants. Add charm person and dominate person to your spell list. Creatures affected by either spell become listless and pale, appearing dead to observers (DC 20 Heal or Perception check to determine the creature is not undead). Affected creatures are slow to take any action unless you specifically direct them to do so. They are not mindless or helpless, however, and defend themselves if attacked.",
          "Juju Senses (Ex)": "When casting detect magic and identify , you gain a +2 bonus on Knowledge (arcana) and Spellcraft checks to recognize auras and identify their properties. You also gain a +2 bonus on Perception and Sense Motive checks made against spirit creatures, such as outsiders, fey, and incorporeal undead. At 10th level, this bonus increases to +4.",
          "Night Terror (Su)": "You send your spirit to torment another being's dreams. Once per day, you may target a creature with the effects of a nightmare spell. Instead of the spell's normal damage, you make a full attack, using your Charisma modifier in place of your Strength modifier, against the victim's touch AC. You deal 1d10 damage for each successful hit. You must be at least 11th level before selecting this revelation.",
          "Path of the Snake (Su)": "Once per day, as a standard action, you can become incorporeal. While in this form, you gain a +10 bonus on Stealth checks and can move in any direction and through any object (except for those made of force). You can take no action other than to move while in this form. You remain in this form for a number of rounds equal to your oracle level, but you can end this effect prematurely with a standard action. At 15th level, you can use this ability twice per day. You must be at least 11th level to select this revelation.",
          "Spiritual Defense (Sp)": "Your chanting grants protection against your enemies. As a move action, you can begin chanting to gain the benefit of a protection spell (such as protection from evil ) using your oracle level as your caster level. This protection lasts until you stop chanting or for the spell's normal duration, whichever comes first. Chanting after the initial round of the effect is a free action, and you can incorporate verbal components and communication into the chant; magical silence ends a chant and its protection effect. At 6th level, you can chant aloud to create a magic circle effect (such as magic circle against evil ). You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Summon Nature's Spirits (Sp)": "Once per day, as a standard action, you may cast a summon monster spell of a level up to the highest level you can cast. You may only summon elementals in this manner, but are treated as having the Augment Summoning feat when you do so. You must be at least 5th level to select this revelation.",
          "Unwilling Host (Su)": "You command spirits to invade the bodies of your enemies. Once per day as a standard action you may target a number of creatures equal to your Charisma modifier within 100 feet, no two of which can be more than 30 feet apart. Targeted creatures must make a Will save or suffer the effects of a confusion spell as the spirits possess them and cause them to behave erratically for a number of rounds equal to your oracle level. You must be at least 7th level to select this revelation."
          },
                "final revelation": ": At 20th level, you become a master of the connections between the mortal world and the spirit world. Your knowledge enables you to gain incredible insight and control over others by manipulating spiritual energy. You gain an insight bonus equal to your Charisma modifier to your AC and on all saving throws and Knowledge checks. Additionally, once per day, you may cast extended dominate monster as a spell-like ability. With this ability, you may dominate a number of creatures equal to double your Charisma modifier."
              },
              "Life": {
                "source": "Advanced Player's Guide pg. 48",
                "deities": ": Gozreh, Pharasma, Sarenrae.",
                "class skills": ": An oracle with the life mystery adds Handle Animal, Knowledge (nature), and Survival to her list of class skills.",
                "bonus spells": ": detect undead (2nd), lesser restoration (4th), neutralize poison (6th), restoration (8th), breath of life (10th), heal (12th), greater restoration (14th), mass heal (16th), true resurrection (18th).",
          "revelations": {
          "Channel (Su)": "You can channel positive energy like a cleric, using your oracle level as your effective cleric level when determining the amount of damage healed (or caused to undead) and the DC. You can use this ability a number of times per day equal to 1 + your Charisma modifier.",
          "Combat Healer (Su)": "As the battle mystery revelation ( Nethys: Provided here for your convenience. ) Whenever you cast a cure spell (a spell with “cure” in its name), you can cast it as a swift action, as if using the Quicken Spell feat, by expending two spell slots. This does not increase the level of the spell. You can use this ability once per day at 7th level and one additional time per day for every four levels beyond 7th. You must be at least 7th level to select this revelation.",
          "Delay Affliction (Su)": "Once per day as an immediate action, whenever you fail a saving throw against a disease or poison, you may ignore its effects for 1 hour per level. At 7th and 15th level, you can use this ability one additional time per day.",
          "Energy Body (Su)": "As a standard action, you can transform your body into pure life energy, resembling a golden-white fire elemental. In this form, you gain the elemental subtype and give off a warm, welcoming light that increases the light level within 10 feet by one step, up to normal light. Any undead creature striking you with its body or a handheld weapon deals normal damage, but at the same time the attacker takes 1d6 points of positive energy damage + 1 point per oracle level. Creatures wielding melee weapons with reach are not subject to this damage if they attack you. If you grapple or attack an undead creature using unarmed strikes or natural weapons, you may deal this damage in place of the normal damage for the attack. Once per round, if you pass through a living allied creature's square or the ally passes through your square, it heals 1d6 hit points + 1 per oracle level. You may use this ability to heal yourself as a move action. You choose whether or not to heal a creature when it passes through your space. You may return to your normal form as a free action. You may remain in energy body form for a number of rounds per day equal to your oracle level.",
          "Enhanced Cures (Su)": "Whenever you cast a cure spell, the maximum number of hit points healed is based on your oracle level, not the limit based on the spell. For example, an 11th-level oracle of life with this revelation may cast cure light wounds to heal 1d8+11 hit points instead of the normal 1d8+5 maximum.",
          "Healing Hands (Ex)": "You gain a +4 bonus on Heal checks. You may provide first aid to two people or treat two people for poison as a standard action (make a separate Heal check for each creature). When using the Heal skill to treat wounds from caltrops (and so on), treat deadly wounds, treat poison, treat disease, or treat long-term care, you may treat double the normal number of people you may treat at the same time. You may provide long-term care for yourself.",
          "Life Link (Su)": "As a standard action, you may create a bond between yourself and another creature. Each round at the start of your turn, if the bonded creature is wounded for 5 or more hit points below its maximum hit points, it heals 5 hit points and you take 5 hit points of damage. You may have one bond active per oracle level. This bond continues until the bonded creature dies, you die, the distance between you and the other creature exceeds medium range, or you end it as an immediate action (if you have multiple bonds active, you may end as many as you want as part of the same immediate action).",
          "Lifesense (Su)": "You notice and locate living creatures within 30 feet, just as if you possessed the blindsight ability. You must be at least 11th level to select this revelation.",
          "Safe Curing (Su)": "Whenever you cast a spell that cures the target of hit point damage, you do not provoke attacks of opportunity for spellcasting.",
          "Spirit Boost (Su)": "Whenever your healing spells heal a target up to its maximum hit points, any excess points persist for 1 round per level as temporary hit points (up to a maximum number of temporary hit points equal to your oracle level)."
          },      
          "final revelation": ": Upon reaching 20th level, you become a perfect channel for life energy. You become immune to bleed, death attacks, exhaustion, fatigue, nausea effects, negative levels, and sickened effects. Ability damage and drain cannot reduce you below 1 in any ability score. You automatically make saving throws against massive damage. When you are below 0 hit points, you do not die until your negative total is in excess of twice your Constitution score."
              },
              "Lore": {
                "source": "Advanced Player's Guide pg. 49",
                "deities": ": Abadar, Irori, Nethys.",
                "class skills": ": An oracle with the lore mystery adds Appraise and all Knowledge skills to her list of class skills.",
                "bonus spells": ": identify (2nd), tongues (4th), locate object (6th), legend lore (8th), contact other plane (10th), mass owl's wisdom (12th), vision (14th), moment of prescience (16th), time stop (18th).",
          "revelations": {
          "Arcane Archivist (Su)": "Your experience with lore-filled tomes has granted you the ability to cast arcane spells as if they were on your spell list. Once per day, you can cast a spell from the sorcerer/wizard spell list as if it were on your list of spells known. The spell consumes a spell slot one level higher than the level of the spell. You must have a spellbook containing the spell to cast it in this way, and the spell is erased when you complete the casting. You must be at least 11th level to select this revelation.",
          "Automatic Writing (Su)": "Once per day, you can spend a full hour in uninterrupted meditation. During this period, your hands produce mysterious writing that pertains to the future. At 1st level, the prophetic writing manifests as an augury spell with 90% effectiveness. At 5th level, the writing takes the form of a divination with 90% effectiveness. At 8th level, the writing manifests as a casting of commune with no material component required.",
          "Brain Drain (Su)": "You can take a standard action to violently probe the mind of a single intelligent enemy within 100 feet. The target receives a Will save to negate the effect and immediately knows the source of this harmful mental prying. Those who fail this save are wracked with pain, taking 1d4 points of damage per oracle level. After successfully attacking with this ability, you may use a full-round action to sort through the jumble of stolen thoughts and memories to make a single Knowledge check using the victim's skill bonus. The randomly stolen thoughts remain in your mind for a number of rounds equal to your Charisma modifier. Treat the knowledge gained as if you used detect thoughts . This is a mind-affecting effect. You can use this ability once per day at 1st level, plus one additional time per day at 5th level and for every 5 levels beyond 5th.",
          "Focused Trance (Ex)": "You can enter a deep meditation, blocking out visual and auditory stimuli and allowing you to concentrate on a single problem, philosophical issue, or memory. This trance lasts 1d6 rounds, during which time you can only take move actions. During this period, you gain a bonus equal to your level on all saves against sonic effects and gaze attacks. When you come out of your trance, you may make a single Intelligence-based skill check with a +20 circumstance bonus. You may enter your focused trance a number of times per day equal to your Charisma modifier.",
          "Lore Keeper (Ex)": "Instead of encyclopedic knowledge, you learn most of your information through tales, songs, and poems. You may use your Charisma modifier instead of your Intelligence modifier on all Knowledge checks.",
          "Mental Acuity (Ex)": "Your explorations into the secret mysteries of the world have granted you a preternatural understanding of all things—and you just keep getting smarter. You gain a +1 inherent bonus to Intelligence upon taking this revelation and another at every third oracle level gained thereafter. You must be at least 7th level to select this revelation.",
          "Sidestep Secret (Su)": "Your innate understanding of the universe has granted you preternatural reflexes and the uncanny ability to step out of danger at the very last second. Add your Charisma modifier (instead of your Dexterity modifier) to your Armor Class and all Reflex saving throws. Your armor's maximum Dexterity bonus applies to your Charisma instead of your Dexterity. Spontaneous Symbology : Your knowledge of the secret history of the world has unveiled the mysterious symbols that govern reality. You can cast any “symbol” spell using a spell slot of the appropriate level, even if the spell is not on your list of spells known. A symbol spell is any spell with the word “symbol” in its name. You must be at least 11th level to select this revelation",
          "Think On It (Ex)": "Once per day, the oracle of lore can re-attempt any previously failed Knowledge check. On this attempt, add a +10 competence bonus on the check.",
          "Whirlwind Lesson (Ex)": "You can quickly browse through a magical tome or manual, gaining its benefits with only a single 8-hour study session (rather than the usual 48 hours over a period of 6 days). At 7th level, you may allow another character to join in your study; both of you gain the full benefit of having read the book. At 15th level, you may share your whirlwind lesson with a number of characters equal to your oracle level. The benefits to you are permanent, whereas your students gain the tome or manual's benefits for a number of days equal to your Charisma modifier but then forget what they have learned."
          },
          "final revelation": ": You gain the ability to take 20 on all Knowledge skill checks. Your understanding of the fundamental underpinnings of reality has also become so advanced that once per day, you can cast wish . This ability does not require a material component, but the wish cannot be used to grant ability score bonuses, nor can it be used to replicate spells with expensive material components."
              },
              "Lunar": {
                "source": "Blood of the Moon pg. 28",
                "deities": ": Ashava, Desna, Groetus, Jezelda, Tsukiyo, Zon-Kuthon.",
                "class skills": ": An oracle with the lunar mystery adds Acrobatics, Knowledge (Nature), Perception, and Survival to her list of class skills.",
                "bonus spells": ": fumbletongue (2nd), dust of twilight (4th), rage (6th), moonstruck (8th), aspect of the wolf (10th), litany of madness (12th), lunar veil (14th), blood mist (16th), polar midnight (18th).",
          "revelations": {
          "Form of the Beast (Su)": "As a standard action, you can assume the form of a Small or Medium animal, as beast shape I . At 9th level, you can assume the form of a Tiny or Large animal, as beast shape II . At 11th level, you can assume the form of a Diminutive or Huge animal or a Small or Medium magical beast, as beast shape III . At 13th level, you can assume the form of a Tiny or Large magical beast, as beast shape IV . You can use this ability once per day, but the duration is 1 hour/level. You must be at least 7th level to select this revelation.",
          "Eye of the Moon (Su)": "Your connection to the moon makes you supernaturally perceptive. You gain darkvision to a range of 60 feet. At 11th level, as a standard action, you can focus on a specific object or area (the size of which can be no greater than a 10-foot-by-10-foot square) and see it as though with true seeing as long as the moon is shining on it. Moonless nights, cloudy skies, and shadows interfere with this ability.",
          "Gift of Claw and Horn (Su)": "As a swift action, you gain a natural weapon. The natural weapon lasts for a number of rounds equal to half your oracle level (minimum 1). You must choose a bite, claw, or gore attack. These attacks deal the normal damage for a creature of your size ( Pathfinder RPG Bestiary 302). At 5th level, your natural weapon gains a +1 enhancement bonus. This bonus increases by +1 at 10th, 15th, and 20th level. At 11th level, you gain two natural weapons at a time. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Mantle of Moonlight (Su)": "Your innate understanding of the moon renders you immune to the curse of lycanthropy. Additionally, you may disrupt a lycanthrope's connection to the moon with a successful touch attack. This action automatically forces the lycanthrope into its humanoid form, in which it must remain for a number of rounds equal to your oracle level. Upon reaching 5th level, you can use this ability to force others into a rage , as the spell. Using this ability is a melee touch attack. You can use this ability once per day at 5th level plus one additional time per day for every 5 levels above 5th.",
          "Moonbeam (Su)": "You can fire a ray of moonlight as a ranged touch attack at any creature within 30 feet. This ray deals 1d6 points of damage + 1 for every 2 oracle levels you possess. In addition, the target must succeed at a Fortitude save or become blinded for 1 round. You can use this ability a number of times per day equal to your Charisma modifier (minimum 1).",
          "Moonlight Bridge (Su)": "You summon a bridge of moonlight. The 10-foot-wide span touches the ground at a point adjacent to you. It can extend from this point in any direction for 10 feet per oracle level. The path persists until you have crossed over the bridge or for 24 hours, whichever is shorter. You may summon a moonlight bridge a number of times per day equal to your Charisma bonus.",
          "Should the bridge be attacked, treat it as a wall of force Moonlit Script (Su)": "Once per night while you sleep, your hands produce mysterious writing that pertains to the future. At 1st level, the prophetic writing manifests as an augury spell with 90% effectiveness. At 5th level, the writing takes the form of a divination with 90% effectiveness. At 8th level, the writing manifests as a casting of commune with no material component required.",
          "Primal Companion (Ex)": "You gain the service of a faithful animal of the night. You can select from a bear, boar, crocodile, shark, tiger, or wolf. This animal functions as a druid's animal companion, using your oracle level as your effective druid level.",
          "Prophetic Armor (Ex)": "You are so in tune with your primal nature that your instincts often act to save you from danger that your civilized mind isn't even aware of. You may use your Charisma modifier (instead of your Dexterity modifier) as part of your Armor Class and all Reflex saving throws. Your armor's maximum Dexterity bonus applies to your Charisma, instead.",
          "Touch of the Moon (Su)": "The exact effects of this revelation depend on whether you cast inflict or cure spells. If you cast inflict spells, these spells carry with them the taint of madness. Subjects who take damage from your inflict spells are also subject to confusion , as the spell, except the duration of this effect is a number of rounds equal to the level of the inflict spell. The save DC against this effect is 10 + 1/2 your oracle level + your Charisma modifier. Alternatively, if you cast cure spells, these spells are potentially more effective but entirely in the target's mind. Whenever you cast a cure spell, you can cast it as though it were enhanced with the Empower Spell metamagic feat by expending two spell slots, except these hit points are temporary. This does not increase the level of the spell. Hit points healed this way expire after a number of minutes equal to half your oracle level. You must be at least 7th level to select this revelation."
          },
          "final revelation": ": Upon reaching 20th level, you become an avatar of the primal world—part humanoid, part beast. Once per day, you can transform into a lycanthrope of your choice for a number of hours equal to your Charisma modifier, gaining all the powers of a natural lycanthrope of that type, including the ability to change shape between human, animal, and hybrid form. In addition, you become immune to mind-affecting and language-dependent effects, as well as effects that specifically target only humanoids."
              },
              "Metal": {
                "source": "Ultimate Magic pg. 55",
                "deities": ": Abadar, Gorum, Torag.",
                "class skills": ": An oracle with the metal mystery adds Appraise, Bluff, Disable Device, and Intimidate to her list of class skills.",
                "bonus spells": ": lead blades (2nd), heat metal (4th), keen edge (6th), versatile weapon (8th), major creation (metal items only) (10th), wall of iron (12th), statue (metal statue instead of iron) (14th), repel metal or stone (16th), iron body (18th).",
          "revelations": {
          "Armor Mastery (Ex)": "You become more maneuverable while wearing armor. You can move at your normal speed in medium armor that is made of metal. This does not grant proficiency in armor. At 5th level, whenever you are wearing metal armor, you reduce the armor check penalty by 1 (to a minimum of 0) and increase the maximum Dexterity bonus allowed by your armor by 1. At 10th level, and again at 15th level, these bonuses increase by 1.",
          "Dance of the Blades (Ex)": "Your base speed increases by 10 feet. At 7th level, you gain a +1 bonus on attack rolls with a metal weapon in any round in which you move at least 10 feet. This bonus increases by +1 at 11th level, and every four levels thereafter. At 11th level, as a move action, you can maneuver your weapon to create a shield of whirling steel around yourself until the start of your next turn; non-incorporeal melee and ranged attacks against you have a 20% miss chance while the shield is active. You must be wielding a metal weapon to use this ability.",
          "Iron Constitution (Su)": "You gain a +1 bonus on Fortitude saves. At 7th level, and again at 14th level, this bonus increases by +1.",
          "Iron Skin (Sp)": "Once per day, your skin hardens and takes on the appearance of iron, granting you DR 10/adamantine. This ability functions as stoneskin , using your oracle level as the caster level, except it only affects you. At 15th level, you can use this ability twice per day. You must be at least 11th level to select this revelation.",
          "Iron Weapon (Su)": "You can create a melee simple or martial weapon that lasts for 1 minute for every oracle level you possess. This weapon is appropriate for your size and entirely made of metal (even if it would normally include non-metal parts, such as a spear's shaft) but functions as if it were a normal weapon of its type. You are considered proficient with this weapon. The weapon disappears after 1 round if it leaves your grasp. At 3rd level, the blade is made of cold iron. At 7th level, 15th level, and 19th level, the blade gains a +1 enhancement bonus. At 11th level, the blade is made of adamantine. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Riddle of Steel (Su)": "Your sacred bond with metal gives you insight into its form and function. Once per day, you may spend 10 minutes meditating on the structure of a piece of unworked metal or ore to gain a +5 insight bonus on your next Craft check to make something using that metal.",
          "Rusting Grasp (Sp)": "Once per day as a standard action, you can perform a melee touch attack that rusts iron, as the rusting grasp spell. At 11th level, and every four levels thereafter, you can use this ability an additional time per day. You must be at least 7th level to select this revelation.",
          "Skill at Arms (Ex)": "You gain proficiency in all martial weapons and heavy armor.",
          "Steel Scarf (Su)": "As a swift action, you can harden a scarf, sleeve, cloak, or other piece of your clothing into something as hard as steel that stretches out to be up to 30 feet long. You can then strike outward with it as if it were a weapon making a melee attack. For the purpose of this ability, you are proficient with this weapon. You can use the weapon to perform combat maneuvers. Make a melee attack roll against a creature within 30 feet; you may use Weapon Finesse with this attack. If you hit, the weapon deals 1d8 points of slashing damage + 1 point for every two oracle levels you possess. After this attack, the clothing returns to its normal length and hardness. You do not threaten an area with this weapon and cannot use it to make attacks of opportunity. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Vision in Iron (Sp)": "You can use any piece of polished metal at least the size of a dagger as a scrying device, as if using the spell scrying . At 15th level, this functions like greater scrying . You can scry for a number of rounds per day equal to your oracle level; these rounds do not need to be consecutive. You must be at least 7th level to select this revelation."
          },
          "final revelation": ": Upon reaching 20th level, you become a master of iron and steel. You gain the benefits of Weapon Focus, Greater Weapon Focus, and Improved Critical with any one metal weapon that you are proficient with. Your armor is like a second skin to you—while wearing metal armor you are proficient with, the armor's maximum Dexterity bonus increases by +5 and you take no armor check penalty. In addition, any metal you create with your magic (such as wall of iron ) has its hardness increased by +10."
              },
              "Nature": {
                "source": "Advanced Player's Guide pg. 50",
                "deities": ": Erastil, Gozreh.",
                "class skills": ": An oracle with the nature mystery adds Climb, Fly, Knowledge (nature), Ride, Survival, and Swim to her list of class skills.",
                "bonus spells": ": charm animal (2nd), barkskin (4th), speak with plants (6th), grove of respite (8th), awaken (10th), stone tell (12th), creeping doom (14th), animal shapes (16th), world wave (18th).",
          "revelations": {
          "Bonded Mount (Su)": "You gain the service of an unusually intelligent, strong, and loyal mount. The creature must be one that you are capable of riding and is suitable as a mount. A Medium oracle can select a camel or a horse. A Small oracle can select a pony or wolf, but can also select a boar or a dog if she is at least 4th level. This mount functions as a druid's animal companion, using your oracle level as your effective druid level. Bonded mounts have an Intelligence score of at least 6.",
          "Erosion Touch (Su)": "As a melee touch attack, you can deal 1d6 points of damage per level to objects or constructs. If used against an object in another creature's possession, treat this attack as a sunder combat maneuver. You can use this ability once per day, plus one time per day for every three levels you possess.",
          "Friend to the Animals (Ex)": "Add all summon nature's ally spells to your spell list. You must still select these spells using your allotment of spells known. Animals within 30 feet of you receive a bonus on all saving throws equal to your Charisma modifier.",
          "Life Leach (Su)": "You can draw life force from the bodies of enemies and channel it into yourself. As a standard action, you can drain the life essence from one living target within 30 feet. The target takes 1d6 points of damage per two levels you possess (maximum 10d6). You gain temporary hit points equal to the damage you deal. You can't gain more than the target's current hit points + the target's Constitution score (which is enough to kill the subject). The temporary hit points last a number of hours equal to your Charisma modifier. The target receives a Fortitude save to halve the damage (and the temporary hit points you gain). You may use this ability once per day at 7th level, plus one additional time per day for every 4 levels you possess beyond 7th. You must be at least 7th level before selecting this revelation.",
          "Natural Divination (Ex)": "You can read the entrails of a freshly killed animal or humanoid to gain an insight bonus equal to your Charisma modifier on one saving throw. Alternatively, by observing and interpreting the flights of birds, you may apply a +10 competence bonus on any one skill check. Finally, by charting marks in dirt or stone, or observing the behavior of sand when thrown into the wind, you gain a +4 insight bonus on one initiative check. These bonuses must be used during the next 24 hours and you must declare you are using the bonus before the check or save is made. Making a natural divination takes 10 minutes. You may use natural divination (in any combination) once per day plus one additional time per day for every four oracle levels you have attained.",
          "Nature's Whispers (Ex)": "You have become so attuned to the whispers of the natural world, from the croaking of frogs to the groaning of great boulders, that your surroundings constantly keep you preternaturally aware of danger. You may add your Charisma modifier, instead of your Dexterity modifier, to your Armor Class and CMD. Any condition that would cause you to lose your Dexterity modifier to your Armor Class instead causes you to lose your Charisma modifier to your Armor Class.",
          "Speak with Animals (Ex)": "Choose a specific kind of animal (eagle, fox, dog, and so on). You gain the ability to converse with that type of animal as if you were under the effects of speak with animal . You gain the ability to communicate with an additional kind of animal for every 3 oracle levels you have attained.",
          "Spirit of Nature (Su)": "When in a natural setting, whenever you are reduced to negative hit points, you automatically stabilize. At 5th level, you gain fast healing 1 for 1d4 rounds whenever you are reduced to negative hit points. At 10th level, the ability works everywhere, even in civilized or wholly artificial realms. At 15th level, you gain fast healing 3 for 1d4 rounds when reduced to negative hit points.",
          "Transcendental Bond (Su)": "You become so attuned to the common spirit shared by all living things that you can use it to communicate with allies. You may communicate with your allies for a number of rounds per day equal to your oracle level as if using telepathic bond . You may designate a number of creatures as your ally equal to your Charisma modifier. Designating a creature is a standard action that requires a touch. At 10th level, you may use this bond to cast a touch spell on a designated ally once per day.",
          "Undo Artifice (Sp)": "At 11th-level, you gain the ability to reduce a nonliving item to its component parts, essentially erasing the hand of artifice and rendering the item into a pile of raw natural materials. This effect acts as the spell polymorph any object , working on both magical and nonmagical nonliving objects. The duration is always permanent. Unlike polymorph any object , it cannot be used to mimic the effects of other spells. Items subject to this effect receive a Fortitude saving throw to negate the effect. Magic items receive a circumstance bonus on this save equal to +1 for every 5,000 gp in the item's value. You may use undo artifice a number of times per day equal to your Charisma modifier."
          },
          "final revelation": ": At 20th level, you have discovered the intrinsic secrets of life itself, granting you incredible control over your own body. Once per day, you can surround yourself with an organic cocoon as a full-round action. While enclosed in the cocoon, you are considered helpless. Eight hours later, you emerge having changed your type to plant, animal, or humanoid, gaining superficial physical characteristics as appropriate (see the Pathfinder RPG Bestiary ). This change does not alter your Hit Dice, hit points, saving throws, skill points, class skills, or proficiencies. Each time the transformation is made, you are cleansed of all poisons or diseases, are restored to full hit points, and heal all ability damage. You must select a new type every time the transformation is made."
              },
              "Occult": {
                "source": "Occult Mysteries pg. 53 , Pathfinder #71: Rasputin Must Die! pg. 68 You have an innate connection to the spirits of the dead.",
                "deities": ": Magdh, Nethys, Pharasma, Tsukiyo.",
                "class skills": ": An oracle with the occult mystery adds Bluff, Disguise, Knowledge (arcana), and Use Magic Device to her list of class skills.",
                "bonus spells": ": unseen servant (2nd), spectral hand (4th), clairaudience/clairvoyance (6th), scrying (8th), contact other plane (10th), project image (12th), vision (14th), moment of prescience (16th), astral projection (18th).",
          "revelations": {
          "Automatic Writing (Su)": "Once per day, you can spend a full hour in uninterrupted meditation. During this period, your hands produce mysterious writing that pertains to the future. At 1st level, the prophetic writing manifests as an augury spell with 90% effectiveness. At 5th level, the writing takes the form of a divination spell with 90% effectiveness. At 8th level, the writing manifests as a casting of commune with no material component required.",
          "Brain Drain (Su)": "You can take a standard action to violently probe the mind of a single intelligent enemy within 100 feet. The target receives a Will save to negate the effect and immediately knows the source of this harmful mental prying. Those who fail this save are wracked with pain, and take 1d4 points of damage per oracle level you possess. After successfully attacking with this ability, you can use a full-round action to sort through the jumble of stolen thoughts and memories and then attempt a single Knowledge check using the victim's skill bonus. The randomly stolen thoughts remain in your mind for a number of rounds equal to your Charisma modifier. Treat the knowledge gained as if you had used detect thoughts . This is a mind-affecting effect. You can use this ability once per day at 1st level, plus 1 use per day at 5th level, and 1 use for every 5 levels beyond 5th.",
          "Ectoplasmic Armor (Su)": "You can conjure armor made of ectoplasm that grants you a +4 armor bonus to AC. In addition, this armor functions as if it had the ghost touch special ability. At 7th level and every 4 levels thereafter, the armor bonus increases by 2. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Phantom Touch (Su)": "As a standard action, you can perform a melee touch attack that causes a living creature to become shaken. This ability lasts for a number of rounds equal to 1/2 your oracle level (minimum 1 round). You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 5th level, the target instead becomes frightened, and at 7th level, the target becomes panicked.",
          "Project Psyche (Su)": "You can project your psyche into another vessel. Once per day, you can possess another creature as if using the magic jar spell, though this does not require a receptacle. You must be adjacent to the target creature, which receives a Will save against the effect. You must be at least 11th level to choose this revelation.",
          "Shroud of Retribution (Su)": "As an immediate action, you can summon a shroud of spirits that reflects your attackers' damage back onto them. Any creature that strikes you deals normal damage to you, but at the same time the attacker takes 1d8 points of force damage + 1 point per 2 caster levels you possess (maximum +10). This effect lasts until the end of your next turn. You can use this ability once per day, plus one additional time per day at 11th level and every 4 levels thereafter. You must be at least 7th level to select this revelation.",
          "Spectral Spells (Su)": "You gain Ectoplasmic Spell APG as a bonus feat. In addition, once per day, you can cast a spell with the Ectoplasmic Spell metamagic feat as a standard action that does not increase the level of the spell. You can use this ability one additional time per day at 7th level and every 4 levels thereafter.",
          "Spirit Walk (Su)": "You can become incorporeal and invisible. While in this form, you can move in any direction and pass through solid objects. You can take no actions other than to move while in this form. You can remain in this form for a number of rounds equal to your oracle level, but you can end this effect prematurely as a standard action. You can use this ability once per day at 11th level and twice per day at 15th level. You must be at least 11th level to select this revelation.",
          "Sure Soul (Su)": "Because of your experience with possessing spirits, you gain a +2 insight bonus on saving throws against possession effects such as magic jar , a ghost's malevolence ability, or domination effects. At 7th level, this bonus also applies against death effects and mind-affecting effects. At 11th level, the bonus increases to +4.",
          "Voice of the Grave (Su)": "You can use speak with dead , as the spell, for a number of rounds per day equal to your oracle level. These rounds do not need to be consecutive. At 5th level and every 5 levels thereafter, the dead creature takes a cumulative –2 penalty on its Will save to resist this effect."
          },
                "final revelation": ": Upon reaching 20th level, you become one with the spirits. You become immune to death effects, exhaustion, fatigue, nausea, negative levels, and the sickened condition. You can cast astral projection and true seeing once per day as spell-like abilities without requiring material components. Should you die, you rise again 2d4 days later as a ghost."
              },
              "Outer Rifts": {
                "source": "Inner Sea Magic pg. 31",
                "deities": ": Iomedae, Groetus, Lamashtu, demon lords",
                "class skills": ": An oracle with the Outer Rifts mystery adds Fly, Intimidate, Knowledge (arcana), and Survival to her list of class skills.",
                "bonus spells": ": endure elements (2nd), resist energy (4th), vermin shape I (6th), confusion (8th), lesser planar binding (10th), planar binding (12th), insanity (14th), greater planar binding (16th), imprisonment (18th).",
          "revelations": {
          "Balefire (Su)": "You call upon the cleansing or searing fires of the Outer Rifts to burn your foes. As a standard action, one target within 30 feet is wreathed in screaming flames and takes 1d6 points of fire damage per level. A successful Ref lex save halves this damage. At 10th level, the fire's howls cause any creatures damaged by it to be staggered for 1 round. At 15th level, creatures who fail their saves against the balefire are staggered for 1d4 rounds and stunned for 1 round. You can use this ability once per day plus one additional time per day at 10th level.",
          "Demonhide (Su)": "You alter your flesh to be as tough as a demon's hide, granting you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this armor also grants you DR 5/cold iron. You can use this revelation for 1 hour per day per oracle level. The duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Dread Resilience (Ex)": "You have been hardened by exposure to the otherworldly energies of the Outer Rifts, and you just keep getting tougher. You gain a +1 inherent bonus to Constitution upon taking this revelation and another for every four oracle levels gained thereafter. You must be at least 9th level to select this revelation.",
          "Planar Haze (Su)": "You can fill an area with the smoky miasma of the Outer Rifts. Once per day when you cast a spell that has an area, as a swift action you may also fill that area with a thick haze that acts as obscuring mist, except it originates at the center of your spell effect and cannot expand beyond the spell's area. At 10th level, the haze functions as fog cloud . You may use this ability one additional time per day at 7th level, and one additional time per day at 14th level.",
          "Planar Infusion (Su)": "As a standard action once per day, you can cause a 20-foot-spread to gain either the mildly chaotic-aligned or mildly evil-aligned planar trait for a number of rounds equal to your oracle level. Lawful creatures in a chaotic-aligned area take a –2 circumstance penalty on all Charisma-based checks, as do good creatures in an evil-aligned area. At 11th level, the infusion makes the area strongly aligned, which causes the –2 circumstance penalty to apply on all Intelligence-, Wisdom-, and Charisma-based checks made by any creature that lacks the matching alignment component (these penalties stack with those from the lower-level effect). You must be chaotic or evil to select this revelation, and you can only infuse an area with an alignment that matches a component of your own alignment.",
          "Rift Magic (Su)": "Your spells gain a +4 bonus on caster level checks made to overcome the spell resistance of chaotic outsiders and evil outsiders.",
          "Rift Weapon (Su)": "Your understanding of the powers that move through the Outer Rifts allows you to imbue weapons with the ability to penetrate the defenses of creatures native to other planes. Once per day as a standard action, you can touch one weapon (or a group of up to 20 similar pieces of ammunition) and give it the ability to penetrate DR/cold iron for 1 minute per caster level. At 9th level, you can also grant the additional ability to bypass either DR/good and DR/law. You can use this ability an additional time per day for every 5 oracle levels you possess.",
          "Telepathy (Su)": "You can mentally communicate with any other creature within 100 feet that has a language, as per the telepathy power of demons and angels. You must be at least 11th level before selecting this revelation.",
          "Unearthly Terrain (Su)": "You can twist the material world into the harsh, jagged edges and uneven angles of the outer planes. As a standard action, you can turn one 20- foot square into difficult terrain for 1 round per level. You may use this ability a number of times per day equal to 3 + your Charisma bonus.",
          "Wings of Terror (Su)": "You can manifest a pair of enormous, batlike demon wings that grant you a fly speed of 60 feet with average maneuverability and a +4 bonus on Intimidate checks. At 10th level, your speed increases to 90 feet, your maneuverability increases to good, and the bonus increases to +8 on Intimidate checks. You can use these wings for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 7th level to select this revelation."
          },
                "final revelation": ": At 20th level, you gain the ability to open rifts between planes. This allows you to use gate as a spell-like ability once per day. If you use this ability to call creatures, you still need to provide 10,000 gp in offerings to secure the creature's aid."
              },
              "Reaper": {
                "source": "Pathfinder #139: The Dead Road pg. 66 Errata Oracles with the reaper mystery strive to quiet restless souls, end lives, and send souls to their final reward.",
                "deities": ": Achaekek, Groetus, Pharasma",
                "class skills": ": An oracle with this mystery adds Intimidate, Perception, Stealth, and Survival to her list of class skills.",
                "bonus spells": ": chill touch (2nd), calm spirit (4th), sands of time (6th), purge spirit (8th), slay living (10th), undeath to death (12th), destruction (14th), horrid withering (16th), wail of the banshee (18th).",
          "revelations": {
          "Death's Embrace (Su)": "You gain Improved Grapple as a bonus feat, even if you do not meet its prerequisites. Once per round when you succeed at a grapple combat maneuver check, you can deal 1d6 points of negative energy damage to the target of your grapple. This damage increases by 1d6 at 5th level and every 5 levels thereafter, to a maximum of 5d6 at 20th level.",
          "Haunt Channeler (Su)": "You gain the medium's haunt channeler class feature with an effective medium level equal to your oracle level –2. You must be at least 5th level to select this revelation.",
          "Moral Crisis (Su)": "As a standard action, you can target a living creature within 30 feet of you, reminding it of its moral failings. The target must succeed at a Will save or be staggered for a number of rounds equal to your oracle level. The target can attempt a new saving throw at the end of each of its turns to end this effect. This is a mind-affecting emotion effect.",
          "Obliterate Memory (Sp)": "As a standard action, you can target a creature within 30 feet and eliminate all memory of an event the target experienced, as modify memory . A target can attempt a Will save to negate this effect. In addition, you can cause an account of the memory erased by this ability to appear on a blank page of any book you are carrying. You can use this ability once per day, plus one additional time per day at 15th level. You must be at least 11th level to select this revelation.",
          "Pale Horse (Sp)": "You can summon a phantom steed , as the spell, to serve you for a number of hours per day equal to your oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments. You must be at least 5th level to select this revelation.",
          "Return to Dust (Su)": "You call upon the inexorable ravages of time and entropy to damage an object or undead creature within 30 feet, dealing 1d6 points of damage per 2 oracle levels you have, ignoring hardness and damage reduction. If used against an undead creature or an object in another creature's possession, the undead creature or the creature possessing the object can attempt a Reflex saving throw to halve the damage. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Spectral Spells (Su)": "You gain Ectoplasmic Spell as a bonus feat. In addition, once per day, you can cast a spell with the Ectoplasmic Spell metamagic feat as a standard action that does not increase the level of the spell. You can use this ability one additional time per day at 7th level and every 4 levels thereafter.",
          "Spirit Touch (Su)": "As a standard action, you can touch one weapon to grant it the ghost touch special ability for a number of rounds equal to your Charisma modifier. At 11th level, you can spend two uses of this ability to grant it the ghost touch and undead bane special abilities. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Terminal Aura (Su)": "You gain an aura with a 10-foot radius; any creature within that has fewer than 0 hit points but is stable must succeed at a Will save or be affected by the spell bleed . A dying creature within range of this aura does not receive a Constitution check to stabilize unless it succeeds at a Will save, but it can still be healed as normal. A creature with fast healing or regeneration must also succeed at a Will save every round or that ability does not function for 1 round. You can suppress and resume this aura as a free action. You must be at least 11th level to select this revelation.",
          "True Death (Su)": "Those slain by your spells or by one of your attacks that deals negative energy becomes more difficult to bring back from the dead. Spellcasters attempting to bring such a creature back from the dead using raise dead or similar magic must succeed at a caster level check with a DC equal to 15 + your oracle level or the spell fails and the material component is wasted. A successful casting of remove curse (DC = 10 + your oracle level) before attempting to bring the creature back from the dead suppresses this effect for 1 minute."
          },      "final revelation": ": Upon 20th level, you are a true reaper of death and no soul can escape your sight. You automatically confirm critical hits and creatures automatically fail Fortitude saves against your coup de grace attempts. In addition, you can notice, locate, and distinguish between living and undead creatures within 60 feet, just as if you had the blindsense ability. This sense does not allow you to detect objects, but it does allow you to notice living things that are not creatures."
              },
              "Shadow": {
                "source": "Blood of Shadows pg. 12",
                "deities": ": Groetus, Lao Shu Po, Tsukiyo, Zon-Kuthon.",
                "class skills": ": An oracle with this mystery adds Bluff, Disguise, Knowledge (dungeoneering), and Stealth to her list of class skills.",
                "bonus spells": ": blurred movement (2nd), invisibility (4th), deeper darkness (6th), shadow step (8th), vampiric shadow shield (10th), shadow walk (12th), mass invisibility (14th), greater shadow evocation (16th), shades (18th).",
          "revelations": {
          "Army of Darkness (Su)": "Whenever you cast a summon monster spell and summon a creature that normally has the celestial or fiendish template, you can instead summon it with the shadow creature template ( Pathfinder RPG Bestiary 4 238). This revelation counts as having the Spell Focus (conjuration) feat for the purpose of meeting the prerequisites of the Augment Summoning feat, as well as any feat that lists Augment Summoning as a prerequisite.",
          "Cloak of Darkness (Su)": "This ability functions as the dark tapestry mystery UM revelation of the same name.",
          "Dark Secrets (Su)": "You learn the hidden secrets surrounding the casting of shadow spells. You can add a number of spells from the sorcerer/wizard spell list equal to your Charisma modifier (minimum 1, maximum equal to half your oracle level) to your spell list and your list of spells known as divine spells. These have a spell level equal to their sorcerer/wizard spell level. You can add only illusion spells from the shadow subschool or spells with the darkness descriptor to your list of spells known in this manner. Each time you gain an oracle level after taking this revelation, you can choose to replace one of these spells for a new appropriate spell on the sorcerer/wizard spell list.",
          "Living Shadow (Sp)": "Your body dissolves, and you become a living shadow. This ability functions as gaseous form . At 14th level, this ability functions as shadow body OA instead, except you also gain DR 10/magic and become immune to poison, sneak attacks, and critical hits as if also using gaseous form . You can use this ability a number of minutes per day equal to your oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 7th level to choose this revelation.",
          "Pierce the Shadows (Su)": "The shadows step aside from your baleful gaze, affording you sight in even the deepest darkness. You gain darkvision 60 feet. If you already have darkvision, increase your existing darkvision by 60 feet instead. At 11th level, you can see perfectly in darkness of any kind, even in absolute darkness or the darkness created by a deeper darkness spell.",
          "Shadow Armament (Su)": "You can create a quasi-real simple or martial masterwork weapon appropriate for your current size. You are considered proficient with this weapon. The first time you hit a creature with this weapon, that creature can attempt a Will save to disbelieve; failure means the weapon deals damage normally, while success means the creature takes only 1 point of damage from the weapon's attacks. The weapon deals only 1 point of damage to objects. At 3rd level, and again at 11th level and 19th level, the weapon gains a cumulative +1 enhancement bonus. At 7th level, the weapon gains either the frost or keen weapon special ability, chosen when the weapon is created. These abilities don't function against a target that succeeds at its Will save. At 15th level, the weapon deals minimum damage (as if it had rolled a 1 on each of its damage dice) against targets that succeed at their saves instead of 1 point of damage. You can use this ability for a number of minutes per day equal to your oracle level. This duration does not need to be consecutive, but it must be used in 1-minute increments. The weapon disappears after 1 round if it leaves your grasp.",
          "Shadow Mastery (Su)": "Whenever you cast an illusion spell from the shadow subschool, increase the strength of such spells by 1% per oracle level you have. You must be at least 7th level to choose this revelation.",
          "Shadow Projection (Su)": "You infuse your life force and psyche into your shadow, causing it to separate from your body and act as an independent creature. This ability functions as shadow projection APG except as follows. Your shadow has the outsider type and the phantom subtype instead of the undead type. As a result, this ability does not have the evil descriptor and your shadow cannot be turned or affected as undead (though it can be affected as an outsider). You can use this ability for a number of hours per day equal to half your oracle level. These hours don't need to be consecutive, but they must be spent in 1-hour increments. Your shadow's hit points are not replenished between uses, although your shadow can be healed in the same manner as any other outsider. When this ability isn't in use, any healing done to you also heals your shadow for an equal amount. You must be at least 7th level to choose this revelation.",
          "Stealth Mastery (Ex)": "You gain Skill Focus with the Stealth skill. At 8th level, you gain Signature Skill PU with the Stealth skill, even if you don't meet the feat's prerequisites. At 16th level, you gain the hide in plain sight shadowdancer class feature.",
           "Wings of Darkness (Su)": "This ability functions as the dark tapestry mystery UM revelation of the same name. You must be at least 7th level to select this revelation."
          },
                "final revelation": ": Upon reaching 20th level, your body becomes permanently suffused with the essence of the Shadow Plane. You gain regeneration 5 while in dim light or darkness and immunity to cold, critical hits, and sneak attacks. Your regeneration is suppressed while in any level of illumination brighter than dim light. In addition, any spells you cast of the shadow subschool or with the darkness descriptor are automatically enlarged without affecting their spell level."
              },
              "Solar": {
                "source": "The Harrow Handbook pg. 26 Aimless wanderers and restless nomads, oracles of the solar mystery uncover meaning in the ever-changing positions of the sun and the stars in the sky.",
                "deities": ": Desna, Gozreh, Iomedae, Keltheald, Lalaci, Nurgal, Sarenrae, Ymeri.",
                "class skills": ": An oracle with this mystery adds Fly, Knowledge (geography), Linguistics, and Survival to her list of class skills.",
                "bonus spells": ": faerie fire (2nd), flaming sphere (4th), daylight (6th), dimension door (8th), planar adaptation (10th), sirocco (12th), sunbeam (14th), sunburst (16th), prismatic sphere (18th).",
          "revelations": {
          "Astral Caravan (Su)": "As a full-round action, you can step into the planar border where the Astral Plane abuts the Material Plane, pulling up to one additional person per class level with you. You can't travel fully into the Astral Plane or any of the other planes it borders, but while using this ability you can cover incredible distances, traversing 50 miles per hour, as per the shadow walk spell. You can travel for up to 1 hour per day per oracle level. This duration need not be continuous, but it must be spent in 1-hour increments.",
          "Blistered Caress (Su)": "You can channel the hostile, unforgiving heat of the sun into your touch. This is a melee touch attack that deals 1d8 points of fire damage per 2 oracle levels (Fortitude half ). Against a plant creature, this touch heals or damages the creature (your choice) for 1d6 points of fire damage per oracle level. At 7th level, a creature that fails its save against this revelation becomes sickened for 1d4 hours in addition to taking fire damage. At 15th level, your touch is so intense that a creature that fails its save is also staggered for 1d6 rounds. You can use this ability once per day plus one additional time per day at 10th level.",
          "Luminous Form (Su)": "You can transform your body into churning light, granting you the effects of blur and causing your body to shed light as a sunrod. At 7th level, creatures that end their turn adjacent to your luminous form become blinded for 1 round (Fortitude negates). At 13th level, creatures that end their turn adjacent to your luminous form are blinded for 1d4 rounds (Fortitude reduces to 1 round). At 18th level, your luminescence is as bright as natural sunlight, and creatures affected by natural sunlight are so affected if they end their turn adjacent to your luminous form. You can maintain your luminous form for up to 1 minute per day per oracle level; this duration need not be continuous, but it must be used in 1-minute increments. You can forgo the blur and blinding aspects of this ability to instead simply shed light as a torch, though this still counts against the ability's duration for the day.",
          "Many Roads (Su)": "You gain an insight bonus on Fly and Survival checks equal to 1/2 your oracle level. Further, you learn to speak and read three languages in addition to those you already know.",
          "Serpent in the Sun (Su)": "So long as you are exposed to at least 4 hours of sunlight per day, you no longer need to eat to survive and you gain +2 bonus on saves against diseases. At 5th level, you become immune to nonmagical diseases and no longer need to drink water to survive. At 10th level, you become immune to magical diseases, gain a +2 bonus on saving throws against poisons, and only need to sleep half as long to rest or recover from fatigue or exhaustion. At 15th level, you become immune to poison and fatigue. You lose these benefits if you fail to spend at least 4 hours in sunlight in a 24-hour period.",
          "Solar Wind (Su)": "You can unleash a blast of searing wind at a single target within 30 feet as a ranged touch attack with no range increment. Your solar wind deals 1d6 points of fire damage + 1 for every 2 oracle levels you possess. At 7th level, you can also knock an opponent back, treating the blast as a bull rush combat maneuver that uses your caster level + your Charisma modifier in place of your CMB. You can use this ability a number of times per day equal to 3 + your Charisma modifier. Starlight Agility : You gain Dodge as a bonus feat. At 8th level, you gain Wind Stance as a bonus feat. At 15th level, you gain Lightning Stance as a bonus feat. You do not need to meet the prerequisites to receive these feats. Sun Stride : You can travel between areas of natural sunlight as if by means of a dimension door spell. This ability does not function in areas of less than bright light, though it does work within the area of a daylight spell. At 5th level, you can sun stride up to 40 feet per day; this can be a single stride of 40 feet or four strides of 10 feet each. At 9th level and every 4 levels thereafter, the distance you can sun stride doubles (80 feet at 9th level, 160 feet at 13th level, and 32 feet at 17th level). This amount can be split among many strides, but each one, no matter how small, counts as a 10-foot increment. You must be at least 5th level to select this revelation.",
          "Sungazer (Sp)": "You can study the sun and gaze upon any place its light touches. You can use clairaudience/clairvoyance as a spell-like ability, but only for visual observation and you can only place your sensor in places currently being touched by sunlight. At 10th level, you can instead use scrying to observe any area touched by sunlight. At 15th level, you can use greater scrying instead. You must be at least 5th level to select this revelation. You can sungaze for 1 minute per day per oracle level; the duration need not be continuous, but it must be used in 1-minute increments.",
          "Torch Touch (Su)": "As a move action, you can alter the amount of light shed by any nonmagical light source within 60 feet so that its light radius is either halved or doubled. At 1st level, you can affect light sources up to the size of a torch. At 7th level, you can affect any Medium or smaller nonmagical light source (such as a campfire). At 14th level, you can affect Large or smaller nonmagical light sources (such as bonfires) and magical light sources up to the size of an everburning torch. If a creature is holding the light source you are trying to affect, the creature can attempt a Reflex save to avoid the effect."
          },
          "final revelation": ": At 20th level, yours becomes a journey without end. You cease aging, no longer suffer age-related penalties to ability scores, and cannot be magically aged. Any spells you cast of the conjuration (teleport) subschool or with the fire or light descriptor are automatically enlarged without affecting their spell level."
              },
              "Spellscar": {
                "source": "Inner Sea Magic pg. 30",
                "deities": ": Gozreh, Lamashtu, Nethys, Zyphus",
                "class skills": ": An oracle with the spellscar mystery adds Knowledge (arcana), Knowledge (nature), Survival, and Use Magic Device to her list of class skills.",
                "bonus spells": ": ray of enfeeblement (2nd), obscure object (4th), dispel magic (6th), lesser globe of invulnerability (8th), break enchantment (10th), antimagic field (12th), spell turning (14th), spellscar (16th), mage's disjunction (18th).",
          "revelations": {
          "Animate Primal Forces (Su)": "As a standard action, you can summon a single Small air, earth, fire, or water elemental to serve you. It remains for a number of rounds equal to your Charisma modifier. At 7th level, you can summon a Medium elemental. At 9th level, you can summon a Large elemental. You can use this ability once per day plus one additional time per day at 10th level. You must be at least 3rd level to select this revelation.",
          "Eldritch Bolt (Su)": "You can damage foes with a bolt of raw magical energy. Make a ranged touch attack against any foe within 30 feet. On a hit, you deal 1d8 points of force damage, +1 point of damage per two oracle levels. At 10th level, the bolt's range increases to 60 feet. You may use this revelation a number of times per day equal to 3 + your Charisma modifier.",
          "Eldritch Resistance (Su)": "You gain resistance 2 to acid, cold, electricity, fire, and sonic. This resistance increases to 5 at 5th level, 10 at 11th level, and 20 at 17th level.",
          "Eldritch Scar (Su)": "Once per day when you damage a creature with a spell you cast, you may, as a swift action, cause your magic to leave an eldritch scar upon that creature. An eldritch scar appears as a normal scar, save that it flickers with faint radiance of a color of your choice. The next time that creature casts a spell, uses a spell-like ability, or activates a magic item, it triggers a primal magic event (see page 13) of a CR equal to your caster level. This causes the eldritch scar to vanish. A creature can be marked by only one eldritch scar at a time (a more powerful one replaces a weaker one). An eldritch scar fades automatically after 24 hours. It can be removed before that point via any effect capable of removing a curse (the curse's level equals your caster level), but if an attempt to remove an eldritch scar fails, that attempt triggers a primal magic event—an event triggered this way does not cause the eldritch scar to fade. You must be at least 7th level to select this revelation.",
          "Magic Penetration (Ex)": "You gain a +2 bonus on any caster level check made to dispel or remove a magic effect (such as when using the dispel magic or remove curse spell). If you are 9th level or higher, the bonus increases to +4.",
          "Mystic Null (Ex)": "You gain a +2 insight bonus on saves against spells and spell-like abilities. At 7th level, this bonus also applies on saves against supernatural abilities. At 11th level, the bonus increases to +4.",
          "Primal Manipulation (Su)": "Whenever you cast a spell that deals acid, cold, electricity, or fire damage, you may change it to deal one of the other listed damage types. You may use this ability once per day, plus one additional time for every 5 levels. At 15th level, you can change a spell to deal sonic damage, though the damage is halved. At 20th level, you can change a spell to deal force damage, though the damage is halved. You must be at least 7th level to select this revelation.",
          "Primal Mastery (Su)": "Whenever a spell you cast triggers a primal magic event (see page 13), or whenever you use a rod of wonder , roll d% twice when generating the result. You may pick which of the two results actually occurs. You gain a +2 bonus on all saving throws made to resist primal magic events or magical effects caused by a rod of wonder.",
          "Trigger Primal Magic Event (Su)": "Once per day as an immediate action, you can cause a spellcaster (including yourself ) within 30 feet to trigger a primal magic event as the spell is being cast. At 13th level, you can cause any creature in the act of activating a magic item to trigger a primal magic event (see page 13). At 17th level, you can use this ability twice per day. A spellcaster can make a concentration check (DC = 15 + twice the spell's level) to focus the magic and avoid triggering a primal magic effect, but non-spellcasters activating magic items have no such option. You must be at least 9th level before selecting this revelation.",
          "Spell Resistance (Ex)": "You gain SR equal to your oracle level + 5. You must be at least 11th level before selecting this revelation."
          },
               "final revelation": ": At 20th level, you become a master of primal magic. Whenever you cast a spell, you can choose to trigger a primal magic event in addition to casting the spell itself—you can use this ability once per minute. If your spellcasting causes a primal magic event to occur, your spell effect is not replaced by the primal magic event—it takes place normally, along with the event itself."
              },
              "Stone": {
                "source": "Advanced Player's Guide pg. 51",
                "deities": ": Abadar, Gorum, Torag.",
                "class skills": ": An oracle with the stone mystery adds Appraise, Climb, Intimidate, and Survival to her list of class skills.",
                "bonus spells": ": magic stone (2nd), stone call (4th), meld into stone (6th), wall of stone (8th), stoneskin (10th), stone tell (12th), statue (14th), repel metal or stone (16th), clashing rocks (18th).",
          "revelations": {
            "Acid Skin (Ex)": "You gain resist acid 5. This resistance increases to 10 at 5th level and 20 at 11th level. At 17th level, you gain immunity to acid.",
            "Clobbering Strike (Ex)": "Whenever you score a critical hit against an opponent with a spell that requires an attack roll, you may immediately attempt to trip your opponent as a swift action. You do not provoke an attack of opportunity as normal for this trip attempt. You cannot be tripped in return when using this ability.",
            "Crystal Sight (Ex)": "You can see through stone, earth, or sand as easily as if it were transparent crystal. Your gaze can penetrate a number of feet equal to your oracle level, or 1/12th this thickness of metal. You can use this ability a number of rounds per day equal to your oracle level, but these rounds do not need to be consecutive.",
            "Earth Glide (Su)": "You can pass through stone, dirt, or almost any other sort of earth except worked stone and metal as easily as a fish swims through water. If protected against fire damage, you can even glide through lava. You glide at your base land speed. While gliding, you breathe stone as if it were air (you do not need to hold your breath). Your burrowing leaves behind no tunnel or hole, nor does it create any ripple or sign of your presence. A move earth spell cast on an area where you are flings you back 30 feet, stunning you for 1 round unless you succeed on a DC 15 Fortitude save. Activating this ability is a free action. You can glide for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 7th level to select this revelation. You can bring other creatures with you when you glide, but each passenger costs an additional minute per minute of travel.",
            "Mighty Pebble (Su)": "As a standard action, you can charge and throw a pebble (or other stone of similar size) that detonates when it strikes a target as a ranged attack. The pebble has a range increment of 20 feet and has a +1 enhancement bonus to attack and damage for every four oracle levels you possess. Any creature struck by the pebble takes 1d6 points of bludgeoning damage per two oracle levels you possess (minimum 1d6). Creatures in squares adjacent to the target take half damage, or no damage if they make a Reflex saving throw. If the attack roll misses, treat the pebble as a thrown splash weapon to determine where it lands. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter.",
            "Rock Throwing (Ex)": "You are an accomplished rock thrower and have a +1 racial bonus on attack rolls with thrown rocks. You can hurl rocks up to two categories smaller than your own size. The range increment for a rock is 20 feet, and you can hurl it up to 5 range increments. Damage for a hurled rock is 2d4 for a Medium creature or 2d3 for a Small creature, plus 1-1/2 your Strength bonus.",
            "Shard Explosion (Su)": "As a swift action, you can cause jagged pieces of stone to explode outward from your body. These shards deal 1d6 points of piercing damage per two oracle levels (minimum 1d6) to all creatures within a 10-foot burst. A Reflex save halves this damage. In addition, the broken shards make the area difficult terrain until your next turn. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter.",
            "Steelbreaker Skin (Su)": "As a standard action, you can harden your flesh so that weapons that strike you are damaged or destroyed. Anytime a melee or ranged weapon strikes you, the weapon takes an amount of damage equal to your oracle level. This ability does not prevent the weapon from harming you unless the damage destroys the weapon attacking you. You can use this ability once per day, but the duration is 1 minute/level. You must be at least 7th level to select this revelation. At 15th level, the damage from this ability ignores up to 10 points of hardness.",
            "Stone Stability (Ex)": "You receive a +4 bonus to your Combat Maneuver Defense when resisting a bull rush or trip attempt while standing on the ground. At 5th level, you gain Improved Trip as a bonus feat. At 10th level, you gain Greater Trip as a bonus feat. You do not need to meet the prerequisites to gain these feats.",
            "Touch of Acid (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of acid damage +1 point for every two oracle levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, any weapon that you wield deals +1d6 points of acid damage, similar to how a flaming weapon operates."
          },     "final revelation": ": Upon reaching 20th level, you become a master of acid and earth. You can apply any one of the following feats to any acid or earth spell without increasing the level or casting time: Enlarge Spell, Extend Spell, Silent Spell, or Still Spell."
              },
              "Streets": {
                "source": "Heroes of the Streets pg. 20",
                "deities": ": Cayden Cailean, Milani, Norgorber.",
                "class skills": ": An oracle with the streets mystery adds Bluff, Knowledge (local), Perception, and Stealth to her list of class skills.",
                "bonus spells": ": disguise self (2nd), detect thoughts (4th), glyph of warding (6th), illusory wall (8th), false vision (10th), getaway (12th), screen (14th), mage's magnificent mansion (16th), clone (18th).",
          "revelations": {
          "The City Provides (Ex)": "Once per day as a full-round action when in an urban environment, you can scrounge up any nonmagical item of your choosing with a value of up to 10 gp per oracle level. You cannot obtain coins or trade goods, and the item is too tattered to resell (though fully functional). If you scrounge a new item, any item previously obtained in this way becomes useless.",
          "Eyes of the Streets (Su)": "Once per day as a full-round action, you can summon a spirit rat, pigeon, or similar tiny creature to serve as your eyes on, above, and beneath the streets—this spirit serves as an arcane eye . At 10th level, you can summon multiple such spirits; this ability functions as prying eyes .",
          "At 15th level, this ability functions as greater prying eyes Face in the Crowd (Ex)": "You gain a +4 bonus on Stealth checks, and can attempt a Stealth check in a crowd even while being observed.",
          "Keep to the Corners (Su)": "Once per day when you fail a Reflex saving throw, you can reroll the saving throw with a +4 insight bonus. You must take the second result, even if it is worse. At 7th level and 15th level, you can use this ability one additional time per day.",
          "Knife in the Dark (Ex)": "As a standard action, you can make a sneak attack as if you were a rogue of your oracle level. You can use this ability once per day, plus one additional time per day at 5th level and for every 5 levels thereafter.",
          "Nooks and Crannies (Ex)": "You can move through any sort of obstacle or difficult terrain in an urban environment (including crowds) at your normal speed and without taking damage or suffering any other impairment. Areas that are enchanted or magically manipulated to impede motion still affect you.",
          "Secrets of City (Su)": "Once per day when you cast a divination spell affecting creatures or areas in urban environments, you can double the spell's range. At 7th level and 15th level, you can use this ability one additional time per day.",
          "Shroud of the City (Sp)": "You can melt into the streets and alleys. You can cast veil once per day, but can affect only yourself and one willing ally per oracle level within 30 feet. You can make the targets appear only as typical members of a settlement with which you are familiar, and can't match the appearance of specific creatures. At 7th level and 15th level, you can use this ability one additional time per day.",
          "The Streets Are Your Friend (Ex)": "As long as you are in an urban environment, you can call upon the city to help an ally within 30 feet succeed at a task. The ally gets a +2 competence bonus on skill checks with a particular skill as long as you concentrate. This bonus increases to +3 at 9th level, and to +4 at 15th level."
          }
          ,"final revelation": ": Upon reaching 20th level, you become an avatar of the city. When you speak the name of a creature and a city out loud, you know whether that creature is in that city. You can also learn about any settlement you are in at will; this functions as commune with nature , operating only in towns and settlements rather than natural terrain."
              },
              "Succor": {
                "source": "Healer's Handbook pg. 20",
                "deities": ": Milani, Pharasma, Qi Zhong, Sarenrae",
                "class skills": ": An oracle with the succor mystery adds Handle Animal, Knowledge (nature), and Survival to her list of class skills.",
                "bonus spells": ": ray of enfeeblement (2nd), shield of fortification ACG (4th), coordinated effort APG (6th), greater shield of fortification ACG (8th), stoneskin (10th), greater heroism (12th), expend APG (14th), greater spellcrash ACG (16th), wall of suppression APG (18th).",
          "revelations": {
          "Combat Healer (Su)": "As per the battle mystery revelation of the same name ( Pathfinder RPG Advanced Player's Guide 45 ).",
          "Curse of Dampening (Su)": "You diminish one target within 30 feet as a standard action, making its attacks weaker. Whenever the target would roll to deal damage with an attack or spell, it deals the minimum amount of damage. This curse lasts for 1 round per 2 oracle levels you have (minimum 1). A successful Will saving throw negates this effect. This is a mind-affecting curse effect. You can use this revelation once per day, plus one additional time at 11th level and 15th level. You must be at least 7th level before selecting this revelation.",
          "Enhanced Cures (Su)": "As per the life oracle mystery revelation of the same name ( Advanced Player's Guide 49 ).",
          "Enhanced Inflictions (Su)": "You recognize that harming your enemies is sometimes the only way to help your allies, and so your wrath is particularly fierce. Whenever you cast an inflict spell (a spell with the word “inflict” in the name), the maximum amount of damage dealt by the spell is based on your oracle level, not the limit based on the spell. For example, an 11th-level oracle of succor with this revelation can cast inflict light wounds to deal 1d8+11 points of damage instead of the normal 1d8+5 maximum.",
          "Perfect Aid (Ex)": "You can effortlessly give aid to your allies, whether that means providing them with help attacking or defending them in the heat of combat. You gain Bodyguard APG as a bonus feat, and whenever you use the aid another action to provide a bonus on attack rolls or to AC to one of your allies, the bonus you provide increases by 1. This bonus increases by 1 at 4th level and every 5 oracle levels thereafter (to a maximum of +5 at 19th level). It doesn't stack with other feats or class features that improve the bonus you provide when using the aid another action. This revelation also counts as the Combat Expertise feat, but only for the purpose of meeting the prerequisites of the Swift Aid APG feat and any feat that lists Swift Aid as a prerequisite.",
          "Pitiful Foe (Su)": "You can temporarily curse one target within 30 feet as a standard action, making it pitiful and ineffective in battle. While this ability is in effect, the target is never considered to be threatening you or your allies, even if it is armed and you or your allies are standing in a square into which it can make a melee attack. If the target rolls a natural 20 on an attack roll or saving throw, the attack or saving throw is not an automatic success (as would be normal) and whether it is successful is instead determined normally. Additionally, the target automatically fails all rolls to confirm critical hits. This curse lasts for 1 round per 2 oracle levels you have (minimum 1). A successful Will saving throw negates this effect. This is a mind-affecting curse effect. You can use this revelation once per day, plus one additional time at 7th and 15th levels.",
          "Shell of Succor (Su)": "You can surround an ally with bolstering energies that supplement its health and grant it extra vigor. With a touch from you (a standard action), one creature gains a ward of restorative energy, granting it a number of temporary hit points equal to your Charisma bonus + 1d6 per 2 oracle levels you have (maximum 10d6). These temporary hit points last 1 minute per oracle level you have. The target always loses these temporary hit points first, even before other temporary hit points (including those from, for example, the purify body spell on page 9 or a kineticist's force ward defense wild talent). If an attack deals fewer points of damage than the target has as temporary hit points from shell of succor, it still reduces those temporary hit points but otherwise counts as a miss for the purpose of abilities that trigger on a hit or a miss. You can use this revelation once per day, plus one additional time at 11th and 19th levels. You must be at least 3rd level before selecting this revelation.",
          "Soul Siphon (Su)": "As per the bones oracle mystery revelation of the same name ( Advanced Player's Guide 46 ).",
          "Spirit Boost (Su)": "As per the life oracle mystery revelation of the same name ( Advanced Player's Guide 49 ). Teamwork Mastery (Ex, Sp) : You are an immaculate team player and can distribute your team-based insights to your allies with a touch. This revelation grants you a bonus teamwork feat. You must meet the teamwork feat's prerequisites, if any. Additionally, you can touch an ally as a standard action to confer upon it the benefits of any one teamwork feat that you have. This effect persists for a number of rounds equal to 1/2 your oracle level (minimum 1). You can confer the benefits of a teamwork feat you have a number of times per day equal to 3 + your Charisma modifier."
          }
          ,"final revelation": ": You become a beacon of aid and assistance to your allies and those you deem worthy of receiving your succoring magical benefits. You can apply any one of the following metamagic feats to any spell you cast that targets one or more of your allies without increasing the level or casting time: Enlarge Spell, Extend Spell, Silent Spell, or Still Spell. You do not need to have these feats to use this ability, and you can use this ability any number of times per day on any spell that can be affected by the listed metamagic feats."
              },
              "Time": {
                "source": "Ultimate Magic pg. 56",
                "deities": ": Gozreh, Nethys, Pharasma.",
                "class skills": ": An oracle with the time mystery adds Fly, Knowledge (arcana), Perception, and Use Magic Device to her list of class skills.",
                "bonus spells": ": memory lapse (2nd), gentle repose (4th), sands of time (6th), threefold aspect (8th), permanency (10th), contingency (12th), disintegrate (14th), temporal stasis (16th), time stop (18th).",
          "revelations": {
          "Aging Touch (Su)": "Your touch ages living creatures and objects. As a melee touch attack, you can deal 1 point of Strength damage for every two oracle levels you possess to living creatures. Against objects or constructs, you can deal 1d6 points of damage per oracle level. If used against an object in another creature's possession, treat this attack as a sunder combat maneuver. You can use this ability once per day, plus one additional time per day for every five oracle levels you possess.",
          "Erase from Time (Su)": "As a melee touch attack, you can temporarily remove a creature from time altogether. The target creature must make a Fortitude save or vanish completely for a number of rounds equal to 1/2 your oracle level (minimum 1 round). No magic or divinations can detect the creature during this time, as it exists outside of time and space—in effect, the creature ceases to exist for the duration of this ability. At the end of the duration, the creature reappears unharmed in the space it last occupied (or the nearest possible space, if the original space is now occupied). You can use this ability once per day, plus one additional time per day at 11th level.",
          "Knowledge of the Ages (Su)": "You can search through time to recall some bit of forgotten lore or information. You can retry any Knowledge skill check you have made within the past minute, gaining an insight bonus on the check equal to your Charisma modifier. You can use this ability a number times per day equal to your Charisma modifier.",
          "Momentary Glimpse (Su)": "Once per day, you can gain a glimpse into your immediate future. On the round after you use this ability, you gain a +2 insight bonus on a single attack roll, saving throw, or skill check or to your Armor Class until the start of your next turn. At 5th level, and every four levels thereafter, you can use this ability one additional time per day.",
          "Rewind Time (Su)": "Once per day as an immediate action, you can reroll any one d20 roll that you have just made before the results of the roll are revealed. You must take the result of the reroll, even if it's worse than the original roll. At 11th level, and every four levels thereafter, you can use this ability an additional time per day. You must be at least 7th level to select this revelation.",
          "Speed or Slow Time (Sp)": "As a standard action, you can speed up or slow down time, as either the haste or slow spell. You can use this ability once per day, plus one additional time per day at 12th level and 17th level. You must be at least 7th level before selecting this revelation.",
          "Temporal Celerity (Su)": "Whenever you roll for initiative, you can roll twice and take either result. At 7th level, you can always act in the surprise round, but if you fail to notice the ambush, you act last, regardless of your initiative result (you act in the normal order in following rounds). At 11th level, you can roll for initiative three times and take any one of the results.",
          "Time Flicker (Su)": "As a standard action, you can flicker in and out of time, gaining concealment (as the blur spell). You can use this ability for 1 minute per oracle level that you possess per day. This duration does not need to be consecutive, but it must be spent in 1-minute increments. At 7th level, each time you activate this ability, you can treat it as the blink spell, though each round spent this way counts as 1 minute of your normal time flicker duration. You must be at least 3rd level to select this revelation.",
          "Time Hop (Su)": "As a move action, you can teleport up to 10 feet per oracle level that you possess per day. This teleportation must be used in 5-foot increments. This movement does not provoke attacks of opportunity. You must have line of sight to your destination to use this ability. You can bring other willing creatures with you, but you must expend an equal amount of distance for each creature brought. You must be at least 7th level to select this revelation.",
          "Time Sight (Su)": "You can peer through the mists of time to see things as they truly are, as if using the true seeing spell. At 15th level, this functions like moment of prescience . At 18th level, this functions like foresight . You can use this ability for a number of minutes per day equal to your oracle level, but these minutes do not need to be consecutive. You must be at least 11th level to select this revelation."
          }
          ,"final revelation": ": Upon reaching 20th level, you become a true master of time and stop aging. You cannot be magically aged and no longer take penalties to your ability scores for aging. Age bonuses still accrue, and any aging penalties that you have already accrued remain in place. You cannot die of old age, but you can be killed or die through accident, disease, poison, or other external effects. In addition, you can cast time stop once per day as a spell-like ability."
              },
              "Volcano": {
                "source": "Pathfinder #95: Anvil of Fire pg. 72",
                "deities": ": Flauros, Mhar, Rovagug, Valani, Yamatsumi, Ymeri.",
                "class skills": ": An oracle with the volcano mystery adds Climb, Intimidate, Knowledge (geography), and Survival to her list of class skills.",
                "bonus spells": ": burning hands (2nd), heat metal (4th), protection from energy (6th), volcanic storm (8th), geyser (10th), contagious flame (12th), fire storm (14th), wall of lava (16th), meteor swarm (18th).",
          "revelations": {
          "Ash Cloud (Su)": "As a standard action, you can surround yourself with a 10-foot-radius cloud of ash, which functions as an obscuring mist spell, except you can see through it clearly. The cloud is stationary, and remains for 1 round per oracle level. Using this ability again causes your previous cloud to fall to the ground. At 7th level, your ash cloud fills with embers. All creatures in the cloud except you take 1d6 points of fire damage per round and must succeed at Fortitude saves to avoid choking, as though they were breathing in heavy smoke ( Core Rulebook 444).",
          "Breath of Creation (Ex)": "Volcanic vapors elevate your mind even as they ravage your body. When you take Constitution damage from volcanic gases, you gain a bonus to your Charisma equal to the damage taken. This bonus lasts for 1 hour or until the ability damage is healed. The maximum bonus to your Charisma is +2, increasing to +4 at 10th level, and to +6 at 15th level.",
          "Burning Magic (Su)": "Whenever a creature fails a saving throw against one of your spells that deals fire damage, that creature catches on fire, taking 1 point of fire damage per spell level at the beginning of its turn. The fire lasts for 1d4 rounds, but it can be extinguished as a move action if the creature succeeds at a Reflex save (using the original spell's DC). Dousing the creature with water as a standard action grants a +2 bonus on this save, while immersing the creature in water extinguishes the fire. Spells that don't grant a saving throw don't cause a creature to catch on fire.",
          "Cleansing Flames (Su)": "As a swift action, you can take 1d4 points of damage per oracle level to gain a new saving throw against a single ongoing effect. The effect must be one for which you already failed a saving throw. If you succeed, the effect is removed. At 7th and 15th levels, you can use this ability one additional time per day.",
          "Erupt (Su)": "As a swift action, you cause flaming shards of rock to erupt from your body. These shards deal 1d6 points of damage per 2 oracle levels (minimum 1d6) to all creatures in a 10-foot-radius burst (Reflex half ). Half of this damage is fire damage and the other half is piercing damage. The shards create difficult terrain for 1 round. You can use this ability once per day, plus one additional time per day at 5th level and every 5 levels thereafter.",
          "Fiery Conduit (Su)": "You can deliver touch spells to burning creatures within 30 feet without actually touching them. For the purposes of this ability, burning creatures include creatures that have caught on fire, creatures taking ongoing fire damage, and creatures with the fire subtype or that are polymorphed into such creatures. You must succeed at a ranged touch attack to affect an unwilling target.",
          "Lava Walk (Su)": "You can walk across lava, magma, and similarly heated stone at your normal movement speed. You are immune to any fire damage caused by the surface while you walk above it, even if it radiates damage at a distance. While using lava walk, you never slip or fall from poor or slippery footing. You can use lava walk for 1 minute per day per oracle level. This duration doesn't need to be consecutive, but it must be spent in 1-minute increments. You must be at least 3rd level to select this revelation.",
          "Magma Form (Su)": "As a standard action, you can assume the form of a Small magma elemental, as elemental body I . You gain the same abilities as if you had chosen an earth elemental's form, except your earth glide functions as the earth glide ability of a magma elemental. At 9th level, you can assume the form of a Medium magma elemental, as elemental body II . At 11th level, you can assume the form a Large magma elemental, as elemental body III . At 13th level, you can assume the form of a Huge magma elemental, as elemental body IV . You can use this ability once per day, but the duration is 1 hour per oracle level. You must be at least 7th level to choose this revelation.",
          "Pyroclastic Shove (Su)": "As a standard action, you conjure a cascade of volcanic ash to bull rush a creature within 30 feet of you. The CMB of this cascade is equal to your base attack bonus + your Charisma modifier + 4 from the cascade's Gargantuan size. If the bull rush succeeds, the creature takes 1d6 points of fire damage per oracle level. At 12th and at 17th level, you can use this ability one additional time per day. You must be 7th level to select this revelation.",
          "Touch of Flame (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of fire damage + 1 point for every 2 oracle levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, when you wield a weapon, it is treated as a flaming weapon."
          }
          ,"final revelation": ": At 20th level, the oracle's body takes on the consistency of rock, and her touch carries the heat of a volcano. She gains the fire and earth subtypes and becomes vulnerable to cold. Any fire damage she deals ignores the first 10 points of fire resistance, but not fire immunity. The oracle gains a +4 bonus to natural armor. Her attacks with natural weapons, unarmed strikes, and metal-hafted weapons deal an additional 1d6 points of fire damage. Any creature that strikes the oracle with a natural weapon or unarmed strike, or that succeeds at a grapple combat maneuver check against her, takes 1d6 points of fire damage. This damage stacks with other sources of fire damage. You can suppress or reestablish this heat as a standard action."
              },
              "Waves": {
                "source": "Advanced Player's Guide pg. 52",
                "deities": ": Gozreh, Pharasma.",
                "class skills": ": An oracle with the waves mystery adds Acrobatics, Escape Artist, Knowledge (nature), and Swim to her list of class skills.",
                "bonus spells": ": touch of the sea (2nd), slipstream (4th), water breathing (6th), wall of ice (8th), geyser (10th), fluid form (12th), vortex (14th), seamantle (16th), tsunami (18th).",
          "revelations": {
          "Blizzard (Su)": "As a standard action, you can create a blizzard of snow and ice. You can create one 10-foot-cube of storm per oracle level. These cubes can be arranged in any pattern you desire, but each cube must be adjacent to another and one must be adjacent to you. Any creature caught in the blizzard takes 1d4 points of cold damage per oracle level, with a Reflex save resulting in half damage. The storm lasts for a number of rounds equal to your Charisma modifier; the ground remains icy (+5 to Acrobatics DCs) as long as local conditions permit. The blizzard obscures sight beyond 5 feet, providing total concealment. A creature within 5 feet has concealment. You can use this ability once per day. You must be 11th level to select this revelation.",
          "Fluid Nature (Ex)": "You receive a +4 bonus to your Combat Maneuver Defense against bull rush, drag, grapple, reposition, and trip attempts. A creature trying to confirm a critical hit against you has a –4 penalty on its confirmation roll. At 5th level, you gain Dodge as a bonus feat. You do not need to meet the prerequisite to gain this feat.",
          "Fluid Travel (Su)": "You can walk on liquid as if it were a solid surface. Walking on the liquid does not harm you; you can walk on acid or even lava (as if walking on a solid temporary crust), though you would still take fire damage from being near the lava. You can move across this surface at your normal land speed. At 7th level, while this ability is in effect, you can instead go underwater, gaining a swim speed of 60 feet and the ability to breathe water. You can use this ability for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Freezing Spells (Su)": "Whenever a creature fails a saving throw and takes cold damage from one of your spells, it is slowed (as the slow spell) for 1 round. Spells that do not allow a save do not slow creatures. At 11th level, the duration increases to 1d4 rounds.",
          "Ice Armor (Su)": "You can conjure armor of ice that grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this armor grants you DR 5/piercing. In cold conditions, the armor bonus (and DR bonus) increases by 2; in very hot conditions it decreases by 2. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Icy Skin (Ex)": "You gain resist cold 5. This resistance increases to 10 at 5th level and 20 at 11th level. At 17th level, you gain immunity to cold.",
          "Punitive Transformation (Su)": "You can transform an opponent into a harmless animal as if using baleful polymorph . This transformation lasts 1 round per oracle level. Transforming another creature causes the first to immediately revert to normal. You may use this ability a number of times per day equal to your Charisma modifier. You must be at least 7th level before selecting this revelation.",
          "Water Form (Su)": "As a standard action, you can assume the form of a Small water elemental, as elemental body I . At 9th level, you can assume the form of a Medium water elemental, as elemental body II . At 11th level, you can assume the form of a Large water elemental, as elemental body III . At 13th level, you can assume the form of a Huge water elemental, as elemental body IV . You can use this ability once per day, but the duration is 1 hour/level. You must be at least 7th level to select this revelation.",
          "Water Sight (Su)": "You can see through fog and mist without penalty as long as there is enough light to allow you to see normal. At 7th level, you can use any calm pool of water at least 1 foot in diameter as a scrying device, as if using the scry spell. At 15th level, this functions like greater scrying .You can use the scrying abilities for a number of rounds per day equal to your oracle level, but these rounds do not need to be consecutive.",
          "Wintry Touch (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of cold damage + 1 point for every two oracle levels you possess. You can use the wintry touch ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, any weapon that you wield is treated as a frost weapon."
          }
          ,"final revelation": ": Upon reaching 20th level, you become a master of cold and water. You can apply any one of the following feats to any cold or water spell without increasing the level or casting time: Enlarge Spell, Extend Spell, Silent Spell, or Still Spell."
              },
              "Whimsy": {
                "source": "Legacy of the First World pg. 10 Whimsy oracles gain powers from capricious fey tricksters.",
                "deities": ": Green Mother, Lantern King, Ng, Shyka.",
                "class skills": ": An oracle with the whimsy mystery adds Bluff, Disguise, Perform, Sleight of Hand, and Stealth to her list of class skills.",
                "bonus spells": ": faerie fire (2nd), hideous laughter (4th), shamefully overdressed UI (6th), major image (8th), lesser entice fey UI (10th), mislead (12th), entice fey UI (14th), irresistible dance (16th), greater entice fey UI (18th).",
          "revelations": {
                "Assumed Form (Sp)": "You can change your appearance at will, as disguise self with a caster level equal to your oracle level. At 7th level, you can instead physically transform, as alter self . At 11th level, this ability lasts until you dismiss it or use it again, allowing you to keep it active while you sleep.",
          "Capricious Misdirection (Sp)": "Your ever-changing nature allows you to misdirect aura-reading divinations with ease. You are constantly under the effects of a misdirection spell, except that you can take a standard action to select a creature or object within 60 feet to serve as the target of detection spells used against you until you select a different creature or object. You must be at least 7th level to select this revelation.",
          "Feywise (Ex)": "Your whimsy grants you protection from fey mischief. You gain the resist nature's lure druid class feature. In addition, you gain a +2 bonus on Perception, Sense Motive, and Survival checks against fey. You must be at least 3rd level to select this revelation.",
          "Flicker (Sp)": "You can flicker from sight for a short time, allowing you to escape or set up a prank. As a swift action, you can disappear for 1 round per oracle level. This ability functions as invisibility . You can use this revelation a number of times per day equal to half your oracle level (minimum 1).",
          "Misdirection Mastery (Su)": "You gleefully evade attacks and confound foes with your capricious misdirection. You receive Misdirection Tactics UI as a bonus feat. At 10th level, you receive Misdirection Redirection UI as a bonus feat, and at 15th level you receive Misdirection Attack UI as a bonus feat. You do not need to meet the prerequisites to receive these feats. You must be at least 3rd level to select this revelation.",
          "Pure Whimsy (Su)": "Once per day, you can release a stream of errant chaos from the First World as a standard action. When you do so, identify a target within 90 feet and generate a random effect as from a rod of wonder (or, at the GM's discretion, another random or unusual effect of similar power). The DC of any required saving throw is 10 + half your oracle level + your Charisma modifier, and no effect from this ability persists for more than 1 day. You can use this ability once per day at 7th level and one additional time per day for every 4 levels beyond 7th. You must be at least 7th level to select this revelation.",
          "Versatile Comedy (Ex)": "The powers of whimsy infuse your comedy with the ability to awe and befuddle. You can use your total Perform (comedy) bonus in place of your Bluff and Intimidate bonuses.",
          "Whimsical Prank (Su)": "As a standard action, you can call upon fey to play a prank on a creature within 30 feet as a dirty trick APG combat maneuver. Resolve this attempt as normal, except that it doesn't provoke attacks of opportunity, you use your oracle level in place of your Combat Maneuver Bonus, and you add your Charisma modifier in place of your Strength or Dexterity modifier. No save is allowed against this attempt, but a creature affected by this revelation cannot be the target of this revelation again for 1 day.",
          "Whimsical Step (Su)": "Once per day as a move action, you can teleport up to 10 feet per oracle level. You can use this ability once per day at 7th level and one additional time per day for every 4 levels beyond 7th. You must be at least 7th level to select this revelation.",
          "Woodland Caprice (Su)": "Your fey powers allow you to move easily through woodland environments. You gain woodland stride, as per the druid ability. At 7th level, you also gain the trackless step druid class feature and can similarly conceal the tracks of any allies within 30 feet that you choose."
          }
          ,"final revelation": ": Upon reaching 20th level, you become a fey trickster in the flesh. Your type changes to fey and you gain low-light vision, immunity to poison, and DR 10/ cold iron."
              },
              "Wind": {
                "source": "Advanced Player's Guide pg. 53",
                "deities": ": Gozreh, Shelyn.",
                "class skills": ": An oracle with the wind mystery adds Acrobatics, Escape Artist, Fly, and Stealth to her list of class skills.",
                "bonus spells": ": alter winds (2nd), gust of wind (4th), cloak of winds (6th), river of wind (8th), control winds (10th), sirocco (12th), control weather (14th), whirlwind (16th), winds of vengeance (18th).",
          "revelations": {
          "Air Barrier (Ex)": "You can create an invisible shell of air that grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this barrier causes incoming arrows, rays, and other ranged attacks requiring an attack roll against you to have a 50% miss chance. You can use this barrier for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments.",
          "Gaseous Form (Su)": "As a standard action, you can assume gaseous form (as the spell). You can remain gaseous for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 7th level to select this revelation. You can bring other creatures with you in gaseous form, but each passenger costs an additional minute per minute of travel.",
          "Invisibility (Su)": "As a standard action, you can become invisible (as per the invisibility spell). You can remain invisible for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. Starting at 9th level, each time you activate this ability you can treat it as greater invisibility , though each round spent this way counts as 1 minute of your normal invisibility duration. You must be at least 3rd level to select this revelation.",
          "Lightning Breath (Su)": "As a standard action, you can breathe a 30-foot line of electricity. This line deals 1d4 points of electricity damage per oracle level. A Reflex save halves this damage. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter.",
          "Spark Skin (Ex)": "You gain resist electricity 5. This resistance increases to 10 at 5th level and 20 at 11th level. At 17th level, you gain immunity to electricity.",
          "Thunderburst (Ex)": "As a standard action, you can create a blast of air accompanied by a loud peal of thunder. The blast has a range of 100 feet and has a 20-foot radius, increasing by 5 feet for every 4 oracle levels after 7th. Creatures in the area take 1d6 points of bludgeoning damage per oracle level and are deafened for 1 hour, with a Fortitude save resulting in half damage and no deafness. You must be at least 7th level to select this revelation. You can use this ability once per day, plus one additional time per day at 11th level and every four levels thereafter.",
          "Touch of Electricity (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of electricity damage +1 point for every two oracle levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, any weapon that you wield is treated as a shock weapon.",
          "Vortex Spells (Ex)": "Whenever you score a critical hit against an opponent with an attack spell, the target is staggered for 1 round. At 11th level, the duration increases to 1d4 rounds.",
          "Wind Sight (Ex)": "You ignore penalties on Perception checks based on wind and the first 100 feet of distance. At 7th level, as a standard action, you can see and hear into any area (as if using clairaudience and clairvoyance ) within range as long as there is an unobstructed path for air to travel between you and the target area (this does not require line of effect, meaning the path can turn corners and go through spaces no smaller than 1 inch in diameter). You can use this ability a number of rounds per day equal to your oracle level, but these rounds do not need to be consecutive.",
          "Wings of Air (Su)": "As a swift action, you can manifest a pair of translucent, cloud-like wings that grant you a fly speed of 60 feet with good maneuverability. At 10th level, your speed increases to 90 feet and your maneuverability increases to perfect. You can use these wings for 1 minute per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-minute increments. You must be at least 7th level to select this revelation."
          }
          ,"final revelation": ": Upon reaching 20th level, you become a master of air and electricity. You can apply any one of the following feats to any air or electricity spell without increasing the level or casting time: Enlarge Spell, Extend Spell, Silent Spell, or Still Spell."
              },
              "Winter": {
                "source": "People of the North pg. 26",
                "deities": ": Gorum, Gozreh, Kostchtchie, Ng, Rovagug.",
                "class skills": ": An oracle with the winter mystery adds Intimidate, Knowledge (nature), Stealth, and Survival to her list of class skills.",
                "bonus spells": ": endure elements (2nd), frost fall UC (4th), sleet storm (6th), ice storm (8th), icy prison UM (10th), cone of cold (12th), ice body UM (14th), polar ray (16th), mass icy prison UM (18th).",
          "revelations": {
          "Blizzard (Su)": "As a standard action, you can create a blizzard of snow and ice. You can create one 10-foot cube of this storm per oracle level. These cubes can be arranged in any pattern you desire, but each cube must be adjacent to another, and at least one must be adjacent to you. Any creature caught in the blizzard takes 1d4 points of cold damage per oracle level, with a successful Reflex save resulting in half damage. The storm lasts for a number of rounds equal to your Charisma modifier; the ground remains icy (+5 to Acrobatics DCs) as long as local conditions permit. The blizzard obscures sight beyond 5 feet, providing total concealment. A creature within 5 feet has concealment. You can use this ability once per day. You must be 11th level to select this revelation.",
          "Child of Winter (Ex)": "You gain the constant benefit of endure elements , but only against cold temperatures. You can move across regular snow without penalty, and heavy snow costs you only 2 squares of movement instead of 4. You can move across icy surfaces without penalty, and never need to make Acrobatics checks to run or charge on ice. You leave no trail in ice or snow, and cannot be tracked (you may choose to leave a trail if you so desire). During winter months, you gain a +2 insight bonus on Initiative checks and Reflex saving throws.",
          "Cold Aura (Su)": "As a swift action, you can cause waves of cold to radiate from your body. This cold deals 1d6 points of cold damage per 2 oracle levels to all creatures within 10 feet. A successful Fortitude save halves the damage. In addition, a flurry of snow momentarily surrounds you, granting you concealment until your next turn. You can use this ability once per day, plus one additional time per day at 5th level and every 5 levels thereafter.",
          "Freezing Spells (Su)": "Whenever a creature fails a saving throw and takes cold damage from one of your spells, it is slowed (as the slow spell) for 1 round. Spells that do not allow saves do not slow creatures. At 11th level, the slow duration increases to 1d4 rounds.",
          "Ice Armor (Su)": "You can conjure armor of ice that grants you a +4 armor bonus to AC. At 7th level and every 4 levels thereafter, this bonus increases by 2. At 13th level, this icy armor grants you DR 5/piercing. In cold conditions, the armor bonus and DR bonus increase by 2; in very hot conditions, however, they decrease by 2. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but must be spent in 1-hour increments.",
          "Ice Shape (Su)": "You are able to sculpt ice and snow into almost any shape. This ability functions like stone shape, but targeting only ice and snow, not stone. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Icy Skin (Ex)": "You gain resist cold 5. This resistance increases to 10 at 5th level and 20 at 11th level. At 17th level, you gain immunity to cold.",
          "Servant of Winter (Sp)": "As a full-round action, you can summon a single ice elemental (Pathfinder RPG Bestiary 2 114) to serve you. At 7th level, you can summon a Medium ice elemental, as summon monster IV . At 11th level, you can summon a Huge ice elemental, as summon monster VI . At 15th level, you can summon an elder ice elemental, as summon monster VIII . You can use this ability once per day, plus one additional time per day at 15th level. You must be at least 7th level before selecting this revelation.",
          "Snow Sight (Su)": "You can see through falling snow and sleet without taking any penalties on Perception checks as long as there is enough light to allow you to see normally. At 11th level, in cold conditions or in icy or snowy terrain, you can learn about your surroundings as if using the commune with nature spell. You can use the commune with nature ability once per day at 11th level, and twice per day at 15th level.",
          "Wintry Touch (Su)": "As a standard action, you can perform a melee touch attack that deals 1d6 points of cold damage + 1 point for every 2 oracle levels you possess. You can use the wintry touch ability a number of times per day equal to 3 + your Charisma modifier. At 11th level, any weapon that you wield is treated as a frost weapon."
          }
          ,"final revelation": ": Upon reaching 20th level, you become an avatar of winter and the North. Your body permanently transforms into living ice, as the ice body UM spell. In addition, your mastery of winter magic is such that any of your attacks that deal cold damage bypass cold immunity or cold resistance."
              },
              "Wood": {
                "source": "Ultimate Magic pg. 57",
                "deities": ": Erastil, Gozreh.",
                "class skills": ": An oracle with the wood mystery adds Climb, Knowledge (nature), Stealth, and Survival to her list of class skills.",
                "bonus spells": ": shillelagh (2nd), barkskin (4th), minor creation (wood items only) (6th), thorn body (8th), tree stride (10th), ironwood (12th), transmute metal to wood (14th), changestaff (16th), wooden phalanx (18th).",
          "revelations": {
          "Bend the Grain (Sp)": "Once per day as a standard action, you can shape or warp wooden objects. This functions as either wood shape or warp wood . At 11th level, you can use this ability to push wood away from you, as repel wood . At 7th level, and again at 14th level, you can use this ability an additional time per day.",
          "Lignification (Su)": "Once per day, you can turn a creature into wood. As a standard action, you may direct your gaze against a single creature within 30 feet. The targeted creature (along with all its carried gear) must make a Fortitude save or turn into a mindless, inert statue made out of wood for a number of rounds equal to 1/2 your oracle level. This ability otherwise functions as a flesh to stone spell, except the target turns to wood instead of stone. This can be reverse by any effect that can reverse flesh to stone . At 15th level, you can use this ability twice per day. You must be at least 11th level to select this revelation.",
          "Speak with Wood (Sp)": "You can talk to wood and learn what it knows. You must spend 1 minute meditating on and communing with the wood. At the end of this time, you can speak with the wood. This functions as the stone tell spell, except with wood instead of stones. You can use this ability for 1 minute per oracle level. This duration does not need to be consecutive, but it must be used in 1-minute increments. You can speak with natural or worked wood. You must be at least 11th level to select this revelation.",
          "Thorn Burst (Su)": "As a swift action, you can cause sharp splinters of wood to explode outward from your body. These splinters deal 1d6 points of piercing damage per two oracle levels (minimum 1d6) to all creatures within a 10-foot burst. A Reflex save halves this damage. In addition, the sharp splinters count as caltrops in the area until your next turn. You can use this ability once per day, plus one additional time per day at 5th level and every five levels thereafter.",
          "Tree Form (Sp)": "As a standard action, you can assume the form of a Large living or dead tree or shrub, as tree shape . At 9th level, you can assume the form of a Small or Medium plant creature, as plant shape I . At 11th level, you can assume the form of a Large plant creature, as plant shape II . At 13th level, you can assume the form of a Huge plant creature, as plant shape III . You can use this ability once per day, but the duration is 1 hour/level. You must be at least 3rd level to select this revelation.",
          "Wood Armor (Su)": "You can conjure wooden armor around yourself, which grants you a +4 armor bonus. At 7th level, and every four levels thereafter, this bonus increases by +2. At 13th level, this armor grants you DR 5/slashing. You can use this armor for 1 hour per day per oracle level. This duration does not need to be consecutive, but it must be spent in 1-hour increments. The armor vanishes if you remove it.",
          "Wood Bond (Ex)": "Your mystical bond with wood is such that your weapons become an extension of your body. You gain a +1 competence bonus on attack rolls when wielding a weapon made of or mostly consisting of wood (such as a bow, club, quarterstaff, or spear). This bonus increases by +1 at 5th level and every five levels thereafter.",
          "Wood Sight (Su)": "As a move action, you can alter your vision to see through underbrush and plant growth that would normally grant concealment, up to a range of 60 feet (though darkness and other obstacles still may block your sight). At 7th level, you can use this ability to see through wood or other plant material as easily as if it were transparent glass, penetrating a number of feet of wood equal to your oracle level. You can use this ability a number of rounds per day equal to your oracle level, but these rounds do not need to be consecutive.",
          "Wooden Weapon (Su)": "You can create a wooden club, quarterstaff, longspear, shortspear, or spear that lasts for 1 minute for every oracle level you possess. This weapon is appropriate for your size. You are considered proficient with the weapon. The weapon disappears after 1 round if it leaves your grasp. At 3rd level, the weapon is considered masterwork. At 7th level, 15th level, and 19th level, the weapon gains a +1 enhancement bonus. At 11th level, the weapon gains the keen weapon property (or the equivalent increase to its critical threat range, if it is a bludgeoning weapon). You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
          "Woodland Stride (Ex)": "You can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you."
          }
          ,"final revelation": ": Upon reaching 20th level, you become a living creature of wood. You are forevermore treated as the plant type rather than your original type for the purpose of spells and magical effects. Your skin takes on the appearance of polished wood grain, and you gain a +4 natural armor bonus to your Armor Class and damage reduction 10/— against wooden weapons or any natural attacks made by a wooden or woodlike creature. You gain immunity to paralysis, poison, polymorph, sleep, and stunning. At will, you can meld with any tree or single block of wood (as meld into stone , except wood only, and with no limit to how long you can remain in the wood)."
              }         
            
        }
    }

