{
  "stalker arts": {
    "advanced study:": "The stalker's knowledge of the martial disciplines expands, imparting new maneuvers as if the character had taken the Advanced Study feat. This art may be selected more than once. The stalker must meet the prerequisites of this feat to select this stalker art.",
    "alacrity (ex):": "A stalker's land speed is faster than the norm for his race, gaining a +10-ft. enhancement bonus to his base speed and he may add his stalker initiation modifier to Acrobatics checks, due to his nimble and finely honed body. The stalker enjoys this benefit only when he is wearing no armor or light armor, not using a shield, and not carrying a medium or heavy load. As a swift action, the character may spend a point of",
    "ki": "as a swift action and move without provoking attacks of opportunity for a number rounds equal to his stalker initiation modifier (min 1).",
    "bloodseeker (ex):": "The stalker gains the scent special ability.",
    "combat art:": "A stalker that selects this art gains a bonus combat feat. The stalker must meet the prerequisites for selecting this feat. This art may be selected more than once.",
    "combat precognition (su):": "The stalker designates his combat senses towards his opponents and gains momentary flashes of insight into how to defend himself against them. SpendIng one point of",
    "concealed recovery (su):": "The stalker may utilize his ki -fueled attunement to the world around him to defend himself while he centers his spirit for martial maneuver recovery. When recovering maneuvers (either as a full round action or as a standard action) the stalker enjoys concealment (with a 20% miss chance). At 11th level, this improves to total concealment (50% miss chance).",
    "critical edge (ex):": "The stalker's deadly efficiency in combat allows him to increase the critical threat range of any weapon he wields by +1. This bonus is applied after abilities such Improved Critical or the keen weapon property and cannot be doubled.",
    "critical training (ex):": "The stalker's deadly strike damage increases by an additional damage die, and he may treat his class level as his base attack bonus for the purposes of qualify for critical feats. If the stalker possesses fighter levels, he may add his stalker level to his fighter level to qualify for critical feats.",
    "deadly ambush (ex):": "The stalker with this art may now use his deadly strike class feature against flat- footed targets and targets that are being denied the Dexterity modifier to their AC as well as on critical hits and when focusing his",
    "deadly insight (su):": "The stalker may use his deadly strikes in conjunction with his combat insight to \"read\" his opponent's defenses and effortlessly attack beyond his foe's guard. The stalker spends one point of",
    "deadly recovery (ex):": "The stalker's deadly nature is reflected when he is considered to be most vulnerable. While recovering maneuvers as a full round action, the stalker gains the use of the Combat Reflexes feat (using his stalker initiation modifier in place of his Dexterity modifier). He may also add his deadly strike damage to any attacks of opportunity he makes while he is recovering maneuvers.",
    "evasion (ex):": "A stalker can avoid damage from many area-effect attacks by channeling his",
    "fear monger (ex):": "The stalker gains Cornugon Smash and Dazzling Display as bonus feats. The stalker must meet the prerequisites of these feats to select this stalker art.",
    "ki vampirism (su):": "The stalker's",
    "killer 's implements (ex):": "The stalker chooses a melee weapon he is proficient with, and gains the benefits of the Weapon Finesse and Deadly Agility feats when using that weapon, even if that weapon could not normally be used with those feats. At 6th level and every five levels thereafter, the stalker chooses an additional melee weapon to gain the benefits of this ability with. The stalker can change one of these weapon choices by practicing with a new weapon for ten minutes. This stalker art counts as both Weapon Finesse and Deadly Agility for the purposes of meeting prerequisites.",
    "lord of war (ex):": "The stalker adds Scarlet Throne or Piercing Thunder to his list of available disciplines. If he does not have that discipline's associated skill as a class skill, he gains it as a class skill. In addition, he gains a +2 competence bonus on checks with that skill. A stalker may select this stalker art once for each discipline.",
    "mind bending (su):": "The stalker's inner sense learns the workings of another being's mind, granting him the ability to impose his own will over those weak enough to succumb to this art. As a standard action, the character spends one",
    "monastic weapon training:": "The stalker gains the Improved Unarmed Strike feat and gains proficiency with all weapons that are considered monk weapons.",
    "murderous insight (su):": "The stalker designates his combat senses towards ending the lives of his opponents and gains momentary flashes of insight in how to best accomplish this. The stalker can activate this ability by spending one point of",
    "obfuscation (su):": "The stalker knows how to maintain a quiet, innocuous attitude as if he were nothing more than a part of the scenery. The stalker spends a point of",
    "phantom reach (su):": "The stalker is capable of extending the reach of melee range martial strikes by infusing",
    "precocious step (su):": "By relying on his combat insight to steer him effortlessly through a dangerous spot, the stalker may spend one point of",
    "rogue talent:": "Some stalkers have learned techniques that are similar to those of the rogue, and may select rogue talents instead of stalker arts. Stalkers may not learn advanced talents, nor can they gain the Ki Pool or Underhanded rogue talents. Talents that apply to a rogue's sneak attack apply to a stalker's deadly strike ability.",
    "sniper 's tools (ex):": "The stalker chooses a ranged weapon he is proficient with, and gains the benefits of the Point Blank Shot and Precise Shot feats when using that weapon. At 6th level and every five levels thereafter, the stalker chooses an additional ranged weapon to gain the benefits of this ability with. The stalker can change one of these weapon choices by practicing with a new weapon for ten minutes. This stalker art counts as both Point Blank Shot and Precise Shot for the purposes of meeting prerequisites."
  }
}