{
  "convictions": {
    "combat conviction": ": The zealot gains a  combat feat  he qualifies for as a bonus feat. After the zealot reaches 10th level, he can gain this conviction a second time.",
    "enduring zeal (su)": ": When the zealot activates his zeal class feature, he can spend up to 1 power point per zealot level to extend the duration of his zeal by a number of rounds equal to the power points spent.",
    "hearten the mindless (su)": ": Creatures in the zealot's collective that are mindless or immune to  mind-affecting  effects still benefit from his zeal class feature, gaining morale bonuses as if they were not mindless or immune to  mind-affecting  effects.",
    "improved zeal (su)": ": Whenever the zealot activates his zeal class feature, he can choose to pay 2 power points. If he does so, the intensity of his zeal increases by 1 for that use of his zeal class feature. A zealot must be at least 6th level before selecting this conviction.",
    "impulsive reactions (ex)": ": The zealot gains  Combat Reflexes  as a bonus feat, even if he does not meet the prerequisites. He uses his zealot initiation modifier instead of his  Dexterity  modifier to determine the number of additional  attacks of opportunity  he can make each round.",
    "path of dedication (su)": ": As a  move action, the zealot can grant one willing member of his collective a move action to move (even if it isn't their turn). This movement must be taken immediately, and provokes attacks of opportunity as normal. The zealot can use this ability only once per round.",
    "path of dedication, improved (su)": ": Whenever the zealot initiates a boost or counter, the zealot can pay 3 power points to activate his Path of Dedication conviction as a  free action, even if it isn't his turn. This is not considered an augment and does not count against the maximum amount of power points the zealot can spend on the maneuver. In addition, he can expend his psionic focus when using the Path of Dedication conviction to grant its effects to all willing members of his collective, including himself. The zealot may still only use this ability once per round. A zealot must be at least 10th level and possess the Path of Dedication conviction before selecting this conviction.",
    "personality fragment (ex)": ": The zealot gains Psicrystal Affinity as a bonus feat, even if he does not meet the prerequisites. He uses his initiator level in place of his manifester level for the purpose of determining the power of his psicrystal and for qualifying for the  Psicrystal Containment  feat. The zealot's psicrystal is always a member of his collective, and does not count towards the maximum number of creatures in his collective.",
    "psibertech affinity": ": This ability functions as the soulknife blade skill of the same name.",
    "psionic conviction": ": The zealot gains a  psionic feat  he qualifies for as a bonus feat. After the zealot reaches 10th level, he can gain this conviction a second time.",
    "shielded collective (su)": ": As a free action, the zealot can expend 3 power points to transfer any amount of temporary hp he currently possesses to another ally in his collective. This temporary hp lasts for 1 round/level or the normal duration, whichever is shorter.",
    "strike of unity (su)": ": The zealot can spend 5 power points when initiating a strike to initiate that maneuver through a member of the zealot's collective. The strike is resolved in all ways as if the zealot's ally had initiated it (in terms of  base attack bonus, weapons, feats, line of sight, reach,  cover, and so on. The maneuver uses the ally's initiation modifier or their  Charisma  modifier, whichever is higher). This is not considered an augment and does not count against the maximum amount of power points the zealot can spend on the maneuver. A zealot must be at least 10th level before selecting this conviction.",
    "tempered body (ex)": ": The zealot's incredible dedication allows him to weather serious and even fatal attacks. When a  critical hit  or  sneak attack  is scored on the zealot, there is a 25% chance that the  critical hit or  sneak attack  is negated and damage is instead rolled normally. This does not stack with similar abilities that negate  critical hits  or  sneak attacks  (such as the fortification armor special ability). The zealot can take this conviction up to three times; its effects stack, increasing the chance of negation by 25% each time he takes it.",
    "transcendent path (su)": ": Whenever the zealot uses the Path of Dedication or Improved Path of Dedication Abilities, he may have the creature teleport up to its movement speed as a move action rather than take a move action normally. The zealot must be at least 10th level and possess the Path of Dedication conviction to select this conviction.",
    "transcendent path, greater (su)": ": By expending 8 additional power points when using Transcendent Path, he may choose to teleport a creature to any location within 30 feet of another collective member rather than to a place where they could normally teleport to as a move action."
  }
}