{"armor_train": {
    "adaptable training (ex)": {
    "description": "the fighter can use his base attack bonus in place of his ranks in one skill of his choice from the following list: acrobatics, climb, disguise, escape artist, intimidate, knowledge (engineering), profession (soldier), ride, or swim. The fighter need not be wearing armor or using a shield to use this option. When using adaptable training, the fighter substitutes his total base attack bonus (including his base attack bonus gained through levels in other classes) for his ranks in this skill, but adds the skills usual ability score modifier and any other bonuses or penalties that would modify that skill. Once a skill has been selected, it cannot be changed, and the fighter can immediately retrain all of his ranks in the selected skill at no additional cost in money or time. In addition, the fighter adds all skills chosen with this option to his list of class skills. A fighter can choose this option up to four times. "
    },
    "armor specialization (ex)": {
    "description": "the fighter selects one specific type of armor with which he is proficient, such as chain shirts or scale mail. While wearing the selected type of armor, the fighter adds one-quarter of his fighter level to the armors armor bonus, up to a maximum bonus of +3 for light armor, +4 for medium armor, or +5 for heavy armor. This increase to the armor bonus doesnt increase the benefit that the fighter gains from feats, class abilities, or other effects that are determined by his armors base armor bonus, including other advanced armor training options. A fighter can choose this option multiple times. Each time he chooses it, he applies its benefit to a different type of armor. "
    },
    "armored confidence (ex)": {
    "description": "while wearing armor, the fighter gains a bonus on intimidate checks based upon the type of armor he is wearing: +1 for light armor, +2 for medium armor, or +3 for heavy armor. This bonus increases by 1 at 7th level and every 4 fighter levels thereafter, to a maximum of +4 at 19th level. In addition, the fighter adds half his armored confidence bonus to the dc of intimidate checks to demoralize him. "
    },
    "armored juggernaut (ex)": {
    "description": "when wearing heavy armor, the fighter gains dr 1/. At 7th level, the fighter gains dr 1/ when wearing medium armor, and dr 2/ when wearing heavy armor. At 11th level, the fighter gains dr 1/ when wearing light armor, dr 2/ when wearing medium armor, and dr 3/ when wearing heavy armor. If the fighter is 19th level and has the armor mastery class feature, these dr values increase by 5. The dr from this ability stacks with that provided by adamantine armor, but not with other forms of damage reduction. This damage reduction does not apply if the fighter is helpless, stunned, or unconscious. "
    },
    "armored master": {
    "description": "the fighter gains an armor mastery feat or a shield mastery feat as a bonus feat. He must meet all of the feats prerequisites. "
    },
    "armored sacrifice (ex)": {
    "description": "when damage would cause the fighter or an adjacent ally to be knocked unconscious or killed, the fighter can instead direct the damage to a suit of armor that he is wearing or a shield he is using as an immediate action. The original target takes no damage, but the armor or shield is treated as if it had only half its normal hardness. The fighter can use this option once per day, plus one additional time each day at 11th level and every 8 fighter levels thereafter, to a maximum of three times per day at 19th level. "
    },
    "armored sprint (ex)": {
    "description": "the fighter gains run as a bonus feat. If the fighter is proficient with heavy armor, he treats heavy armor as if it were one category lighter for the purpose of determining how fast he can move while running in armor. "
    },
    "critical deflection (ex)": {
    "description": "while wearing armor or using a shield, the fighter gains a +2 bonus to his ac against attack rolls made to confirm a critical hit. This bonus increases by 1 at 7th level and every 4 fighter levels thereafter, to a maximum of +6 at 19th level. "
    },
    "master armorer (ex)": {
    "description": "the fighter can use his base attack bonus in place of his ranks in the craft (armor) skill. The fighter need not be wearing armor or using a shield to use this option. The fighter substitutes his total base attack bonus (including his base attack bonus gained through levels in other classes) for his ranks in this skill, but adds the skills usual ability score modifier and any other bonuses or penalties that would modify that skill. Additionally, the fighter is treated as having the craft magic arms and armor and master craftsman feats, but only for the purpose of making magic armor. The fighter does not need to meet these feats prerequisites. "
    },
    "quick donning (ex)": {
    "description": "the fighter can don armor in a hurry without reducing its effectiveness, and remove it quickly when it becomes a hindrance. When the fighter dons or removes his armor or dons it hastily, the amount of time needed to do so is reduced. The fighter can also remove sections of armor to escape grapples and similar hindrances. Whenever the fighter attempts a combat maneuver check, an escape artist check, or a strength check to escape from an effect that reduces or restricts his ability to move or act, he can reduce the armor bonus of any armor that he is wearing by up to half his armors base armor bonus. If he does so, he gains a bonus on his check equal to the amount by which he reduced his armors armor bonus. Multiple uses of this ability cannot reduce the armors armor bonus below half its base armor bonus, and the reduction to the armors armor bonus lasts until the fighter recovers and dons the removed pieces of armor. "
    },
    "steel headbutt (ex)": {
    "description": "while wearing medium or heavy armor, a fighter can deliver a headbutt with his helm as part of a full attack action. This headbutt is in addition to his normal attacks, and is made using the fighters base attack bonus  5. A helmet headbutt deals 1d3 points of damage if the fighter is wearing medium armor, or 1d4 points of damage if he is wearing heavy armor (1d2 and 1d3, respectively, for small creatures), plus an amount of damage equal to 1/2 the fighters strength modifier. Treat this attack as a weapon attack made using the same special material (if any) as the armor. The armors enhancement bonus does not modify the headbutt attack, but the helm can be enchanted as a separate weapon. "
    },
    "unmoving (ex)": {
    "description": "select one combat maneuver (except sunder). Whether using his armor as leverage against a grappling foe or using its weight to help him stop a bull rush, a fighter can use his armor to protect him from the chosen combat maneuver. While wearing armor or wielding a shield, the fighter gains a bonus to his cmd against the chosen combat maneuver. The bonus is +1 if hes wearing light armor, +2 if hes wearing medium armor, and +3 if hes wearing heavy armor. This bonus increases by 1 at 7th level and every 4 fighter levels thereafter, to a maximum at 19th level of +5 for light armor, +6 for medium armor, and +7 for heavy armor. Mithral armor provides a bonus 1 lower than normal for armor of its type. "
    }
    }
    ,
    
    "weapon_train": {
    "abundant tactics (ex)": {
    "description": "the fighter adds his weapon training bonus to the number of times per day he can use a combat feat he has that allows a limited number of daily uses, such as the stunning fist feat. "
    },
    "armed bravery (ex)": {
    "description": "the fighter applies his bonus from bravery to will saving throws. In addition, the dc of intimidate checks to demoralize him increases by an amount equal to twice his bonus from bravery. The fighter must have the bravery class feature in order to select this option. "
    },
    "combat competence (ex)": {
    "description": "for any weapon in the associated weapon group with which the fighter is not proficient, the penalty on attack rolls taken as a result of not being proficient is reduced by an amount equal to the fighters weapon training bonus with that weapon group. Once the penalty is reduced to 0, the fighter becomes proficient with such weapons. "
    },
    "combat maneuver defense (ex)": {
    "description": "when the fighter is wielding weapons from the associated weapon group, his weapon training bonus applies to his cmd against all combat maneuvers attempted against him, instead of just against disarm and sunder combat maneuvers. "
    },
    "dazzling intimidation (ex)": {
    "description": "the fighter applies his weapon training bonus to intimidate checks and can attempt an intimidate check to demoralize an opponent as a move action instead of a standard action. If he has the dazzling display feat, he can use it as a standard action instead of a full-round action. "
    },
    "defensive weapon training (ex)": {
    "description": "the fighter gains a +1 shield bonus to his armor class. The fighter adds half his weapons enhancement bonus (if any) to this shield bonus. When his weapon training bonus for weapons from the associated fighter weapon group reaches +4, this shield bonus increases to +2. This shield bonus is lost if the fighter is immobilized or helpless. "
    },
    "effortless dual-wielding (ex)": {
    "description": "the fighter treats all one-handed weapons that belong to the associated weapon group as though they were light weapons when determining his penalties on attack rolls for fighting with two weapons. "
    },
    "fighters finesse (ex)": {
    "description": "the fighter gains the benefits of the weapon finesse feat with all melee weapons that belong to the associated fighter weapon group (even if they cannot normally be used with weapon finesse). The fighter must have the weapon finesse feat before choosing this option. "
    },
    "fighters reflexes (ex)": {
    "description": "the fighter applies his weapon training bonus to reflex saving throws. He loses this bonus when he is flat-footed or denied his dexterity bonus to ac. "
    },
    "fighters tactics (ex)": {
    "description": "all of the fighters allies are treated as if they had the same teamwork feats as the fighter for the purpose of determining whether the fighter receives a bonus from his teamwork feats. His allies do not receive any bonuses from these feats unless they actually have the feats themselves. "
    },
    "focused weapon (ex)": {
    "description": "the fighter selects one weapon for which he has weapon focus and that belongs to the associated fighter weapon group. The fighter can deal damage with this weapon based on the damage of the warpriests sacred weapon class feature, treating his fighter level as his warpriest level. The fighter must have weapon focus with the selected weapon in order to choose this option. "
    },
    "inspiring confidence (ex)": {
    "description": "a number of times per day equal to his highest weapon training bonus as a swift action, the fighter can allow one ally within 30 feet to attempt a new saving throw against an ongoing fear effect that causes the ally to cower or to become frightened, panicked, or shaken. "
    },
    "item mastery": {
    "description": "the fighter gains an item mastery feat as a bonus feat, which functions with any magic weapon he wields, even if the magic weapon does not meet the feats normal requirements. "
    },
    "trained grace (ex)": {
    "description": "when the fighter uses weapon finesse to make a melee attack with a weapon, using his dexterity modifier on attack rolls and his strength modifier on damage rolls, he doubles his weapon training bonus on damage rolls. The fighter must have weapon finesse in order to choose this option. "
    },
    "trained initiative (ex)": {
    "description": "as long as he is wielding a weapon from the associated weapon group or is able to draw such a weapon, the fighter applies his weapon training bonus to initiative checks. "
    },
    "trained throw (ex)": {
    "description": "when the fighter makes a ranged attack with a thrown weapon and applies his dexterity modifier on attack rolls and his strength modifier on damage rolls, he doubles his weapon training bonus on damage rolls. "
    },
    "versatile training (ex)": {
    "description": "the fighter can use his base attack bonus in place of his ranks in two skills of his choice that are associated with the fighter weapon group he has chosen with this option. "
    },
    "warrior spirit (su)": {
    "description": "the fighter can forge a spiritual bond with a weapon that belongs to the associated weapon group, allowing him to unlock the weapons potential. "
    },
    "weapon mastery": {
    "description": "the fighter gains a weapon mastery feat as a bonus feat, even when not wielding a weapon from the appropriate weapon group. "
    },
    "weapon sacrifice (ex)": {
    "description": "when damage would cause the fighter or an adjacent ally to be knocked unconscious or killed, as a swift or immediate action the fighter can instead direct the damage to a weapon from the associated weapon group that he is wielding. "
    },
    "weapon specialist (ex)": {
    "description": "the fighter selects a number of combat feats that he knows equal to his weapon training bonus with the associated weapon group. The selected feats must be ones that require the fighter to choose a type of weapon. "
    }
    
    }
    }