{
  "basic": {
    "acceleration of form": {
      "benefit": "a ninja with this trick can spend 1 ki point as a standard action to gain the benefits of displacement and haste for 1 round per 2 ninja levels. "
    },
    "acrobatic master": {
      "benefit": "as a swift action, a ninja with this trick can focus her ki to grant her a +20 bonus on one acrobatics check of her choice made before the start of her next turn. Using this ability expends 1 ki point from her ki pool. "
    },
    "bleeding attack": {
      "benefit": "a ninja with this trick can cause living opponents to bleed by hitting them with a sneak attack. This attack causes the target to take 1 additional point of damage each round for each die of the ninjas sneak attack. Bleeding creatures take that amount of damage every round at the start of each of their turns. The bleeding can be stopped by a dc 15 heal check or the application of any effect that heals hit point damage. Bleed damage from this ability does not stack with itself. Bleed damage bypasses any dr the creature might possess. "
    },
    "blood debt": {
      "benefit": "a ninja with this ability gains in harms way as a bonus feat, even if she doesnt meet the prerequisites. When the ninja intercepts an attack using this feat, she can spend 1 ki point to impose a blood debt on the aided ally. The ninjas ki pool is reduced by 1 until she ends this effect, which she may do as an immediate action. If the ninja ends the blood debt in response to a successful attack against her by a creature the indebted ally threatens, the ally (who must be willing) takes full damage from that attack and any associated effects instead of the ninja. "
    },
    "breath of the ancestor": {
      "benefit": "the ninja chooses one imperial dragon type (forest, sea, sky, sovereign, or underworld) when she gains this trick, and the choice cant be changed. She can use supplies similar to those used for ninja smoke bombs to produce an alchemical breath weapon that deals the same kind of damage as the selected dragon (piercing damage for forest dragons, fire (steam) for sea dragons, and so on). The breath weapon deals the same amount of damage as the ninjas sneak attack, with a reflex save allowed for half damage. "
    },
    "choking bomb": {
      "prerequisite": "poison bomb",
      "benefit": "whenever a ninja throws a smoke bomb, all living creatures in the resulting cloud must make a fortitude save or become staggered by the choking black smoke for 1d4 rounds. The dc of this saving throw is equal to 10 + 1/2 the ninjas level + the ninjas charisma modifier. The ninja can decide to create an ordinary smoke bomb or add poison to this smoke bomb as normal. "
    },
    "poison bomb": {
      "prerequisite": "smoke bomb",
      "benefit": "whenever the ninja throws a smoke bomb, she can decide to include 1 dose of any inhaled poison she possesses. This poison affects all creatures in the smoke and lasts as long as the smoke lasts. She must pay for the poison normally. "
    },
    "smoke bomb": {
      "benefit": "this ability allows a ninja to throw a smoke bomb that creates a cloud of smoke with a 15-foot radius. This acts like the smoke from a smokestick. The ninja can center this smoke on herself, or throw the bomb as a ranged touch attack with a range of 20 feet. Using this ability is a standard action. Each use of this ability uses up 1 ki point. "
    },
    "combat": {
      "benefit": "a ninja who selects this trick gains a bonus combat feat. "
    },
    "darkvision": {
      "benefit": "this trick allows the ninja to use her ki to enhance her sight, granting darkvision out to a range of 60 feet. Using this trick is a standard action that costs 1 ki point. The enhanced senses last for 1 hour. "
    },
    "deadly range": {
      "benefit": "a ninja with this ninja trick increases the range at which she can deal sneak attack damage by 10 feet. A ninja can take this trick more than once. Its effects stack. "
    },
    "deflect arrows": {
      "prerequisite": "improved unarmed strike",
      "benefit": "a ninja who selects this ninja trick gains the deflect arrows feat as a bonus feat. "
    },
    "fast stealth": {
      "benefit": "a ninja with this trick can move at full speed using the stealth skill without penalty. "
    },
    "feather fall": {
      "benefit": "as an immediate action, the ninja can slow her descent as if using feather fall. This ability uses her ninja level as the caster level. Each use of this ability uses up 1 ki point. "
    },
    "flurry of stars": {
      "benefit": "a ninja with this ability can expend 1 ki point from her ki pool as a swift action before she makes a full-attack attack with shuriken. During that attack, she can throw two additional shuriken at her highest attack bonus, but all of her shuriken attacks are made at a 2 penalty, including the two extra attacks. "
    },
    "forgotten trick": {
      "benefit": "a ninja with this ability can recall one trick taught to her by her ancient masters. When she uses this ability, she selects one ninja trick (not a master trick or rogue talent) that she does not know and can use that ninja trick for a number of rounds equal to her level. She must pay any ki costs associated with the trick as normal. Using this ability expends 2 ki points from her ki pool, plus the ki cost of the trick she chooses. "
    },
    "hidden weapons": {
      "benefit": "a ninja with this ability can easily conceal weapons on her body. The ninja adds her level on opposed sleight of hand checks made to conceal a weapon. In addition, she can draw hidden weapons as a move action, instead of as a standard action. "
    },
    "high jumper": {
      "prerequisite": "acrobatic master",
      "benefit": "when a ninja with this trick makes a high jump, the dc for that jump is half the normal dc. "
    },
    "kamikaze": {
      "benefit": "a ninja with this ability strikes without concern for her own well-being. The ninja can spend 1 point from her ki pool to give her unarmed strikes and any weapons she wields the vicious weapon special ability for 1 round per level. The ninja can spend 1 ki point to dismiss this effect. "
    },
    "ki block": {
      "benefit": "a ninja with this trick can prevent a creature from using its ki pool. Whenever the ninja deals sneak attack damage, the target must make a will save or be unable to spend any points from its ki pool for a number of rounds equal to the ninjas charisma modifier. The dc of this save is 10 + 1/2 the ninjas level + the ninjas charisma modifier. The number of points in the targets ki pool is unaffected, and abilities that do not require the subject to spend ki still function. "
    },
    "ki charge": {
      "benefit": "a ninja with this trick can invest a portion of her ki into a single thrown weapon, such as a shuriken, and throw it as a standard action. The thrown weapon explodes on impact in a 5-foot burst, dealing 1d6 points of fire damage plus 1d6 points of fire damage for every four levels of the ninja above 2nd, to a maximum 4d6 at 18th level. Creatures caught in the blast receive a reflex save to halve the damage. The dc of this save is 10 + 1/2 the ninjas level + the ninjas charisma modifier. If the thrown weapon hits a creature, that creature takes a 2 penalty on the saving throw. If the thrown weapon misses, treat it as a thrown splash weapon. Using this ability expends 1 ki point from her ki pool. "
    },
    "ki venom": {
      "the poison lasts for 24 hours before becoming inert. The poison deals either strength or dexterity damage, chosen when the venom is created. The ninja can spend additional ki as part of the process of creating the ki venom to improve the venom in one or more of the following ways": "spend 1 ki point to increase the damage die to a d6, spend 1 ki point to change the ability damage dealt to intelligence, wisdom, or charisma damage, or spend 1 ki point to increase the number of saves required to cure the poison by 1. "
    },
    "pressure points": {
      "benefit": "a ninja with this trick can strike at an opponents vital pressure points, causing weakness and intense pain. Whenever the ninja deals sneak attack damage, she also deals 1 point of strength or dexterity damage, decided by the ninja. Unlike normal ability damage, this damage can be healed by a dc 15 heal check. Each successful check heals 1 point of damage caused by this trick. A ninja with this trick receives a +10 insight bonus on this heal check. "
    },
    "redirect force": {
      "benefit": "if the ninja has a feat that allows her to attempt a combat maneuver without provoking attacks of opportunity, she can choose to provoke them anyway when she performs that maneuver. If she does so and takes damage from the attack of opportunity, the ninja adds the damage as a bonus on her attack roll instead of as a penalty. "
    },
    "rogue talent": {
      "benefit": "the ninja can select a rogue talent in place of a ninja trick. The ninja cannot select a rogue talent that has the same name as a ninja trick. The ninja can select this talent multiple times. "
    },
    "shadow clone": {
      "benefit": "the ninja can create 1d4 shadowy duplicates of herself that conceal her true location. This ability functions as mirror image, using the ninjas level as her caster level. Using this ability is a standard action that uses up 1 ki point. "
    },
    "slow metabolism": {
      "benefit": "the ninja has a slower-than-normal metabolism. She can hold her breath for twice as long as normal before needing to make constitution checks (four times her constitution score). In addition, whenever the ninja is poisoned, the time between saving throws (the poisons frequency) is doubled. Thus, a poison that has a frequency of 1/round for 6 rounds would instead be 1/2 rounds for 12 rounds. "
    },
    "slow reactions": {
      "benefit": "opponents that are damaged by the ninjas sneak attack cant make attacks of opportunity for 1 round. "
    },
    "snatch arrows": {
      "prerequisites": "deflect arrows, improved unarmed strike",
      "benefit": "a ninja who selects this ninja trick gains the snatch arrows feat as a bonus feat. "
    },
    "style master": {
      "benefit": "a ninja who selects this ninja trick gains a style feat that she qualifies for as a bonus feat. "
    },
    "sudden disguise": {
      "benefit": "as a swift action, a ninja can change her appearance for 1 minute per level. This ability functions as disguise self. Each use of this ability uses up 1 ki point. "
    },
    "unarmed combat training": {
      "benefit": "a ninja who selects this ninja trick gains improved unarmed strike as a bonus feat"
    },
      "undetected sabotage": {
        "benefit": "whenever a ninja with this trick uses disable device to sabotage or disable a device, she can make a stealth check with a bonus equal to her level. Anyone who inspects the device does not notice the sabotage and assumes the object works unless he beats the ninjas check with an opposed perception skill check. "
      },
      "vanishing trick": {
        "benefit": "as a swift action, the ninja can disappear for 1 round per level. This ability functions as invisibility. Using this ability uses up 1 ki point. "
      },
      "ventriloquism": {
        "benefit": "as a swift action, the ninja can throw her voice as if using the spell ventriloquism. She can use this ability for 1 minute per ninja level. Each use of this ability uses up 1 ki point. "
      },
      "wall climber": {
        "benefit": "a ninja with this ability gains a climb speed of 20 feet, but only on vertical surfaces. This ability cannot be used to scale perfectly smooth surfaces or to climb on the underside of horizontal surfaces. "
      },
      "weapon training": {
        "benefit": "a ninja who selects this ninja trick gains weapon focus as a bonus feat. "
      }
    },
    "advanced": {
      "advanced talents": {
        "prerequisites": "",
        "benefit": "the ninja can select a rogue talent from the list of advanced talents in place of a ninja trick. The ninja cannot select a rogue talent that has the same name as a ninja trick. The ninja cannot select improved evasion unless she has evasion (either as a class feature or as a ninja master trick). "
      },
      "assassinate": {
        "prerequisites": "",
        "benefit": "a ninja with this master trick can kill foes that are unable to defend themselves. To attempt to assassinate a target, the ninja must first study her target for 1 round as a standard action. On the following round, if the ninja makes a sneak attack against the target and the target is denied its dexterity bonus to ac, the sneak attack has the additional effect of possibly killing the target. This attempt automatically fails if the target recognizes the ninja as an enemy. If the sneak attack is successful and the target of this attack fails a fortitude save, it dies. The dc of this save is equal to 10 + 1/2 the ninjas level + the ninjas charisma modifier. If the save is successful, the target still takes the sneak attack damage as normal, but it is immune to that ninjas assassinate ability for 1 day. "
      },
      "blinding bomb": {
        "prerequisites": "choking bomb",
        "benefit": "whenever the ninja throws a smoke bomb, all living creatures in the cloud must make a fortitude save or be blinded by the black smoke for 1d4 rounds. The dc of this saving throw is equal to 10 + 1/2 the ninjas level + the ninjas charisma modifier. This trick cannot be combined with a choking bomb, but the ninja can combine a blinding bomb with a poison bomb. "
      },
      "deadly shuriken": {
        "prerequisites": "",
        "benefit": "as a full-round action, a ninja with this master trick can take careful aim and pool all of her attack potential into a single, deadly shuriken throw. When she does this, she throws a single shuriken at a single target, but makes as many attack rolls as she can, based on her base attack bonus. She makes the attack rolls in order from highest bonus to lowest, as if she were making a full attack. If any of the attack rolls hit the target, the attack hits. For each additional successful attack roll beyond the first, the ninja increases the damage by 1d6. Precision damage and extra damage from weapon special abilities (such as flaming) are added with damage modifiers and are not increased by this advanced talent. If one or more rolls are critical threats, she confirms the critical once using her highest base attack bonus 5. For each critical threat beyond the first, she reduces this penalty by 1 (to a maximum of 0). "
      },
      "evasion": {
        "prerequisites": "",
        "benefit": "a ninja can avoid even magical and unusual attacks with great agility. If she makes a successful reflex saving throw against an attack that normally deals half damage on a successful save, she instead takes no damage. Evasion can be used only if the ninja is wearing light armor or no armor. A helpless ninja does not gain the benefit of evasion. "
      },
      "feat": {
        "prerequisites": "",
        "benefit": "a ninja may gain any feat that she qualifies for in place of a ninja trick. "
      },
      "ghost step": {
        "prerequisites": "",
        "benefit": "as a swift action, a ninja with this trick can pass through walls as if she were a ghost. Until the end of her turn, she can pass through a wall or other surface that is up to 5 feet thick per level as if she were incorporeal. She must exit the solid material by the end of her turn. Each use of this ability uses up 1 ki point. "
      },
      "invisible blade": {
        "prerequisites": "vanishing trick",
        "benefit": "whenever a ninja uses the vanishing trick ninja trick, she is treated as if she were under the effects of greater invisibility. "
      },
      "kawarimi": {
        "prerequisite": "",
        "benefit": "once per day when a successful attack is made against a ninja with this ability, as an immediate action she can spend 1 ki point to attempt a stealth check opposed by the attackers perception check. The ninja can attempt this check while being observed as long as she has cover or concealment (or an ability that allows her to attempt stealth checks without cover or concealment). If shes successful, the opponents attack hits an inanimate object that the attacker mistook for the ninja, and the ninja may move into an adjacent square and is hidden from the attacker. "
      },
      "master disguise": {
        "prerequisites": "sudden disguise",
        "benefit": "a ninja with this trick can take on the appearance of other creatures and individuals. Whenever the ninja uses the sudden disguise ninja trick, the duration increases to 10 minutes per level. Alternatively, the ninja can use the sudden disguise ninja trick to take on the appearance of a specific individual that the ninja has seen before for 1 minute per level. Creatures that are familiar with the individual receive a will saving throw to see through the illusion. The dc of this saving throw is 10 + 1/2 the ninjas level + the ninjas charisma modifier. This illusion also changes the ninjas speech, if she has heard the individual talk and can speak his language. "
      },
      "see the unseen": {
        "prerequisites": "",
        "benefit": "a ninja with this trick learns how to see that which cannot be seen. As a swift action, the ninja can cast see invisibility, using her level as the caster level. Each use of this ability uses up 1 ki point. "
      },
      "shadow split": {
        "prerequisites": "shadow clone",
        "benefit": "this trick allows the ninja to create an illusory double of herself that moves away from her, allowing the ninja to create a distraction. When she uses this ability, an illusory double appears and moves away from the ninja, heading in one direction. The double climbs walls, jumps pits, or simply passes through obstacles, moving at twice the ninjas speed in the direction indicated by the ninja when the ability is used. Its course cannot be changed. The double persists for 1 round per level of the ninja. Those who interact with the double receive a will saving throw to recognize that it is fake. The dc of this save is 10 + 1/2 the ninjas level + the ninjas charisma modifier. Each use of this ability uses up 1 ki point. "
      },
      "unarmed combat mastery": {
        "prerequisites": "improved unarmed strike",
        "benefit": "a ninja who selects this trick deals damage with her unarmed strikes as if she were a monk of her ninja level 4. If the ninja has levels in monk, this ability stacks with monk levels to determine how much damage she can do with her unarmed strikes. "
      },
      "unbound steps": {
        "prerequisites": "",
        "benefit": "this trick allows a ninja to use her ki to walk through the air. Whenever the ninja uses the light steps class feature, she can walk on air, rising or descending as she desires. She must end her move on a solid surface. Each use of this ability uses up 1 ki point. "
      }
    }
  }