{
  "basic":{
     "aligned sneak attack (su)":{
        "benefit":"When making a sneak attack against a creature that has damage reduction that can be overcome by weapons of a particular alignment (such as DR 5/good), the rogue’s (or slayer’s) attack reduces that damage reduction by an amount equal to the number of sneak attack dice rolled until the end of the rogue’s turn."
     },
     "blood reader":{
        "benefit":"While able to see a studied target, a slayer with this talent knows exactly how many hit points his opponent has remaining. This only works against living targets."
     },
     "catfolk slayer":{
        "prerequisite":"Catfolk",
        "benefit":"A catfolk slayer can select deadly scratch, graceful faller, nimble climber, or vicious claws in place of a slayer talent. Any talent effects based on rogue level use the slayer’s class level. The slayer must fulfill any prerequisites as normal. This talent can be selected multiple times; each time, it grants a new catfolk rogue talent."
     },
     "deadly range":{
        "prerequisite":"slayer 4",
        "benefit":"A slayer with this talent increases the range at which he can deal sneak attack damage by 10 feet. A slayer can select this talent more than once; its effects stack."
     },
     "eternal opposition":{
        "prerequisite":"samsaran",
        "benefit":"While most imperial dragons, undead, and other long-enduring foes can count on outlasting their mortal adversaries, the samsaran slayer has pledged to oppose their machinations across all his lifetimes. When his studied target is of the dragon, fey, outsider, or undead type, the slayer gains a +2 insight bonus to his AC against its attacks and on saving throws against its abilities."
     },
     "experience across ages":{
        "prerequisite":"samsaran",
        "benefit":"Once per day, a samsaran slayer can draw upon insights from his previous lifetimes to help identify a foe or recall a key piece of information. As a swift action, the slayer can attempt a Knowledge check as if he had a number of ranks in the appropriate Knowledge skill equal to his slayer level. A slayer can use this talent one additional time per day for every 5 slayer levels he has."
     },
     "focused poison":{
        "prerequisite":"slayer 6, poison use",
        "benefit":"When the slayer studies a target, he can immediately reduce the number of additional studied targets he can maintain. Reducing this number does not require an action. For each target reduced in this way, the DC of poisons used against his studied target increases by 1."
     },
     "foil scrutiny":{
        "benefit":"A slayer with this talent is able to obscure his thoughts and intentions. He gains a +2 bonus on all Bluff and Disguise checks, as well as on Will saving throws to resist mind-reading spells and effects (such as detect thoughts and discern lies)."
     },
     "inured to terror":{
        "prerequisite":"samsaran",
        "benefit":"With their knowledge of the cyclical nature of existence, there are few experiences that can daunt samsaran slayers for long. As an immediate action when a slayer fails a saving throw against a fear effect, he can attempt the saving throw a second time to reduce the severity of the effect from panicked to frightened, frightened to shaken, or shaken to unaffected. Additionally, the DC of Intimidate checks to demoralize him increases by 2."
     },
     "jaguar’s grace":{
        "prerequisite":"slayer 4",
        "benefit":"A slayer with this talent does not take the normal –4 penalty when dealing nonlethal damage using a weapon that normally deals lethal damage. Attacks made this way can apply nonlethal sneak attack damage."
     },
     "jaguar’s pounce":{
        "prerequisite":"jaguar’s grace",
        "benefit":"When a slayer with this talent deals sneak attack damage, he can attempt a disarm or trip combat maneuver as an immediate action as if the target were flatfooted (losing its Dexterity bonus to CMD). This combat maneuver does not provoke attacks of opportunity."
     },
     "jaguar’s protection":{
        "prerequisite":"jaguar’s grace, jaguar’s pounce",
        "benefit":"When a slayer with this talent deals sneak attack damage, he draws the target’s attention away from his allies. The affected enemy takes a –2 penalty on attack rolls made against anyone other than the slayer for 1 minute."
     },
     "mountainside ambush":{
        "prerequisite":"samsaran",
        "benefit":"samsaran slayers often strike with deadly attacks from above. If a slayer deals sneak attack damage to a creature that is unaware of his presence while he is standing on higher ground than his target, he does not have to roll sneak attack damage; instead, the sneak attack deals maximum damage. The samsaran must be standing on solid ground to use this ability."
     },
     "mystic veil":{
        "prerequisite":"samsaran, int 11",
        "benefit":"samsaran slayers are adept at obscuring the passes of their mountain homes from intruders. The slayer can cast silent image as a spell-like ability once per day for every 2 slayer levels he has, using his slayer level as his caster level. The slayer uses his Intelligence modifier on concentration checks when using this ability, and the DC to disbelieve the illusion is equal to 11 + the slayer’s Intelligence modifier."
     },
     "ranger combat style":{
        "benefit":"The slayer selects a ranger combat style (such as archery or two-weapon combat) and gains a combat feat from the first feat list of that style. He can choose feats from his selected combat style, even if he does not have the normal prerequisites. At th level, he may select this talent again and add the 6th-level ranger combat feats from his chosen style to the list. At 1th level, he may select this talent again and add the 10th-level ranger combat feats from his chosen style to the list."
     },
     "recall training":{
        "prerequisite":"samsaran",
        "benefit":"By calling on the memories of previous incarnations, a samsaran slayer can use martial techniques that transcend his usual capabilities. Once per day, the slayer can take a move action to gain the benefit of a combat feat he doesn’t have. This effect lasts for 1 minute per slayer level he has. The slayer must meet all the feat’s prerequisites."
     },
     "redirect poison":{
        "benefit":"When a creature unsuccessfully attacks the slayer with a poisoned weapon or a natural weapon that would poison him, the slayer can attempt to redirect the attack to a creature within his reach (including, possibly, the creature that unsuccessfully attacked the slayer). As an immediate action, the slayer can make an attack roll against the creature to which he would redirect the poison. On a success, the poison is redirected to the target, and the target must attempt a saving throw against the poison as normal. This attack only redirects the poison and does not otherwise damage the targeted creature. This ability cannot affect a creature that attacked the slayer with a poisoned natural weapon, but it can affect a creature that attacked him with a poisoned manufactured weapon."
     },
     "rogue talent":{
        "benefit":"A slayer can select one of the following rogue talents in place of a slayer talent. Any talent effects based on rogue level use the slayer’s class level. If the rogue talent has a prerequisite, the slayer must fulfill the prerequisite before taking that rogue talent. This talent can be selected multiple times; each time, it grants the slayer a new rogue talent."
     },
     "scrying familiarity":{
        "benefit":"You are well acquainted with scrying sensors. You can roll twice and take the better result on saving throws against divination (scrying) spells and effects, on Perception checks to notice scrying sensors, and on caster level checks to overcome spell resistance when you use a scrying spell or effect. If you notice a magical sensor, you can attempt a Stealth check opposed by the caster’s caster level check to avoid being detected by the sensor."
     },
     "sever alignment* (su)":{
        "prerequisite":"aligned sneak attack",
        "benefit":"When making a sneak attack against an opponent with an alignment subtype, a rogue (or slayer) with this talent can forgo her sneak attack damage to scramble the creature’s metaphysical nature. If the attack succeeds, the rogue deals weapon damage as normal, and the target must succeed at a Fortitude save (DC = 10 + half the rogue’s level + the rogue’s (or slayer’s) Intelligence modifier) or lose all damage reduction overcome by aligned weapons (such as DR 10/good), lose all regeneration overcome by aligned sources (such as regeneration 10 [good]), and lose the ability to cast spells and use spell-like abilities with alignment descriptors for 1 round for every 2d6 points of sneak attack damage the rogue (or slayer) would have dealt (minimum 1 round)."
     },
     "slowing strike*":{
        "benefit":"An opponent damaged by the slayer‘s sneak attack has its speed halved for 1d4 rounds. A successful Fortitude saving throw negates this effect (DC = 10 + 1/2 of the slayer’s level + the slayer’s Intelligence modifier). Against creatures with multiple types of movement, the slayer must choose which movement type to affect. If the slayer affects a creature’s flight movement, its maneuverability is reduced by one step; if it’s airborne at the time, it falls unless it succeeds at a DC 10 Fly check. If the slayer targets a creature already affected by this ability, its speed and maneuverability are not further reduced; the slayer may either extend the duration of that effect by 1d4 rounds or choose another movement type to affect (keeping track of the duration of each affected movement separately)."
     },
     "studied ally":{
        "benefit":"The slayer can study an ally or friendly creature he can see as a move action. The slayer gains a +1 bonus on checks and attack rolls to use the aid another action to help with that ally’s skill checks, attacks, or AC. This bonus increases at the same rate as a slayer’s studied target bonus. At th level, a slayer can study an ally as a move or swift action. A slayer’s studied ally counts against the number of studied targets he can have active at once."
     },
     "toxin training":{
        "prerequisite":"slayer 4, poison use"
     },
     "poison use":{
        "benefit":"The slayer is trained in the use of poison, and cannot accidentally poison himself when applying poison to a weapon."
     },
     "trapfinding":{
        "benefit":"The slayer gains Disable Device as a class skill. The slayer also gains the trapfinding and trap sense rogue abilities, using his slayer level as his effective rogue level."
     }

    },
    "advanced": {
     "armored marauder":{
        "benefit":"The slayer gains proficiency with heavy armor. In addition, the armor check penalty of any heavy armor the slayer wears is reduced by 1 for every 6 slayer levels he has."
     },
     "armored swiftness":{
        "benefit":"A slayer with this talent can move at full speed in heavy armor. In addition, the maximum Dexterity bonus of heavy armor the slayer wears increases by 1 for every 6 class levels he has. A slayer must have the armored marauder slayer talent to select this talent."
     },
     "assassinate":{
        "benefit":"A slayer with this advanced talent can kill foes that are unable to defend themselves. To attempt to assassinate a target, the slayer must first study his target for 1 round as a standard action. On the following round, if the slayer makes a sneak attack against the target and that target is denied its Dexterity bonus to AC, the sneak attack has the additional effect of possibly killing the target. This attempt automatically fails if the target recognizes the slayer as an enemy. If the sneak attack is successful, the target must attempt a Fortitude saving throw with a DC equal to 10 + 1/2 the slayer’s level + the slayer’s Intelligence modifier. If the target fails this save, it dies; otherwise, the target takes the sneak attack damage as normal and is then immune to that slayer’s assassinate ability for 24 hours."
     },
     "marksman’s shot":{
        "benefit":"As an attack action, the slayer makes a single ranged attack at his highest attack bonus with a ranged weapon he wields. The target of the attack must be the slayer’s studied target. On a successful hit, the slayer doubles the number of sneak attack dice applied to the attack; if the attack was not a sneak attack, this benefit does not apply."
     },
     "reaping stalker":{
        "benefit":"A slayer with this talent treats any sickle or scythe he wields as though it were one size larger for the purpose of determining its damage dice."
     },
     "slayer camouflage":{
        "prerequisite":"terrain mastery",
        "benefit":"A slayer can use the Stealth skill to hide in any of his favored terrains, even if the terrain doesn’t grant cover or concealment."
     },
     "swallow reversal":{
        "benefit":"As an attack action, the slayer can make a single melee attack against his studied target at his highest base attack bonus. When attempting a swallow reversal, the slayer rolls two attack rolls and uses the highest result. If the attack is a critical threat, the slayer attempts to confirm the critical hit as normal. The slayer can use swallow reversal at will, but it can only be used against a given target once per day."
     },
     "woodland stride":{
        "benefit":"A slayer with this talent may move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at his normal speed and without taking damage or suffering any other impairment. Terrain that is enchanted"
     }
    }
  }