{"bloodline":   {
    "Aberrant Bloodline": {
      "class skill": "Knowledge (dungeoneering).",
      "bonus spells": [      "enlarge person (3rd)",
      "see invisibility (5th)",
      "tongues (7th)",
      "black tentacles (9th)",
      "feeblemind (11th)",
      "veil (13th)",
      "plane shift (15th)",
      "mind blank (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Combat Casting, Improved Disarm, Improved Grapple, Improved Initiative, Improved Unarmed Strike, Iron Will, Silent Spell, Skill Focus (Knowledge [dungeoneering])"],
      "bloodline arcana": "Whenever you cast a spell of the polymorph subschool, increase the duration of the spell by 50% (minimum 1 round). This bonus does not stack with the increase granted by the Extend Spell feat.",
      "bloodline powers": "Aberrant sorcerers show increasing signs of their tainted heritage as they increase in level, although they are only visible when used.",
      "Acidic Ray (Sp)": "Starting at 1st level, you can fire an acidic ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. The acidic ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Long Limbs (Ex)": "At 3rd level, your reach increases by 5 feet whenever you are making a melee touch attack. This ability does not otherwise increase your threatened area. At 11th level, this bonus to your reach increases to 10 feet. At 17th level, this bonus to your reach increases to 15 feet.",
      "Unusual Anatomy (Ex)": "At 9th level, your anatomy changes, giving you a 25% chance to ignore any critical hit or sneak attack scored against you. This chance increases to 50% at 13th level.",
      "Alien Resistance (Su)": "At 15th level, you gain spell resistance equal to your sorcerer level + 10.",
      "Aberrant Form (Ex)": "At 20th level, your body becomes truly unnatural. You are immune to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/-."
  },
    "Abyssal Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "cause fear (3rd)",
      "bull's strength (5th)",
      "rage (7th)",
      "stoneskin (9th)",
      "dismissal (11th)",
      "transformation (13th)",
      "greater teleport (15th)",
      "unholy aura (17th)",
      "summon monster IX (19th)"
],
      "bonus feats": ["Augment Summoning, Cleave, Empower Spell, Great Fortitude, Improved Bull Rush, Improved Sunder, Power Attack, Skill Focus (Knowledge [planes])"],
      "bloodline arcana": "Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/good equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.",
      "bloodline powers": "While some would say that you are possessed, you know better. The demonic influence in your blood grows as you gain power.",
      "Claws (Su)": "At 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. These attacks deal 1d4 points of damage each (1d3 if you are Small) plus your Strength modifier. At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws become",
      "flaming weapons": ", each dealing an additional 1d6 points of fire damage on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.",
      "Demon Resistances (Ex)": "At 3rd level, you gain resist electricity 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to electricity increases to 10 and your bonus on poison saving throws increases to +4.",
      "Strength of the Abyss (Ex)": "At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.",
      "Added Summonings (Su)": "At 15th level, whenever you summon a creature with the demon subtype or the fiendish template using a",
      "summon monster": "spell, you summon one additional creature of the same kind.",
      "Demonic Might (Su)": "At 20th level, the power of the Abyss flows through you. You gain immunity to electricity and poison. You also gain resistance to acid 10, cold 10, and fire 10, and gain telepathy with a range of 60 feet (allowing you to communicate with any creature that can speak a language)."
  },
    "Accursed Bloodline": {
      "class skill": "Perception.",
      "bonus spells": [      "ray of enfeeblement (3rd)",
      "touch of idiocy (5th)",
      "ray of exhaustion (7th)",
      "bestow curse (9th)",
      "feeblemind (11th)",
      "eyebite (13th)",
      "insanity (15th)",
      "dimensional lock (17th)",
      "energy drain (19th)"
],
      "bonus feats": ["Alertness, Blind-Fight, Combat Casting, Deceitful, Defensive Combat Training, Endurance, Great Fortitude, Mounted Combat"],
      "bloodline arcana": "You count as a hag for the purpose of joining a hag's coven. The coven must contain at least one hag. In addition, whenever you are within 30 feet of another sorcerer with this bloodline or a witch with the coven hex, you can use the aid another action to grant a +1 bonus to the other spellcaster's caster level for 1 round.",
      "bloodline powers": "The source of your power isn't pretty, but it does allow you to emulate the preternatural ugliness and toughness of a hag-though doing so won't help you make friends.",
      "Horrific Visage (Su)": "At 1st level, you can draw upon your hag ancestor to cause one target to perceive you as having a horrifying appearance. As a standard action, you can force one target within 30 feet to make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be shaken for 1 round for every 2 sorcerer levels you possess (minimum 1 round). This is a mind-affecting, fear-based ability. This fear does not stack with other fear effects. You may use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Wretched Endurance (Ex)": "At 3rd level, you gain a +2 bonus on all saving throws against charm, cold, fear, fire, and sleep effects. And 9th level, these bonuses increase to +4.",
      "Dread Gaze (Su)": "At 9th level, you gain a form of the green hag's evil eye power. As a standard action, you may fix your gaze on any one creature within 60 feet. The target must make a Will save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) or be staggered for 1 round for every 2 sorcerer levels you possess. You may use this ability once per day at 9th level. At 17th level, you can use this ability twice per day. At 20th level, you may use this ability three times per day.",
      "Dream Walking (Sp)": "At 15th level, you can enter the ethereal plane. This functions like",
      "ethereal jaunt": ", but with a duration of 1 minute for every 2 sorcerer levels you possess. Once during this trip, you may cast",
      "nightmare": "as a spell-like ability on a creature you see on the Material Plane. (This is an exception to the normal rule that ethereal creatures cannot affect targets on the Material Plane).",
      "Fearsome Survival (Su)": "At 20th level, your hag-blood gives you considerable resilience. You gain DR 10/cold iron, and gain SR equal to 6 + your sorcerer level."
  },
    "Aquatic Bloodline": {
      "class skill": "Swim.",
      "bonus spells": [      "hydraulic push (3rd)",
      "slipsream (5th)",
      "aqueous orb (7th)",
      "geyser (9th)",
      "control water (11th)",
      "beast shape IV (13th)",
      "summon monster VII (15th)",
      "seamantle (17th)",
      "world wave (19th)"
],
      "bonus feats": ["Athletic, Brew Potion, Defensive Combat Training, Dodge, Mobility, Silent Spell, Skill Focus (Swim), Toughness"],
      "bloodline arcana": "Whenever you cast a spell of the water type, your effective caster level is increased by one, and summoned creatures with a swim speed or the aquatic or water type gain a +1 morale bonus on attack and damage rolls.",
      "bloodline powers": "Your seaborn magical talents awaken changes in you, both mystical and physical, as you develop your powers.",
      "Dehydrating Touch (Sp)": "Starting at 1st level, you can make a melee touch attack as a standard action that inflicts 1d6 points of nonlethal damage + 1 for every two sorcerer levels you possess and sickens the target for 1 round. Oozes, plants, and creatures with the aquatic or water subtypes suffer lethal damage instead. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Aquatic Adaptation (Ex)": "At 3rd level, you gain a swim speed of 30 feet. At 9th level, you gain the amphibious special quality and develop a fat layer that grants a +1 natural armor bonus and resist cold 5. When immersed in water, you gain blindsense 30 feet. At 15th level, you gain a swim speed of 60 feet and blindsense of 60 feet in water.",
      "Aquatic Telepathy (Su)": "At 9th level, you gain telepathy (100 feet) and can communicate with creatures with a swim speed or the aquatic or water types regardless of intelligence. You may cast",
      "suggestion": "on such creatures a number of times per day equal to your Charisma modifier. This ability is telepathic and does not require audible or visual components. At 15th level, once per day you can telepathically call and request a service from an aquatic, water, or swimming creature as if using",
      "demand": "or",
      "Raise the Deep (Sp)": "At 15th level, you raise water as per",
      "Deep One (Ex)": "At 20th level, you gain blindsense 60 feet and your body is covered with fine, slippery scales granting DR 10/piercing, resist cold 20, and continuous",
      "freedom of movement": ". Underwater, you gain evasion and blindsight 120 feet, and you are immune to pressure damage from deep water."
  },
    "Arcane Bloodline": {
      "class skill": "Knowledge (any one).",
      "bonus spells": [      "identify (3rd)",
      "invisibility (5th)",
      "dispel magic (7th)",
      "dimension door (9th)",
      "overland flight (11th)",
      "true seeing (13th)",
      "greater teleport (15th)",
      "power word stun (17th)",
      "wish (19th)"
],
      "bonus feats": ["Combat Casting, Improved Counterspell, Improved Initiative, Iron Will, Scribe Scroll, Skill Focus (Knowledge [arcana]), Spell Focus, Still Spell"],
      "bloodline arcana": "Whenever you apply a metamagic feat to a spell that increases the slot used by at least one level, increase the spell's DC by +1. This bonus does not stack with itself and does not apply to spells modified by the Heighten Spell feat.",
      "bloodline powers": "Magic comes naturally to you, but as you gain levels you must take care to prevent the power from overwhelming you.",
      "Arcane Bond (Su)": "At 1st level, you gain an arcane bond, as a wizard equal to your sorcerer level. Your sorcerer levels stack with any wizard levels you possess when determining the powers of your familiar or bonded object. This ability does not allow you to have both a familiar and a bonded item. Once per day, your bonded item allows you to cast any one of your spells known (unlike a wizard's bonded item, which allows him to cast any one spell in his spellbook).",
      "Metamagic Adept (Ex)": "At 3rd level, you can apply any one metamagic feat you know to a spell you are about to cast without increasing the casting time. You must still expend a higher-level spell slot to cast this spell. You can use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 19th level. At 20th level, this ability is replaced by arcane apotheosis.",
      "New Arcana (Ex)": "At 9th level, you can add any one spell from the sorcerer/wizard spell list to your list of spells known. This spell must be of a level that you are capable of casting. You can also add one additional spell at 13th level and 17th level.",
      "School Power (Ex)": "At 15th level, pick one school of magic. The DC for any spells you cast from that school increases by +2. This bonus stacks with the bonus granted by Spell Focus.",
      "Arcane Apotheosis (Ex)": "At 20th level, your body surges with arcane power. You can add any metamagic feats that you know to your spells without increasing their casting time, although you must still expend higher-level spell slots. Whenever you use magic items that require charges, you can instead expend spell slots to power the item. For every three levels of spell slots that you expend, you consume one less charge when using a magic item that expends charges."
  },
    "Astral Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "true strike (3rd)",
      "false life (5th)",
      "sands of time (7th)",
      "wandering star motes (9th)",
      "permanency (11th)",
      "contingency (13th)",
      "ethereal jaunt (15th)",
      "create demiplane (17th)",
      "time stop (19th)"
],
      "bonus feats": ["Combat Reflexes, Dodge, Forge Ring, Improved Initiative, Lightning Reflexes, Quicken Spell, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "When you cast a spell, you can choose to enhance the next spell you cast before the end of your next turn, increasing the enhanced spell's saving throw DC by 1. The level of the enhanced spell must be lower than that of the spell used to activate this ability.",
      "bloodline powers": "You can warp time and project your senses into the Astral Plane.",
      "Astral Warp (Sp)": "At 1st level, you can create a sparkling field within 30 feet that distorts time within a 5-foot cube. This field lasts until the beginning of your next turn. Any creature that enters the area or that starts its turn within the cube takes 1d4 points of force damage + 1 point of force damage per 2 sorcerer levels you have (Fortitude negates). While within the area, a creature takes a -1 penalty on Reflex saves and to AC. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Peerless Speed (Su)": "At 3rd level, you can tap into the power of the Astral's enhanced magical nature to gain the ability to accelerate your spellcasting dramatically. Once per day as a swift action, you can cast one cantrip you know as though it were augmented by the Quicken Spell metamagic feat, without altering the cantrip's level. At 5th level and every 2 levels thereafter, the maximum level of the spell you can augment with this ability increases by 1, to a maximum of an 8th-level spell at 19th level. If you use this ability while on the Astral Plane or on any plane whose enhanced magic trait allows you to cast a spell as if augmented by Quicken Spell, you can instead choose to augment the spell as though you had applied the Empower Spell or Maximize Spell metamagic feats instead.",
      "Astral Voyager (Sp)": "At 9th level, you can send your consciousness to the Astral Plane once per day. This functions as",
      "lesser astral projection": "ability instead functions as",
      "plane shift": "once per day, but only on yourself and willing targets that accompany you, and only from the Material Plane to the Astral Plane and vice versa. At 17th level, the",
      "Arrest the Flow (Su)": "At 15th level, once per day as an immediate action, you can attune yourself to the Astral's timeless nature to halt the effects of one condition or affliction (such as paralyzed, stunned, a poison, or a curse), including permanent and instantaneous conditions, until the end of your next turn. You can use this ability even when a condition or affliction would normally prevent you from doing so, regardless of whether you're targeting that prevention effect's source. At the end of your next turn the condition or affliction resumes its normal effect and the round delayed by this ability does not count toward the condition or affliction's duration. This ability has no effect on hit point damage, ability damage, or the dead condition. Alternatively, you can use this ability to extend the duration of any one effect affecting you until the end of your next turn; this does not extend the duration for any other creatures under the effect. At 19th level, you can use this ability twice per day.",
      "Timeless Soul (Ex)": "At 20th level, the silver skies and conduits of the Astral Plane are permanently connected to you. You become immune to the retroactive aging side effects incurred when leaving a plane with the timeless planar trait. You do not gain negative levels when slain on the Astral Plane while using",
      "astral projection": ", and any effect that would sever your silver cord instead returns you to your physical body if you succeed at a Will save (DC = 10 + the CR of the creature or caster level of the effect that severed the cord). In addition, when applying the Quicken Spell metamagic feat to a spell, it uses up a spell slot only 3 levels higher than the spell's actual level. This ability does not stack with other abilities that would reduce the spell's final adjusted level."
  },
    "Boreal Bloodline": {
      "class skill": "Survival.",
      "bonus spells": [      "enlarge person (3rd)",
      "rage (5th)",
      "elemental aura (cold only) (7th)",
      "wall of ice (9th)",
      "cone of cold (11th)",
      "transformation (13th)",
      "giant form I (15th)",
      "polar ray (17th)",
      "meteor swarm (dealing cold damage) (19th)"
],
      "bonus feats": ["Arcane Strike, Diehard, Empower Spell, Endurance, Exotic Weapon Proficiency, Power Attack, Skill Focus (Intimidate), Toughness"],
      "bloodline arcana": "Whenever you cast a spell with the cold descriptor, increase the spell's save DC by 1.",
      "bloodline powers": "Your connection to primeval winters grants you a mastery of cold magic that few can match, and a savagery that fewer still can withstand.",
      "Cold Steel (Sp)": "At 1st level, you can touch a weapon or up to 50 pieces of ammunition as a standard action, giving it the frost property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the",
      "icy burst": "property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Icewalker (Ex)": "At 3rd level, you gain resist cold 5 and can move across snow and icy surfaces without penalty and without leaving tracks. At 9th level, you gain resist cold 10 and can climb icy surfaces as if using",
      "Snow Shroud (Su)": "At 9th level, you ignore concealment and Perception penalties in natural or magical snow, ice, fog, and similar weather conditions. In addition, you can surround yourself with a cloak of swirling snow for a number of rounds per day equal to your sorcerer level. This power acts and deals damage as a",
      "fire shield": "(",
      "chill shield": ") that sheds no light. It provides a 20% miss chance on attacks made against you and grants a bonus on Stealth checks equal to 1/2 your sorcerer level in snowy or icy areas. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.",
      "Blizzard (Sp)": "At 15th level, you can create a savage winter storm centered on you. This power acts as",
      "control winds": ", but in addition the entire area (not including the \"eye\"at the center of the storm) is affected as a",
      "sleet storm": "and all in the area are exposed to extreme cold. You may use this ability once per day.",
      "Child of Ancient Winters (Su)": "At 20th level, you gain the cold subtype and you become immune to fatigue and exhaustion. In addition, you gain immunity to sneak attacks and critical hits. This power causes you to gain vulnerability to fire."
  },
    "Celestial Bloodline": {
      "class skill": "Heal.",
      "bonus spells": [      "bless (3rd)",
      "resist energy (5th)",
      "magic circle against evil (7th)",
      "remove curse (9th)",
      "flame strike (11th)",
      "greater dispel magic (13th)",
      "banishment (15th)",
      "sunburst (17th)",
      "gate (19th)"
],
      "bonus feats": ["Dodge, Extend Spell, Iron Will, Mobility, Mounted Combat, Ride-By Attack, Skill Focus (Knowledge [religion]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell of the summoning subschool, the creatures summoned gain DR/evil equal to 1/2 your sorcerer level (minimum 1). This does not stack with any DR the creature might have.",
      "bloodline powers": "Your celestial heritage grants you a great many powers, but they come at a price. The lords of the higher planes are watching you and your actions closely.",
      "Heavenly Fire (Sp)": "Starting at 1st level, you can unleash a ray of heavenly fire as a standard action, targeting any foe within 30 feet as a ranged touch attack. Against evil creatures, this ray deals 1d4 points of damage + 1 for every two sorcerer levels you possess. This damage is divine and not subject to energy resistance or immunity. This ray heals good creatures of 1d4 points of damage + 1 for every two sorcerer levels you possess. A good creature cannot benefit from your heavenly fire more than once per day. Neutral creatures are neither harmed nor healed by this effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Celestial Resistances (Ex)": "At 3rd level, you gain resist acid 5 and resist cold 5. At 9th level, your resistances increase to 10.",
      "Wings of Heaven (Su)": "At 9th level, you can sprout feathery wings and fly for a number of minutes per day equal to your sorcerer level, with a speed of 60 feet and good maneuverability. This duration does not need to be consecutive, but it must be used in 1 minute increments.",
      "Conviction (Su)": "At 15th level, you can reroll any one ability check, attack roll, skill check, or saving throw you just made. You must decide to use this ability after the die is rolled, but before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability once per day.",
      "Ascension (Su)": "At 20th level, you become infused with the power of the heavens. You gain immunity to acid, cold, and petrification. You also gain resist electricity 10, resist fire 10, and a +4 racial bonus on saves against poison. Finally, you gain unlimited use of the wings of heaven ability. Finally, you gain the ability to speak with any creature that has a language (as per the",
      "tongues": "spell)."
  },
    "Daemon Bloodline": {
      "class skill": "Heal.",
      "bonus spells": [ "ray of enfeeblement (3rd)",
      "touch of idiocy (5th)",
      "vampiric touch (7th)",
      "contagion (9th)",
      "blight (11th)",
      "circle of death (13th)",
      "waves of exhaustion (15th)",
      "horrid wilting (17th)",
      "soul bind (19th)"],
      "bonus feats": ["Diehard, Endurance, Fast Healer*, Great Fortitude, Heroic Defiance*, Heroic Recovery*, Sickening Spell*, Toughness"],
      "bloodline arcana": "Whenever you cast a spell that kills one or more living creatures with an Intelligence score of 3 or higher, the caster level of any spell you cast in the next round increases by +1 for each creature your first spell killed. This ability does not stack with other effects that increase your effective caster level, and you cannot gain a bonus greater than 1/2 your Charisma modifier (minimum 1). The second spell you cast must be of an equal or lower level than the first one.",
      "bloodline powers": "Like that of a daemon, your magic derives from painful and lingering death.",
      "Advanced Player's Guide": "Heal. :",
      "Wasting Ray (Sp)": "At 1st level, as a standard action, you can impose either starvation or thirst upon a living creature you can see within 30 feet. This requires the creature to make a Constitution check each round (DC 10 + 1 for each previous check) to avoid taking 1d6 points of nonlethal damage. The creature must continue to make these checks until, as a full-round action, it quenches its thirst or sates its hunger (see pages 444-445 of the",
      "Pathfinder RPG Core Rulebook": "for more information on starvation and thirst). You can use this ability a number of times per day equal to 3 + your Charisma modifier, but can only apply it once every 24 hours to any given creature. Creatures that do not need to eat are immune to this effect.",
      "Daemonic Resistances (Ex)": "At 3rd level, you gain resist acid 5 and a +2 bonus on saving throws made against poison and death effects. At 9th level, your resistance to acid increases to 10 and your bonus on saving throws against poison and death effects increases to +4.",
      "Age Out (Su)": "At 9th level, you gain the ability to instantly recover from most harmful effects by temporarily aging yourself decades in a matter of moments. As a standard action, you can shift your effective age to the next highest aging step (for example, from adulthood to middle age). Each time you do this, any debilitating condition or effect currently affecting you that initially allowed a Will or Fortitude saving throw immediately ends. When you age yourself in this way, you take the normal penalties associated with growing older (see page 169 of the",
      "Core Rulebook": ") but gain none of the benefits. You cannot use this power to age beyond venerable, recover hit point damage, or remove effects that did not or do not allow a Will or Fortitude saving throw to negate. You return to your actual age 24 hours after the last time you used this ability, and all penalties to ability scores as a result of advanced age are then removed.",
      "Wound Warp (Sp)": "At 15th level, you gain the ability to travel across the battlefield by literally erupting from the fatal wounds of deceased creatures. As a standard action once per day, you can teleport to an unoccupied square adjacent to any dead creature within 10 feet per caster level. Any creatures adjacent to the square you teleport to take 4d6 points of acid damage as you burst into being and shower them with acidic bile. Creatures that make successful Reflex saves (DC 10 + 1/2 your sorcerer level + your Charisma modifier) take half damage. This ability otherwise functions like",
      "dimension door": ". At 20th level, you can use this ability twice per day.",
      "One with Abaddon (Su)": "At 20th level, your body embraces the unspeakable power of your daemon lineage. You gain immunity to acid, death effects, and poison. You also gain DR 5/good or silver and resistance to cold 10, electricity 10, and fire 10."
  },
    "Deep Earth Bloodline": {
      "class skill": "Knowledge (dungeoneering).",
      "bonus spells": [      "expeditious excavation (3rd)",
      "darkvision (5th)",
      "shifting sand (7th)",
      "stoneskin (9th)",
      "spike stones (11th)",
      "stone tell (13th)",
      "repel metal or stone (15th)",
      "earthquake (17th)",
      "clashing rocks (19th)"
],
      "bonus feats": ["Acrobatic Steps, Alertness, Blind-Fight, Forge Ring, Nimble Moves, Skill Focus (Perception), Stealthy, Still Spell"],
      "bloodline arcana": "Whenever you and the target of your spell are both underground, increase the spell's save DC by +1.",
      "bloodline powers": "The powers of the living rock are within you, and your communion with the strength of stone is refined and enhanced as your power grows.",
      "Tremor (Sp)": "At 1st level, as a standard action, you can cause the ground to shake beneath a single creature within 30 feet, functioning as a trip maneuver using your sorcerer level plus your Charisma modifier in place of your CMB. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Rockseer (Su)": "At 3rd level, you gain the stonecunning trait as a dwarf; if already a dwarf, your bonus improves to +4. At 9th level, you gain tremorsense 30 feet. At 15th level, you can see through solid objects as if using a",
      "ring of x-ray vision": "for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.",
      "Crystal Shard (Sp)": "At 9th level, you can touch a metal or stone weapon (or up to 50 pieces of ammunition) as a standard action, giving it the",
      "bane": "property against any creature with the earth subtype, oozes, or constructs made of stone or metal, for 1 minute. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.",
      "Earth Glide (Ex)": "At 15th level, you can glide through any sort of natural earth or stone as easily as a fish swims through water, with a burrow speed equal to half your normal speed. You do not leave a tunnel or trace of your passage. You can use this ability for 1 minute per sorcerer level each day. The duration need not be continuous, but it must be used in 1-minute increments.",
      "Strength of Stone (Su)": "At 20th level, your flesh becomes as hard as stone, giving you DR 10/adamantine, and you become immune to petrification. You suffer no penalties while squeezing through tight spaces and are immune to bull rush, drag, grapple, reposition, and trip maneuvers, and to push and pull effects as long as you are standing on the ground."
  },
    "Destined Bloodline": {
      "class skill": "Knowledge (history).",
      "bonus spells": [      "alarm (3rd)",
      "blur (5th)",
      "protection from energy (7th)",
      "freedom of movement (9th)",
      "break enchantment (11th)",
      "mislead (13th)",
      "spell turning (15th)",
      "moment of prescience (17th)",
      "foresight (19th)"
],
      "bonus feats": ["Arcane Strike, Diehard, Endurance, Leadership, Lightning Reflexes, Maximize Spell, Skill Focus (Knowledge [history]), Weapon Focus"],
      "bloodline arcana": "Whenever you cast a spell with a range of \"personal,\"you gain a luck bonus equal to the spell's level on all your saving throws for 1 round.",
      "bloodline powers": "You are destined for great things, and the powers that you gain serve to protect you.",
      "Touch of Destiny (Sp)": "At 1st level, you can touch a creature as a standard action, giving it an insight bonus on attack rolls, skill checks, ability checks, and saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Fated (Su)": "Starting at 3rd level, you gain a +1 luck bonus on all of your saving throws and to your AC during surprise rounds (see Combat) and when you are otherwise unaware of an attack. At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.",
      "It Was Meant To Be (Su)": "At 9th level, you may reroll any one attack roll, critical hit confirmation roll, or level check made to overcome spell resistance. You must decide to use this ability after the first roll is made but before the results are revealed by the GM. You must take the second result, even if it is worse. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day.",
      "Within Reach (Su)": "At 15th level, your ultimate destiny is drawing near. Once per day, when an attack or spell that causes damage would result in your death, you may attempt a DC 20 Will save. If successful, you are instead reduced to -1 hit points and are automatically stabilized. The bonus from your fated ability applies to this save.",
      "Destiny Realized (Su)": "At 20th level, your moment of destiny is at hand. Any critical threats made against you only confirm if the second roll results in a natural 20 on the die. Any critical threats you score with a spell are automatically confirmed. Once per day, you can automatically succeed at one caster level check made to overcome spell resistance. You must use this ability before making the roll."
  },
    "Div Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "disguise self (3rd)",
      "touch of idiocy (5th)",
      "deeper darkness (7th)",
      "bestow curse (9th)",
      "insect plague (11th)",
      "disintegrate (13th)",
      "insanity (15th)",
      "earthquake (17th)",
      "wish (19th)"
],
      "bonus feats": ["Blind-Fight, Deceitful, Empower Spell, Improved Initiative, Iron Will, Lightning Reflexes, Persuasive, Power Attack"],
      "bloodline arcana": "Whenever you deal damage to more than one creature with a spell that affects an area, the save DCs of your spells increase by 1 for 1d4 rounds.",
      "bloodline powers": "The corrupt blood within you grants you powers to devastate the works and bonds of mortals.",
      "Spoiling Touch (Su)": "At 1st level, you can impose the broken condition upon one Medium or smaller object by making a successful melee touch attack. Magical items or objects carried or worn by a creature are allowed a Fortitude save to resist this effect. Multiple uses of this effect do not stack. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Div Resistances (Ex)": "At 3rd level, you gain fire resistance 5 and a +2 bonus on saving throws against poison. At 9th level, your resistance to fire increases to 10 and your bonus on saving throws against poison increases to +4.",
      "Corrupting Aura (Ex)": "At 9th level, you can surround yourself with an aura of corrupting energy for a number of rounds per day equal to your sorcerer level. Any creature within 10 feet of you takes 1d6 points of nonlethal damage + 1 for every 2 sorcerer levels you possess, and it is sickened for 1 round. In addition, any creature within the aura that attempts casting a divine spell must succeed at a caster level check (DC 15 + double the level of the spell) or lose the spell. You can use this ability once per day at 9th level, twice per day at 17th, and three times per day at 20th.",
      "Squander (Su)": "At 15th level, you gain the ability to force others to waste the opportunities they are given. Once per day as a standard action, you can cause a target within 30 feet to gain the staggered condition for a number of rounds equal to your sorcerer level. The duration is halved if the target makes a successful Will save (DC 10 + 1/2 your sorcerer level + your Cha modifier).",
      "Ahriman's Favor (Su)": "At 20th level, you are filled with Ahriman's wickedness. You gain immunity to fire and poison. You also gain acid resistance 10 and electricity resistance 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet."
  },
    "Djinni Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [  "shocking grasp (3rd)",
      "invisibility (5th)",
      "fly (7th)",
      "minor creation (9th)",
      "overland flight (11th)",
      "chain lightning (13th)",
      "plane shift(15th)",
      "greater planar binding (17th)",
      "wish (19th)"
],
      "bonus feats": ["Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to electricity. This also changes the spell's descriptors to match this energy type.",
      "bloodline powers": "Like a djinni, you have both natural power over air and several other genie-based abilities.",
      "Electricity Ray (Sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of electricity damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Elemental Resistance (Ex)": "At 3rd level, you gain electricity resistance 10. Your electricity resistance increases to 20 at 9th level.",
      "Whirlwind (Su)": "At 9th level, you gain the ability to turn into a 10-foot-high whirlwind once per day for 1 round per sorcerer level.",
      "Elemental Movement (Su)": "At 15th level, you gain a fly speed of 60 feet with average maneuverability.",
      "Power of the Djinn (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast",
      "limited wish": "as a spell-like ability. Such wishes must begin with the words \"I wish,\"and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component. You also become immune to electricity damage, and can use"
  },
    "Draconic Bloodline": {
      "class skill": "Perception.",
      "bonus spells": [      "mage armor (3rd)",
      "resist energy (5th)",
      "fly (7th)",
      "fear (9th)",
      "spell resistance (11th)",
      "form of the dragon I (13th)",
      "form of the dragon II (15th)",
      "form of the dragon III (17th)",
      "wish (19th)"
],
      "bonus feats": ["Blind-Fight, Great Fortitude, Improved Initiative, Power Attack, Quicken Spell, Skill Focus (Fly), Skill Focus (Knowledge [arcana]), Toughness"],
      "bloodline arcana": "Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, that spell deals +1 point of damage per die rolled",
      "bloodline powers": "The power of dragons flows through you and manifests in a number of ways. At 1st level, you must select one of the chromatic or metallic dragon types. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your dragon type, as noted on the following table.",
      "Energy Types": "Several of these new draconic bloodline options include nonstandard damage types. For the sake of game balance, many of the damage types available to the bloodlines below somewhat differ from those produced by the parent dragon. Specifically, force energy, negative energy, and sonic energy have been altered to different types of energy. In cases where a dragon's energy type is listed as physical damage (such as bludgeoning or piercing), use that damage type when determining your breath weapon damage. For the purpose of the dragon resistance bloodline power, you gain DR equal to half the energy resistance you would normally gain against all attacks of that specific damage type. A character with the power of wyrms bloodline power gains immunity to her bloodline's damage type. For all other purposes, such as archetypes, bloodline powers, and feats, treat that dragon's energy type as fire.",
      "Variant bloodline arcana": "Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, you can reroll a number of damage dice equal to half the spell's level.",
      "Claws (Su)": "Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack action using your full base attack bonus. Each of these attacks deals 1d4 points of damage plus your Strength modifier (1d3 if you are Small). At 5th level, these claws are considered magic weapons for the purpose of overcoming DR. At 7th level, the damage increases by one step to 1d6 points of damage (1d4 if you are Small). At 11th level, these claws deal an additional 1d6 points of damage of your energy type on a successful hit. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.",
      "Dragon Resistances (Ex)": "At 3rd level, you gain resist 5 against your energy type and a +1 natural armor bonus. At 9th level, your energy resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.",
      "Breath Weapon (Su)": "At 9th level, you gain a breath weapon. This breath weapon deals 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of the breath receive a Reflex save for half damage. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The shape of the breath weapon depends on your dragon type (as indicated on the above chart). At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day.",
      "Wings (Su)": "At 15th level, leathery dragon wings grow from your back as a standard action, giving you a fly speed of 60 feet with average maneuverability. You can dismiss the wings as a free action.",
      "Power of Wyrms (Su)": "At 20th level, your draconic heritage becomes manifest. You gain immunity to paralysis, sleep, and damage of your energy type. You also gain blindsense 60 feet.  Chromatic and metallic dragons remain the most common dragons to impart their legacy onto other species. The bloodrager and sorcerer classes each include a draconic bloodline that assumes the character's lineage is somehow connected with the power of a chromatic or metallic dragon. Presented below are expanded options for the existing draconic bloodlines, increasing the selection of heritages to include the numerous new true dragons presented in the many",
      "Pathfinder RPG Bestiary": "volumes. Each of the draconic bloodlines below alters the bloodrager's or sorcerer's bloodline arcana. : Several of these new draconic bloodline options include nonstandard damage types. For the sake of game balance, many of the damage types available to the bloodlines below somewhat differ from those produced by the parent dragon. Specifically, force energy, negative energy, and sonic energy have been altered to different types of energy. In cases where a dragon's energy type is listed as physical damage (such as bludgeoning or piercing), use that damage type when determining your breath weapon damage. For the purpose of the dragon resistance bloodline power, you gain DR equal to half the energy resistance you would normally gain against all attacks of that specific damage type. A character with the power of wyrms bloodline power gains immunity to her bloodline's damage type. For all other purposes, such as archetypes, bloodline powers, and feats, treat that dragon's energy type as fire. Though many of the enigmatic esoteric dragons remain aloof or intentionally distant from mortal affairs, occult dragons are the most likely to imprint their bloodline onto humanoids. Often such draconic blood is the result of ongoing experimentation. Scions of other esoteric dragons are far more unusual; such bloodlines usually result from explorers traveling the realms where these distant dragons dwell and being exposed to some spectacular and illunderstood power. : When selecting spells known, you can choose spells from the psychic class spell list (",
      "Pathfinder RPG Occult Adventures 69": "). The psychic spells you select must normally be unavailable to your class. You can know only a number of psychic spells equal to the highest level spell you can cast from your class spell list, based on your current class level. When you're casting these spells, they function as psychic magic instead of arcane. You use thought and emotion components (",
      "Occult Adventures 144": ") instead of verbal and somatic components when casting these spells.  *Choose one when the bloodline is first selected The blood of imperial dragons is well known throughout the lands of Tian Xia, where such dragons form a strong part of much of the continent's mythology. This is particularly true in Xa Hoi, where imperial dragons rule. Imperial dragons in other lands may vary in their interactions with humanoids, but universally accept the praise (and fear) of those around them. Their connection to the land makes the blood of these dragons a powerful arcane catalyst in the making of heroes. : Whenever you cast a spell that affects a creature with the shaken, frightened, or panicked condition, increase the spell's save DC by 1.  The interests of outer dragons take them across the cosmos. Strange devices or experimentation are most likely to lead to the addition of outer dragon blood into a world's ecosystem. The hidden blood of an outer dragon in a family's lineage is difficult to detect or stamp out. On Golarion, these dragons most commonly find themselves drawn to the fabled land of Numeria and its alien technology, though they usually refuse to share any of their insights with that nation's residents. : Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, if a creature is damaged by the spell, that creature cannot take a 5-foot step for 1 round. This effect occurs only when you're using spells that require an attack roll (such as chill touch or scorching ray) or spells that allow a save (such as fireball or lightning bolt). A successful save against the damage or effects of the spell also negates this additional effect.  Born from the elemental planes or the Shadow Plane, primal dragons are infused with primeval power. These dragons traveled to the Material Plane in ages past, and many of their kind continue to spread their blood and magical influence among the humanoid races of the world. Even the malign umbral dragons prosper in the caverns of the Darklands and the mountains of Nidal. Any exposure to or experimentation with primal magics may introduce primal dragon blood into a lineage. : Whenever you cast a spell with an energy descriptor that matches your draconic bloodline's energy type, you can reroll a number of damage dice equal to half the spell's level."
  },
    "Dreamspun Bloodline": {
      "class skill": "Sense Motive.",
      "bonus spells": [      "sleep (3rd)",
      "augury (5th)",
      "deep slumber (7th)",
      "divination (9th)",
      "dream (11th)",
      "shadow walk (13th)",
      "vision (15th)",
      "moment of prescience (17th)",
      "astral projection (19th)"
],
      "bonus feats": ["Alertness, Blind-Fight, Combat Expertise, Deceitful, Heighten Spell, Improved Feint, Persuasive, Skill Focus (Sense Motive)"],
      "bloodline arcana": "Whenever you target a single creature with a spell, you gain an insight bonus equal to half the spell's level (minimum +1) for 1 round to your AC and saving throws against any spell or attack made by that creature.",
      "bloodline powers": "You reach out into and through the world of dreams to touch the minds and destinies of those around you.",
      "Lullaby (Sp)": "At 1st level, you can use",
      "lullaby": "as a spell-like ability a number of times per day equal to 3 + your Charisma modifier. This effect lasts for 1 minute and does not require concentration. The penalty on saves versus sleep effects increases to -4.",
      "Combat Precognition (Su)": "Your insight into the future grants you an advantage in combat. At 3rd level and every 4 levels thereafter, you gain a +1 insight bonus on initiative checks.",
      "Dreamshaper (Sp)": "At 9th level, you can manipulate the dreamscape of others, drawing forth or tampering with their subconscious minds. This power allows you to tamper with the target's memories as if using",
      "modify memory": ", or you may ask questions as if using",
      "speak with dead": "upon a corpse. A successful Will save negates the effect. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier, with further modifiers as the",
      "nightmare": "spell. You can use this ability once per day at 9th level. At 17th level you can use this ability twice per day, and at 20th, three times per day.",
      "Eye of Somnus (Sp)": "At 15th level, you can project your consciousness as if using",
      "arcane eye": "to become visible. The eye can no longer be moved, but it acts as a",
      "symbol of sleep": "to all who see it. You may use this power once per day.",
      "Solipsism (Ex)": "At 20th level, you can drift into the dream world, fading from the world around you. You can become incorporeal for 1 minute per sorcerer level. You gain the incorporeal subtype and take only half damage from corporeal magical attacks (you take no damage from nonmagical weapons and objects). Your spells deal only half damage to corporeal creatures, but spells and abilities that do not deal damage function normally. The duration need not be continuous, but it must be used in 1-minute increments."
  },
    "Ectoplasm Bloodline": {
      "class skill": "Stealth.",
      "bonus spells": [      "obscuring mist (3rd)",
      "ghost whip (5th)",
      "ectoplasmic snare (7th)",
      "spirit-bound blade (9th)",
      "wall of ectoplasm (11th)",
      "ethereal jaunt (13th)",
      "ectoplasmic eruption (15th)",
      "create demiplane (17th)",
      "etherealness (19th)"
],
      "bonus feats": ["Blind-Fight, Dodge, Ectoplasmic Spell"],
      "bloodline arcana": "Incorporeal creatures take 75% of the normal amount of damage from your damaging spells, and when incorporeal creatures attempt saving throws against your non-damaging spells, they roll twice and must take the lower result.",
      "bloodline powers": "You can control and emit ectoplasm, leaving you less grounded in the physical world.",
      "Entangling Ectoplasm (Sp)": "At 1st level, you can create a ball of ectoplasm and hurl it at targets within 30 feet. This ectoplasm acts as a tanglefoot bag that can also entangle incorporeal creatures. The ectoplasm dissipates within 1d3 rounds. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Ectoplasmic Reach (Su)": "At 3rd level, you can exude small tendrils of ectoplasm that can be used to make melee touch attacks as part of a spell with a range of touch. You can make melee touch attacks as if you had an additional 5 feet of reach. You must have a free hand with which to direct the ectoplasm. This ability does not otherwise increase your threatened area. At 11th level, this additional reach increases to 10 feet. At 17th level, this additional reach increases to 15 feet.",
      "Ectoplasmic Form (Sp)": "At 9th level, you can transform into a cloud of ectoplasm. Treat this as",
      "gaseous form": ", except that you can fly at a speed of 30 feet, and you can solidify your form sufficiently to carry small objects, though fine manipulation is impossible. You can use this ability for a number of minutes per day equal to your sorcerer level. These minutes need not be consecutive, but must be used in 1-minute increments.",
      "Malevolent Ectoplasm (Sp)": "At 15th level, your ectoplasmic tendrils can lash out at creatures around you. Treat this as a",
      "black tentacles": "effect centered on your position, but the tentacles can also grapple ethereal and incorporeal creatures, and they do not affect you (though they still affect your allies). You can use this ability a number of rounds per day equal to your sorcerer level. These rounds need not be consecutive.",
      "Ectoplasmic Body (Ex)": "At 20th level, you are more ectoplasm than flesh. You become immune to sneak attacks and critical hits and gain DR 5/slashing."
  },
    "Efreeti Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "enlarge person (3rd)",
      "scorching ray (5th)",
      "fireball (7th)",
      "wall of fire (9th)",
      "persistent image (11th)",
      "planar binding (13th)",
      "plane shift (15th)",
      "giant form II (17th)",
      "wish (19th)"
],
      "bonus feats": ["Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to fire. This also changes the spell's descriptors to match this energy type.",
      "bloodline powers": "Like an efreeti, you have both natural power over air and several other genie-based abilities.",
      "Fire Ray (Sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of fire damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Elemental Resistance (Ex)": "At 3rd level, you gain fire resistance 10. At 9th level, your fire resistance increases to 20.",
      "Efreeti Form (Su)": "At 9th level, you gain the ability to assume the form of an efreeti once per day. This acts like the spell",
      "giant form I": ", except you only use it to become an efreeti and its duration is 1 round per level. While in this form, you also gain an efreeti's heat ability.",
      "Elemental Movement (Su)": "At 15th level, your base speed increases by +30 feet.",
      "Power of the Efreet (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast",
      "limited wish": "as a spell-like ability. Such wishes must begin with the words \"I wish,\"and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component. You also become immune to fire damage, and can use"
  },
    "Elemental Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "burning hands* (3rd)",
      "scorching ray* (5th)",
      "protection from energy (7th)",
      "elemental body I (9th)",
      "elemental body II (11th)",
      "elemental body III (13th)",
      "elemental body IV (15th)",
      "summon monster VIII (17th) (elementals only)",
      "elemental swarm (19th)"
],
      "bonus feats": ["Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to match the type of your bloodline. This also changes the spell's type to match the type of your bloodline.",
      "bloodline powers": "One of the four elements infuses your being, and you can draw upon its power in times of need. At first level, you must select one of the four elements: air, earth, fire, or water. This choice cannot be changed. A number of your abilities grant resistances and deal damage based on your element, as noted below.",
      
      "Elemental Ray (Sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of damage of your energy type + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Elemental Resistance (Ex)": "At 3rd level, you gain energy resistance 10 against your energy type. At 9th level, your energy resistance increases to 20.",
      "Elemental Blast (Sp)": "At 9th level, you can unleash a blast of elemental power once per day. This 20-foot-radius burst does 1d6 points of damage of your energy type per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Creatures that fail their saves gain vulnerability to your energy type until the end of your next turn. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.",
      "Elemental Movement (Su)": "At 15th level, you gain a special movement type or bonus. This ability is based on your chosen element, as indicated on the above chart.",
      "Elemental Body (Su)": "At 20th level, elemental power surges through your body. You gain immunity to sneak attacks, critical hits, and damage from your energy type."
  },
    "Fey Bloodline": {
      "class skill": "Knowledge (nature).",
      "bonus spells": [      "entangle (3rd)",
      "hideous laughter (5th)",
      "deep slumber (7th)",
      "poison (9th)",
      "tree stride (11th)",
      "mislead (13th)",
      "phase door (15th)",
      "irresistible dance (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Dodge, Improved Initiative, Lightning Reflexes, Mobility, Point-Blank Shot, Precise Shot, Quicken Spell, Skill Focus (Knowledge [nature])"],
      "bloodline arcana": "Whenever you cast a spell of the compulsion subschool, increase the spell's DC by +2.",
      "bloodline powers": "You have always had a tie to the natural world, and as your power increases, so does the influence of the fey over your magic.",
      "Laughing Touch (Sp)": "At 1st level, you can cause a creature to burst out laughing for 1 round as a melee touch attack. A laughing creature can only take a move action but can defend itself normally. Once a creature has been affected by laughing touch, it is immune to its effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Woodland Stride (Ex)": "At 3rd level, you can move through any sort of undergrowth (such as natural thorns, briars, overgrown areas, and similar terrain) at your normal speed and without taking damage or suffering any other impairment. Thorns, briars, and overgrown areas that have been magically manipulated to impede motion, however, still affect you.",
      "Fleeting Glance (Sp)": "At 9th level, you can turn invisible for a number of rounds per day equal to your sorcerer level. This ability functions as",
      "greater invisibility": ". These rounds need not be consecutive.",
      "Fey Magic (Su)": "At 15th level, you may reroll any caster level check made to overcome spell resistance. You must decide to use this ability before the results are revealed by the GM. You must take the second result, even if it is worse. You can use this ability at will.",
      "Soul of the Fey (Su)": "At 20th level, your soul becomes one with the world of the fey. You gain immunity to poison and DR 10/cold iron. Creatures of the animal type do not attack you unless compelled to do so through magic. Once per day, you can cast",
      "shadow walk": "as a spell-like ability using your sorcerer level as your caster level."
  },
    "Ghoul Bloodline": {
      "class skill": "Stealth.",
      "bonus spells": [      "ray of enfeeblement (3rd)",
      "feast of ashes (5th)",
      "vampiric touch (7th)",
      "fear (9th)",
      "hungry earth (11th)",
      "move earth (13th)",
      "control undead (15th)",
      "unholy aura (17th)",
      "wail of the banshee (19th)"
],
      "bonus feats": ["Arcane Strike, Combat Casting, Power Attack, Skill Focus (Knowledge [religion]), Spell Focus (necromancy), Toughness, Warren Digger, Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell of the necromancy school that deals hit point damage, you are healed of 1 hit point per spell level.",
      "bloodline powers": "The dark energies that fuel your existence and undying hunger form the basis of your power.",
      "Ghoulish Claws (Su)": "Starting at 1st level, you can grow claws as a free action. These claws are treated as natural weapons, allowing you to make two claw attacks as a full attack using your full base attack bonus. Each of these attacks deals 1d4 points of damage + your Strength modifier (1d3 if you are Small). At 5th level, creatures damaged with your claw attack are paralyzed for 1 round, as the ghoul ability (Fortitude negates). At 7th level, the duration of the paralysis increases to 1d4+1 rounds, and the claws are considered magic weapons for the purpose of overcoming DR. You can use your claws for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive. If you're a ghoul with this bloodline, instead of gaining this ability, your levels in sorcerer stack with your racial Hit Dice when determining the DC of your paralysis and disease special abilities.",
      "Leathery Skin (Ex)": "At 3rd level, you gain cold resistance 5 and a +1 natural armor bonus to AC. At 9th level, your cold resistance increases to 10 and natural armor bonus increases to +2. At 15th level, your natural armor bonus increases to +4.",
      "Ravenous Frenzy (Ex)": "At 9th level, you gain the benefits of",
      "haste": "for a number of rounds per day equal to your sorcerer level. These rounds don't need to be consecutive. Each time you hit a creature with two or more claw attacks during a full attack while affected by this ability, that creature takes 1d4 points of bleed damage.",
      "Earth Crawler (Su)": "At 15th level, you gain a burrow speed of 30 feet. Additionally, as long as you are surrounded by at least 5 feet of dirt or natural stone on all sides, you gain fast healing 10. You can heal a number of hit points per day equal to 10 + your sorcerer level with this ability.",
      "Ghoulish Aspect (Su)": "At 20th level, you take on aspects of the nature and appearance of ghouls. You no longer feel the need to eat and are immune to hunger (though you are still able to consume flesh if you choose to). You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/-. Additionally, you gain the stench ability with a radius of 10 feet. Creatures that fail their Fortitude saving throws are sickened for 1d6+4 minutes. Use half your sorcerer level instead of half your racial Hit Dice to determine the saving throw DC."
  },
    "Harrow Bloodline": {
      "class skill": "Knowledge (history).",
      "bonus spells": [      "ill omen (3rd)",
      "augury (5th)",
      "harrowing (7th)",
      "shadow conjuration (9th)",
      "contact other plane (11th)",
      "legend lore (13th)",
      "greater harrowing (15th)",
      "moment of prescience (17th)",
      "weird (19th)"
],
      "bonus feats": ["Alertness, Craft Wondrous Item, Extend Spell, Fortune Teller"],
      "bloodline arcana": "Whenever you cast a divination spell that requires a percentage roll, add 5 to the result of your roll. In addition, you can roll the percentage dice twice and use the result you prefer. Your maximum percentage chance of receiving a meaningful and accurate reply for divination spells is 100%, instead of the usual 90%.",
      "bloodline powers": "Your connection to the harrow gives you uncanny insight into both the future and the motivations of mortals.",
      "Twisted Fortune (Sp)": "At 1st level, you can use your supernatural insight to hijack the fortunes of a single target within 30 feet. For 1 round, the target becomes confused and cannot directly control its actions (Will negates). Once a creature has been affected by twisted fortune, it is immune to the ability's effects for 24 hours. You can use this ability a number of times per day equal to 3 + your Cha modifier.",
      "See It Coming (Su)": "At 3rd level, you gain a +1 luck bonus on the saving throw type of your choice (Fortitude, Reflex, or Will). As a full-round action, you can change which saving throw your luck bonus applies to. At 7th level and every 4 levels thereafter, this bonus increases by 1, to a maximum of +5 at 19th level.",
      "Invoke the Harrow (Su)": "At 9th level, you can draw a random harrow card from a complete harrow deck you own as a standard action and channel the aspects of the card into your body. You take on superficial traits featured on the card and gain a +4 enhancement bonus to the ability score associated with the card's suit. You can invoke the harrow for a number of minutes per day equal to your sorcerer level; the duration need not be continuous, but it must be used in 1-minute increments.",
      "Harrowed Home (Sp)": "At 15th level, your otherworldly connection is so strong that your subconscious cleaves off a small portion of the Harrowed Realm for use as your own private sanctuary. Your harrowed home is created the first time you use this ability, and is decorated as a garish ref lection of your personality. Thereafter, you always visit this same home. You can place a portal to your harrowed home once every 24 hours, but placing a new portal destroys the previous one, and you can not move the entrance while you are inside. As long as you are not in your harrowed home, time ceases to pass for anything and anyone still in your pocket dimension; creatures cannot move, objects do not decay, and everything remains exactly the same as you left it the last time you visited the plane. Time continues as normal whenever you are inside your harrowed home. This ability is otherwise identical to",
      "Kin to the Old Tales (Su)": "At 20th level, your soul becomes host to the otherworldly energies of the harrow. You gain DR 10/cold iron and immunity to curses, paralysis, and sleep. You can always act in the surprise round of combat, and you cannot be caught flat-footed. You gain unlimited use of your invoke the harrow ability."
  },
    "Imperious Bloodline": {
      "class skill": "Perform (oratory).",
      "bonus spells": [      "moment of greatness (3rd)",
      "eagle's splendor (5th)",
      "heroism (7th)",
      "threefold aspect (9th)",
      "greater command (11th)",
      "repulsion (13th)",
      "greater age resistance (15th)",
      "prediction of failure (17th)",
      "overwhelming presence (19th)"
],
      "bonus feats": ["Diehard, Endurance, Heroic Defiance, Heroic Recovery, Improved Initiative, Lingering Spell, Magical Aptitude, Persuasive"],
      "bloodline arcana": "Whenever you cast a harmful spell, you gain a bonus equal to the spell's level on Intimidate checks made against any creature adversely effected by that spell until the end of your next turn. Adversely effected typically means damage, but it can also mean debilitating effects or conditions.",
      "bloodline powers": "You draw upon ancestors both legendary and forgotten.",
      "Student of Humanity (Ex)": "At 1st level, you gain Diplomacy, Knowledge (history), Knowledge (local), Knowledge (nobility), and Linguistics as class skills. In addition, when using these skills to learn, study, or gather information about humans, you add an insight bonus equal to your Charisma bonus on such checks.",
      "Heroic Echo (Su)": "At 3rd level, when you receive a morale bonus from any spell, spell-like ability, or magic item, including those you cast on yourself, that bonus increases by +1. At 9th level, this ability also applies to competence bonuses. If you receive a morale effect (or a competence effect at 9th level) that affects an area or multiple targets, as an immediate action you can share your increased bonus with all other recipients. This increase to other participants lasts a number of rounds equal to your Charisma bonus. You can use this ability once per day, plus one time per three levels after 3rd.",
      "Take Your Best Shot (Su)": "At 9th level, if you are targeted by a harmful spell, spell-like ability, or supernatural ability and suffer no harm from it, whether because of a successful saving throw, spell resistance, the attack missing, or some other protection, as an immediate action you can make an Intimidate check to demoralize the creature that produced the effect, but only if the creature that used the harmful effect is within 30 feet and can clearly see and hear you. At 13th level, you can use this ability after succeeding at a saving throw to reduce the effects of an attack (if no save is allowed, you cannot use this ability).",
      "Heroic Legends (Su)": "At 15th level, you may inspire greatness or inspire heroics as a bard of your sorcerer level by sacrificing a spell slot as a swift or move action. The effect lasts a number of rounds equal to the sacrificed spell's level; this duration is doubled for human recipients.",
      "Immortal Legend (Ex)": "At 20th level, you cease aging; no longer need to eat, drink, or sleep; and gain immunity to death effects and energy drain."
  },
    "Impossible Bloodline": {
      "class skill": "Knowledge (engineering).",
      "bonus spells": [      "lesser confusion (3rd)",
      "make whole (5th)",
      "shrink item (7th)",
      "confusion (9th)",
      "fabricate (11th)",
      "animate objects (13th)",
      "insanity (15th)",
      "polymorph any object (17th)",
      "wish (19th)"
],
      "bonus feats": ["Craft Construct, Craft Magic Arms and Armor, Deft Hands, Exotic Weapon Proficiency, Far Shot, Iron Will, Point-Blank Shot, Skill Focus (Knowledge [engineering])"],
      "bloodline arcana": "Constructs are susceptible to your enchantment (compulsion) spells as if they were not mindaffecting. Constructs are treated as living creatures for the purposes of determining which spells affect them.",
      "bloodline powers": "You see the world differently from others, and can mold it to suit your needs.",
      "Disorienting Touch (Sp)": "At 1st level, as a melee touch attack, you can cause a creature to doubt its sense of depth and direction. The target is sickened for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Spontaneous Generation": "At 3rd level, you gain Craft Wondrous Item as a bonus feat. In addition, when you craft a magic item (except a potion, a spell-trigger item, or a spellcompletion item), you may ignore one spell prerequisite without increasing the creation DC. You can ignore an additional spell prerequisite at 9th, 15th, and 20th levels.",
      "Distracting Pattern (Su)": "At 9th level, you can distort the scenery around you for a number of rounds equal to your sorcerer level. This ability provides a 20% miss chance on ranged attacks made against you and grants you a bonus on Stealth checks equal to 1/2 your sorcerer level. You can use this ability once per day at 9th level, twice per day at 17th level, and three times per day at 20th level.",
      "Relativity (Su)": "At 15th level, you can traverse vertical surfaces as easily as you walk on the ground. When climbing, you move at your normal land speed and take none of the penalties associated with climbing. The surface must be able to support your weight, and difficult terrain affects your speed as normal. You are also immune to",
      "reverse gravity": "and similar effects.",
      "Living Paradox (Ex)": "At 20th level, your outward appearance remains the same, but beneath your skin lies not flesh and blood but clockwork gears, miniature galaxies, or something equally uncanny. You gain immunity to disease and poison. You take no additional damage from bleed effects, critical hits, and sneak attacks."
  },
    "Infernal Bloodline": {
      "class skill": "Diplomacy.",
      "bonus spells": [      "protection from good (3rd)",
      "scorching ray (5th)",
      "suggestion (7th)",
      "charm monster (9th)",
      "dominate person (11th)",
      "planar binding (13th)",
      "greater teleport (15th)",
      "power word stun (17th)",
      "meteor swarm (19th)"
],
      "bonus feats": ["Blind-Fight, Combat Expertise, Deceitful, Extend Spell, Improved Disarm, Iron Will, Skill Focus (Knowledge [planes]), Spell Penetration"],
      "bloodline arcana": "Whenever you cast a spell of the charm subschool, increase the spell's DC by +2.",
      "bloodline powers": "You can draw upon the power of Hell, although you must be wary of its corrupting influence. Such power does not come without a price.",
      "Corrupting Touch (Sp)": "At 1st level, you can cause a creature to become shaken as a melee touch attack. This effect persists for a number of rounds equal to 1/2 your sorcerer level (minimum 1). Creatures shaken by this ability radiate an aura of evil, as if they were an evil outsider (see",
      "detect evil": "). Multiple touches do not stack, but they do add to the duration. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Infernal Resistances (Ex)": "At 3rd level, you gain resist fire 5 and a +2 bonus on saving throws made against poison. At 9th level, your resistance to fire increases to 10 and your bonus on poison saving throws increases to +4.",
      "Hellfire (Sp)": "At 9th level, you can call down a column of hellfire. This 10-foot-radius burst does 1d6 points of fire damage per sorcerer level. Those caught in the area of your blast receive a Reflex save for half damage. Good creatures that fail their saves are shaken for a number of rounds equal to your sorcerer level. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.",
      "On Dark Wings (Su)": "At 15th level, you can grow fearsome bat wings as a standard action, giving you a fly speed of 60 feet with average maneuverability. The wings can be dismissed as a free action.",
      "Power of the Pit (Su)": "At 20th level, your form becomes infused with vile power. You gain immunity to fire and poison. You also gain resistance to acid 10 and cold 10, and the ability to see perfectly in darkness of any kind to a range of 60 feet."
  },
    "Kobold Sorcerer Bloodline": {
      "class skill": "Disable Device.",
      "bonus spells": [      "alarm (3rd)",
      "create pit (5th)",
      "explosive runes (7th)",
      "dragon's breath (9th)",
      "transmute rock to mud (11th)",
      "guards and wards (13th)",
      "delayed blast fireball (15th)",
      "form of the dragon III (17th)",
      "imprisonment (19th)"
],
      "bonus feats": ["Alertness, Combat Casting, Defensive Combat Training, Dodge, Improved Initiative, Lightning Reflexes, Silent Spell"],
      "bloodline arcana": "Whenever you cast a spell against a creature that is denied its Dexterity bonus to AC, increase that spell's DC by +2.",
      "bloodline powers": "Like all kobolds, you have a natural talent for ambushing, creating traps, and mining. As your power increases, you discover ever more useful ways to blend your magic with these instinctive talents.",
      "Trap Rune (Sp)": "At 1st level, as a standard action, you can sketch a single, nearly invisible magical rune on any 5-foot-square solid surface. When you create a rune, pick one of the following energy types: acid, cold, electricity, or fire. While the rune is active, the next creature other than you who steps on or touches the rune's area causes the rune to explode. The rune's explosion deals a number of points of energy damage equal to 1d8 + 1 per sorcerer level you possess to anything in its square. A Reflex saving throw halves the damage (DC 10 + 1/2 your sorcerer level + your Charisma modifier). The rune is considered a magical trap for the purpose of perceiving it or disabling it. The DC for both Perception and Disable Device checks is the same as the Reflex saving throw to halve the damage. You can use this ability a number of times per day equal to 3 + your Charisma modifier. Each rune lasts for 24 hours or until discharged.",
      "Trap Sense (Ex)": "At 3rd level, you develop a sixth sense that helps you avoid traps. You gain a +2 bonus on Perception checks made to notice traps. You also gain a +1 bonus on Reflex saves to avoid traps and a +1 dodge bonus to AC against attacks made by traps. These bonuses increase by +1 at 7th level and for every four sorcerer levels you gain thereafter (to a maximum of +5 at 19th level). This bonus stacks with that provided by a rogue's trap sense and similar abilities.",
      "Arcane Ambush (Su)": "At 9th level, as a swift action, you can expend a spell slot in order to grant you and your allies a bonus on attack and damage rolls. This bonus lasts 1 round, is equal to the level of the spell expended, and only applies to opponents your allies are flanking or opponents denied their Dexterity bonus against your allies. You grant this bonus to yourself plus up to one ally for every four sorcerer levels you possess (to a maximum of five allies at 20th level). The allies must be within 30 feet of you and you must have line of effect to each affected ally.",
      "Earth Glide (Su)": "At 15th level, you gain the earth glide universal monster ability with a speed equal to your base speed. This does not give you the ability to breathe while passing through earth, so you must hold your breath or use some alternate method to breathe while using this ability.",
      "Nimble Walker (Su)": "At 20th level, you gain a +5 racial bonus on Reflex saving throws and on Acrobatics checks made to move through a creature's threatened area or through its space. You also gain the ability to breathe while passing through earth using your earth glide ability."
  },
    "Maestro Bloodline": {
      "class skill": "Perform.",
      "bonus spells": [      "ventriloquism (3rd)",
      "hideous laughter (5th)",
      "suggestion (7th)",
      "shout (9th)",
      "dominate person (11th)",
      "mass suggestion (13th)",
      "power word blind (15th)",
      "greater shout (17th)",
      "wail of the banshee (19th)"
],
      "bonus feats": ["Deceitful, Greater Spell Focus (enchantment), Lingering Performance, Persuasive, Skill Focus (Perform), Spell Focus (enchantment), Spellsong, Still Spell"],
      "bloodline arcana": "Whenever you cast a spell with a verbal component and no somatic or material component, you treat your caster level as if it were one higher.",
      "bloodline powers": "You hear music whenever you cast spells, and can use the songs in your head to create magic effects.",
      "Beguiling Voice (Ex)": "At 1st level, you can use the sound of your voice to lull a target creature into taking no action. This ability acts as the",
      "daze": "spell, except it is language-dependent, has a duration of 1 round, and affects a living creature whose Hit Dice do not exceed your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Fascinate (Ex)": "At 3rd level, you gain the ability to use a Perform skill to cause one or more creatures to become fascinated with you. This acts as the fascinate bardic perform ability, except the save DC is 10 + 1/2 your sorcerer level + your Charisma bonus, and it lasts 1 round/level. You may use this ability once per day at 3rd level, twice per day at 8th level, three times per day at 13th level, and four times per day at 18th level.",
      "Perfect Voice (Su)": "At 9th level, you understand all efforts to communicate through sound, and can make yourself understood to any creature able to understand language. You can speak to, and understand the speech of, any creature that understands at least one spoken language. The save DCs of language-dependent spells you cast increase by +1.",
      "Inspire (Sp)": "At 15th level, your artistic magic can inspire your allies to great accomplishments. You can use",
      "greater heroism": "as a spell-like ability. You can use this ability once per day at 15th level, twice per day at 17th level, and three times per day at 19th level.",
      "Grand Maestro (Su)": "At 20th level, the power of pure magic music flows through you. You cast any spell with a verbal component as if it had the Still Spell metamagic feat applied to it, with no increase to the casting time or spell slot required to cast it. You gain immunity to sonic damage and language-dependent spells."
  },
    "Marid Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "obscuring mist (3rd)",
      "see invisibility (5th)",
      "gaseous form (7th)",
      "wall of ice (9th)",
      "persistent image (11th)",
      "elemental body III (13th)",
      "plane shift (15th)",
      "polar ray (17th)",
      "wish (19th)"
],
      "bonus feats": ["Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to cold. This also changes the spell's descriptors to match this energy type.",
      "bloodline powers": "Like a marid, you have both natural power over water and several other genie-based abilities.",
      "Frost Ray (Sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of cold damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Elemental Resistance (Ex)": "At 3rd level, you gain cold resistance 10. At 9th level, your cold resistance increases to 20.",
      "Water's Fury (Su)": "At 9th level, you gain the ability to summon a rushing jet of water from the elemental plane of water and direct it against your foes. As a standard action, you can create a jet of water in a 60-foot line that deals 1d6 points of damage per two sorcerer levels you possess, and blinds the target that was struck for 1d6 rounds. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma bonus) reduces the damage by half and negates the blinding effect.",
      "Elemental Movement (Su)": "At 15th level, you gain a swim speed of 60 feet.",
      "Power of the Marid (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast",
      "limited wish": "as a spell-like ability. Such wishes must begin with the words \"I wish,\"and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component. You become immune to cold damage, and can use"
  },
    "Martyred Bloodline": {
      "class skill": "Perform (oratory).",
      "bonus spells": [      "endure elements (3rd)",
      "surmount affliction** (5th)",
      "heroism (7th)",
      "blessing of fervor* (9th)",
      "death ward (11th)",
      "greater heroism (13th)",
      "joyful rapture** (15th)",
      "mind blank (17th)",
      "overwhelming presence** (19th)"
],
      "bonus feats": ["Diehard, Endurance, Heroic Defiance*, Heroic Recovery*, Leadership, Persuasive, Skill Focus (Perform), Toughness"],
      "bloodline arcana": "Whenever you take damage in battle, your effective caster level increases by 1 during your next turn. This effect does not apply more than once per round",
      "bloodline powers": "You draw upon the power of your ancestor's self-sacrifice.",
      "Pathfinder RPG Advanced Player's Guide": ". Two asterisks (**) indicate a spell or feat from",
      "Pathfinder RPG Ultimate Magic": "Perform (oratory). :",
      "Sacrificial Boon (Su)": "At 1st level, as an immediate action, you can sacrifice 1 hit point in exchange for a +1 sacred bonus on the next damage roll, saving throw, or skill check you make. This bonus only applies as long as you use it by or during your next turn-otherwise both your sacrificed hit point and the bonus are wasted. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Rallying Cry (Su)": "At 3rd level, as a standard action once per day, you can shout a cry instilled with the noble sacrifices of your ancestor. You and any allies within 30 feet who can hear you gain a +1 morale bonus on attack and damage rolls for a number of rounds equal to half your sorcerer level (minimum 1). At 7th level and every four levels thereafter, this bonus increases by +1, to a maximum of +5 at 19th level.",
      "Gift of Blood (Su)": "At 9th level, as a standard action, you can choose to sacrifice some of your hit points to grant an ally double that number in temporary hit points. You can sacrifice up to your character level in hit points when using this ability. These temporary hit points last up to 1 minute per sorcerer level. You cannot heal your sacrificed hit points until your target has lost its temporary hit points. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day.",
      "Sacrificial Exchange (Su)": "At 15th level, as a swift action once per day, you can take 2 points of temporary ability damage to one of your ability scores and add a temporary +2 inherent bonus to any other ability score. This bonus lasts for a maximum of 1 hour per sorcerer level or until you choose to prematurely dismiss it (a free action), during which time the temporary ability damage cannot be healed by any means. After this effect ends, you can heal the ability damage normally. At 20th level, you can use this ability twice per day.",
      "Eternal Martyr (Su)": "At 20th level, your ancestor's act of martyrdom infuses your spirit. You become immune to death effects. Material components for spells and effects to bring you back to life (such as",
      "raise dead": "or",
      "resurrection": ") cost half as much as normal. Your body cannot be turned into an undead creature, as though you were affected by a permanent",
      "hallow": "effect (caster level equal to your sorcerer level)."
  },
    "Naga Bloodline": {
      "class skill": "Knowledge (dungeoneering)",
      "bonus spells": [      "ray of enfeeblement (3rd)",
      "invisibility (15th)",
      "lightning bolt (7th)",
      "poison (9th)",
      "dominate person (11th)",
      "veil (13th)",
      "limited wish (15th)",
      "mass charm monster (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Alertness, Blind-Fight, Combat Casting, Dodge, Improved Initiative, Lightning Reflexes, Skill Focus (Knowledge [dungeoneering]), Stealthy"],
      "bloodline arcana": "Whenever you cast a spell with the poison descriptor, increase the spell's DC by 2.",
      "bloodline powers": "You can draw upon the ancient magic of the nagas to ensnare the minds of lesser creatures and destroy those who would defy your will.",
      "Vanishing (Sp)": "At 1st level, you can cloak yourself in illusory magic as a standard action, making you invisible (as per",
      "Naga Resistances (Ex)": "At 3rd level, you gain a +2 bonus on saving throws against mind-affecting effects and poison effects. At 9th level, this bonus increases to +4.",
      "Ensnaring Eyes (Su)": "At 9th level, add 2 to the save DC of any spell, spell-like ability, or supernatural ability you use that causes a target to become fascinated or that belongs to the charm subschool.",
      "Cast without Hands (Su)": "At 15th level, you learn to eschew the use of your hands when casting spells, as a naga would. Whenever you cast an arcane spell with a somatic component, you can do so even with your hands full, by twisting and gyrating your body. This doubles the arcane spell failure chance from your armor (if any), and you can't use this ability if you are pinned or immobile.",
      "Power of the Naga (Su)": "At 20th level, your form becomes enhanced by the power of the naga. You gain immunity to charm effects, mind-reading effects, and poison. In addition, you can also assume the shape of a naga at will as if using"
  },
    "Nanite Bloodline": {
      "class skill": "Knowledge (engineering).",
      "bonus spells": [      "disguise self (3rd)",
      "defensive shock (5th)",
      "gaseous form (7th)",
      "miasmatic form (9th)",
      "echolocation (11th)",
      "fluid form (13th)",
      "magnetic field (15th)",
      "iron body (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Blind-Fight, Combat Expertise, Dodge, Eldritch Heritage"],
      "bloodline arcana": "Whenever you cast a spell from the transmutation school and target only yourself, increase the spell's duration by 50%. This does not stack with metamagic feats or abilities such as Extend Spell.",
      "bloodline powers": "The microscopic nanites in your blood grant you incredible powers and alien magic.",
      "Nanite Strike (Ex)": "At 1st level as a free action, you can cause nanites to flow from your body and coat the striking end of any manufactured melee weapon you wield. When you hit with a melee attack using this weapon, some of the nanites infect the blood of the victim (Poison-injury; save Fort DC 10 + 1/2 your sorcerer level + your Con modifier;",
      "frequency": "1/round for 6 rounds;",
      "effect": "1 Str damage;",
      "cure": "1 save). At 5th level, weapons you use with this ability are treated as magical for the purposes of overcoming DR, and the poison also deals 1 point of Constitution damage. At 7th level, the damage increases to 1d2 points of Constitution damage and 1d2 points of Strength damage. At 11th level, the cure becomes two successful saves. You can use this ability for a number of rounds per day equal to 3 + your Charisma modifier; these rounds need not be consecutive.",
      "Nanite Surge (Ex)": "At 3rd level, once per day as an immediate action, you can cause your nanites to surge, granting you a bonus equal to 3 + your sorcerer level on any one d20 roll; this ability must be activated before the roll is made. If you already possess the nanite surge ability from another source (such as from being an android), you can use your nanite surge an additional time per day. At 9th level, you can use this ability an additional time per day.",
      "Nanite Resurgence (Ex)": "At 9th level, once per day as an immediate action upon being reduced to one-quarter your maximum hit points, you can force the mechanical swarm living inside you to keep you alive. This ability functions like a",
      "resurgent transformation": "spell (",
      "Pathfinder RPG Advanced Player's Guide": "239) using your sorcerer level as the caster level, except it is an extraordinary ability and cannot be dispelled. At 17th level, you can use this ability twice per day (though using this ability twice in one 24-hour period entails a chance of system shock and death; see the spell's description for more details). At 20th level, you never die of system shock from using this ability.",
      "Distributed Body (Ex)": "At 15th level, anytime you are struck by a critical hit or a sneak attack, there is a 25% chance that your nanites scatter and reincorporate around the attack, negating the extra damage and causing the attack to deal damage as normal instead.",
      "Living Swarm (Su)": "At 20th level, you and the machines within you become one. Your nanites consume and replicate your body, allowing swift and radical physical alterations with little more than a thought. You become immune to bleed effects, diseases, and poisons, and gain DR 5/-. At will, you can break down your body and move in a shimmering stream of flying nanites, as if affected by"
  },
    "Oni Bloodline": {
      "class skill": "Intimidate.",
      "bonus spells": [      "ray of enfeeblement (3rd)",
      "invisibility (5th)",
      "fly (7th)",
      "charm monster (9th)",
      "cone of cold (11th)",
      "greater dispel magic (13th)",
      "waves of exhaustion (15th)",
      "trap the soul (17th)",
      "dominate monster (19th)"
],
      "bonus feats": ["Combat Expertise, Combat Reflexes, Enforcer*, Fast Healer*, Improved Initiative, Iron Will, Power Attack, Skill Focus (Intimidate), Weapon Proficiency (katana [see"],
      "bloodline arcana": "Whenever you cast a spell of the charm or compulsion subschool, you gain a bonus on Bluff, Diplomacy, and Intimidate skill checks equal to the level of the spell for 1d4 rounds.",
      "bloodline powers": "While some would call you cursed, you have learned to unlock the powers of your oni heritage. Your emergent cruelty becomes more dominant as your power increases.",
      "Pathfinder RPG Ultimate Combat": "]) : Whenever you cast a spell of the charm or compulsion subschool, you gain a bonus on Bluff, Diplomacy, and Intimidate skill checks equal to the level of the spell for 1d4 rounds. : While some would call you cursed, you have learned to unlock the powers of your oni heritage. Your emergent cruelty becomes more dominant as your power increases.",
      "Touch of Agony (Sp)": "At 1st level, you can make a melee touch attack as a standard action that wracks a living creature with agonizing pain. The target takes 1d4 points of nonlethal damage each round for a number of rounds equal to 1/2 your sorcerer level (minimum 1). You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Altered Form (Sp)": "At 3rd level, you gain the ability to change shape (as the spell",
      "alter self": ") for a number of minutes per day equal to your sorcerer level. These rounds need not be consecutive. At 17th level, the duration of this effect is no longer limited, and you may remain in your chosen form as long as you want.",
      "Windborne (Sp)": "At 9th level, you can turn gaseous (as the spell",
      "gaseous form": ") for a number of rounds per day equal to your sorcerer level. These rounds need not be consecutive. At 11th level and every two levels thereafter, your speed while gaseous increases by +10 feet, to a maximum speed of 60 feet at 19th level.",
      "Oni Healing (Su)": "At 15th level, if your hit points drop below 0, you automatically stabilize and begin regenerating 2 hit points per round for a number of rounds per day equal to your sorcerer level. While regenerating in this way, you are not affected by spells or effects that would cause you to continue dying, such as",
      "bleed": ", but if you take any acid or fire damage, you stop regenerating for the rest of the day (but remain stabilized) and you are affected by such effects as normal. You still die if your hit points reach a negative number equal to your Constitution score, regardless of whether you are regenerating. This ability only works once per day-if you drop below 0 hit points a second time, you do not benefit from this ability.",
      "Hedonistic Master (Su)": "At 20th level, you fully embrace your oni heritage to unlock its maximum potential. You gain the ability to change your shape between your natural form and that of any one Large humanoid creature of the giant subtype at will (as the spell",
      "giant form I": "). You must choose which creature you wish to be able to change into when you reach 20th level; once you make this decision, you cannot change it. You can switch between your forms at will, and can assume your giant form for as long as you want. In addition, you gain SR equal to 6 + your sorcerer level, and whenever you cast a spell of the charm or compulsion subschool, the spell's DC increases by +2."
  },
    "Orc Bloodline": {
      "class skill": "Survival.",
      "bonus spells": [      "burning hands (3rd)",
      "bull's strength (5th)",
      "rage (7th)",
      "wall of fire (9th)",
      "cloudkill (11th)",
      "transformation (13th)",
      "delayed blast fireball (15th)",
      "iron body (17th)",
      "meteor swarm (19th)"
],
      "bonus feats": ["Diehard, Endurance, Great Fortitude, Intimidating Prowess, Improved Overrun, Power Attack, Toughness, Widen Spell"],
      "bloodline arcana": "You gain the orc subtype, including darkvision 60 feet and light sensitivity. If you already have darkvision, its range increases to 90 feet. Whenever you cast a spell that deals damage, that spell deals +1 point of damage per die rolled.",
      "bloodline powers": "You are heir to the bestial power of the great orc warlords of the past. You feel their rage in your blood, and must take care lest the urge to despoil and destroy consumes you.",
      "Touch of Rage (Sp)": "At 1st level, you can touch a creature as a standard action, giving it a morale bonus on attack rolls, damage rolls, and Will saving throws equal to 1/2 your sorcerer level (minimum 1) for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Fearless (Ex)": "At 3rd level, you gain a +4 bonus on saving throws made against fear and a +1 natural armor bonus. At 9th level, you lose your light sensitivity, gain immunity to fear, and your natural armor bonus increases to +2.",
      "Strength of the Beast (Ex)": "At 9th level, you gain a +2 inherent bonus to your Strength. This bonus increases to +4 at 13th level, and to +6 at 17th level.",
      "Power of Giants (Sp)": "At 15th level, you may grow to Large size as a standard action. At this size you gain a +6 size bonus to Strength, a -2 penalty to Dexterity, a +4 size bonus to Constitution, and a +4 natural armor bonus. You may return to your normal size as a standard action. You may remain in this size for up to 1 minute per character level per day; this duration does not need to be consecutive, but it must be used in 1 minute increments.",
      "Warlord Reborn (Su)": "At 20th level, you become a true orc warlord of legend. You gain immunity to fire and DR 5/-. Once per day, you can cast"
  },
    "Pestilence Bloodline": {
      "class skill": "Heal.",
      "bonus spells": [      "charm animal (3rd)",
      "summon swarm (5th)",
      "contagion (7th)",
      "repel vermin (9th)",
      "insect plague (11th)",
      "eyebite (13th)",
      "creeping doom (15th)",
      "horrid wilting (17th)",
      "power word kill (19th)"
],
      "bonus feats": ["Brew Potion, Diehard, Endurance, Great Fortitude, Self Sufficient, Skill Focus (Knowledge [nature]), Silent Spell, Toughness"],
      "bloodline arcana": "Vermin are susceptible to your mind-affecting spells. They are treated as animals for the purposes of determining which mind-affecting spells affect them.",
      "bloodline powers": "You awaken and quicken the lurking pestilence in your own body or the surrounding world to wreak hideous malice, or to command and commune with agents of such plagues.",
      "Plague's Caress (Sp)": "At 1st level, you can make a melee touch attack as a standard action that causes a living creature's flesh to break out into rancid-smelling pustules and sores for a number of rounds equal to 1/2 your sorcerer level (minimum 1 round). These sores cause the victim to become sickened for the duration of the effect; this is a disease effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Accustomed to Awfulness (Ex)": "At 3rd level, you become immune to the sickened condition and gain a +4 bonus on all saving throws against effects that cause nausea or disease. At 9th level, you become immune to the nauseated condition and to the debilitating effects of disease (but you can still be a carrier of diseases).",
      "Shroud of Vermin (Su)": "At 9th level, swarms no longer see you as prey. You can walk among swarms without fear of being harmed by them at all, and by taking a standard action to mentally command a swarm in which you stand, you can direct that swarm's attacks and movements as long as you have more Hit Dice than the swarm. Even when you aren't standing amid a swarm, your body crawls with vermin, and their chitinous bodies increase your natural armor bonus by +1. At 11th level, this bonus increases to +2, and at 17th level it increases to +3.",
      "Pestilential Breath (Su)": "At 15th level, the sickness within your body finally becomes so potent that your very breath is deadly. Once per day as a standard action, you can exhale a cloud of pestilence in a 30-foot cone. Those caught in the area of this miasmic cloud receive a single Fortitude save to avoid suffering the effects of two different diseases. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You can choose what two diseases you inflict on each target that succumbs to your plague breath, but they must be two different diseases chosen from the following list: blinding sickness, bubonic plague, cackle fever, filth fever, leprosy, mindfire, red ache, shakes, or slimy doom. The victim suffers the initial effects of these two diseases immediately - use the diseases' frequency and save DC normally to determine further effects as detailed on page 557 of the",
      "Pathfinder RPG Core Rulebook": ". At 17th level, you can use this ability twice per day. At 20th level you can use this ability three times per day.",
      "Plague Carrier (Su)": "At 20th level, your touch inflicts mummy rot on those you strike. You can choose to suppress this ability for 1 round as a swift action. You can make a touch attack to inflict this disease on a target, or transfer it as part of an attack with any melee weapon or touch-based spell. The creature touched can resist contracting mummy rot by making a Fortitude save - the DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier."
  },
    "Phoenix Bloodline": {
      "class skill": "Knowledge (Arcana)",
      "bonus spells": [
       "color spray (3rd)",
      "see invisibility (5th)",
      "magic circle against evil (7th)",
      "wall of fire (9th)",
      "break enchantment (11th)",
      "path of the winds (13th)",
      "firebrand (15th)",
      "prismatic wall (17th)",
      "fiery body (19th)"
],
      "bonus feats": ["Dodge, Elemental Focus (fire), Fast Healer, Improved Initiative, Iron Will, Mobility, Quicken Spell, Skill Focus (Knowledge [arcana])"],
      "bloodline arcana": "When casting any spell that deals fire damage, you can instead heal your targets. The spell deals no damage, and living creatures affected by the spell instead regain a number of hit points equal to half the fire damage the spell would normally deal.",
      "bloodline powers": "The phoenix is an elemental creature of sky and primal fire, and its blood within you sings with a similar power.",
      "The Unseen World (Su)": "At 1st level, you gain and as spells known. At 5th level, the phoenix's blood drives you to find and save lost knowledge and magical items. As a swift action, you can automatically identify the properties of a non-cursed magic item you hold; you must still identify a cursed item as normal to correctly identify it as cursed. You can use this ability a number of times equal to your Charisma modifier per day.",
      "Immolation (Su)": "At 3rd level, you gain the ability to surround yourself in fire as a swift action. This fire burns for a number of rounds per day equal to your character level plus your Charisma bonus. These rounds do not have to be consecutive. Any unarmed attacks you make while affected by immolation deal an additional 1d6 points of fire damage, and any creature that ends its turn adjacent to you while you're affected by immolation also takes 1d6 points of fire damage.",
      "Vermilion Wings (Su)": "At 9th level, you gain the ability to grow a pair of phoenix wings from your back as a standard action. The wings grant you a fly speed of 60 feet with good maneuverability. You can dismiss the wings as a free action.",
      "Restoring Flames (Sp)": "At 15th level, you can cast once per day as a spell-like ability.",
      "Rebirth (Su)": "At 20th level, the full power of a phoenix erupts from within you if you perish. When you die, you are brought back to life, as , after 1 minute. This ability can be used only once every 24 hours, and if you are slain again within this period, your death is permanent."
  },
    "Possessed Bloodline": {
      "class skill": "Knowledge (religion)",
      "bonus spells": [      "anticipate peril (3rd)",
      "share memory (5th)",
      "purge spirit (7th)",
      "entrap spirit (9th)",
      "possession (11th)",
      "telepathy (13th)",
      "insanity (15th)",
      "bilocation (17th)",
      "divide mind (19th)"
],
      "bonus feats": ["Combat Casting, Deceitful, Fearsome Spell"],
      "bloodline arcana": "Whenever you cast a non-cantrip spell, you can roll the next Will save you attempt against a mind-affecting effect before your next turn twice and take the better result. If you have already failed a save against a mind-affecting effect, you can instead attempt another Will save against that ongoing mind-affecting effect after successfully casting your spell. You can use this ability only once against a given mind-affecting effect. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "bloodline powers": "The mystical connection with your possessing spirit allows you to gain more control over your body and mind.",
      "Aggressive Possession (Sp)": "At 1st level, you can make a melee touch attack as a standard action. The target must succeed at a Will save or be confused for 1 round. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Sight Unseen (Sp)": "At 3rd level, you gain darkvision with a range of up to 30 feet. If you already have darkvision, its range instead increases by 30 feet. At 9th level, you gain lifesense with a range of 30 feet (lifesense allowsyou to sense and locate living creatures as if you had the blindsight ability).",
      "Inside Agent (Sp)": "At 9th level, you can reroll any Perception check you just attempted by allowing your possessing spirit to take further control. You take a -2 penalty on all other skill checks for the following minute as the spirit interferes with your concentration. At 13th level, you can reroll any other skill check, but the penalty for using the ability in this way increases to -4 for the following 10 minutes. You must reroll the check before  you learn the result of your original check, and cannot use this power while the skill check penalty associated with inside agent is imposed on you.",
      "One Body, Two Minds (Sp)": "At 15th level, once per day, you can improve the effectiveness of a single spell by havingyour possessing spirit channel that spell. The spell acts as though it were affected by both the Silent Spell and Still Spell metamagic feats. If the spell chosen is a mindaffecting spell, it also benefits from the Extend Spell metamagic feat. This ability does not use up a spell slot higher than the level of the base spell, nor does it increase the level of the base spell.",
      "Dual Spirit (Su)": "At 20th level, you gain immunity to mind-affecting effects. Whenever you successfully employ a possession effect (such as magic jar or possession ), you remain in complete control of your body and the body of your possessed target."
  },
    "Protean Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "entropic shield (3rd)",
      "blur (5th)",
      "gaseous form (7th)",
      "confusion (9th)",
      "major creation (11th)",
      "disintegrate (13th)",
      "greater polymorph (15th)",
      "polymorph any object (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Agile Maneuvers, Defensive Combat Training, Enlarge Spell, Great Fortitude, Improved Great Fortitude, Skill Focus (Craft [any]), Spell Focus, Toughness"],
      "bloodline arcana": "Your magic of creation and changing is hard to unravel. The DC to dispel transmutation or conjuration (creation) spells that you cast is increased by +4.",
      "bloodline powers": "Your ancestral immersion in primordial chaos begets your curiously warped magical talents.",
      "Protoplasm (Sp)": "At 1st level, you can create a ball of entropic protoplasm and hurl it at targets within 30 feet. This protoplasm acts as a tanglefoot bag that also inflicts 1 point of acid damage per round to a creature entangled by it. The protoplasm dissolves within 1d3 rounds. You may use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Protean Resistances (Ex)": "At 3rd level, you gain resist acid 5 and a +2 bonus on saving throws against polymorph, petrification, and transmutation spells or effects. At 9th level, you gain resist acid 10 and your save bonus increases to +4.",
      "Reality Wrinkle (Sp)": "At 9th level, you can surround yourself with a mobile, 10-foot-radius emanation of mutable reality. This rippling distortion is similar to",
      "solid fog": "but does not provide concealment or block line of sight. Your movement is not slowed by this aura. Attacks from outside the aura suffer a 20% miss chance against targets inside the aura. You may use this ability a number of rounds per day equal to your sorcerer level, though this duration need not be continuous.",
      "Spatial Tear (Sp)": "At 15th level, once per day, you can unravel the fibers of reality and ride along them as they snap back into place. This power functions as",
      "dimension door": ", while also creating a mass of",
      "black tentacles": "centered on your former location. Both of these effects use your sorcerer level as the caster level. At 20th level, you can use this ability twice per day.",
      "Avatar of Chaos (Ex)": "At 20th level, you are infused with the essence of raw chaos. You gain immunity to acid, petrification, and polymorph effects (except when cast on self), as well as a +2 bonus to save DCs and on checks to overcome spell penetration against creatures with the lawful subtype."
  },
    "Psychic Bloodline": {
      "class skill": "Sense Motive.",
      "bonus spells": [      "mind thrust I (3rd)",
      "id insinuation I (5th)",
      "ego whip I (7th)",
      "intellect fortress I (9th)",
      "psychic crush I (11th)",
      "mental barrier V (13th)",
      "tower of iron will III (15th)",
      "bilocation (17th)",
      "microcosm (19th)"],

      "bonus feats": ["Focused Spell"],
      "bloodline arcana": "Your sorcerer spells and spell-like abilities count as psychic instead of arcane. You use thought and emotion components instead of verbal and somatic components when casting your spells.",
      "bloodline powers": "Your psychic powers make you a master mentalist, but your soul struggles with the urge to transcend into a pure thought-form.",
      "Psychic Strike (Su)": "At 1st level, you can overwhelm the minds of those nearby. You can target one creature within 30 feet that you can see; that creature must succeed at a Will saving throw (DC = 10 + 1/2 your sorcerer level + your Charisma modifier) or it takes 1d6 points of damage + 1 point for every 2 sorcerer levels you possess and becomes shaken for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Mental Resistance (Ex)": "At 3rd level, your mind blocks attempts to assail it. You gain a +2 bonus on saving throws against mind-affecting effects. At 9th level, this bonus increases to +4.",
      "Undercasting Prodigy (Sp)": "Starting at 9th level, whenever you gain a new level of spells, you automatically replace any psychic bloodline spells that can be undercast with the highest-level version you can cast in your list of spells known. For example, at 9th level, you would replace",
      "mind thrust IV": ",",
      "id insinuation III": ", and",
      "ego whip II": ", respectively, as spells known.",
      "Thoughtsense (Sp)": "At 15th level, you can detect the thoughts of others around you, as a constant",
      "thoughtsense": "effect with a range of 30 feet instead of 60 feet.",
      "True Thought-Form (Sp)": "At 20th level, you can shed the restrictions of the flesh and become a thoughtform-a being that exists independently of its substance. Whenever a creature would kill you, you can attempt to use",
      "mind swap": "against that creature as an immediate action just before dying."
  },
    "Rakshasa Bloodline": {
      "class skill": "Disguise.",
      "bonus spells": [      "charm person (3rd)",
      "invisibility (5th)",
      "suggestion (7th)",
      "detect scrying (9th)",
      "prying eyes (11th)",
      "mass suggestion (13th)",
      "greater polymorph (15th)",
      "mind blank (17th)",
      "dominate monster (19th)"
],
      "bonus feats": ["Arcane Armor Mastery, Arcane Armor Training, Deceitful, Detect Expertise, Empower Spell, Light Armor Proficiency, Martial Weapon Proficiency, Stealthy"],
      "bloodline arcana": "Add half your sorcerer level to the Spellcraft DC for others to identify spells you cast. If their checks fail by 5 or more, they mistakenly believe you are casting an entirely different spell (selected by you when you begin casting).",
      "bloodline powers": "You can call upon the nearly divine power of your rakshasa ancestors, giving you the power to convincingly deceive your enemies.",
      "Silver Tongue (Su)": "At 1st level, you can draw upon your outsider heritage to spin amazingly convincing lies. Activating this ability is a swift action. You gain a +5 bonus on one Bluff check made to convince another of the truth of your words (similar to using",
      "glibness": "). If a magical effect is used against you that would detect your lies or force you to speak the truth, the user of the effect must succeed on a caster level check (DC 10 + your sorcerer level) to succeed. Failure means the effect does not detect your lies or force you to speak only the truth. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Mind Reader (Sp)": "At 3rd level, you can read minds as a spell-like ability. This ability acts like",
      "detect thoughts": ", except it lasts only 1 round, you use it on a single target as a standard action, and if the target fails its Will save, you gain information as if you had concentrated on it for 3 rounds. You may use this ability once per day at 3rd level and one additional time per day for every four sorcerer levels you possess beyond 3rd, up to five times per day at 20th level.",
      "Hide Aura (Sp)": "At 9th level, you can conceal yourself from prying magic. This ability acts like a constant",
      "nondetection": "spell cast upon yourself. You can end or restore this protection as a move action.",
      "Alter Self (Sp)": "At 15th level, you can change your shape into that of any humanoid at will. This ability acts like",
      "alter self": "or other disguise and polymorph abilities to assume your original form or other forms when it suits you. You are forevermore treated as a native outsider rather than as a humanoid (or whatever your original type was) for the purpose of spells and other magical effects. Unlike other outsiders, you can still be brought back from the dead as if you were a member of your previous creature type. You gain DR 10/piercing.",
      "Outsider (Su)": "At 20th level, your natural form becomes an animal-headed humanoid, like a true rakshasa. This does not affect your ability to speak or cast spells. You can use your"
  },
    "Salamander Bloodline": {
      "class skill": "Acrobatics",
      "bonus spells": [      "magic weapon (3rd)",
      "molten orb (5th)",
      "magic vestment (7th)",
      "fire shield (9th)",
      "fire snake (11th)",
      "tar poolUC (13th)",
      "firebrand (15th)",
      "wall of lava (17th)",
      "meteor swarm (19th)"
],
      "bonus feats": ["Cleave, Craft Wondrous Item, Iron Will, Power Attack, Prodigy"],
      "bloodline arcana": "The DCs of your sorcerer spells increase by 2 against creatures that are suffering ongoing fire damage.",
      "bloodline powers": "Your salamander blood gives you great skill at crafting, even as it reshapes your form.",
      "Ember (Su)": "At 1st level, when making a Craft check involving metal, you can expend any number of uses of this ability (up to half your sorcerer level, minimum one use) to gain a circumstance bonus on the check equal to twice the number of uses expended. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Forge and Fire (Su)": "At 3rd level, you gain Craft Magic Arms and Armor as a bonus feat. In addition, whenever you cast a nonpermanent, noninstantaneous spell that improves or enhances a manufactured weapon, you can also give that weapon the",
      "flaming": "special ability.)",
      "Serpent's Tail (Su)": "At 9th level, you can transform your legs into a slithering serpentine tail as a free action. Your speed is reduced by 10 feet (to a minimum of 5 feet), and you can't be tripped. Your footwear melds into your body and is nonfunctional unless it provides a constant bonus and does not need to be activated. You also gain a tail slap natural attack that deals 1d8 points of damage (1d6 if you are Small) + your Strength modifier. At 15th level, your reach with your tail slap increases by 5 feet. These effects last a number of minutes per day equal to your sorcerer level; the duration does not need to be consecutive, but it must be used in 1-minute increments.",
      "Searing Heat (Su)": "At 15th level, your body becomes as hot as a salamander's. You deal 1d6 additional points of fire damage with natural weapons and melee attacks made with metal weapons. In addition, you deal 2d6 points of fire damage per round to any creature you grapple. This heat does not damage your equipment. You can activate or deactivate this effect as a free action.",
      "Reforged Flesh (Ex)": "At 20th level, you become immune to fire damage and gain DR 10/adamantine and magic."
  },
    "Scorpion Bloodline": {
      "class skill": "Climb.",
      "bonus spells": [      "thorn javelin (3rd)",
      "spider climb (5th)",
      "poison (7th)",
      "giant vermin (9th),",
      "vermin shap II (11th)",
      "sirocco (13th)",
      "creeping doom (15th)",
      "horrid wilting (17th)",
      "transmute blood to acid (19th)"
],
      "bonus feats": ["Arcane Strike, Blind-Fight, Combat Reflexes, Disruptive Spell, Improved Initiative, Nimble Moves, Skill Focus (Climb), Stealthy"],
      "bloodline arcana": "You are trained in the use of poison and cannot accidentally poison yourself when applying poison to a weapon.",
      "bloodline powers": "Wherever your lineage hails from now, the desert is in your blood. Your ancestors may have worshiped the power of the scorpion or learned to channel it to survive.",
      "Progenitor's Sting (Sp)": "You can magically apply your toxic essence onto your weapon or onto the weapon of a willing ally within 30 feet as a standard action. (",
      "Poison": "-injury;",
      "save": "Fort DC 10 + half your sorcerer level + your Charisma modifier;",
      "frequency": "1/round for 6 rounds;",
      "effect": "1 Str, Dex, or Con damage [chosen when this ability is used];",
      "cure": "1 save). You can use this ability a number of times per day equal to 3 + your Charisma modifier. At 5th level, the ability damage of your poison increases to 1d3. At 7th level, each time you apply your progenitor's sting, you can choose two ability scores for your bloodline poison to affect. At 11th level, whenever you apply your progenitor's sting to a weapon, you can magically apply it onto all willing allies' weapons within 20 feet as well. This counts as one use of your bloodline ability.",
      "Modify Onset (Su)": "At 3rd level, you can increase the onset time of poisons you use by up to 1 hour per level. At 9th level, you can alter a poison so that it does not have an onset time, but you can trigger it as a swift action to take effect at any time, regardless of distance. If you do not trigger this poison within 1 week of poisoning a target, the poison dissipates harmlessly. The poison can be detected and removed before it is triggered using any normal methods of detecting and removing poison.",
      "Sudden Sting (Ex, Sp)": "At 9th level, when you are able to act in the surprise round, you can take a full round's worth of actions rather than just a single standard action. You can also cast",
      "accelerate poison": "and",
      "delay poison": "as spell-like abilities a total of three times per day.",
      "Sandwalker (Ex)": "At 15th level, you gain you gain a burrow speed of 30 feet and tremorsense with a range of 60 feet.",
      "It Is My Nature (Su)": "At 20th level, your poisoned blood protects you, reflexively conjuring an ethereal stinger to lash out at foes who come too close. Three times per day when an enemy moves into a square adjacent to you, you can make a melee touch attack against the creature as an immediate action. On a hit, the creature must succeed at a Fortitude save (DC = 10 + half your sorcerer level + your Charisma modifier) or die. A creature that succeeds at this Fortitude save is immune to this effect for 24 hours. This is a poison and death effect. You can use this ability even when you are surprised or flat-footed."
  },
    "Serpentine Bloodline": {
      "class skill": "Diplomacy.",
      "bonus spells": [      "hypnotism (3rd)",
      "delay poison (5th)",
      "summon monster III (reptiles only) (7th)",
      "poison (9th)",
      "hold monster (11th)",
      "mass suggestion (13th)",
      "summon monster VII (reptiles only) (15th)",
      "irresistible dance (17th)",
      "dominate monster (19th)"
],
      "bonus feats": ["Combat Casting, Combat Reflexes, Deceitful, Deft Hands, Persuasive, Silent Spell, Skill Focus (Bluff), Stealthy"],
      "bloodline arcana": "Your powers of compulsion can affect even bestial creatures. Whenever you cast a mind-affecting or language-dependent spell, it affects animals, magical beasts, and monstrous humanoids as if they were humanoids who understood your language.",
      "bloodline powers": "The treacherous and yet hypnotic serpent's blood that flows through you taints your magic with a sinuous and seductive grace.",
      "Serpent's Fang (Ex)": "At 1st level, you can grow fangs as a free action. These fangs are treated as a natural weapon inflicting 1d4 points of damage plus your Strength modifier (1d3 if you are Small) plus poison (Bite-injury;",
      "save": "Fort DC 10 + 1/2 your sorcerer level + your Constitution modifier;",
      "frequency": "1/round for 6 rounds;",
      "effect": "1 Con damage;",
      "cure": "1 save). At 5th level, these fangs are considered magical for the purpose of overcoming DR and the poison damage increases to 1d2 Con. At 7th level, your poison requires 2 successful saves to cure. At 11th level, your poison damage increases to 1d4 Con. You can use your fangs for a number of rounds per day equal to 3 + your Charisma modifier.",
      "Serpentfriend (Ex)": "At 3rd level, you can use",
      "speak with animals": "at will with reptilian animals (including various forms of dinosaurs, lizards, and other cold-blooded creatures), and you gain a viper familiar using your sorcerer level -2 as your effective wizard level.",
      "Snakeskin (Ex)": "At 9th level, you gain a +1 bonus to natural armor, a +2 racial bonus on saves against poison, and a +2 bonus on Escape Artist checks. At 13th level and 17th level, these bonuses increase by +1.",
      "Den of Vipers (Sp)": "At 15th level, you may summon a host of writhing serpents. This power acts as",
      "creeping doom": ", but the swarms' poison inflicts Con damage and any creature other than you sharing a space with a swarm is entangled.",
      "Scaled Soul (Su)": "At 20th level, you gain the shapechanger subtype, and you can assume the form of a reptilian humanoid (as",
      "alter self": ") or snake of Diminutive to Huge size (as",
      "beast shape III": ") at will. You retain the power of speech and the ability to use somatic spell components when transformed. You also become immune to poison and paralysis. You may use serpent's fang as often as desired, and you may choose to inflict damage to any ability score."
  },
    "Shadow Bloodline": {
      "class skill": "Stealth.",
      "bonus spells": [      "ray of enfeeblement (3rd)",
      "darkvision (5th)",
      "deeper darkness (7th)", 
      "shadow conjuration (9th)",
      "shadow evocation (11th)",
      "shadow walk (13th)",
      "power word blind (15th)",
      "greater shadow evocation (17th)",
      "shades (19th)"
],
      "bonus feats": ["Acrobatic, Blind-Fight, Dodge, Quick Draw, Silent Spell, Skill Focus (Stealth), Stealthy, Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell with the darkness descriptor or the shadow subschool, you gain a circumstance bonus on Stealth checks equal to the spell's level for 1d4 rounds.",
      "bloodline powers": "Your benighted heritage infuses your mastery of magic with the essence of shadowstuff.",
      "Shadowstrike (Sp)": "At 1st level, you can make a melee touch attack as a standard action that inflicts 1d4 points of nonlethal damage + 1 for every two sorcerer levels you possess. In addition, the target is dazzled for 1 minute. Creatures with low-light vision or darkvision are not dazzled by this ability. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Nighteye (Ex)": "At 3rd level, you gain darkvision 30 feet. At 9th level, you gain darkvision 60 feet. If you already possess darkvision, its range is increased by these amounts.",
      "Shadow Well (Sp)": "At 9th level, you can use the Stealth skill even while being observed and without cover or concealment, as long as you are within 10 feet of a shadow other than your own. In addition, when within an area of darkness or dim light, as a standard action you may choose to switch places with a willing ally within 60 feet, who must also be in darkness or dim light. At 13th level, you can instead switch the positions of two willing allies, each of whom must be within 60 feet of you. Unless otherwise noted, this travel is identical to",
      "dimension door": ". You may use the ability to switch places once per day at 9th level, plus one additional time per day at 17th level and 20th level.",
      "Enveloping Darkness (Sp)": "At 15th level, you may create an area of",
      "freedom of movement": "or a similar effect. You may use this ability once per day.",
      "Shadow Master (Su)": "At 20th level, you can see perfectly in natural or magical darkness. When you use"
  },
    "Shaitan Bloodline": {
      "class skill": "Knowledge (planes).",
      "bonus spells": [      "true strike (3rd)",
      "glitterdust (5th)",
      "greater magic weapon (7th)",
      "stoneskin (9th)",
      "wall of stone (11th)",
      "wall of iron (13th)",
      "plane shift (15th)",
      "iron body (17th)",
      "wish (19th)"
],
      "bonus feats": ["Dodge, Empower Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Power Attack, Skill Focus (Knowledge [planes]), Weapon Finesse"],
      "bloodline arcana": "Whenever you cast a spell that deals energy damage, you can change the type of damage to acid. This effect also changes the spell's descriptors to match this energy type.",
      "bloodline powers": "Like a shaitan, you have both natural power over earth, and several other genie-based abilities.",
      "Acid Ray (Sp)": "Starting at 1st level, you can unleash an elemental ray as a standard action, targeting any foe within 30 feet as a ranged touch attack. This ray deals 1d6 points of acid damage + 1 for every two sorcerer levels you possess. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Elemental Resistance (Ex)": "At 3rd level, you gain acid resistance 10. At 9th level, your acid resistance increases to 20.",
      "Avalanche (Su)": "At 9th level, whenever you hit a single target with a spell that deals damage, you may make a bull rush check as a swift action. Your CMB for this maneuver is equal to your sorcerer caster level + your Charisma bonus. You can make this maneuver even if the target is not in melee range, and you do not provoke an attack of opportunity for making this maneuver. If the target is in contact with earth, stone, or rock, you gain a +4 bonus on your CMB check.",
      "Elemental Movement (Su)": "At 15th level, you gain a burrow speed of 30 feet.",
      "Power of the Shaitan (Su)": "At 20th level, you gain the power of genies to grant wishes. Once per day, you can cast",
      "limited wish": "as a spell-like ability. Such wishes must begin with the words \"I wish,\"and cannot duplicate a wish you have granted within the past 24 hours. If you use this ability to duplicate a spell with a costly material component, you must provide that component. You become immune to acid damage, and can use"
  },
    "Shapechanger Bloodline": {
      "class skill": "Disguise.",
      "bonus spells": [      "disguise self (3rd)",
      "alter self (5th)",
      "fly (7th)",
      "beast shape II (9th)",
      "polymorph (11th)",
      "transformation (13th)",
      "greater polymorph (15th)",
      "frightful aspectUC (17th)",
      "shapechange (19th)"
],
      "bonus feats": ["Combat Casting, Dodge, Extend Spell, Great Fortitude, Improved Initiative, Lightning Reflexes, Skill Focus (Disguise), Toughness"],
      "bloodline arcana": "You are very skilled with magic that transforms you. Transmutation spells you cast only on yourself affect you as though your caster level were 1 higher.",
      "bloodline powers": "Your bloodline grants you the following powers.",
      "Hardened Fists (Su)": "At 1st level, you can make your fists grow large, callused, and gnarled as a free action. Your unarmed strikes deal damage as though you were one size category larger, deal lethal damage, and do not provoke attacks of opportunity. If you have claws, they are affected instead, and they deal damage as though you were one size category larger. You can use this ability for a number of rounds per day equal to 3 + your Charisma modifier. These rounds do not need to be consecutive.",
      "Mutable Flesh (Su)": "At 3rd level, once per day when you cast a transmutation spell with a duration of 1 minute per level that affects only you, you can increase its duration to 10 minutes per level. At 9th level, you can increase the duration to 1 hour per level.",
      "Vortex of Flesh (Su)": "At 9th level, you can momentarily change into an amalgam of erratic geometric shapes once per day, lashing out at every creature in a 20-foot-radius spread around you as a standard action. This attack deals 1d6 points of bludgeoning, piercing, and slashing damage per sorcerer level. If you benefit from a spell or effect that allows you to overcome damage resistance with your natural attacks (such as",
      "magic fang": "), this attack ignores DR of the same type. Those caught in the area can attempt a Reflex saving throw (DC = 10 + half your sorcerer level + your Charisma modifier) for half damage. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day.",
      "Superior Transformation (Su)": "At 15th level, you become master of your own shape and you fully understand the intricacies of all shapechanging magic. You are immune to polymorph effects unless you are a willing target. Once per day when you cast a polymorph spell on yourself, in addition to the normal effects of the spell, you can choose to gain a fly speed of 60 feet (average maneuverability), a swim speed of 60 feet, or an increase to your base land speed of 30 feet.",
      "Amorphous Anatomy (Su)": "At 20th level, your vital organs shift position, and as a rule they are constantly changing their shape and size to best protect you. You gain immunity to critical hits and sneak attacks. In addition, you gain blindsight with a range of 60 feet and damage reduction 5/-. You automatically recover from physical blindness or deafness after 1 round by growing new sensory organs to replace the compromised ones; you cannot otherwise regenerate lost body parts."
  },
    "Solar Bloodline": {
      "class skill": "Perception",
      "bonus spells": [      "searing light (3rd)",
      "fury of the sunARG (5th)",
      "daylight (7th)",
      "shield of dawnISG (9th)",
      "flame strike (11th)",
      "true seeing (13th)",
      "sunbeam (15th)",
      "sunburst (17th)",
      "overwhelming presenceUM (19th)"
],
      "bonus feats": ["Alertness, Combat Casting, Empower Spell, Improved Initiative, Lightning Reflexes, Quicken Spell, Spell Focus, Spell Penetration"],
      "bloodline arcana": "Whenever you cast a spell with the fire descriptor, if it deals damage, it deals +1 point of damage per die rolled.",
      "bloodline powers": "The solar power that infuses your being alters the way you interact with the world, searing through your spells.",
      "Sunsight (Su)": "At 1st level, you gain low-light vision and cannot be dazzled. If you already have lowlight vision, you instead gain a +4 bonus on saving throws against blindness effects.",
      "Friend of Fire (Su)": "At 3rd level, you gain fire resistance 10. At 5th level, when in contact with flame or a burning object (including a",
      "flaming": "weapon, lantern, or torch), add 1 per die to any healing effect of which you are the target. At 9th level, your fire resistance increases to 20. At 20th level, you gain immunity to fire.",
      "Cleansing Flame (Su)": "At 9th level, twice per day, you can use fire to restore the health of yourself or your allies. As a standard action, you can wreathe your hand in a halo of flame and touch yourself or another creature. The touch heals 2d8 + your character level points of damage. You can also remove one of the following conditions affecting the target: 1d6 points of ability damage, blinded, confused, dazzled, deafened, diseased, exhausted, fatigued, nauseated, poisoned, or sickened. At 20th level, you can use this ability three times per day.",
      "Healing Fire (Su)": "At 15th level, you can channel energy twice per day as a cleric of half your level. Instead of using this ability to damage undead, you can convert the positive energy to flame and deal an equivalent amount of fire damage instead.",
      "Solar Ascension (Su)": "At 20th level, as a full-round action, you can become an incorporeal being of light for 1 round per sorcerer level. While in this form, you gain the incorporeal subtype and take half the normal damage from corporeal magic attacks (you take no damage from nonmagical weapons and objects). Your spells deal half damage to corporeal creatures, but spells and abilities that do not deal damage function normally. The duration need not be continuous, but it must be used in 1-round increments. While in this form, any creature you move through (as the overrun combat maneuver) takes 2d6 points of fire damage."
  },
    "Starsoul Bloodline": {
      "class skill": "Knowledge (nature).",
      "bonus spells": [      "unseen servant (3rd)",
      "glitterdust (5th)",
      "blink (7th)",
      "call lightning storm (dealing fire damage, damage increased outdoors at night) (9th)",
      "overland flight (11th)",
      "repulsion (13th)",
      "reverse gravity (15th)",
      "greater prying eyes (17th)",
      "meteor swarm (19th)"
],
      "bonus feats": ["Blind-Fight, Craft Rod, Dodge, Endurance, Improved Counterspell, Improved Iron Will, Iron Will, Quicken Spell, Skill Focus (Perception), Toughness"],
      "bloodline arcana": "Whenever you cast an evocation spell, targets that fail their saves are dazzled by tiny sparkling starlights for 1 round per level of the spell.",
      "bloodline powers": "Your skyward gaze and communion with the heavens focus and enhance your magical talents.",
      "Minute Meteors (Sp)": "At 1st level, you can summon a rain of tiny meteorites as a standard action to fall in a 5-foot column, 30 feet high, with a range of 30 feet. The meteors inflict 1d4 points of fire damage + 1 per 2 sorcerer levels. A Reflex save negates this damage. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Voidwalker (Ex)": "At 3rd level, you gain low-light vision and resist cold and fire 5. At 9th level, you no longer need to breathe, as if wearing a",
      "Aurora Borealis (Sp)": "At 9th level, you can create a sheet of cascading colors. This power acts as a",
      "wall of fire": ", but it inflicts cold damage and does not radiate heat. However, one side of the aurora designated by you fascinates creatures within 10 feet, up to a maximum of 2 HD of creatures per sorcerer level. A Will save negates this fascinate effect. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. You may use this ability for a number of rounds per day equal to your sorcerer level. These rounds do not need to be consecutive.",
      "Breaching the Gulf (Sp)": "At 15th level, your caster level is increased by 3 when casting spells of the teleportation subschool. In addition, once per day you can teleport a single creature within 30 feet into the void of space if it fails a Will save. The save DC is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The target can attempt a new saving throw as a full-round action each round to return. While trapped in the airless void, the target takes 6d6 points of cold damage per round and must hold its breath or begin to suffocate.",
      "Starborn (Ex)": "At 20th level, you gain immunity to cold and blindness, and you can see perfectly in natural or magical darkness. In addition, you gain fast healing 1 when you are outdoors at night."
  },
    "Stormborn Bloodline": {
      "class skill": "Knowledge (nature).",
      "bonus spells": [      "shocking grasp (3rd)",
      "gust of wind (5th)",
      "lightning bolt (7th)",
      "shout (9th)",
      "overland flight (11th)",
      "chain lightning (13th)",
      "control weather (15th)",
      "whirlwind (17th)",
      "storm of vengeance (19th)"
],
      "bonus feats": ["Deadly Aim, Dodge, Enlarge Spell, Far Shot, Great Fortitude, Point-Blank Shot, Skill Focus (Fly), Wind Stance"],
      "bloodline arcana": "Whenever you cast a spell with the electricity or sonic descriptor, increase the save DC by 1.",
      "bloodline powers": "Your mastery of the storm is reflected in the unique panoply of powers you manifest.",
      "Thunderstaff (Sp)": "At 1st level, you can touch a weapon as a standard action, giving it the",
      "shock": "property for a number of rounds equal to 1/2 your sorcerer level (minimum 1). At 9th level, you can confer the",
      "shocking burst": "property instead, but the duration of the power is halved. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Stormchild (Ex)": "At 3rd level, you gain resist electricity 5 and resist sonic 5, and treat wind effects as being one step less severe. At 9th level, you treat wind effects as being two steps less severe and gain blindsense 60 feet against concealment from natural or magical fog, mist, or weather effects.",
      "Thunderbolt (Sp)": "At 9th level, you can command a stroke of lightning to strike from above in a 5-foot-radius cylinder 60 feet high. The thunderbolt inflicts 1d6 points of damage per sorcerer level; half of this damage is electricity and half is sonic. A Reflex save (DC 10 + 1/2 your sorcerer level + your Charisma modifier) halves this damage. Creatures failing their saves are deafened for 1 round. At 9th level, you can use this ability once per day, at 17th twice per day, and at 20th three times per day. This power has a range of 120 feet.",
      "Ride the Lightning (Sp)": "At 15th level, as a full-round action you can become a living lightning bolt and move in a straight line up to 10 times your speed. You do not provoke attacks of opportunity while moving in this way. Creatures or objects in your path are affected as by your thunderbolt power. Creatures do not block your movement but solid barriers do unless they are reduced to 0 hit points. You can use this power once per day for a number of rounds equal to your sorcerer level.",
      "Storm Lord (Ex)": "At 20th level, you are one with the storm. You gain immunity to deafness, stunning, and wind effects and gain blindsight 120 feet against concealment from natural or magical fog, mist, or weather. Once per day, when attacked with an electricity or sonic effect, you may forgo your saving throw and absorb the energies of the attack, healing 1 point of damage for every 3 points of damage the attack would otherwise have dealt."
  },
    "Undead Bloodline": {
      "class skill": "Knowledge (religion).",
      "bonus spells": [      "chill touch (3rd)",
      "false life (5th)",
      "vampiric touch (7th)",
      "animate dead (9th)",
      "waves of fatigue (11th)",
      "undeath to death (13th)",
      "finger of death (15th)",
      "horrid wilting (17th)",
      "energy drain (19th)"
],
      "bonus feats": ["Combat Casting, Diehard, Endurance, Iron Will, Skill Focus (Knowledge [religion]), Spell Focus, Still Spell, Toughness"],
      "bloodline arcana": "Some undead are susceptible to your mind-affecting spells. Corporeal undead that were once humanoids are treated as humanoids for the purposes of determining which spells affect them.",
      "bloodline powers": "You can call upon the foul powers of the afterlife. Unfortunately, the more you draw upon them, the closer you come to joining them.",
      "Grave Touch (Sp)": "Starting at 1st level, you can make a melee touch attack as a standard action that causes a living creature to become shaken for a number of rounds equal to 1/2 your sorcerer level (minimum 1). If you touch a shaken creature with this ability, it becomes frightened for 1 round if it has fewer Hit Dice than your sorcerer level. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Death's Gift (Su)": "At 3rd level, you gain resist cold 5 and DR 5/- against nonlethal damage. At 9th level, your resistance to cold increases to 10 and your DR increases to 10/- against nonlethal damage.",
      "Grasp of the Dead (Sp)": "At 9th level, you can cause a swarm of skeletal arms to burst from the ground to rip and tear at your foes. The skeletal arms erupt from the ground in a 20-foot-radius burst. Anyone in this area takes 1d6 points of slashing damage per sorcerer level. Those caught in the area receive a Reflex save for half damage. Those who fail the save are unable to move for 1 round. The DC of this save is equal to 10 + 1/2 your sorcerer level + your Charisma modifier. The skeletal arms disappear after 1 round. The arms must burst up from a solid surface. At 9th level, you can use this ability once per day. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. This power has a range of 60 feet.",
      "Incorporeal Form (Sp)": "At 15th level, you can become incorporeal for 1 round per sorcerer level. While in this form, you gain the incorporeal subtype. You only take half damage from corporeal sources as long as they are magic (you take no damage from non-magic weapons and objects). Likewise, your spells deal only half damage to corporeal creatures. Spells and other effects that do not deal damage function normally. You can use this ability once per day.",
      "One of Us (Ex)": "At 20th level, your form begins to rot (the appearance of this decay is up to you) and undead see you as one of them. You gain immunity to cold, nonlethal damage, paralysis, and sleep. You also gain DR 5/-. Unintelligent undead do not notice you unless you attack them. You receive a +4 morale bonus on saving throws made against spells and spell-like abilities cast by undead."
  },
    "Unicorn Bloodline": {
      "class skill": "Heal",
      "bonus spells": [
      "cure light wounds (3rd)",
      "cure moderate wounds (5th)",
      "cure serious wounds (7th)",
      "neutralize poison (9th)",
      "atonement (11th)",
      "heal (13th)",
      "greater restoration (15th)",
      "mass cure critical wounds (17th)",
      "mass heal (19th)"
],
      "bonus feats": ["Alertness, Animal Affinity, Brew Potion, Fleet, Greater Fortitude, Improved Counterspell, Self-Sufficient, Skill Focus (Heal)"],
      "bloodline arcana": "Every time you cast a spell, you can restore a number of hit points equal to double the level of the spell you cast to one target of your choice that you can see. A creature at its maximum hit points cannot be affected by this ability. Healing a dying creature with this ability does not automatically stabilize the creature unless its hit points are brought to 0 or above.",
      "bloodline powers": "Your connection to the unicorns' blessing shapes you as you grow, empowering you with the forces of good and restoration.",
      "Safekeeping (Su)": "At 1st level, you can touch a creature as a standard action, granting it a +2 insight bonus to AC for 1 round. You can use this ability a number of times per day equal to 3 + your Charisma modifier.",
      "Pure of Mind (Su)": "At 3rd level, you gain a +2 bonus on saving throws against charm effects and a +4 bonus on saving throws against spells with the evil descriptor. At 9th level, your bonus on saving throws against charm effects increases to +4 and your bonus on saving throws against spells with the evil descriptor increases to +6.",
      "Righteous Fury (Su)": "At 9th level, once per day you can create a spear of pure light and throw it at a creature within 60 feet as a standard action. This is a ranged touch attack that uses your Charisma modifier in place of your Dexterity modifier to determine the attack bonus. The spear deals 1d6 points of damage per sorcerer level and ignores all damage reduction and hardness. This damage increases to 1d8 points of damage per sorcerer level against an evil creature. At 13th level, you can use this ability twice per day. At 17th level, you can use this ability three times per day.",
      "Friend to Nature (Su)": "At 15th level, creatures with the animal or magical beast type and a nonevil alignment instinctually trust you. Such creatures automatically have a starting attitude of indifferent or better toward you unless you or a creature allied with you has attacked or otherwise threatened violence against such a creature.",
      "Blessing (Su)": "At 20th level, you gain immunity to poison, to charm effects, and to spells and weapons with the evil descriptor. You can also cast at will with a caster level equal to your sorcerer level."
  },
    "Verdant Bloodline": {
      "class skill": "Knowledge (nature).",
      "bonus spells": [      "entangle (3rd)",
      "barkskin (5th)",
      "speak with plants (7th)",
      "command plants (9th)",
      "wall of thorns (11th)",
      "transport via plants (13th)",
      "plant shape III (15th)",
      "animate plants (17th)",
      "shambler (19th)"
],
      "bonus feats": ["Acrobatic Steps, Craft Staff, Endurance, Extend Spell, Fleet, Nimble Moves, Skill Focus (Knowledge [nature]), Toughness"],
      "bloodline arcana": "Whenever you cast a spell with a range of personal, your skin toughens, granting you a natural armor bonus equal to the spell's level for 1d4 rounds. This bonus does not stack with any other natural armor bonuses you might have.",
      "bloodline powers": "The power of living things infuses every aspect of your magic, as you draw power from nature and its life energies flow through you.",
      "Tanglevine (Sp)": "At 1st level, as a standard action, you can create a 15-foot-long, animated vine that springs from your hand. This vine lasts for 1 round and can be used to make a single disarm, steal, or trip combat maneuver, using your sorcerer level plus your Charisma modifier in place of your normal CMB. You can use this power a number of times per day equal to 3 + your Charisma modifier.",
      "Photosynthesis (Ex)": "At 3rd level, you feed upon nature's raw essence. Your need to eat and sleep is reduced as if wearing a",
      "ring of sustenance": ", and you gain a +2 racial bonus on saving throws made against poison and sleep effects. At 9th level, these bonuses increase to +4.",
      "Massmorph (Sp)": "At 9th level, as a full-round action, you can alter the size and health of plant life, as if using",
      "plant growth": "or",
      "diminish plants": ". Alternatively, you can transform one willing non-plant creature per sorcerer level (no two of which can be more than 30 feet apart) as",
      "tree shape": ". You may transform creatures as",
      "plant shape I": "at 15th level, or",
      "plant shape II": "at 20th level. You can transform non-plant creatures using this power once per day.",
      "Rooting (Ex)": "At 15th level, as a move action, you can extend roots into the ground. Your speed is reduced to 5 feet, but you gain a +4 bonus to natural armor and a +10 bonus to CMD against bull rush, overrun, reposition, and trip maneuvers. You also gain tremorsense 30 feet and fast healing 1. You can use this power for a number of minutes per day equal to your sorcerer level. This duration need not be consecutive, but it must be used in 1-minute increments.",
      "Shepherd of the Trees (Su)": "At 20th level, your verdant heritage fully manifests. You gain a +4 natural armor bonus. You gain immunity to paralysis, poison, polymorph, sleep, and stunning, and you gain tremorsense 30 feet even when not rooted."
  },
    "Vestige Bloodline": {
      "class skill": "Knowledge (history).",
      "bonus spells": [      "identify (3rd)",
      "share memory (5th)",
      "arcane sight (7th)",
      "hypercognition (9th)",
      "telepathic bond (11th)",
      "analyze dweomer (13th)",
      "vision (15th)",
      "discern location (17th)",
      "foresight (19th)"
],
      "bonus feats": ["Arcane Strike, Augment Summoning, Craft Wondrous Item, Echoing Spell, Iron Will, Leadership, Skill Focus (Knowledge [history]), Spell Focus"],
      "bloodline arcana": "Whenever you cast a spell of the divination school, you see into the past. You gain an insight bonus equal to the divination spell's level on the next Appraise, Craft, or Knowledge skill check you attempt within 24 hours.",
      "bloodline powers": "Your connection to your past allows you to tap into ancient secrets and power.",
      "Bonded Object (Sp)": "At 1st level, you gain an arcane bond, per a wizard equal to your sorcerer level, with an object constructed by a long-lost civilization. Your sorcerer levels stack with any wizard levels you have when determining the powers of your bonded object. This ability does not allow you to have both a familiar and a bonded object. Once per day, your bonded object allows you to cast any one of your spells known and increase the save DC of that spell by 1.",
      "Restored Glory (Su)": "At 3rd level, objects in your possession with the broken condition function as if they did not have the broken condition, though if they reach 0 hit points they are destroyed as normal. At 9th level, destroyed objects (objects with 0 hit points) in your possession function and appear as if they had only the broken condition, though if they reach a number of negative hit points equal to your level, they become fully destroyed and don't function at all, even in your possession. At 15th level, destroyed objects in your possession function and appear as if fully repaired, though they can become fully destroyed as described above. Destroyed objects must have physical pieces left to be affected by this ability. Objects that leave your possession are affected normally by these conditions. This ability does not affect artifacts.",
      "Call Ancestor (Sp)": "At 9th level, once per day, you can spend a standard action to grant a long-dead relative a brief facsimile of life. This functions as the",
      "lesser simulacrum": "spell, except the simulacrum lasts only 1 round per sorcerer level you have, has the same statistics as you, and always has the likeness of an ancestor. In addition, the simulacrum has lost knowledge from the past. When summoning the simulacrum, select one Knowledge skill. The simulacrum is considered trained in that skill and has a bonus on Knowledge checks of this type equal to twice your level plus your Intelligence modifier. The simulacrum is under your control, but it cannot attack or take hostile actions. At 17th level, you can use this ability twice per day. At 20th level, you can use this ability three times per day. You cannot have more than one ancestor simulacrum active at any one time.",
      "Eternal Past (Su)": "At 15th level, you gain an immersive mindscape (",
      "Pathfinder RPG Occult Adventures": "235). This functions as a permanent",
      "greater create mindscape": "spell, except it must appear as a lost civilization, and you do not target any other creatures when the mindscape is created. You can open a conduit to your mindscape as a standard action at will (per the",
      "mindscape door": "spell), allowing you or other creatures to enter or leave. The mindscape is only as detailed as your knowledge of the lost civilization but still holds valuable secrets. The mindscape functions as a library for all Knowledge skills; while within your mindscape, you can spend 1d4 hours researching to use a Knowledge (history) check in place of any other Knowledge check.",
      "Manifest Memory (Su)": "At 20th level, you can overlay portions of your mindscape onto the world around you. This functions as the",
      "mirage arcana": "spell, except all structures and terrain created must be places appearing within your mindscape. You can use this ability at will, but you can maintain only a single manifest memory at any one time. You can allow any creature you can see who has previously entered your mindscape to automatically disbelieve the illusion as a free action."
    }
  }

}
