[
  {
    "Dwarf": {
      "Source": "Blood of Shadows pg. 5",
      "Physical Description": ": Dwarves are a short and stocky race, and stand about a foot shorter than most humans, with wide, compact bodies that account for their burly appearance. Male and female dwarves pride themselves on the long length of their hair, and men often decorate their beards with a variety of clasps and intricate braids. Clean-shavenness on a male dwarf is a sure sign of madness, or worse—no one familiar with their race trusts a beardless dwarven man.",
      "Society": ": The great distances between dwarves' mountain citadels account for many of the cultural differences that exist within their society. Despite these schisms, dwarves throughout the world are characterized by their love of stonework, their passion for stone- and metal-based craftsmanship and architecture, and their fierce hatred of giants, orcs, and goblinoids. In some remote enclaves, such as those areas where these races are uncommon or unheard of, dwarves' fixation on security and safety combined with their rather pugnacious nature leads them to find enemies or at least rivals wherever they settle. While they are not precisely militaristic, they learned long ago that those without axes can be hewn apart by them, and thus dwarves everywhere are schooled to be ready to enforce their rights and claims by force of arms. When their patience with diplomacy is exhausted, dwarves do not hesitate to adopt what they call \"aggressive negotiations.\"",
      "Relations": ": Dwarves and orcs have long dwelt in proximity to one another, and share a history of violence as old as both races. Dwarves generally distrust and shun Half-Orcs. They find elves, gnomes, and halflings to be too frail, flighty, or \"pretty\" to be worthy of proper respect. It is with humans that dwarves share the strongest link, for humans' industrious nature and hearty appetites come closest to matching those of the dwarven ideal.",
      "Alignment and Religion": ": Dwarves are driven by honor and tradition. While they are often stereotyped as standoffish, they have a strong sense of friendship and justice, and those who win their trust understand that while they work hard, they play even harder—especially when good ale is involved. Most dwarves are lawful good.",
      "Adventurers": ": Although dwarven adventurers are rare compared to humans, they can be found in most regions of the world. Dwarves often leave the confines of their redoubts to seek glory for their clans, to find wealth with which to enrich the fortress-homes of their birth, or to reclaim fallen dwarven citadels from racial enemies. Dwarven warfare is often characterized by tunnel fighting and melee combat, and as such most dwarves tend toward classes such as fighters and barbarians.",
      "Males Names": ": Dolgrin, Grunyar, Harsk, Kazmuk, Morgrym, Rogar.",
      "Female Names": ": Agna, Bodill, Ingra, Kotri, Rusilka, Yangrit.: Dwarves are both tough and wise, but also a bit gruff.",
      "+2 Constitution, +2 Wisdom, –2 Charisma": ": Dwarves are both tough and wise, but also a bit gruff.",
      "Medium": ": Gain a +1/2 bonus on saving throws against possession and a +1/2 bonus on saving throws to end haunt channeler, location channel, and spacious soul.",
      "Slow and Steady": ": Dwarves have a base speed of 20 feet, but their speed is never modified by armor or encumbrance.",
      "Darkvision": ": Dwarves can see in the dark up to 60 feet.",
      "Defensive Training": ": Dwarves get a +4 dodge bonus to their AC against monsters of the giant subtype.",
      "Greed": ": Dwarves receive a +2 racial bonus on Appraise checks made to determine the price of nonmagical goods that contain precious metals or gemstones.",
      "Hatred": ": Dwarves receive a +1 bonus on attack rolls against humanoid creatures of the orc and goblinoid subtypes because of their special training against these hated foes.",
      "Hardy": ": Dwarves receive a +2 racial bonus on saving throws against poison, spells, and spell-like abilities.",
      "Stability": ": Dwarves receive a +4 racial bonus to their Combat Maneuver Defense when resisting a bull rush or trip attempt while standing on the ground.",
      "Stonecunning": ": Dwarves receive a +2 bonus on Perception checks to potentially notice unusual stonework, such as traps and hidden doors located in stone walls or floors. They receive a check to notice any such features that they pass within 10 feet of, whether or not they are actively looking.",
      "Weapon Familiarity": ": Dwarves are prof icient with battleaxes, heavy picks, and warhammers, and treat any weapon with the word \"dwarven\" in its name as a martial weapon.",
      "Languages": ": Dwarves begin play speaking Common and Dwarven. Dwarves with high Intelligence scores can choose from the following languages: Giant, Gnome, Goblin, Orc, Terran, and Undercommon.Advanced Race Guide pg. 12",
      "Alchemist": ": Add +1/4 to the alchemist's natural armor bonus when using his mutagen.",
      "Arcanist": ": Add 1/4 to the arcanist's effective class level when determining the effects of the arcane barrier and arcane weapon arcanist exploits.",
      "Barbarian": ": Add +1 to the barbarian's total number of rage rounds per day.",
      "Bard": ": Reduce arcane spell failure chance for casting bard spells when wearing medium armor by +1%. Once the total reaches 10%, the bard also receives Medium Armor Proficiency, if he does not already possess it.",
      "Bloodrager": ": Increase the bloodrager's total number of bloodrage rounds per day by 1.",
      "Brawler": ": Reduce the hardness of any object made from clay, stone, or metal by 1 whenever the object is struck by the brawler's unarmed strike (minimum 0).",
      "Cavalier": ": Add +1/2 to the cavalier's bonus to damage against targets of his challenge.",
      "Cleric": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power.",
      "Druid": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a bull rush or trip.",
      "Gunslinger": ": Reduce the misfire chance for one type of firearm by 1/4. You cannot reduce the misfire chance of a firearm below 1.",
      "Hunter": ": Gain a +1/2 bonus on wild empathy checks the hunter makes to inf luence animals and magical beasts that live underground.",
      "Inquisitor": ": Add +1/2 to the inquisitor's level for the purpose of determining the effects of one type of judgment.",
      "Investigator": ": Gain a +1/4 bonus on Perception checks when underground and +1/2 bonus to the investigator's trap sense ability regarding stone traps.",
      "Kineticist": ": Add 1/3 point of damage to earth element blasts that deal damage.",
      "Magus": ": Select one known magus arcana usable only once per day. The magus adds +1/6 to the number of times it can be used per day. Once that magus arcana is usable twice per day, the magus must select a different magus arcana.",
      "Mesmerist": ": Increase painful stare's damage by 1/4 point.",
      "Monk": ": Reduce the Hardness of any object made of clay, stone, or metal by 1 whenever the object is struck by the monk's unarmed strike (minimum of 0).",
      "Occultist": ": Gain a +1/3 bonus on Appraise and Use Magic Device checks involving stone and metal objects.",
      "Oracle": ": Reduce the penalty for not being proficient with one weapon by 1. When the nonproficiency penalty for a weapon becomes 0 because of this ability, the oracle is treated as having the appropriate Martial or Exotic Weapon Proficiency feat with that weapon.",
      "Paladin": ": Choose a creature type (and subtype, if necessary) from the ranger's favored enemies list. Add a +1/2 bonus on Knowledge checks to identify creatures of that type. You can choose the same creature type up to six times; if you choose the same creature type six times, add 1 point of damage when smiting creatures of that type.",
      "Psychic": ": When casting psychic abjuration spells, add 1/2 level to the effective caster level of the spell, but only to determine the spell's duration.",
      "Ranger": ": Add a +1/2 bonus on wild empathy checks to influence animals and magical beasts that live underground.",
      "Rogue": ": Add a +1/2 bonus on Disable Device checks regarding stone traps and a +1/2 bonus to trap sense regarding stone traps.",
      "Shaman": ": Add 1/4 to the natural armor bonus of the shaman's spirit animal.",
      "Shifter": ": Add a +1/2 bonus on wild empathy checks to influence animals and magical beasts that are normally encountered in underground environments.",
      "Skald": ": Reduce the arcane spell failure chance for casting skald spells when wearing heavy armor by 1%. Once the total reduction reaches 10%, the skald also receives Heavy Armor Proficiency (if the skald does not already possess it).",
      "Slayer": ": Gain a +1/3 bonus on Knowledge (dungeoneering) checks and on Survival checks when underground. If the slayer has a +1 bonus on Knowledge (dungeoneering) checks from this ability, he is also considered trained in that skill.",
      "Sorcerer": ": Add +1/2 to acid and earth spell or spell-like ability damage.",
      "Spiritualist": ": Add a +1/4 bonus on weapon damage rolls with the slam attacks from ectoplasmic bonded manifestation.",
      "Summoner": ": Add a +1/4 natural armor bonus to the AC of the summoner's eidolon.",
      "Swashbuckler": ": Add 1/4 to the swashbuckler's effective class level to determine the extra damage she deals because of the precise strike deed when wielding a light pick or a heavy pick. If the swashbuckler has the Slashing Grace feat or another similar effect, she can treat the battleaxe or handaxe as a one-handed piercing melee weapon, and she gains this benefit when wielding the appropriate weapon for the feat as well.",
      "Vigilante": ": Increase the bonus from social grace on Craft skills by +1/2.",
      "Warpriest": ": Add 1/3 to the number of times per day the warpriest can use blessings, but he can only use these additional uses on blessings that affect weapons or armor.",
      "Witch": ": Add +1/4 natural armor bonus to the AC of the witch's familiar.",
      "Wizard": ": Add 1/3 to the effective caster level of wizard abjuration spells, but only to determine duration.",
      "Subraces": {
        "Deep Delver": [
          "Dwarves living far below the earth have the minesight and deep warrior racial traits. Deep delver spellcasters may exchange stonecunning for the stonesinger trait."
        ],
        "Desert Dwarves": [
          "In southern peaks of the Shattered Range, near Geb and the Screaming Jungle, clans of nomadic dwarves live and travel through ancient tunnels by day, moving to the surface only at night. Though there are no known dwarven cities in this region, the Garundi dwarves claim the extensive tunnels and caverns they move through are the remains of a once=powerful dwarven kingdom, which was struck down by the gods for some long-forgotten offense. These dwarves travel in caravans of 40 or so family units (though the largest caravans can contain more than 300 families) and engage in sporadic clan-based trade or warfare, but they all respect the neutrality of hidden settlements of dwarves who dwell in underground oases within the mountains. Desert dwarves often have the craftsman, mountaineer, and rock stepper alternate racial traits. Most also have the desert delver alternate racial trait described below."
        ],
        "Elder Dwarf": [
          "Traditionalist dwarves of ancient lineage have the ancient enmity, lorekeeper, and either the magic resistant or stubborn racial traits."
        ],
        "Exiled Dwarf": [
          "Dwarves who have lost their homelands usually have the relentless and stubborn racial traits, and often have wyrmscourged as well."
        ],
        "Mountain Dwarf": [
          "Dwarves living atop high peaks have the mountaineer racial trait and often surface survivalist as well. Mountain dwarves are also trained to defend their homes, and may take the sky sentinel and xenophobic traits instead."
        ],
        "Mwangi Dwarves": [
          "Two tribes of dwarves reside in the Mwangi Expanse: the Mbe’ke and the Taralu. The Mbe’ke build cities in the mountains of the Terwa Uplands, while the Taralu live in small clans in the eastern jungle. Although there is little contact between the two groups, they share a reverence for and affinity with dragons—most especially cloud dragons— as well as any draconic creature that can be reasoned with, including wyverns. Mwangi dwarves often take the magic resistant or surface survivalist alternate racial traits. Those who form the strongest spiritual bonds to some form of dragon sometimes also have the breath weapon alternate racial trait described below."
        ],
        "Ouat Caste Dwarves": [
          "The Ouat caste dwarves are a sect of the Pahmet dwarves of Osirion who pursue self-perfection in the style of Irori. Ouat caste dwarves seek to become closer to divinity by overcoming their mortal limitations. They train themselves and others in the monastic city of Tar Kuata, constantly striving to put aside petty material concerns to focus on spiritual growth. The Ouat’s focus on the power of will and self-improvement causes many of them to take the relentless and stubborn alternate racial traits. Those who begin the path to inner awareness very early in their lives also sometimes take the iron within alternate racial trait described below."
        ],
        "Pahmet Dwarves": [
          "The Pahmet have been present in Osirion since ancient days and claim to have been sent by the gods to warn the pharaohs of impending crises and disasters. Though most scholars suspect that claim is more legend than history, the ancient pharaohs of Osirion treated the Pahmet with great reverence. In return, the Pahmet guard Erekrus, a necropolis in the mountains of southern Osirion, where the Pahmet interred the bodies of pharaohs deemed particularly worthy. The Pahmet are a rigid and often mistrusting people; it is common for its members who avoid contact with outsiders to have the xenophobic alternate racial trait. Many Pahmet have the lorekeeper, mountaineer, rock stepper, and surface survivalist alternate racial traits. Those who come from long lines of keepers who dedicate themselves to the guarding of tombs also often have the death’s end alternate racial trait described below."
        ],
        "Paraheen Dwarves": [
          "The Paraheen are a small but important part of the society of Katheer, where they operate numerous forges and weapon shops within the city. Not quite a clan, the Paraheen are a set of related, family-run businesses respected for their great craftsmanship and work ethic. While most Paraheen are not citizens of Qadira, they are treated as a valued subclass of residents, with enough powerful patrons among the upper ranks of Qadiran society to afford them protection that in some cases is greater than citizenship. The Paraheen have operated as an autonomous community for centuries, avoiding local politics and worshiping a combination of traditional dwarven gods and an aspect of Sarenrae who is aligned with the fire of the forge. Nearly all Paraheen have the craftsman alternate racial trait, but in the case of the Paraheen, it replaces hardy rather than greed. Those Paraheen who are involved in trade by river and sea, common in Katheer, also generally have the saltbeard alternate racial trait. Most Paraheen from older families tend to have the iron citizen alternate racial trait described below."
        ],
        "Sky Citadel Dwarves": [
          "When the dwarves successfully completed the Quest for Sky, they set about constructing 10 Sky Citadels, massive fortresses that formed the basis for dwarven kingdoms in the Inner Sea region. While several of those Sky Citadels have been lost or overrun, a few—such as Highhelm, Janderhoff, and Dongun Hold—remain bastions of dwarven tradition and authority. Because these Sky Citadels often have connections to the Darklands, it is common for the dwarves dwelling in their lower reaches to have the ancient enmity or deep warrior alternate racial traits, while those in lands populated by ogres and hill giants often have the giant hunter alternate racial trait, and those in wealthy areas that attract the attention of dragons sometimes have the sky sentinel or wyrmscourged alternate racial traits. Because of the eon-long histories of the Sky Citadels, their citizens also often have the deep tradition alternate racial trait described below."
        ]
      }
    }
  },
  {
    "Elf": {
      "Source": "Blood of Shadows pg. 5",
      "Physical Description": ": Generally taller than humans, elves possess a graceful, slender physique that is accentuated by their long, pointed ears. It is a mistake, however, to consider them weak or feeble, as the thin limbs of an elf can contain surprising power. Their eyes are wide and almond-shaped, and filled with large, vibrantly colored pupils. The coloration of elves as a whole varies wildly, and is much more diverse than that of human populations. However, as their coloration often matches their surroundings, the elves of a single community may appear quite similar. Forest-dwelling elves often have variations of green, brown, and tan in their hair, eye, and even skin tones.",
      "Society": ": Many elves feel a bond with nature and strive to live in harmony with the natural world. Although, like most, elves prefer bountiful lands where resources are plentiful, when driven to live in harsher climates, they work hard to protect and shepherd the region's bounty, and learn how to maximize the benefit they receive from what little can be harvested. When they can carve out a sustainable, reliable life in deserts and wastelands, they take pride as a society in the accomplishment. While this can make them excellent guides to outsiders they befriend who must travel through such lands, their disdain of those who have not learned to live off the scant land as they have makes such friends rare.",
      "Relations": ": Elves are prone to dismissing other races, writing them off as rash and impulsive, yet on an individual level, they are excellent judges of character. In many cases an elf will come to value a specific member of another race, seeing that individual as deserving and respectable, while still dismissing the race as a whole. If called on this behavior, the elf often doesn't understand why his \"special friend\" is upset the elf has noticed the friend is \"so much better than the rest of his kind.\" Even elves who see such prejudice for what it is must constantly watch themselves to prevent such views from coloring their thinking.",
      "Alignment and Religion": ": Elves are emotional and capricious, yet value kindness and beauty. Most elves are chaotic good, wishing all creatures to be safe and happy, but unwilling to sacrifice personal freedom or choice to accomplish such goals. serving as an example of personal artistry and freedom of expressions, rather than seeking some base physical gratification.",
      "Adventurers": ": Many elves embark on adventures out of a desire to explore the world, leaving their secluded realms to reclaim forgotten elven magic or search out lost kingdoms established millennia ago by their ancestors. This need to see a wider world is accepted by their societies as a natural part of becoming mature and experienced individuals. Such elves are expected to return in some few decades and take up lives in their homelands once more, enriched both in treasure and in worldview. For those elves raised among humans, however, life within their homes—watching friends and family swiftly age and die—is often stifling, and the ephemeral and unfettered life of an adventurer holds a natural appeal.",
      "Male Names": ": Caladrel, Heldalel, Lanliss, Meirdrarel, Seldlon, Talathel, Variel, Zordlon.",
      "Female Names": ": Amrunelara, Dardlara, Faunra, Jathal, Merisiel, Oparal, Soumral, Tessara, Yalandlara.: Elves are nimble, both in body and mind, but their forms are frail.",
      "+2 Dexterity, +2 Intelligence, –2 Constitution": ": Elves are nimble, both in body and mind, but their forms are frail.",
      "Medium": ": Gain a +1/3 bonus on all skill checks using occult skill unlocks.",
      "Normal Speed": ": Elves have a base speed of 30 feet.",
      "Low-Light Vision": ": Elves can see twice as far as humans in conditions of dim light.",
      "Elven Immunities": ": Elves are immune to magic sleep effects and get a +2 racial bonus on saving throws against enchantment spells and effects.",
      "Elven Magic": ": Elves receive a +2 racial bonus on caster level checks made to overcome spell resistance. In addition, elves receive a +2 racial bonus on Spellcraft checks made to identify the properties of magic items.",
      "Keen Senses": ": Elves receive a +2 racial bonus on Perception checks.",
      "Weapon Familiarity": ": Elves are proficient with longbows (including composite longbows), longswords, rapiers, and shortbows (including composite shortbows), and treat any weapon with the word \"elven\" in its name as a martial weapon.",
      "Languages": ": Elves begin play speaking Common and Elven. Elves with high Intelligence scores can choose from the following languages: Celestial, Draconic, Gnoll, Gnome, Goblin, Orc, and Sylvan.Heroes from the Fringe pg. 10",
      "Alchemist": ": Add one extract formula from the alchemist's list to his formula book. This formula must be at least one level lower than the highest-level formula the alchemist can create.",
      "Arcanist": ": Increase total number of points in the arcanist's arcane reservoir by 1.",
      "Barbarian": ": Add +1 to the barbarian's base speed. In combat this option has no effect unless the barbarian has selected it five times (or another increment of five). This bonus stacks with the barbarian's fast movement feature and applies under the same conditions as that feature.",
      "Bard": ": Add +1 to the bard's CMD when resisting a disarm or sunder attempt.",
      "Bloodrager": ": Add 1 foot to the bloodrager's base speed. In combat, this only has an effect for every five increases in base speed. This bonus stacks with the bloodrager's fast movement class feature, and applies under the same conditions and that feature.",
      "Brawler": ": Add 1 foot to the brawler's base speed. In combat, this has an effect only for every five increases in the brawler's base speed.",
      "Cavalier": ": Add +1 hit point to the cavalier's mount. If the cavalier ever replaces his mount, the new mount gains these bonus hit points.",
      "Cleric": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power.",
      "Druid": ": Add +1/3 to the druid's natural armor bonus when using wild shape.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a disarm or sunder attempt.",
      "Gunslinger": ": Add +1/3 on critical hit confirmation rolls made with firearms (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Hunter": ": Choose a weapon from the following list: longbow, longsword, rapier, short sword, shortbow, or any weapon with \"elven\" in its name. Gain a +1/2 bonus on critical hit confirmation rolls made while using that type of weapon (maximum bonus +4). This bonus does not stack with those gained through Critical Focus and similar effects.",
      "Inquisitor": ": Add one spell known from the inquisitor's spell list. This spell must be at least one level below the highest-level spell the inquisitor can cast.",
      "Investigator": ": Increase the total number of points in the investigator's inspiration pool by 1/3.",
      "Kineticist": ": Gain a +1/4 bonus on damage rolls that apply the kineticist's elemental overf low bonus.",
      "Magus": ": The magus gains 1/6 of a new magus arcana.",
      "Mesmerist": ": Add a +1/4 bonus on grapple and trip combat maneuver checks.",
      "Monk": ": Add +1 to the monk's base speed. In combat this option has no effect unless the monk has selected it five times (or another increment of five). This bonus stacks with the monk's fast movement class feature and applies under the same conditions as that feature.",
      "Occultist": ": Increase the occultist's total number of points of mental focus by 1/2 point.",
      "Oracle": ": Add +1/6 to the oracle's level for the purpose of determining the effects of one revelation.",
      "Paladin": ": Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm).",
      "Psychic": ": Increase the total number of points in the psychic's phrenic pool by 1/3 point.",
      "Ranger": ": Choose a weapon from the following list: longbow, longsword, rapier, shortbow, short sword, or any weapon with \"elven\" in its name. Add +1/2 on critical hit confirmation rolls made while using that weapon (maximum bonus of +4). This bonus does not stack with Critical Focus.",
      "Rogue": ": Add +1 to the number of times per day the rogue can cast a cantrip or 1st-level spell gained from the minor magic or major magic talent. The number of times this bonus is selected for the major magic talent cannot exceed the number of times it is selected for the minor magic talent. The rogue must possess the associated rogue talent to select these options.",
      "Shaman": ": Add 5 feet to the range of a chosen shaman hex. Multiple bonuses from this ability can apply to the same hex, to a maximum of an additional 30 feet for any single hex.",
      "Shifter": ": Add 1 to the shifter's base speed. This has no ingame effect unless the shifter has selected this reward five times (or any multiple of five) to enhance her speed by 5 feet. For example, a 4th-level elven shifter who has selected this option four times has a base speed of 34 feet, but is treated as if she still had a base speed of 30 feet. When she reaches 5th level and takes this favored class option again, her base speed becomes 35 feet. This bonus applies only when the shifter is wearing no armor.",
      "Skald": ": Increase the bonus granted by the well-versed class feature by 1/4 (maximum +8).",
      "Slayer": ": Increase the studied target bonus on Perception and Survival checks by 1/4. When the slayer gains the stalker class feature, he also gains this increase to the studied target bonus on Stealth checks.",
      "Sorcerer": ": Choose a terrain type from the ranger's favored terrain list. When casting sorcerer spells in the chosen terrain, add 1/3 to the effective caster level of the spell, for the purpose of determining the spells' duration.",
      "Spiritualist": ": Add 1/6 to the shield bonus granted by the 3rd-level ectoplasmic bonded manifestation ability.",
      "Summoner": ": The amount of time the summoner must spend to summon his eidolon is reduced by 1 round, to a minimum of 1 round.",
      "Swashbuckler": ": Increase the total number of points in the swashbuckler's panache pool by 1/4.",
      "Vigilante": ": Gain +1/3 on all Acrobatics, Climb, and Stealth checks in forested areas.",
      "Warpriest": ": Add 1/2 to the number of times per day the warpriest can use blessings, but he can use these additional blessings on only those from the Air, Animal, Charm, Magic, Plant, or Sun domains.",
      "Witch": ": Add a +1/2 bonus on Spellcraft checks to identify cursed items and on Sense Motive checks to notice enchantment or possession.",
      "Wizard": ": Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power.",
      "Subraces": {
        "Aquatic Elves": [
          "Aquatic elves are the oceanic cousins of landborn elves. These elves have developed gills and webbed fingers and toes that allow them to survive and navigate the waters of Golarion, and often have blue, coral, or seaweed-black skin to blend into their environment. A significant number of aquatic elves live in the Steaming Sea near Mordant Spire, and in the Arcadian Ocean. Aquatic elves typically live secluded lives, either on their own or in small communities, though groups of aquatic elves that interact with land-dwelling communities are not uncommon. These elves are as varied as their land-dwelling kin, with unique cultures and customs scattered throughout the oceans and seas of Golarion. Aquatic elves often have the aquatic mastery alternate racial trait described below."
        ],
        "Arctic Elf": [
          "These elves were born and raised in the frozen lands of the far north or south, and have dealt with freezing deserts, nights that last for weeks, and the horrors that roam the cold terrain. These elves have the darkvision, desert runner, and elemental resistance alternate racial traits."
        ],
        "Dusk Elf": [
          "Rather than being tied to the terrain around them, some elves are linked to the night itself. Though not tied to demon worship and evil as drow are, these elves are similarly attuned to the magical concepts of darkness and shadow. These elves have the arcane focus, darkvision, dreamspeaker, and silent hunter alternate racial traits."
        ],
        "Ekujae Elves": [
          "Though the Ekujae clans are often mistaken for unaffiliated tribes, they are in fact a united nation and still hold vestiges of the power that their ancient kingdom once wielded. Ekujae elves reside within the Mwangi Expanse in hidden jungle villages so interwoven with the surrounding trees that the buildings there are overlooked even by travelers passing within a few hundred feet them. Unlike many of the elves of Avistan, the Ekujae remained on Golarion despite the calamity of Earthfall and tell tales of having defeated a “Great Darkness” after the disaster. They still hone their skills for war and are ever ready to fight the Darkness if it returns. Due to this ancient responsibility, Ekujae hold to strict traditions in many matters, including the burying of their fallen and the act of swearing oaths and ritualized agreements.Like other elves, Ekujae have keen intellects and are skilled in magical lore, including what has been passed down through their oral traditions and the numerous secrets of the Mwangi Expanse. They often journey to the Magaambya to study magic or to share their knowledge with that academy’s students. Ekujae frequently have the long-limbed alternate racial trait and either the woodcraft, silent hunter, or light against darkness alternate racial traits, as well as the sense thoughts alternate racial trait described below."
        ],
        "Forlorn Elves": [
          "Forlorn elves rarely refer to themselves by that name; instead, other elves use the term to refer to elves who reside among shorter-lived races. Forlorn elves often watch many of their friends and family die before their first century is past. Some Forlorn have adopted a variety of unhealthy coping mechanisms as a result, such as recklessness or substance abuse; others develop antisocial tendencies and keep others at arm’s length to avoid the pain of loss. Still others learn to accept the brevity of the lives around them, cherishing what time they have with friends while they still have it.Forlorn are the most common wanderers of elvenkind, whether they’re traveling widely to avoid attachment or relishing travel with short-lived companions, and many become adventurers. Some find their way to elven lands, where their kin sympathetically welcome them, while others avoid such places out of bitterness or fear of rejection. Forlorn elves frequently have the envoy and urbanite alternate racial traits; some also have the devoted companion alternate racial trait described below."
        ],
        "Jininese Elves": [
          "The elves of Jinin are descended from those who traveled underground millennia ago to escape Earthfall. Led by the oracle Jininsiel and guided by a vast, treelike vein of mithral, these elves emerged in Tian Xia, where they founded the nation of Jinin. Jininese elves have adopted many of the customs of their human and samsaran neighbors—Jinin’s culture places great emphasis on artistic pursuits, especially those involving mithral, which serves as a national symbol, lucrative export, and treasured cultural relic for Jininese elves. The elves of Jinin are far less isolationist than many other elven cultures, freely permitting outsiders into Jinin; likewise, while most Jininese elves remain there, many travel or settle across the Dragon Empires and beyond.Jininese elves frequently have the dreamspeaker and envoy alternate racial traits, as well as the Jininese weapon mastery alternate racial trait described below."
        ],
        "Savage Elf": [
          "In lands where every day is a constant struggle to survive and the niceties of civilization are rare, elves adapt to depend on swift strikes and lifelong vigilance to keep their families alive. These elves have the eternal grudge and fleet-footed alternate racial traits."
        ],
        "Snowcaster Elves": [
          "The Snowcaster tribes of the far north are extraordinarily reclusive, hiding their settlements in icy caverns, mountain valleys, the hearts of snow-shrouded pine forests, and other difficult-to-reach places. Their loyalty to their homes borders on religious reverence, whether they are ancestral burial grounds, ancient elven ruins, or simply places they’ve chosen as their own. Snowcasters rarely journey outside their homes or meet with outsiders. The primary exceptions to this are the twilight speakers, who serve as emissaries to the outside world. Less commonly, Snowcasters who have been exiled, who have lost their homes to monsters, or who are simply overcome with wanderlust may journey to the outside world to seek a new life.Snowcasters frequently have the desert runner, elemental resistance (cold), and fleet-footed alternate racial traits; a few have the frostmelding alternate racial trait described below."
        ],
        "Spiresworn Elves": [
          "The Mordant Spire’s elves, with their eerie masks and off-putting mannerisms, are a mystery to most Avistani. These elves have sworn to prevent exploration of Azlant in order to preserve and isolate the remnants of the Azlanti culture and protect Golarion from another Earthfall. The reclusive Spiresworn use enchantment and water magic to dissuade explorers; they resort to violent or deadly means only with utmost reluctance. In recent years, some younger Spiresworn have begun to question their isolationist traditions. While their commitment to protecting Azlant remains firm, a growing segment of Spiresworn believe that there is much to gain from interaction with the wider world. These elves sometimes leave the Spire to seek knowledge and experience.Spiresworn frequently have the keeper of secrets alternate racial trait, as well as the crossbow training, natural swimmer, and tongue of the sea alternate racial traits; some also have the moonkissed alternate racial trait described below."
        ],
        "Tower Elf": [
          "Some elven institutions of magical learning date back centuries, and entire clans of elves have lived for generations as caretakers, students, and instructors of these self-sufficient schools of wizardry. These elves have the arcane focus and urbanite alternate racial traits."
        ]
      }
    }
  },
  {
    "Gnome": {
      "Source": "Heroes from the Fringe pg. 16",
      "Physical Description": ": Gnomes are one of the smallest of the common races, generally standing just over 3 feet in height. Despite their small frames, however, gnomes are extremely resilient, and not as weak as many of their foes assume. Though their diminutive stature reduces their ability to move quickly, gnomes often train to take advantage of their size, especially when fighting foes much larger than themselves.",
      "Society": ": Unlike most races, gnomes do not generally organize themselves within classic societal structures. Gnome cities are unusual and gnome kingdoms almost unknown. Further, gnomes have no particular tendency to gather in specific neighborhoods even when a large number of them live among other races. While specific laws meant to contain the potential impact of gnomes on a society may require a \"gnome quarter,\" and societal pressure sometimes causes all non-gnomes to move away from areas with high gnome populations, left to their own devices, gnomes tend to spread evenly throughout communities that allow them.",
      "Relations": ": Gnomes have difficulty interacting with the other races, on both emotional and physical levels. In many ways the very fact other races see gnomes as odd is itself the thing gnomes find most odd about other races, and this leads to a strong lack of common ground upon which understanding and relationships can be built. When two gnomes encounter one another, they generally assume some mutually beneficial arrangement can be reached, no matter how different their beliefs and traditions may be. Even if this turns out not to be the case, the gnomes continue to look for commonalities in their dealings with each other. The inability or unwillingness of members of other races to make the same effort when dealing with gnomes is both frustrating and confusing to most gnomes.",
      "Alignment and Religion": ": Although gnomes are impulsive tricksters, with sometimes inscrutable motives and equally confusing methods, their hearts are generally in the right place. What may seem a malicious act to a non-gnome is more likely an effort to introduce new acquaintances to new experiences, however unpleasant the experiences may be. Gnomes are prone to powerful fits of emotion, and find themselves most at peace within the natural world.",
      "Adventurers": ": Gnomes' propensity for wanderlust, deep curiosity, and desire to master odd or esoteric skills and languages make them natural adventurers. They often become wanderers to experience new aspects of life, for nothing is as novel as the uncounted dangers facing adventurers. Many gnomes see adventuring as the only worthwhile purpose in life, and seek out adventures for no other motive than to experience them. Other gnomes desire to find some lost lore or material that has ties to their chosen vocation and believe only dragon hoards and ancient ruins can contain the lore they need, which can result in gnomes who think of themselves as bakers or weavers being just as accomplished adventurers as those who declare themselves to be mages or scouts.",
      "Male Names": ": Abroshtor, Bastargre, Halungalom, Krolmnite, Poshment, Zarzuket, Zatqualmie.",
      "Female Names": ": Besh, Fijit, Lini, Majet, Neji, Pai, Queck, Trig.: Gnomes are physically weak but surprisingly hardy, and their enthusiastic attitudes make them naturally agreeable.",
      "+2 Constitution, +2 Charisma, –2 Strength": ": Gnomes are physically weak but surprisingly hardy, and their enthusiastic attitudes make them naturally agreeable.",
      "Small": ": Gnomes are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Gnomes have a base speed of 20 feet.",
      "Low-Light Vision": ": Gnomes can see twice as far as humans in conditions of dim light.",
      "Defensive Training": ": Gnomes get a +4 dodge bonus to their AC against monsters of the giant type.",
      "Gnome Magic": ": Gnomes add 1 to the DCs of any saving throws to resist illusion spells that they cast. Gnomes with a Charisma of 11 or higher also gain the following spell-like abilities: 1/day—,,, and. The caster level for these effects is equal to the gnome's character level. The DC for these spells is equal to 10 + the spell's level + the gnome's Charisma modifier.",
      "Hatred": ": Gnomes receive a +1 bonus on attack rolls against humanoid creatures of the reptilian and goblinoid subtypes because of their special training against these hated foes.",
      "Illusion Resistance": ": Gnomes get a +2 racial bonus on saving throws against illusion spells or effects.",
      "Keen Senses": ": Gnomes receive a +2 racial bonus on Perception checks.",
      "Obsessive": ": Gnomes receive a +2 racial bonus on a Craft or Profession skill of their choice.",
      "Weapon Familiarity": ": Gnomes treat any weapon with the word \"gnome\" in its name as a martial weapon.",
      "Languages": ": Gnomes begin play speaking Common, Gnome, and Sylvan. Gnomes with high Intelligence scores can choose from the following languages: Draconic, Dwarven, Elven, Giant, Goblin, and Orc.Heroes from the Fringe pg. 16",
      "Alchemist": ": Add +1/2 to the number of bombs per day the alchemist can create.",
      "Arcanist": ": Add 1/6 to the number of points the arcanist gains in her arcane reservoir each day.",
      "Barbarian": ": Add a +1/2 bonus to the barbarian's trap sense.",
      "Bard": ": Add +1 to the bard's total number of bardic performance rounds per day.",
      "Bloodrager": ": Add 1/4 to the bloodrager's effective class level when determining the power of her bloodrager bloodline powers.",
      "Brawler": ": Increase the number of times per day the brawler can use martial flexibility by 1/4.",
      "Cavalier": ": Add +1 to the cavalier's mounted base speed. In combat this has no effect unless the cavalier has selected this reward five times (or another increment of five). If the cavalier ever replaces his mount, the new mount gains this bonus to its speed.",
      "Cleric": ": Add +1/2 to the cleric's channeled energy total when healing creatures of the animal, fey, and plant types.",
      "Druid": ": The druid's animal companion gains 1/4 point of DR/cold iron (maximum DR 5/cold iron). If the druid replaces her companion, the new companion gains this DR.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a dirty trick or steal attempt.",
      "Gunslinger": ": The gunslinger reduces the amount of time needed to restore a broken firearm using the Gunsmithing feat by 5 minutes (maximum reduction of 50 minutes).",
      "Hunter": ": Add DR 1/magic to the hunter's animal companion. Each time the hunter gains another level, the DR increases by 1/2 (maximum DR 10/magic). If the hunter replaces her animal companion, the new companion gains this damage reduction.",
      "Inquisitor": ": Add a +1 bonus on concentration checks when casting inquisitor spells.",
      "Investigator": ": Add one extract formula from the investigator's list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create.",
      "Kineticist": ": Gain a +1/2 bonus on Bluff, Diplomacy, Intimidate, and Sense Motive skill checks against creatures with the elemental subtype matching the kineticist's primary element.",
      "Kinetcist": ": Add a +1/6 bonus on combat maneuver checks attempted as part of a substance infusion.",
      "Magus": ": Add 1/2 of an illusion spell from the sorcerer/ wizard spell list that isn't on the magus spell list to the magus's spellbook. The magus treats this spell as if it were on the magus spell list at the same level as on the sorcerer/ wizard list. This spell must be at least 1 level below the  highest spell level the magus can cast.",
      "Medium": ": Gain a +1/2 bonus on Bluff, Diplomacy, Intimidate, and Sense Motive skill checks against spirits, undead, phantoms, and creatures native to the Astral Plane.",
      "Mesmerist": ": Increase the number of mesmerist tricks the mesmerist can use per day by 1/3.",
      "Monk": ": Add +1 to the monk's Acrobatics check bonus gained by spending a point from hispool. A monk must be at least 5th level to select this benefit.",
      "Occultist": ": Increase the duration of the occultist's minor figment by 1 minute, and increase the total concealment miss chance from the occultist's distortion resonant power by 2%. This doesn't increase the maximum miss chance.",
      "Oracle": ": Add +1/6 to the oracle's level for the purpose of determining the effects of the oracle's curse ability.",
      "Paladin": ": Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm).",
      "Psychic": ": Increase the total number of points in the psychic's phrenic pool by 1/3 point.",
      "Ranger": ": Add DR 1/magic to the ranger's animal companion. Each additional time the ranger selects this benefit, the DR/magic increases by +1/2 (maximum DR 10/magic). If the ranger ever replaces his animal companion, the new companion gains this DR.",
      "Rogue": ": Add 1/4 to the Perception and Disable Device DCs of traps the rogue creates.",
      "Shaman": ": The shaman gains 1/6 of a new shaman hex.",
      "Shifter": ": Gain energy resistance 1 against acid, cold, electricity, or fire. Each time the shifter selects this reward, increase that energy resistance by 1, to a maximum of energy resistance 10. Once the gnome reaches energy resistance 10, she can select a new type of energy to build her resistance to the next time she selects this favored class option.",
      "Skald": ": Add a +1 bonus on concentration checks when casting skald spells.",
      "Slayer": ": The slayer gains 1/6 of a new slayer talent.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power.",
      "Spiritualist": ": Add 1/6 to the shield bonus granted to the spiritualist while under the effects of either spiritual interference or greater spiritual interference.",
      "Summoner": ": Add +1 hit point to the summoner's eidolon.",
      "Swashbuckler": ": Increase the number of times per day the swashbuckler can use charmed life by 1/4.",
      "Vigilante": ": Gain +1/2 on Bluff checks when attempting to tell a lie that would be true from the point of view of the vigilante's current identity.",
      "Warpriest": ": Add 1/2 to the result of the warpriest's channeled energy when healing creatures of the animal, fey, and plant types.",
      "Witch": ": The witch gains 1/6 of a new witch hex.",
      "Wizard": ": Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power.",
      "Subraces": {
        "Bleachlings": [
          "While most gnomes who undergo the harrowing process of the Bleaching physically waste away from boredom, some gnomes do survive the process, emerging as humorless, monochrome versions of their former selves. Referred to as “bleachlings,” these gnomes are eerily serene and placid. In addition to the effects of the Bleaching itself, many bleachlings have the academician and eternal hope alternate racial traits, as well as the bleachling magic and nature affinity traits listed below."
        ],
        "Dread Gnomes": [
          "Moodier, less forgiving, and often crueler than other gnomes, dread gnomes trace their heritage to the darker, more bloodthirsty lines of fey. Though not all dread gnomes are evil, they all find humor in watching others suffer, and have little use for the bright colors and joyful pursuits of their more cheerful cousins. Dread gnomes have the fell magic and knack for poison alternate racial traits."
        ],
        "First World Gnomes": [
          "The gnomes of Golarion are immigrants from the First World, the primordial realm of the fey. While Golarion’s gnomes have had generations to adapt to the realities of the Material Plane, many gnomes remain in the First World to this day. In addition to the First World creature template (57), most First World gnomes have the bond to the land alternate racial trait, as well as the fey fortitude and fey magic traits listed below."
        ],
        "Gear Gnomes": [
          "Sometimes rather than a single gnome becoming obsessed with a project, whole families of gnomes undertake a project so massive it requires generations of artisans to complete. Such projects often involve complex clockwork devices (or entire clockwork buildings), and those born into families dedicated to lifetimes of work on them are known as gear gnomes. Gear gnomes have the academician and master tinker alternate racial traits."
        ],
        "Lava Gnomes": [
          "Fascinated by the power of magma and living in vast caverns beneath active volcanoes, lava gnomes are considered hot-tempered and dangerously unstable even by other gnomes. Lava gnomes have the darkvision and pyromaniac alternate racial traits."
        ],
        "Segada Gnomes": [
          "The city of Segada on the continent of Arcadia has a substantial gnomish population, which emigrated from the tall peaks of the Akrandida Mountains. Known for their creativity and love all forms of artistic expression, many of Segada’s gnomes make their living as entertainers. Even more so than other gnomes, Segada gnomes are fond of wearing bright colors, and often wear accessories that make noise as they move, such as bells, jangling bracelets, and flute-like reed pendants. Most Segada gnomes have the darkvision, gift of tongues, and magical linguist alternate racial traits, as well as the artistic and sound mimicry alternate racial traits described below."
        ],
        "Traveler Gnomes": [
          "These gnomes were born on the move, their families living on a ship or in a caravan wagon. These gnomes have the magical linguist and either the explorer or the gift of tongues alternate racial traits."
        ]
      }
    }
  },
  {
    "Half-Elf": {
      "Source": "Heroes of the Streets pg. 8",
      "Physical Description": ": Half-elves stand taller than humans but shorter than elves. They inherit the lean build and comely features of their elven lineage, but their skin color is normally dictated by their human side. While half-elves retain the pointed ears of elves, theirs are more rounded and less pronounced. Their eyes tend to be humanlike in shape, but feature an exotic range of colors from amber or violet to emerald green and deep blue. This pattern changes for half-elves of drow descent, however. Such elves are almost unfailingly marked with the white or silver hair of the drow parent, and more often than not have dusky gray skin that takes on a purplish or bluish tinge in the right light, while their eye color usually favors that of the human parent.",
      "Society": ": Their lack of a unified homeland and culture forces half-elves to remain versatile, able to conform to nearly any environment. While often considered attractive to both races for the same reasons as their parents, half-elves rarely fit in with either humans or elves, as both races see too much evidence of the other in them. This lack of acceptance weighs heavily on many half-elves, yet others are bolstered by their unique status, seeing in their lack of a formalized culture the ultimate freedom. As a result, half-elves are incredibly adaptable, capable of adjusting their mind-sets and talents to whatever societies they find themselves in.",
      "Relations": ": Half-elves understand loneliness, and know that character is often less a product of race than of life experience. As such, they are often open to friendships and alliances with other races, and less likely than most to rely on first impressions when forming opinions of new acquaintances.",
      "Alignment and Religion": ": Half-elves' isolation strongly influences their characters and philosophies. Cruelty does not come naturally to them, nor does blending in or bending to societal convention—as a result, most half-elves are chaotic good. Half-elves' lack of a unified culture makes them less likely to turn to religion, but those who do generally follow the common faiths of their homeland. Others come to religion and worship later in their lives, especially if they have been made to feel part of a community through faith or the work of clerical figures.",
      "Adventurers": ": Half-elves tend to be itinerants, wandering the lands in search of a place they might finally call home. The desire to prove themselves to the community and establish a personal identity—or even a legacy—drives many Half-Elf adventurers to lives of bravery. Some half-elves claim that despite their longevity, they perceive the passage of time more like humans than elves, and are driven to amass wealth, power, or fame early on in life so they may spend the rest of their years enjoying it.",
      "Male Names": ": Calathes, Encinal, Iradli, Kyras, Narciso, Quinray, Seltyiel, Zirul.",
      "Female Names": ": Cathran, Elsbeth, Iandoli, Kieyanna, Lialda, Maddela, Reda, Tamarie.: Half-Elf characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "+2 to One Ability Score": ": Half-Elf characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "Medium": ": Gain a +1/3 bonus on all skill checks using occult skill unlocks.",
      "Normal Speed": ": Half-elves have a base speed of 30 feet.",
      "Low-Light Vision": ": Half-elves can see twice as far as humans in conditions of dim light.",
      "Adaptability": ": Half-elves receive Skill Focus as a bonus feat at 1st level.",
      "Elf Blood": ": Half-elves count as both elves and humans for any effect related to race.",
      "Elven Immunities": ": Half-elves are immune to magic sleep effects and get a +2 racial bonus on saving throws against enchantment spells and effects.",
      "Keen Senses": ": Half-elves receive a +2 racial bonus on Perception checks.",
      "Multitalented": ": Half-elves choose two favored classes at 1st level and gain 1 additional hit point or skill point whenever they take a level in either one of those classes.",
      "Languages": ": Half-elves begin play speaking Common and Elven. Half-elves with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic).Heroes from the Fringe pg. 20,Bastards of Golarion pg. 5",
      "Alchemist": ": Add +1 foot to the range increment of the alchemist's thrown splash weapons (including the alchemist's bombs). This option has no effect unless the alchemist has selected it 5 times (or another increment of 5); a range increment of 24 feet is effectively the same as a range increment of 20 feet, for example.",
      "Arcanist": ": When casting arcanist enchantment spells, add 1/3 to the effective caster level, but only for the purpose of determining duration.",
      "Barbarian": ": Add +1/4 to the bonus on Reflex saves and dodge bonus to AC against attacks made by traps granted by trap sense.",
      "Bard": ": Add +1 to the bard's total number of bardic performance rounds per day.",
      "Bloodrager": ": Increase the bonus gained from blood sanctuary by 1/4.",
      "Brawler": ": Add 1 to the brawler's CMD when she's resisting a trip or overrun combat maneuver.",
      "Cavalier": ": Add +1 foot to the cavalier's mount's base speed. This option has no effect unless the cavalier has selected it 5 times (or another increment of 5); a speed of 54 feet is effectively a speed of 50 feet, for example. If the cavalier ever replaces his mount, the new companion gains this base speed bonus.",
      "Cleric": ": Add a +1/4 bonus on caster level checks to remove afflictions (curses, diseases, poisons, etc.).",
      "Druid": ": Select one cleric domain power at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power. For druids whose nature bond gives them an animal companion, add +1 skill rank to the animal companion. If the druid ever replaces her animal companion, the new companion gains these bonus skill ranks.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a disarm or overrun combat maneuver.",
      "Gunslinger": ": Add +1/4 to the number of grit points in the gunslinger's grit pool.",
      "Hunter": ": Add 1 foot to the hunter's companion's base speed. In combat, this has an effect only for every five increases in base speed.",
      "Inquisitor": ": Add +1/4 to the number of times per day the inquisitor can change her most recent teamwork feat.",
      "Investigator": ": Gain a +1/4 bonus on all inspiration rolls.",
      "Kineticist": ": Gain a +1/4 bonus on damage rolls that apply the kineticist's elemental overflow bonus.",
      "Magus": ": Add +1/4 to the magus's arcane pool.",
      "Mesmerist": ": When casting mesmerist enchantment spells, add 1/2 to the effective caster level of the spell, but only to determine the spell's duration.",
      "Monk": ": Add +1/2 on Escape Artist checks and on Acrobatics checks to cross narrow surfaces.",
      "Occultist": ": Gain a +1/2 bonus on Spellcraft checks to identify the properties of magic items and a +1/2 bonus on Use Magic Device checks to emulate a race.",
      "Oracle": ": Select one revelation normally usable a number of times per day equal to 3 + the oracle's Charisma modifier. Add 1/2 to the number of uses per day of that revelation.",
      "Paladin": ": Add +1 foot to the size of all the paladin's aura class features. This option has no effect unless the paladin has selected it 5 times (or another increment of 5); an aura of 14 feet is effectively the same as a 10-foot aura, for example.",
      "Psychic": ": Gain 1/6 of a new phrenic amplification.",
      "Ranger": ": The duration of the ranger's companion bond increases by 1 round.",
      "Rogue": ": Add a +1/2 bonus on Bluff checks to feint and Diplomacy checks to gather information.",
      "Shaman": ": Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Shifter": ": Add a +1/2 bonus on Survival checks to get along in the wild, to avoid getting lost, and to avoid all natural hazards.",
      "Skald": ": Increase the skald's total number of raging song rounds per day by 1.",
      "Slayer": ": Gain a +1/2 bonus on Bluff checks to feint and Diplomacy checks to gain information.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power.",
      "Spiritualist": ": Add 1 skill rank to the spiritualist's phantom.",
      "Summoner": ": Add +1/4 to the eidolon's evolution pool.",
      "Swashbuckler": ": Increase the number of times per day the swashbuckler can use charmed life by 1/4.",
      "Vigilante": ": Gain +1/2 on the Disguise bonus from seamless guise.",
      "Warpriest": ": Gain a +1/3 bonus on the damage dealt or healed with the warpriest's channel energy ability.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells.",
      "Wizard": ": When casting wizard enchantment spells, add +1/3 to the effective caster level of the spell, but only to determine the spell's duration.",
      "Subraces": {
        "Aquatic Half-Elves (Shoreborn)": [
          "The children of aquatic elves and land-bound humans feel the disparity between their heritages more than any other. These half-elves show their parentage on their faces, with sandy, russet, or green-black skin to match their elven parent. Slightly webbed fingers and toes aid in swimming, but their neck slits almost never function as gills. A few aquatic half-elves can breathe underwater and live with their elven parents, but far more shoreborn live on land, feeling a constant call to the water. Many find work as sailors. Fishing vessels and merchant ships often have shoreborn deckhands and first mates, and a crew made up solely of aquatic half-elves sails an infamous pirate ship known as the Shoreline Scourge."
        ],
        "Ekujae Half-Elves (Wildborn)": [
          "The half-elves of the Mwangi Expanse have the dark skin of their Ekujae parents, but they tend to be closer in stature and build to their human parents, allowing wildborn to pass for human more easily than most of their fellow half-elves. These half-elves are equally at home in the wilds of the jungle or arranging trade deals in the larger Mwangi cities. While some Ekujae raise their wildborn children, others ritually turn over their Half-Elven offspring to specific Half-Elven villages within their Mwangi nation. The adult wildborn of these villages seek out and accept any of these children who might have fallen through the cracks, raising them with respect for both the wilderness and society. Even a few half-elves from other backgrounds travel to the Mwangi Expanse to join these villages, finding acceptance they can’t get anywhere else. The members of these villages protect their homes fiercely, and few dare attack them."
        ],
        "Elf-Raised": [
          "These half-elves represent those embraced by their elven relatives, and raised with all of the traditional cultural training and education typical of most full-blooded elves. These half-elves have the ancestral arms and arcane training alternate racial traits."
        ],
        "Half-Drow (Darkborn)": [
          "Scorned by both drow, who call them thinbloods, and humans, who call them darkborn, half-drow face discrimination and tribulation from an early age. Those half-drow who are not crushed by persecution are forced to age into particularly strong and independent adults. Some give into bitterness from their upbringing, becoming hardened assassins or wanton killers. Others deliberately rebel against their brutal childhoods, becoming righteous warriors against evil. Either way, half-drow fight fiercely to the very last. Darkborn have the gray skin and light-colored hair of the drow but have human-looking eyes, and they have a more difficult time appearing fully elven or human than most half-elves do."
        ],
        "Human-Raised": [
          "These half-elves were born and raised into accepting human communities, often raised by generations of a single family, or through the charity of churches and temples. These half-elves have the integrated and wary racial traits."
        ],
        "Mordant Spire Half-Elves (Spireborn)": [
          "Mordant Spire elves and humans almost never meet by accident. Their offspring, the Spireborn, only come about when Mordant Spire elves travel to human villages. Spireborn half-elves are almost always taken back to the Mordant Spire by their elven parent, and they are usually trained from youth to go on important missions outside of the Mordant Spire. Spireborn undergo both physical training and extensive education on the Azlanti. They tell no one they meet on their travels of their heritage or their top-secret duties."
        ],
        "Snowcaster Half-Elves (Snowborn)": [
          "Found throughout the northern countries, snowborn are typically the children of twilight speakers—religious envoys from the normally distrustful Snowcaster clans, who consider it a sacred duty to befriend humans and other non-elves. Snowcaster clans vary in their acceptance of these children, but the average clan’s seclusion from humanity and inability to understand half-elves almost invariably ends up driving the snowborn away. Twilight speakers, however, tend to enjoy a particularly close relationship with their snowborn children, and the two groups often wander together. Snowborn have their elven parents’ snowy white skin and particularly sharp ears. Some Snowcaster half-elves find welcome homes among the Jadwiga and Ulfen communities, as well as the Erutaki tribes. Others wander, looking for a permanent place to belong."
        ]
      }
    }
  },
  {
    "Halfling": {
      "Source": "Blood of Shadows pg. 5",
      "Physical Description": ": Halflings rise to a humble height of 3 feet. They prefer to walk barefoot, leading the bottoms of their feet to become roughly calloused. Tufts of thick, curly hair warm the tops of their broad, tanned feet. Their skin tends toward a rich cinnamon color and their hair toward light shades of brown. A halfling's ears are pointed, but proportionately not much larger than those of a human.",
      "Society": ": Rather than place their faith in empires or great causes, many halflings prefer to focus on the simpler and humbler virtues of their families and local communities. Halflings claim no cultural homeland and control no settlements larger than rural assemblies of free towns. Most often, they dwell at the knees of their human cousins in human cities, eking out livings as they can from the scraps of larger societies. Many halflings lead perfectly fulfilling lives in the shadow of their larger neighbors, while some prefer more nomadic lives, traveling the world and experiencing all it has to offer.",
      "Relations": ": A typical halfling prides himself on his ability to go unnoticed by other races—a trait that allows many halflings to excel at thievery and trickery. Most halflings know full well the stereotypical view other races take of them as a result, and go out of their way to be forthcoming and friendly to the bigger races when they're not trying to go unnoticed. They get along fairly well with gnomes, although most halflings regard these eccentric creatures with a hefty dose of caution. Halflings respect elves and dwarves, but these races often live in remote regions far from the comforts of civilization that halflings enjoy, thus limiting opportunities for interaction. By and large, only Half-Orcs are shunned by halflings, for their great size and violent natures are a bit too intimidating for most halflings to cope with.",
      "Alignment and Religion": ": Halflings are loyal to their friends and families, but since they dwell in a world dominated by races twice as large as themselves, they have come to grips with the fact that sometimes they need to scrape and scrounge for survival. Most halflings are neutral as a result. Though they usually make a show of respecting the laws and endorsing the prejudices of their communities, halflings place an even greater emphasis on the innate common sense of the individual. When a halfling disagrees with society at large, he will do what he thinks is best.",
      "Adventurers": ": Their inherent luck coupled with their insatiable wanderlust makes halflings ideal candidates for lives of adventure. Though perfectly willing to pocket any valuables they come across, halflings often care more for the new experiences adventuring brings them than for any material reward. Halflings tend to view money as a means of making their lives easier and more comfortable, not as an end in and of itself.",
      "Male Names": ": Antal, Boram, Hyrgan, Jamir, Lem, Miro, Sumak, Tribin, Uldar, Vraxim.",
      "Female Names": ": Anafa, Bellis, Etune, Filiu, Irlana, Marra, Pressi, Rilka, Sistra, Wyssal, Yamyra.: Halflings are nimble and strong-willed, but their small statures make them weaker than other races.",
      "+2 Dexterity, +2 Charisma, –2 Strength": ": Halflings are nimble and strong-willed, but their small statures make them weaker than other races.",
      "Small": ": Halflings are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Halflings have a base speed of 20 feet.",
      "Fearless": ": Halflings receive a +2 racial bonus on all saving throws against fear. This bonus stacks with the bonus granted by halfling luck.",
      "Halfling Luck": ": Halflings receive a +1 racial bonus on all saving throws.",
      "Keen Senses": ": Halflings receive a +2 racial bonus on Perception checks.",
      "Sure-Footed": ": Halflings receive a +2 racial bonus on Acrobatics and Climb checks.",
      "Weapon Familiarity": ": Halflings are proficient with slings and treat any weapon with the word \"halfling\" in its name as a martial weapon.",
      "Languages": ": Halflings begin play speaking Common and Halfling. Halflings with high Intelligence scores can choose from the following languages: Dwarven, Elven, Gnome, and Goblin.Advanced Race Guide pg. 62",
      "Alchemist": ": Add one extract formula from the alchemist's list to the alchemist's formula book. This formula must be at least one level below the highest formula level the alchemist can create.",
      "Arcanist": ": Gain 1/6 of a new arcanist exploit.",
      "Barbarian": ": Add 1 foot to the range increment of thrown weapons the barbarian wields. This option has no effect unless the barbarian has selected it 5 times (or another increment of 5).",
      "Bard": ": Add +1/2 on Bluff checks to pass secret messages, +1/2 on Diplomacy checks to gather information, and +1/2 on Disguise checks to appear as an elven, Half-Elven, or human child.",
      "Bloodrager": ": Gain a +1/4 dodge bonus to AC while bloodraging against creatures at least one size category larger than the bloodrager.",
      "Brawler": ": Gain a +1 bonus to the brawler's CMD when resisting a grapple or overrun combat maneuver.",
      "Cavalier": ": The cavalier's mount gains a +1/2 bonus on saving throws against fear effects. If the cavalier ever replaces his mount, the new mount gains this bonus.",
      "Cleric": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power.",
      "Druid": ": Add a +1/4 luck bonus on the saving throws of the druid's animal companion.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a trip or grapple attempt.",
      "Gunslinger": ": Add +1/4 to the dodge bonus to AC granted by the nimble class feature (maximum +2) or +1/4 to the AC bonus gained when using the gunslinger's dodge deed.",
      "Hunter": ": The hunter's animal companion gains a +1/4 luck bonus on saving throws. If the hunter replaces her animal companion, the new animal companion gains this bonus.",
      "Inquisitor": ": Add +1/4 to the number of times per day that an inquisitor can change her most recent teamwork feat.",
      "Investigator": ": Add one extract formula from the investigator's list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create.",
      "Kineticist": ": Increase the capacity of the kineticist's internal buffer by 1/6 point.",
      "Magus": ": The magus gains 1/6 of a new magus arcana.",
      "Medium": ": Increase the bonus the medium gains from its seance boon by 1/3 point. This doesn't increase the bonus allies gain from shared seance.",
      "Mesmerist": ": Increase the number of mesmerist tricks the mesmerist can use per day by 1/3.",
      "Monk": ": Gain a +1/4 bonus to CMD against trip and on damage rolls against prone targets that add the monk's Strength modifier.",
      "Occultist": ": Add 1/2 point of mental focus per day.",
      "Oracle": ": Add +1/2 to the oracle's level for the purpose of determining the effects of the oracle's curse ability.",
      "Paladin": ": Add +1/2 hit point to the paladin's lay on hands ability (whether using it to heal or harm).",
      "Psychic": ": The psychic treats her Charisma bonus as 1/3 point higher for the purpose of determining the number of uses or rounds per day of her discipline powers.",
      "Ranger": ": Add a +1/4 dodge bonus to Armor Class against the ranger's favored enemies.",
      "Rogue": ": Choose a weapon from the following list: sling, dagger, or any weapon with \"halfling\" in its name. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus does not stack with Critical Focus.",
      "Shaman": ": Add 1/2 to the shaman's effective class level for the purpose of determining her spirit animal's natural armor adjustment, Intelligence, and special abilities.",
      "Shifter": ": Increase the AC bonus from defensive instinct by 1/4 against creatures of size Large or larger.",
      "Skald": ": Choose a weapon from the following list: dagger, sling, or any weapon with the word \"halfling\" in its name. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus doesn't stack with those gained through Critical Focus and similar effects.",
      "Slayer": ": Add a +1/4 dodge bonus to Armor Class against the slayer's studied target.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power.",
      "Spiritualist": ": Add 1/4 to the number of rounds that the spiritualist's incorporeal phantom can be out of sight and line of effect before being sent back to the Ethereal Plane.",
      "Summoner": ": Add +1 skill rank to the summoner's eidolon.",
      "Swashbuckler": ": Increase the number of times the swashbuckler can use charmed life by 1/4.",
      "Vigilante": ": Gain 1/6 of a new social talent.",
      "Warpriest": ": Add 1/4 to the warpriest's effective level when determining the damage of his sacred weapon.",
      "Witch": ": Add +1/4 to the witch's caster level when determining the effects of the spells granted to her by her patron.",
      "Wizard": ": Add +1/2 to the wizard's effective class level for the purposes of determining his familiar's natural armor adjustment, Intelligence, and special abilities.",
      "Subraces": {
        "Avenging": [
          "Unlike most halflings, members of this subtype actively look for trouble in their quest to avenge slights and wrongdoings. Whether resisting a local bully, monster, or troops of an oppressive ruler, halfling warriors of this secret subculture don masks and strike back on behalf of their community. These halflings have the low blow, underfoot, and warslinger alternate racial traits."
        ],
        "Nomadic": [
          "These halflings were born on the road and most follow it until the end of their days. They travel fast and light and never miss a chance for either profit or adventure. These halflings have the fleet-footed, polyglot, and wanderlust alternate racial traits."
        ],
        "Segadan Halflings": [
          "Hailing from the bureaucratic Degasi city of Segada, Segadan halflings relish the comforts their prosperous city provides. The halflings of Segada nonetheless remain suspicious of Chelish settlers in the Segadan protectorates of Anchor’s End and Canorus, given Cheliax’s history of enslaving halflings. Segadan halflings are well suited to take the attentive alternate racial trait, as well as the festive and small quarter ally alternate racial traits described below."
        ],
        "Slave Born": [
          "These halflings come from lineages that have spent countless generations as property. Though usually free themselves, the weight of slavery still bears down on their souls, making them eager to please and prone to sudden fits of fear. These halflings have the craven and ingratiating alternate racial traits."
        ],
        "Song'o Halflings": [
          "Deep in the jungles outside the former Chelish colony of Sargava in the Mwangi Expanse, the mysterious Song’o halflings avoid almost all non-Mwangi. These halflings live in temporary villages, abandoning sites when they are discovered and resettling in ever more isolated areas of the jungle. Many believe this intense aversion to outside interaction is due to early Chelish slavers settling the region and Sargava’s oppression of the native Mwangi. Song’o halflings are well represented by the deep jungle alternate racial trait, as well as the danger detection and evasive nomad alternate racial traits described below."
        ]
      }
    }
  },
  {
    "Half-Orc": {
      "Source": "Blood of Shadows pg. 5",
      "Physical Description": ": Half-Orcs average around 6 feet tall, with powerful builds and greenish or grayish skin. Their canine teeth often grow long enough to protrude from their mouths, and these \"tusks,\" combined with heavy brows and slightly pointed ears, give them their notoriously bestial appearance. While Half-Orcs may be impressive, few ever describe them as beautiful. Despite these obvious orc traits, Half-Orcs are as varied as their human parents.",
      "Society": ": Unlike half-elves, where at least part of society's discrimination is born out of jealousy or attraction, Half-Orcs get the worst of both worlds: physically weaker than their orc kin, they also tend to be feared or attacked outright by humans who don't bother making the distinction between full orcs and halfbloods. Even on the best of terms, Half-Orcs in civilized societies are not exactly accepted, and tend to be valued only for their physical abilities. On the other hand, orc leaders have been known to deliberately spawn Half-Orcs, as the halfbreeds make up for their lack of physical strength with increased cunning and aggression, making them natural leaders and strategic advisors.",
      "Relations": ": Elves and dwarves tend to be the least accepting of Half-Orcs, seeing in them too great a resemblance to their racial enemies, and other races aren't much more understanding.",
      "Alignment and Religion": ": Forced to live either among brutish orcs or as lonely outcasts in civilized lands, most Half-Orcs are bitter, violent, and reclusive. Evil comes easily to them, but they are not evil by nature—rather, most Half-Orcs are chaotic neutral, having been taught by long experience that there's no point doing anything but that which directly benefits themselves. Half-Orcs worship the human or orc gods venerated in the area where they were raised. Those who live alongside humans most often worship human gods of war, freedom, or destruction. Half-Orcs raised in orc tribes find themselves most drawn to the gods of blood, fire, and iron—depending more on what god the tribe worships rather than the Half-Orcs' personal preference. Many Half-Orcs are contrary about religion, either ignoring it entirely, or getting deeply involved in it and trying to find meaning in a life filled with hate and misunderstanding; even a Half-Orc divine spellcaster may wrestle with doubt and anger about religion and faith.",
      "Adventurers": ": Staunchly independent, many Half-Orcs take to lives of adventure out of necessity, seeking to escape their painful pasts or improve their lot through force of arms. Others, more optimistic or desperate for acceptance, take up the mantle of crusaders in order to prove their worth to the world.",
      "Male names": ": Ausk, Davor, Hakak, Kizziar, Makoa, Nesteruk, Tsadok.",
      "Female names": ": Canan, Drogheda, Goruza, Mazon, Shirish, Tevaga, Zeljka.: Half-Orc characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "+2 to One Ability Score": ": Half-Orc characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "Medium": ": When gaining a taboo, the medium can use spirit surge without incurring influence an additional 1/4 time per day.",
      "Normal Speed": ": Half-Orcs have a base speed of 30 feet.",
      "Darkvision": ": Half-Orcs can see in the dark up to 60 feet.",
      "Intimidating": ": Half-Orcs receive a +2 racial bonus on Intimidate checks because of their fearsome nature.",
      "Orc Blood": ": Half-Orcs count as both humans and orcs for any effect related to race.",
      "Orc Ferocity": ": Once per day, when a Half-Orc is brought below 0 hit points but not killed, he can fight on for 1 more round as if disabled. At the end of his next turn, unless brought to 1 or more hit points, he immediately falls unconscious and begins dying.",
      "Weapon Familiarity": ": Half-Orcs are proficient with greataxes and falchions, and treat any weapon with the word \"orc\" in its name as a martial weapon.",
      "Languages": ": Half-Orcs begin play speaking Common and Orc. Half-Orcs with high Intelligence scores can choose from the following languages: Abyssal, Draconic, Giant, Gnoll, and Goblin.Advanced Race Guide pg. 52",
      "Alchemist": ": Gain a +1/2 bonus on Strength checks to break objects and on sunder combat maneuver checks when under the effects of a mutagen that increases the alchemist's Strength or Constitution score.",
      "Arcanist": ": Gain a +1 bonus on concentration checks made due to taking damage while casting arcanist spells.",
      "Barbarian": ": Add +1 to the barbarian's total number of rage rounds per day.",
      "Bard": ": Gain a +1/2 bonus on Bluff checks to pass secret messages, Sense Motive checks to discern secret messages, and Linguistic checks to decipher unusual handwriting.",
      "Bloodrager": ": Increase the bloodrager's total number of bloodrage rounds per day by 1.",
      "Brawler": ": Add 1/4 to the brawler's effective level to determine her unarmed strike damage.",
      "Cavalier": ": Add +1 hit point to the cavalier's mount companion. If the cavalier ever replaces his mount, the new mount gains these bonus hit points.",
      "Cleric": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power.",
      "Druid": ": Add +1/3 to the druid's natural armor bonus when using wild shape.",
      "Fighter": ": The fighter gains 1/2 point of DR/— against nonlethal damage (maximum DR 10/—).",
      "Gunslinger": ": Add a +1/3 bonus on attack rolls when using the pistol whip deed.",
      "Hunter": ": Add 1 hit point to the hunter's animal companion. If the hunter replaces his animal companion, the new animal companion gains these bonus hit points.",
      "Inquisitor": ": Add a +1/2 bonus on Intimidate checks and Knowledge checks to identify creatures.",
      "Investigator": ": Gain a +1/3 bonus on critical hit confirmation rolls made while using studied combat (maximum bonus of +5). This bonus does not stack with those gained through Critical Focus and similar effects.",
      "Kineticist": ": Add 1/3 point of fire damage to fire-element blasts that deal fire damage.",
      "Magus": ": Add +1/2 point of fire damage to spells that deal fire damage cast by the magus.",
      "Mesmerist": ": Increase the mesmerist's bonus damage from painful stare by 1/2 point.",
      "Monk": ": Add +1 to the monk's CMD when resisting a grapple and +1/2 to the number of stunning attacks he can attempt per day.",
      "Occultist": ": Deal an additional 1/2 point of damage with focus powers.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast.",
      "Paladin": ": Add +1/3 on critical hit confirmation rolls made while using smite evil (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Psychic": ": Gain a +1 bonus on concentration checks required because of taking damage while casting spells from the psychic class.",
      "Ranger": ": Add +1 hit point to the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains these bonus hit points.",
      "Rogue": ": Add +1/3 on critical hit confirmation rolls made while using sneak attack (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Shaman": ": Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Shifter": ": Add a +1/3 bonus on critical hit confirmation rolls when using shifter claws (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Skald": ": Increase the skald's total number of raging song rounds per day by 1.",
      "Slayer": ": Gain a +1/3 bonus on critical hit confirmation rolls made while using sneak attack (maximum bonus of +5). This bonus doesn't stack with those gained through Critical Focus and similar effects.",
      "Sorcerer": ": Add +1/2 point of fire damage to spells that deal fire damage cast by the sorcerer.",
      "Spiritualist": ": Add 1 hit point to the spiritualist's phantom.",
      "Summoner": ": Add +1 hit point to the summoner's eidolon.",
      "Swashbuckler": ": Gain a +1/3 bonus on all critical hit confirmation rolls made while using the precise strike deed (maximum bonus of +5). This bonus doesn't stack with those gained through Critical Focus and similar effects.",
      "Vigilante": ": Add 1/2 to the DC increase from unshakable.",
      "Warpriest": ": Gain a +2 bonus on rolls to stabilize when dying.",
      "Witch": ": Add +1 skill rank to the witch's familiar. If the Half-Orc ever replaces her familiar, the new familiar gains these bonus skill ranks.",
      "Wizard": ": Add a +1 bonus on concentration checks made due to taking damage while casting wizard spells.",
      "Subraces": {
        "Arena-Bred": [
          "Many Half-Orcs are born and raised to fight in the arena, and in many cases have two Half-Orc parents or even a Half-Orc and a human parent. These arena-bred Half-Orcs lose the brutal physical appearance of their orc ancestors and look more human. They have the city-raised and skilled alternate racial traits."
        ],
        "Darklands Half-Orcs (Gloomkin)": [
          "At the end of the Age of Darkness, when light returned to Golarion, many orcs lost their footholds on the surface world and returned to the Darklands, taking their Half-Orc progeny with them. Of all the Half-Orcs, gloomkin face the harshest treatment; they are punished and abused from birth for what orcs consider the taint of their bloodline. As the bottom of the social ladder in orc society, gloomkin are assigned the task that very few orcs take on willingly: reading. They are the historians, scribes, and advisors, placing them in a key position to discover secrets and gain influence without drawing attention to themselves."
        ],
        "Deep Kin": [
          "Some Half-Orcs are descended from clans that remained in the eternal darkness below the surface. Half-Orcs from these clans tend to be smaller and more at home underground than those descended from surface-dwelling orcs. These Half-Orcs have the acute darkvision and cavewight alternate racial traits."
        ],
        "Desert Half-Orcs (Sandkin)": [
          "Desert Half-Orcs are born primarily in northern Garund and Osirion and often hold a level of esteem and self-assurance that is rare for Half-Orcs. Among desert orc tribes, the ability to tolerate harsh sunlight is a sign of strength, and weathering the sun is a rite of passage. Lacking their ancestors’ light sensitivity, Half-Orcs excel at these contests of endurance and easily earn high positions within their tribes.Desert Half-Orcs also fare better than most among human civilizations. The strong presence of Sarenrae’s followers has led to a culture of forgiveness and understanding that is rare in other parts of Golarion, making it easier for Half-Orcs to thrive. Many desert Half-Orcs believe they are blessed by Sarenrae and become clerics or paladins of her church."
        ],
        "Feral": [
          "Half-Orc children who are abandoned as infants or small children rarely survive in the wild, but a few manage to scrape out a meager existence as \"wild children,\" tough enough to live but completely uncivilized. Feral Half-Orcs have the forest walker and toothy alternate racial traits."
        ],
        "Jungle Half-Orcs (Rainkin)": [
          "In the jungles of the Mwangi Expanse, the few remaining orc tribes have been largely cut off from others of their kind. Isolated since the orc empires collapsed after the Age of Darkness, only a handful of oral retellings recall the true heritage of these orcs and Half-Orcs, and their culture diverges greatly from other orc societies. It is said that some early Mwangi tribes participated in arranged marriages with orcs, leading Half-Orc children to be associated with alliances and prosperity, and true or not, Half-Orcs have been a major part of these orc tribes for generations. Even in the present day, many orcs are willing to pay a large dowry to bring Half-Orcs into their villages, and orphaned Half-Orcs are happily adopted.Because they usually come from rich families, rainkin halforcs often receive better treatment than their orc or human cousins. This can create a self-fulfilling prophecy; because Half-Orc children receive the best care, protection, and training, they are usually stronger and more skilled than orcs or humans, increasing the desire to have Half-Orcs in a tribe. While jungle Half-Orcs typically have great pride and selfworth, many are also resentful of the high expectations placed on them from birth and angry to be treated like a commodity by so many. As a result, rainkin have trouble forming close bonds with non-Half-Orcs, so they often create close-knit groups between themselves. Some of these groups even grow large enough to break off and form their own tribes."
        ],
        "Mountain Clan": [
          "Half-Orcs from the more mountainous regions tend to be more agile and alert to the echoing sounds of their homeland. Mountain clan Half-Orcs have the bestial and rock climber racial traits."
        ],
        "Mountain Half-Orcs (Cragkin)": [
          "Cragkin are widespread across Golarion, found across all the mountain ranges of western Avistan. Thanks to their thin frames and quick wits, mountain-born Half-Orcs excel at climbing and acrobatic stunts. Anything less than a vertical cliff face is traversable, and often even that isn’t enough to stop them. To mountain Half-Orcs, obstacles are merely a foothold on their path to the top.Mountain orcs respect bravery, and cragkin have turned fearlessness and reckless abandon into a badge of honor. By using the terrain to their advantage against less surefooted enemies, they can attack from strange angles and gain advantages with just a few quick steps. They often take near-suicidal leaps to strike enemies from above, or trick enemies into falling to their deaths by leading them down impossible paths. Despite their great skill, accidents are common in this treacherous environment, and no one is surprised if one halforc returns after a raid and his companions do not.Many mountain Half-Orcs find a place among Shoanti and Ulfen settlements, where valor in battle is highly prized. As long as they are willing to respect the traditions of their adopted clans, they usually integrate well into these societies and contribute much to the community."
        ],
        "Mystic": [
          "Orc shamans are brutal teachers who sometimes kill or maim their most promising students in order to eliminate what could be a potential rival. Half-Orcs who survive years of abuse by an orc shaman master are deeply scarred and altered by the experience. Shaman trainees learn early that cunning and luck are often the only things that offer a chance of survival. They have the shaman’s apprentice and sacred tattoo alternate racial traits."
        ],
        "Winter Half-Orcs (Frostkin)": [
          "At the Crown of the World, nomadic clans of orcs live on the frozen wastes. The winter Half-Orcs that live among them are treated as the runts of the pack. However, strength in numbers is vital in the north, as many young do not survive the harsh winters. Even the weakest are provided for as long as they can prove their usefulness. Sewing, cooking, and child-rearing are all valued skills, and winter Half-Orcs who excel at these are treated better than most. Those who would rather prove their worth through their strength do so by hunting, as ritual combat is a frowned upon waste of energy and resources.While Half-Orcs are not well liked in the Linnorm Kingdoms, they may be able to find homes in the Ironbound Isles. Merchants traveling between Tian Xia and Avistan are often willing to hire on a Half-Orc as a guide and bodyguard across the Crown of the World. Winter Half-Orcs who migrate south into Irrisen can find an easier life in the growing Half-Orc communities, but they are unlikely to find any upward mobility unless they show skill at witchcraft."
        ]
      }
    }
  },
  {
    "Human": {
      "Source": "Inner Sea Races pg. 214",
      "Physical Description": ": The physical characteristics of humans are as varied as the world's climes. From the dark-skinned tribesmen of the southern continents to the pale and barbaric raiders of the northern lands, humans possess a wide variety of skin colors, body types, and facial features. Generally speaking, humans' skin color assumes a darker hue the closer to the equator they live. At the same time, bone structure, hair color and texture, eye color, and a host of facial and bodily phenotypic characteristics vary immensely from one locale to another. Cheekbones may be high or broad, noses aquiline or flat, and lips full or thin; eyes range wildly in hue, some deep set in their sockets, and others with full epicanthic folds. Appearance is hardly random, of course, and familial, tribal, or national commonalities often allow the knowledgeable to identify a human's place of origin on sight, or at least to hazard a good guess. Humans' origins are also indicated through their traditional styles of bodily decoration, not only in the clothing or jewelry worn, but also in elaborate hairstyles, piercing, tattooing, and even scarification.",
      "Society": ": Human society comprises a multitude of governments, attitudes, and lifestyles. Though the oldest human cultures trace their histories thousands of years into the past, when compared to the societies of other races like elves and dwarves, human society seems to be in a state of constant flux as empires fragment and new kingdoms subsume the old. In general, humans are known for their flexibility, ingenuity, and ambition. Other races sometimes envy humans their seemingly limitless adaptability, not so much biologically speaking but in their willingness to step beyond the known and press on to whatever might await them. While many or even most humans as individuals are content to stay within their comfortable routine, there is a dauntless spirit of discovery endemic to humans as a species that drives them in striving toward possibilities beyond every horizon.",
      "Relations": ": Humans are fecund, and their drive and numbers often spur them into contact with other races during bouts of territorial expansion and colonization. In many cases, this tendency leads to violence and war, yet humans are also swift to forgive and forge alliances with races who do not try to match or exceed them in violence. Proud, sometimes to the point of arrogance, humans might look upon dwarves as miserly drunkards, elves as flighty fops, halflings as craven thieves, gnomes as twisted maniacs, and half-elves and Half-Orcs as embarrassments—but the race's diversity among its own members also makes many humans quite adept at accepting others for what they are. Humans may become so absorbed in their own affairs that they remain ignorant of the language and culture of others, and some take this ignorance to a hateful extreme of intolerance, oppression, and rarely even extermination of others they perceive as dangerous, strange, or \"impure.\" Thankfully, while such incidents and movements may taint all of humanity in the eyes of some, they are more often the exception than the rule.",
      "Alignment and Religion": ": Humanity is perhaps the most diverse of all the common races, with a capacity for both great evil and boundless good. Some humans assemble into vast barbaric hordes, while others build sprawling cities that cover miles. Taken as a whole, most humans are neutral, yet they generally tend to congregate in nations and civilizations with specific alignments. Humans also have the widest range of gods and religions, lacking other races' ties to tradition and eager to turn to anyone offering them glory or protection.",
      "Adventurers": ": Ambition alone drives countless humans, and for many, adventuring serves as a means to an end, whether it be wealth, acclaim, social status, or arcane knowledge. A few pursue adventuring careers simply for the thrill of danger. Humans hail from myriad regions and backgrounds, and as such can fill any role within an adventuring party.",
      "Names": ": Unlike other races, which generally cleave to specific traditions and shared histories, humanity's diversity has resulted in a nearly infinite set of names. The humans of a northern barbarian tribe have much different names than those hailing from a subtropical nation of sailors and traders. Even humans who speak the same language may have names that are as varied as their beliefs and appearances, depending on their origins.: Human characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "+2 to One Ability Score": ": Human characters get a +2 bonus to one ability score of their choice at creation to represent their varied nature.",
      "Medium": ": When gaining a taboo, the medium can use spirit surge without incurring influence an additional 1/4 time per day.",
      "Normal Speed": ": Humans have a base speed of 30 feet.",
      "Bonus Feat": ": Humans select one extra feat at 1st level.",
      "Skilled": ": Humans gain 1 additional skill rank at 1st level and 1 additional rank whenever they gain a level.",
      "Languages": ": Humans begin play speaking Common and their ethnic language. Humans whose ethnic language is Common (or Taldane, in the case of Chelaxians or Taldans) do not receive an additional ethnic language. Humans with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic).Advanced Race Guide pg. 72",
      "Alchemist": ": Add one extract formula from the alchemist formula list to the character's formula book. This formula must be at least one level below the highest formula level the alchemist can create.",
      "Arcanist": ": Add one spell from the arcanist spell list to the arcanist's spellbook. The spell must be at least 1 spell level below the highest level the arcanist can cast.",
      "Barbarian": ": Add a +1/2 bonus to trap sense or +1/3 to the bonus from the superstitious rage power.",
      "Bard": ": Add one spell known from the bard spell list. This spell must be at least one level below the highest spell level the bard can cast.",
      "Bloodrager": ": Increase the bloodrager's total number of bloodrage rounds per day by 1.",
      "Brawler": ": Gain a +1 bonus to the brawler's CMD when resisting two combat maneuvers of the brawler's choice.",
      "Cavalier": ": Add +1/4 to the cavalier's banner bonus.",
      "Cleric": ": Add a +1 bonus on caster level checks made to overcome the spell resistance of outsiders.",
      "Druid": ": Add a +1/2 bonus on Diplomacy and Intimidate checks to change a creature's attitude.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting two combat maneuvers of the character's choice.",
      "Gunslinger": ": Add +1/4 point to the gunslinger's grit points.",
      "Hunter": ": Add 1 skill rank to the hunter's animal companion. If the hunter replaces his animal companion, the new animal companion gains these bonus skill ranks.",
      "Inquisitor": ": Add a +1/2 bonus on Perception checks to see through magical disguises or pinpoint invisible creatures.",
      "Investigator": ": Add one extract formula from the investigator's formula list to his formula book. This formula must be at least 1 formula level below the highest level the investigator can create.",
      "Kineticist": ": Gain 1/6 of an Extra Wild Talent feat.",
      "Magus": ": Add +1/4 point to the magus' arcane pool.",
      "Mesmerist": ": Increase the mesmerist's towering ego bonus by 1/3 point (to a maximum increase of +2).",
      "Monk": ": Add +1/4 point to the monk'spool.",
      "Occultist": ": Add a +1/3 bonus on any skill check attempted as a part of an occult ritual ().",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast.",
      "Paladin": ": Add +1 to the paladin's energy resistance to one kind of energy (maximum +10).",
      "Psychic": ": Add a +1/4 bonus to AC when flatfooted, to a maximum of what the psychic's AC would be if not flat-footed.",
      "Ranger": ": Add +1 hit point or +1 skill rank to the ranger's animal companion. If the ranger ever replaces his companion, the new companion gains these bonus hit points or skill ranks.",
      "Rogue": ": The rogue gains +1/6 of a new rogue talent.",
      "Shaman": ": Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Shifter": ": Add 1/3 to the number of minutes the shifter can assume her minor form each day.",
      "Skald": ": Add one spell from the skald's spell list to the skald's known spells. This spell must be at least 1 spell level below the highest level the skald can cast.",
      "Slayer": ": Gain 1/6 of a new slayer talent.",
      "Sorcerer": ": Add one spell known from the sorcerer spell list. This spell must be at least one level below the highest spell level the sorcerer can cast.",
      "Spiritualist": ": Add 1 skill rank or 1 hit point to the spiritualist's phantom.",
      "Summoner": ": Add +1 hit point or +1 skill rank to the summoner's eidolon.",
      "Swashbuckler": ": Increase the total number of points in the swashbuckler's panache pool by 1/4.",
      "Vigilante": ": Gain +1/2 on the Disguise bonus provided by seamless guise.",
      "Warpriest": ": Gain 1/6 of a new bonus combat feat.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells.",
      "Wizard": ": Add one spell from the wizard spell list to the wizard's spellbook. This spell must be at least one level below the highest spell level the wizard can cast.",
      "Subraces": {
        "Cosmopolitan": [
          "Adept as city living, these humans can navigate crowds and fulfill the need for skilled labor in such settlements. Replace the skilled racial trait with heart of the streets and the bonus feat racial trait with focused study."
        ],
        "Country Folk": [
          "These humans are suited to life in the countryside. Replace the skilled racial trait with heart of the fields and the bonus feat racial trait with focused study."
        ],
        "Gutter Rat": [
          "Often second-class citizens living in sprawling ghettos and slums, these humans work hard to eke out an existence in a city. Replace the skilled racial trait with heart of the slums and the bonus feat racial trait with mixed heritage (heart of the streets)."
        ],
        "Imperious Human": [
          "Hailing from either an empire, an emerging nation, or a controlling city-state, these humans are arrogant expansionists, absorbing others to their causes and culture. Replace the skilled racial trait with silver tongued and the bonus feat racial trait with eye for talent."
        ],
        "Trailblazer": [
          "Adaptive and inventive, these humans must have quick wits and a dose of heroic luck to survive in the lands they settle. Replace the skilled racial trait with heart of the wilderness and the bonus feat racial trait with heroic. At the GM’s discretion, you can swap out the heart of the wilderness racial trait for either heart of the mountains, heart of the sea, heart of the snows, or heart of the sun, depending on the type of terrain these humans are settling."
        ],
        "Versatile Human": [
          "While they lack some of the training of other humans, the natural talents of versatile humans more than make up for this lack. Replace the +2 bonus to any ability score, the skilled racial trait, and the bonus feat racial trait with dual talent."
        ]
      }
    }
  }
]