{
  "Firearm": {
    "Breech-loader": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Heroes of Golarion pg. 18 Statistics",
      "cost": "3,000 gp",
      "weight": "4 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x4;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "2",
      "category": "One-Handed;",
      "proficiency": "Exotic Description This double-barreled pistol variant has its barrel attached to its stock by a hinge, enabling ammunition to be loaded quickly and easily. Reloading a breech-loader is a standard action that reloads both barrels; the Rapid Reload feat reduces this to a move action."
    },
    "Buckler gun": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "750 gp",
      "weight": "6 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x4;",
      "range": "10 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "2",
      "category": "One-Handed;",
      "proficiency": "Exotic Description The front of this buckler is fitted with a small, double-barreled gun that can be shot while wearing the buckler. Unlike with a double-barreled pistol, you can shoot only one barrel at a time. You must remove the buckler to reload the gun. Each barrel of a buckler gun uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. Because of its awkward construction, a buckler gun is always considered an off-handed weapon. This is an early firearm."
    },
    "Coat pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "750 gp",
      "weight": "1 lb.",
      "damage": "1d3 (small), 1d4 (medium);",
      "critical": "x3;",
      "range": "10 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "1",
      "category": "One-Handed;",
      "proficiency": "Exotic Description Though less powerful than other, larger firearms, this pistol is small enough to be easily concealed in a jacket or coat. You get a +2 bonus on Sleight of Hand checks made to conceal a coat pistol on your body. A coat pistol uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Dagger pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "740 gp",
      "weight": "1 lb.",
      "damage": "1d3 (small), 1d4 (medium);",
      "critical": "x3;",
      "range": "10 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "1",
      "category": "One-Handed;",
      "proficiency": "Exotic Description A combination of a coat pistol and a blade, the dagger pistol can be used as both weapons. The awkwardness of the configuration means you do not gain the bonus on Sleight of Hand checks that either of those stand-alone weapons grants. The dagger pistol is considered a double weapon for the purpose of creating masterwork or magical versions of this weapon. If this firearm gains the broken condition, both the firearm component and the dagger component are considered broken. A dagger pistol uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Double-barreled pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "1,750 gp",
      "weight": "5 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "2",
      "category": "One-Handed;",
      "proficiency": "Exotic Description This pistol has two parallel barrels; each barrel can be fired independently as separate attacks, or both can be fired at once as a standard action (the attack action).. If both barrels are shot at once, they must both target the same creature or object, and the pistol becomes wildly inaccurate, imposing a 4 penalty on each shot. This is an early firearm."
    },
    "Dragon pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "1,000 gp",
      "weight": "3 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x4;",
      "range": "special;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "1",
      "category": "One-Handed;",
      "proficiency": "Exotic Description Like a miniature blunderbuss, the dragon pistol fires pellets or a bullet from its flared barrel. The dragon pistol fires in a 15-foot cone when firing pellets, and has a 10-foot range increment when firing a bullet. A dragon pistol uses either a bullet or group of pellets and 1 dose of black powder, or a single alchemical cartridge (with either bullets or pellets) as ammunition. This is an early firearm."
    },
    "Dragoon Pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Villain Codex pg. 57 Statistics",
      "cost": "1,500 gp",
      "weight": "5 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x3;",
      "range": "30 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "3",
      "category": "One-Handed;",
      "proficiency": "Exotic Description Like the dragoon musket, this long-barreled pistol is more precise than a typical pistol but slightly less deadly on a critical hit. It can fire only dragoon cartridges or specially modified mage shot"
    },
    "Paddle-foot pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "People of the Wastes pg. 15 Statistics",
      "cost": "2,500 gp",
      "weight": "5 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x3;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "4",
      "category": "One-Handed;",
      "proficiency": "Exotic Description This early firearm has four barrels, each of which can be fired one at a time with a single adjustable flintlock. The paddle-foot pistol fires in a 20-foot cone when making a scattering shot, and it has a 20-foot range increment when firing a bullet. Additionally, the paddle-foot pistol has a maximum range of three range increments. Each barrel of a paddle-foot pistol can hold 1 dose of black powder, along with either pellets or a bullet, or it can hold a single alchemical cartridge."
    },
    "Pepperbox": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 138 Statistics",
      "cost": "3,000 gp",
      "weight": "5 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "6",
      "category": "One-Handed;",
      "proficiency": "Exotic Description This pistol has six barrels instead of one. The entire barrel housing can be quickly rotated by hand between shots (a free action requiring one free hand), allowing all six bullets to be fired before the weapon must be reloaded. Each barrel of a pepperbox uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 138 Statistics",
      "cost": "1,000 gp",
      "weight": "4 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "1",
      "category": "One-Handed;",
      "proficiency": "Exotic Description The basic single-shot pistol is one of the most common firearms, although in most campaigns it is still rare enough to be an object of envy or curiosity to most. As such, it can take a variety of different forms, from wildly ornate masterpieces in the shape of fire-breathing dragons to the more common woodhandled pistols, or nothing more than a simple metal tube with a triggering device. A pistol uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Sword cane pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "775 gp",
      "weight": "1 lb.",
      "damage": "1d3 (small), 1d4 (medium);",
      "critical": "x3;",
      "range": "10 ft.;",
      "type": "B and P;",
      "misfire": "1 (5 ft.);",
      "capacity": "1",
      "category": "One-Handed;",
      "proficiency": "Exotic Description A combination weapon, this gun mixes a coat pistol with a sword cane. The sword cane pistol is considered a double weapon for the purpose of creating masterwork or magical versions of this weapon. The pistol attachment makes the nature of the weapon a little more difficult to hide. An observer must succeed at a DC 15 Perception check to realize that an undrawn sword cane pistol is a weapon rather than a simple walking stick; the DC decreases to 5 if the observer is able to handle the weapon. A sword cane pistol uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. The sword part of the weapon must be drawn in order to load the pistol part of the weapon. This is an early firearm."
    },
    "Air repeater": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Heroes of Golarion pg. 18 Statistics",
      "cost": "600 gp",
      "weight": "6 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "50 ft.;",
      "type": "B and P;",
      "misfire": "1 (see text);",
      "capacity": "6",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This long-barreled firearm is powered by a removable compressed air reservoir. A misfire while an air repeater has the broken condition does not cause the firearm to explode, but it does destroy the air reservoir. An air repeater can fire 6 shots before the air reservoir is depleted. An air repeater comes with three air reservoirs. Replacing the air reservoir requires 1 minute. The Rapid Reload feat reduces this to a full-round action."
    },
    "Axe musket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "1,600 gp",
      "weight": "6 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "30 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This short musket features an axe blade at the end of its barrel. It can be used as both a musket and a battleaxe. It is considered a double weapon for the purposes of creating masterwork or magical versions of this weapon. If this firearm gains the broken condition, both the firearm component and the axe are considered broken. An axe musket uses either a bullet and a single dose of black powder or an alchemical cartridge as ammunition. This is an early firearm."
    },
    "Blunderbuss": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "2,000 gp",
      "weight": "8 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x2;",
      "range": "special;",
      "type": "B and P;",
      "misfire": "1-2 (10 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This weapon fires pellets or a bullet from its trumpet-shaped barrel, making it an effective fowling weapon or closefighting personal defense weapon. The blunderbuss fires in a 15-foot cone when firing pellets, and has a 10-foot range increment when firing a bullet. A blunderbuss uses a bullet or pellets and a single dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Culverin": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "4,000 gp",
      "weight": "40 lbs.",
      "damage": "2d6 (small), 2d8 (medium);",
      "critical": "x4;",
      "range": "30 ft.;",
      "type": "B and P;",
      "misfire": "1 (10 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description The culverin, also known as a hand bombard, consists of a simple smoothbore tube, sealed at one end except for a small hole used to ignite a gunpowder charge. A wooden stock partially encases the barrel, allowing you to hold it under your arm with relative ease when carrying it. Firing a culverin without support (such as a wall, a window, or a stand) imposes a 4 penalty on attack rolls, and knocks you prone. A culverin uses 4 doses of black powder and grapeshot (a handful of pellets) as ammunition. Note that these statistics simulate only the original, hand-held culverinstheir larger descendants are considered cannons and are dealt with in the siege weapon section of Ultimate Combat . This is an early firearm."
    },
    "Cylinder rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 Statistics",
      "cost": "6,000 gp",
      "weight": "12 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "40 ft.;",
      "type": "B and P;",
      "misfire": "1-3 (10 ft.);",
      "capacity": "8",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This long-barreled early firearm has a slim horizontal disk with eight uncovered slots, each of which can hold one bullet and 1 dose of black powder (but not alchemical cartridges). Each time the weapon is fired, the disk rotates to load the next available shot. Misfiring with a cylinder rifle causes rogue sparks to cause the gun to erratically fire all the remaining bullets loaded in the disk, and each stray bullet has a 50% chance to hit the wielder, dealing 1d6 points of damage. Reloading a cylinder rifle requires two full-round actions, regardless of the number of slots being loaded. The Rapid Reload feat reduces this to a single full-round action."
    },
    "Double hackbut": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "4,000 gp",
      "weight": "18 lbs.",
      "damage": "2d10 (small), 2d12 (medium);",
      "critical": "x4;",
      "range": "50 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "2",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This double-length rifle uses a pair of trunnions to mount its barrel into a swiveling mechanism fastened to the top of a lightweight, twowheeled carriage. It takes a full-round action to set up the carriage. The carriage has a hind leg, allowing the wielder to wheel the device about and immediately prop it for stability during combat. Unlike other two-handed firearms, you must fire the double hackbut while it is mounted, or else firing it imparts a 4 penalty on attack rolls and the recoil knocks you prone. A Large or larger creature can fire a double hackbut one size smaller than itself without the gun's mounting as a normal two-handed weapon and without the danger of being knocked prone, but takes the normal penalty for firing an inappropriately sized weapon. This is an early firearm."
    },
    "Double-barreled musket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 138 Statistics",
      "cost": "2,500 gp",
      "weight": "11 lbs.",
      "damage": "1d10 (small), 1d12 (medium);",
      "critical": "x4;",
      "range": "10 ft.;",
      "type": "B and P;",
      "misfire": "1-3 (5 ft.);",
      "capacity": "2",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This musket has two parallel barrels; each barrel can be shot independently as separate attacks, or both can be fired at once as a standard action (the attack action). If both barrels are fired at once, they must both target the same creature or object, and the gun becomes wildly inaccurate, taking a 4 penalty on each shot. Each barrel of a double-barreled musket uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Dragoon Musket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Villain Codex pg. 57 Statistics",
      "cost": "2,000 gp",
      "weight": "12 lbs.",
      "damage": "1d10 (small), 1d12 (medium);",
      "critical": "x3;",
      "range": "60 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "3",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This long-barreled musket shoots more precisely than other muskets but is slightly less damaging on a critical hit. It can fire only dragoon cartridges or specially modified mage shot"
    },
    "Fire lance": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "25 gp",
      "weight": "4 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x4;",
      "range": "10 ft.;",
      "type": "P;",
      "misfire": "1-4 (5 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This primitive firearm is merely a long tube that, when ignited, propels forth a short gout of flame and a javelin. Unlike other firearms, the fire lance is wildly imprecise, and targets AC rather than touch AC. A fire lance is always treated as having the broken condition for the purpose of determining the effects of a misfire. A fire lance uses a javelin and 2 doses of black powder as ammunition. This is an early firearm."
    },
    "Musket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 137 Statistics",
      "cost": "1,500 gp",
      "weight": "9 lbs.",
      "damage": "1d10 (small), 1d12 (medium);",
      "critical": "x4;",
      "range": "40 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This long-barreled firearm has a much greater range than a pistol. A musket uses either a bullet and 1 dose of black powder or a single alchemical cartridge as its ammunition. This is an early firearm."
    },
    "Warhammer musket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 138 Statistics",
      "cost": "1,600 gp",
      "weight": "6 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "30 ft.;",
      "type": "B and P;",
      "misfire": "1-2 (5 ft.);",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This musket has a warhammer head at the end of its barrel, which allows it to be used as both a musket and a warhammer. It is considered a double weapon for the purposes of creating masterwork or magical versions of this weapon. If this firearm gains the broken condition, both the firearm component and the warhammer are considered broken. A warhammer musket uses either a bullet and 1 dose of black powder or a single alchemical cartridge as ammunition. This is an early firearm."
    },
    "Radium pistol": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see text",
      "source": "Pathfinder: Worldscape #2 pg. 26 Statistics",
      "cost": "4,500 gp",
      "weight": "3 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "30 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "6",
      "category": "One-Handed;",
      "proficiency": "Exotic Description A radium pistol is a one-handed weapon with a revolving cylinder containing six chambers. Each chamberholdsaspecial radium-powder cartridge, and when one cartridge is fired, the cylinder automatically rotates (no extra hand or action required). readying the next cartridge for ring. Radium Weapons Barsoomian rearms are stocked with rare local woods. Metal components consist of an alloy of aluminum and steel that exceeds the strength of Earth metals (giving Barsoomian mrms a hardness of 12). Radium weapons re special cartridges that must be manufactured under articial light, as exposure to sunlight results in an explosion. When the cartridges strike their target they shatter exposingthe radium powder within. The moment sunlight strikes this substance it explodes with considerable violence, making the weapons versatile for either direct re or suppressive re. Radium weapons follow the general rules for advanced firearms found in Pathnder Roleplang Game: Ultimate Combat All radium weapons use radium cartridges for ammunition. As a result. in addition to targeting specic creatures or objects. the wielder may re a radium weapon at an unoccupied square similar to throwing a splash weapon ( Pathfinder RFC Core Rulebook 202 ). All creatures within 15 feet of the targeted square take 2d6 points of bludgeoning, piercing, and slashing damage (Reex DC 15 half). Radium cartridge damage does not change based on the size of the weapon used to re them. Radium cartridges cannot be red effectively in this way outside the rays of the sun, such as underground or at night. Radium cartridges cost 3 gp per cartridge."
    },
    "Revolver": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "4,000 gp",
      "weight": "4 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x4;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "6",
      "category": "One-Handed;",
      "proficiency": "Exotic Description A revolver is a pistol with a revolving cylinder containing six chambers. Each chamber can hold a metal cartridge, and when one cartridge is fired, the cylinder automatically rotates (no extra hand or action required), readying the next chamber for firing. A revolver uses metal cartridges as ammunition. This is an advanced firearm."
    },
    "Double-barreled shotgun": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 140 Statistics",
      "cost": "7,000 gp",
      "weight": "15 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x2;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "2",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This twin-barreled shotgun can be shot one barrel at a time, or both together as one attack. A double shot that fires bullets is inaccurate, and takes a 4 penalty on both attacks. A double shot that fires bullets targets only a single creature and increases the damage of each barrel to 2d6 points (Small) or 2d8 points (Medium) for a total of 4d6 or 4d8 points of damage. A doublebarreled shotgun uses metal cartridges (loaded with either a bullet or pellets) as ammunition. This is an advanced firearm."
    },
    "Pepperbox rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 140 Statistics",
      "cost": "7,000 gp",
      "weight": "15 lbs.",
      "damage": "1d8 (small), 1d10 (medium);",
      "critical": "x4;",
      "range": "80 ft.;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "4",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description The four barrels of this rifle are set into a turnable housing that can be quickly rotated by hand (a free action) between shots. A pepperbox rifle uses metal cartridges as ammunition. This is an advanced firearm."
    },
    "Radium rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see text",
      "source": "Pathfinder: Worldscape #2 pg. 27 Statistics",
      "cost": "5,500 gp",
      "weight": "10 lbs.",
      "damage": "1d8 (small), 1d10 (medium);",
      "critical": "x4;",
      "range": "100 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description The long  barrel and line construction ofthis two handed weapon allows for a range superior to  even modern Earth ries. Radium Weapons Barsoomian rearms are stocked with rare local woods. Metal components consist of an alloy of aluminum and steel that exceeds the strength of Earth metals (giving Barsoomian mrms a hardness of 12). Radium weapons re special cartridges that must be manufactured under articial light, as exposure to sunlight results in an explosion. When the cartridges strike their target they shatter exposingthe radium powder within. The moment sunlight strikes this substance it explodes with considerable violence, making the weapons versatile for either direct re or suppressive re. Radium weapons follow the general rules for advanced firearms found in Pathnder Roleplang Game: Ultimate Combat All radium weapons use radium cartridges for ammunition. As a result. in addition to targeting specic creatures or objects. the wielder may re a radium weapon at an unoccupied square similar to throwing a splash weapon ( Pathfinder RFC Core Rulebook 202 ). All creatures within 15 feet of the targeted square take 2d6 points of bludgeoning, piercing, and slashing damage (Reex DC 15 half). Radium cartridge damage does not change based on the size of the weapon used to re them. Radium cartridges cannot be red effectively in this way outside the rays of the sun, such as underground or at night. Radium cartridges cost 3 gp per cartridge."
    },
    "Rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 139 Statistics",
      "cost": "5,000 gp",
      "weight": "12 lbs.",
      "damage": "1d8 (small), 1d10 (medium);",
      "critical": "x4;",
      "range": "80 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This improvement on the musket features a grooved barrel that imparts a twisting, spiral motion to the bullet as it exits, stabilizing it and preventing the end-over-end tumbling common to projectiles from simpler firearms. As a result, a rifle can fire significantly farther and with more accuracy than early long-bore firearms. A rifle uses metal cartridges as ammunition. This is an advanced firearm."
    },
    "Shotgun": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "scatter",
      "source": "Ultimate Equipment pg. 43 , Ultimate Combat pg. 140 Statistics",
      "cost": "5,000 gp",
      "weight": "12 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x2;",
      "range": "20 ft.;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This advanced version of the blunderbuss shoots in a 30-foot cone when firing pellets, and has a 20-foot range increment when firing a bullet (often called a slug). Shotguns can either be simple and functional, or art pieces in their own right, with engravings and inlay on the stocks and breeches. Those used by the upper class are often emblazoned with images of game animals, family crests, or elaborate maker's marks. A shotgun uses metal cartridges (loaded with either a bullet or pellets) as ammunition. This is an advanced firearm."
    },
    "Thark rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see text",
      "source": "Pathfinder: Worldscape #2 pg. 27 Statistics",
      "cost": "6,500 gp",
      "weight": "12 lbs.",
      "damage": "1d8 (small), 1d10 (medium);",
      "critical": "x4;",
      "range": "1 mile;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "1",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description Similar in construction to the standard radium rifle employed by Barsoom's red Martians, the Thark rifle (named for Barsoom's most prominent green Martian tribe) offers a staggering range and greater damage capacity fitting the brutality of its Large wielder. The Thark rifle is a Large two-handed weapon. Radium Weapons Barsoomian firearms are stocked with rare local woods. Metal components consist of an alloy of aluminum and steel that exceeds the strength of Earth metals (giving Barsoomian firarms a hardness of 12). Radium weapons re special cartridges that must be manufactured under artificial light, as exposure to sunlight results in an explosion. When the cartridges strike their target they shatter exposing the radium powder within. The moment sunlight strikes this substance it explodes with considerable violence, making the weapons versatile for either direct fire or suppressive fire. Radium weapons follow the general rules for advanced firearms found in Pathnder Roleplaying Game: Ultimate Combat All radium weapons use radium cartridges for ammunition. As a result. in addition to targeting specific creatures or objects. the wielder may fire a radium weapon at an unoccupied square similar to throwing a splash weapon ( Pathfinder RFC Core Rulebook 202 ). All creatures within 15 feet of the targeted square take 2d6 points of bludgeoning, piercing, and slashing damage (Reflex DC 15 half). Radium cartridge damage does not change based on the size of the weapon used to fire them. Radium cartridges cannot be fired effectively in this way outside the rays of the sun, such as underground or at night. Radium cartridges cost 3 gp per cartridge."
    },
    "Air reservoir": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Heroes of Golarion pg. 18 Statistics",
      "cost": "6 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description A spare reservoir of compressed air comes with 6 pieces of ammunition to be used with an air repeater."
    },
    "Alchemical cartridge (dragon's breath)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "40 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (entangling shot)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "40 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (flare)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "10 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (gray dust shot)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "50 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (gray dust)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "50 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (molten shot)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "40 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (paper, bullet or pellet)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "12 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (repellent)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "30 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (salt shot)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "12 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (smoke cartridge)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "35 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Alchemical cartridge (toxin)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "People of the Wastes pg. 15 ) A toxic cartridge can be used only in early or advanced firearms with the scatter weapon quality. To use a toxic cartridge, make a scattering shot against an AC of 5. If you succeed, you create a cone of burning toxic gas that lasts for 1 rounds, after which the gas dissipates. Any creature within this area when it is created or any creature that enters the gas while it is active must succeed at a DC 15 Fortitude save or become nauseated for 1d2 rounds. Being affected by the gas multiple times lengthens the duration of the sickened condition. In addition, any creature that begins its turn in the area takes 1d6 points of fire damage. If your attack results in a misfire that causes your firearm to explode, the area of the cloud is instead centered on one corner of your square (your choice), with a radius equal to the firearm's misfire burst size. Firing this cartridge increases the firearm's misfire value by 1.",
      "cost": "100 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description An alchemical cartridge is a prepared bundle of black powder with a bullet or pellets, sometimes with more exotic material added, which is then wrapped in paper or cloth and sealed with beeswax, lard, or tallow. There are many types of alchemical cartridges, the simplest being the paper cartridgea simple mix of black powder and either pellets or a bullet. Alchemical cartridges make loading a firearm easier, reducing the time to load a firearm by one step (a full-round action becomes a standard action, a standard action becomes a move action, and a move action becomes a free action), but they tend to be unstable. The misfire value of a weapon firing an alchemical cartridge increases as listed in each entry. Dragon's Breath Cartridge : ("
    },
    "Black powder (dose)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Ultimate Combat pg. 140 Statistics",
      "cost": "10 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description Black powder is the key explosive component within a firearm that enables it to function, but in larger amounts this alchemical material can be quite destructive on its own as well. A single dose of black powder is enough to power a single shot from most one-handed and two-handed firearms, while 10 doses are required to fire a cannon. Black powder is often stored and transported in kegs (which hold 100 doses), but in this quantity the powder itself becomes dangerous. Exposure to fire, electricity, or a misfire explosion causes black powder to explodea single keg that explodes in this manner deals 5d6 points of fire damage to anyone within a 20-foot burst (DC 15 Reflex half). Storing black powder in a powder horn protects the powder from explosion."
    },
    "Black powder (keg)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Ultimate Combat pg. 140 Statistics",
      "cost": "1,000 gp",
      "weight": "5 lbs.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description Black powder is the key explosive component within a firearm that enables it to function, but in larger amounts this alchemical material can be quite destructive on its own as well. A single dose of black powder is enough to power a single shot from most one-handed and two-handed firearms, while 10 doses are required to fire a cannon. Black powder is often stored and transported in kegs (which hold 100 doses), but in this quantity the powder itself becomes dangerous. Exposure to fire, electricity, or a misfire explosion causes black powder to explodea single keg that explodes in this manner deals 5d6 points of fire damage to anyone within a 20-foot burst (DC 15 Reflex half). Storing black powder in a powder horn protects the powder from explosion."
    },
    "Bullet, adamantine": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "61 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description These expensive bullets are crafted from adamantine. They ignore hardness 20 or less when attacking objects."
    },
    "Bullet, screaming": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Heroes of Golarion pg. 18 Statistics",
      "cost": "20 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description This ammunition makes a piercing scream when fired. If fired as part of an Intimidate check, it imparts a +5 bonus on the check. If used with the startling shot deed, the target is flat-footed for an additional round."
    },
    "Dragoon Cartridge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Villain Codex pg. 57 Statistics",
      "cost": "30 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description These clips of alchemical cartridges hold three bullets and fit the slot of either the dragoon musket or the dragoon pistol. They allow the wielder of those firearms to fire up to three shots in quick succession without the need to reload. Once the cartridge is spent, reloading another dragoon cartridge takes a full-round action, no matter the type of dragoon firearm in question. Rapid Reload can reduce the action time required, but abilities like the musket master's fast musket have no effect. Unlike other alchemical cartridges, dragoon cartridges don't increase a dragoon firearm's misfire chance by 1. Dragoon cartridges can be used only with dragoon firearms. Magical bullets can be made in the form of dragoon cartridges, but the price and cost are three times greater than the listed value."
    },
    "bullet (1)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Pathfinder Campaign Setting pg. 211 , Ultimate Combat pg. 141 Statistics",
      "cost": "1 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description The ammunition of most one-handed and two-handed firearms, firearm bullets typically take the form of small balls of lead or some other metal. Thirty bullets weigh half a pound."
    },
    "bullet (30)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "30 gp",
      "weight": "1/2 lb.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description The ammunition of most one-handed and two-handed firearms, firearm bullets typically take the form of small balls of lead or some other metal. Thirty bullets weigh half a pound."
    },
    "bullet, silver": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "25 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description This ammunition is specifically crafted from silver, and though nonmagical, it is particularly detrimental to lycanthropes, automatically confirming any critical threats against such creatures. A firearm that is shooting a silver bullet takes a 1 penalty on damage rolls (with a minimum of 1 point of damage)."
    },
    "Gunsmith's kit": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "15 gp",
      "weight": "2 lbs.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description This small kit has all the tools a person needs to create, repair, and restore firearms, except for the necessary raw materials. Without such a kit, you cannot properly construct or provide upkeep for firearms."
    },
    "Lawrence 1917 flamethrower fuel tank": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "50 gp",
      "weight": "9 lbs.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description This pair of\r\ntanksone filled with oil, and the other a propellant\r\nprovides enough flammable material to use a\r \nflamethrower six times."
    },
    "Metal cartridge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Ultimate Combat pg. 141 Statistics",
      "cost": "15 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description These sturdier versions of alchemical cartridges serve as the ammunition for advanced firearms. They can hold either bullets or pellets."
    },
    "Pellets (30 handfuls)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "30 gp",
      "weight": "1/2 lb.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description A handful of pellets, along with 1 dose of black powder, is commonly used as ammunition for one-handed and twohanded firearms with the scatter weapon quality, though rocks or other small bits of hard material can be used in the pellets' place. Using anything other than pellets or alchemical cartridges when firing off a cone attack with a scatter weapon increases the weapon's misfire range by 1 (though this increase can be removed by switching back to standard ammunition). Thirty handfuls of pellets weigh half a pound."
    },
    "Pellets (handful)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Ultimate Combat pg. 141 Statistics",
      "cost": "1 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description A handful of pellets, along with 1 dose of black powder, is commonly used as ammunition for one-handed and twohanded firearms with the scatter weapon quality, though rocks or other small bits of hard material can be used in the pellets' place. Using anything other than pellets or alchemical cartridges when firing off a cone attack with a scatter weapon increases the weapon's misfire range by 1 (though this increase can be removed by switching back to standard ammunition). Thirty handfuls of pellets weigh half a pound."
    },
    "Pitted bullet": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Equipment pg. 41 , Ultimate Combat pg. 141 Statistics",
      "cost": "5 gp",
      "weight": "",
      "category": "Ammunition;",
      "proficiency": "Exotic Description This ammunition is pitted with a pattern of small pocks into which specially formulated poison compounds can be applied. A poison compound is a derivative of a standard toxin that is alchemically reduced to a solid form. These can be made from any standard injury or contact poison with a successful Craft (poison) check equal to the poison's DC + 4. The cost of purchasing an already prepared poison compound for the purpose of treating pitted bullets is equal to the poison's base cost + 20 gp. Once crafted, the compound can be pasted into the ammunition's pitted design and allowed to harden. Upon completion, the bullet can be fired from an appropriate firearm, releasing the poison compound into its target upon impact, but the poison's DC is reduced by 2. A pitted bullet cannot be used with an alchemical cartridge. The listed cost does not include the cost of poison."
    },
    "Powder horn": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 141 Statistics",
      "cost": "3 gp",
      "weight": "1 lb.",
      "category": "Ammunition;",
      "proficiency": "Exotic Description Typically crafted from animal horn, but increasingly crafted from metal in a wide variety of shapes, a powder horn can hold up to 10 doses of black powder. A powder horn protects black powder stored within in it from exposure to fire, electricity, firearm misfires, and water."
    },
    "Nagant M1895 revolver": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "400 gp",
      "weight": "4 lbs.",
      "damage": "1d8 (medium);",
      "critical": "x4;",
      "range": "80 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "7",
      "category": "One-Handed;",
      "proficiency": "Exotic Description This\r firearm is identical in operation\r to the advanced firearms revolver\r ( Ultimate Combat 139), though it\r has a capacity of 7 instead of 6."
    },
    "Lawrence 1917 flamethrower": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "800 gp",
      "weight": "20 lbs.",
      "damage": "4d6 (medium);",
      "critical": ";",
      "range": ";",
      "type": "fire;",
      "misfire": ";",
      "capacity": "6",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description One of the most infamous\r devices to evolve as a result of\r trench warfare, the flamethrower is still\r in its infancy in the early twentieth century.\r The British military produced the Lawrence\r 1917, which found its way into the hands of\r Russia's soldiers. The device consists\r of a cumbersome backpack\r of two tanks and a swivelmounted,\r handheld projection\r unit, or lance. When the device\r is aimed and a small hand lever\r depressed, a small gas burner ignites the oil, which is\r propelled forth in a blazing stream of intense flame. A\r f lamethrower with full tanks is capable of unleashing up\r to 6 charges of ignited oil, to devastating effect. When using a flamethrower, the wielder projects a\r 60-foot-long line of fire, attempting a separate attack roll\r against each creature within the line. Each attack roll takes\r a 2 penalty, and its attack damage cannot be modified\r by precision damage or damage-increasing feats such as\r Vital Strike. Effects that grant concealment, such as fog or\r smoke, or the blur , invisibility , or mirror image spells, do not\r foil this line attack. If any of the rolls threatens a critical\r hit, the wielder confirms the critical for that roll alone. All affected creatures take 4d6 points of damage,\r and any creature hit by the flaming stream must also\r succeed at succeed at a DC 20 Ref lex save or catch fire,\r taking an additional 2d6 points of damage each round\r until the flames are extinguished. A burning creature\r can attempt a new save as a full-round action, and\r dropping and rolling on the ground grants a +2 bonus\r on this save. The device's tanks and backpacks are awkward, and the\r wielder takes a 4 armor check penalty when wearing the\r cumbersome device. In addition, the tanks have hardness\r 10 and 5 hit points, and if the tank is ruptured in the\r presence of any adjacent flame (including the device's own\r gas igniter), a mighty conf lagration erupts, the wielder\r takes 6d6 points of fire damage, and all creatures within a\r 20-foot radius take 3d6 points of fire damage (Reflex DC 20\r for half ). Any creatures who take damage must succeed at a\r DC 20 Reflex save or catch on fire."
    },
    "Madsen light machine gun": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "automatic",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "1,000 gp",
      "weight": "20 lbs.",
      "damage": "2d6 (medium);",
      "critical": "x4;",
      "range": "100 ft.;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "20, 30, or 40",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This imposing machine\r gun is light enough to\r be transported and\r wielded by a single\r user. Chambered\r for the Russian\r military in 7.62\u001f54mmR,\r this machine gun uses a top-loading, detachable 20-, 30-,\r or 40-round magazine. Like most machine guns, it is only\r capable of automatic fire."
    },
    "Maxim M1910 machine gun": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "automatic",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "1,500 gp",
      "weight": "140 lbs.",
      "damage": "2d8 (medium);",
      "critical": "x4;",
      "range": "120 ft.;",
      "type": "B and P;",
      "misfire": "1-2;",
      "capacity": "250",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This heavy machine\r gun uses 7.62\u001f54mmR ammunition in 250-round belts.\r Although a single person can fire a Maxim, it typically has\r a two-person crew: the gunner, and a loader who assists\r with feeding the ammunition belt into the weapon. As a\r full-round action, the loader can use a special aid another\r action to grant the gunner a +2 bonus on his next attack roll. Because of its size and heavy weight, a Maxim is often\r either mounted on a wheeled chassis with a gun shield\r for trench defensive use, or on the back of a horse-drawn\r wagon called a tachanka (see page 67). Assuming a user\r can even lift the weapon, firing a Maxim M1910 machine\r gun that is not mounted imparts a 4 penalty on attack\r rolls and the recoil knocks the wielder prone. The Maxim\r M1910 is automatic-fire only. The armored shield provides\r cover when firing the weapon from the prone position."
    },
    "Mosin-Nagant M1891 rifle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "500 gp",
      "weight": "9 lbs.",
      "damage": "1d10 (medium);",
      "critical": "x4;",
      "range": "80 ft.;",
      "type": "B and P;",
      "misfire": "1;",
      "capacity": "5",
      "category": "Two-Handed;",
      "proficiency": "Exotic Description This bolt-action rifle is\r the mainstay of Russian military forces. It is similar to the\r advanced firearms rif le with the following differences. It\r uses the same 7.62\u001f54mmR ammunition as the Madsen\r machine gun, and is fed from a 5-round internal, nondetachable\r magazine that is typically loaded with 5-round\r stripper clips (loading it is a move action). Without stripper\r clips, you may only reload up to 2 rounds of ammunition\r as a move action. Ammunition is typically sold in groups\r of 5 rounds. The rifle has a lug for the\r attachment of a socket bayonet, and\r can be equipped with a unique sidemount\r scope system (see below)."
    },
    "Aasen mortar": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "500 gp",
      "weight": "50 lbs.",
      "damage": "6d6 ;",
      "critical": "x3;",
      "range": "200 ft. (50 ft. min.);",
      "type": "B, P, and S",
      "misfire": "1;",
      "crew": "1;",
      "aim": "0;",
      "load": "1",
      "category": "Siege;",
      "proficiency": "Exotic Description The Aasen\r\n mortar is an indirect-fire\r\n advanced siege firearm, consisting of a heavy steel barrel, a loading mechanism,\r\n and a folding bipod stand, and is used to launch explosives\r\n to penetrate enemy defensive lines. Aiming the mortar is\r\n part of the standard action required to fire it. Reloading\r\n the mortar is a full-round action, and the user loads a\r\n grenade-like projectile into the breech of the weapon's\r\n steel barrel, along with a blank rifle round that propels\r\n the bomb when triggered. The weapon uses indirect fire to\r\n lob bombs in slow-moving, high arcs, and the user targets\r\n a specific square. Rules for indirect-fire siege weapons are\r\n found on page 160 of Ultimate Combat. Mortars can also\r\n be fired as direct-fire siege engines. When used for direct\r\n fire, they take a 4 penalty on attack rolls and their range\r\n increment is halved, but they do not have a minimum\r\n range. After the point of impact is determined, the shell\r\n explodes and deals 6d6 points of bludgeoning, piercing,\r\n and slashing damage to all creatures in a 30-foot radius\r\n (Ref lex DC 20 for half ). An Aasen mortar has hardness 10\r\n and 35 hit points; it fires special, finned fragmentation\r\n bombs that cost 10 gp each and weigh 4 pounds each.\r\n These bombs usually arrive on the battlefront in wooden\r\n cases containing 6 mortars each."
    },
    "Hotchkiss 6 pounder": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "2,000 gp",
      "weight": "special",
      "damage": "8d6 ;",
      "critical": "x3;",
      "range": "300 ft.;",
      "type": "B, P, and S",
      "misfire": "1;",
      "crew": "2;",
      "aim": "0;",
      "load": "2",
      "category": "Siege;",
      "proficiency": "Exotic Description The Hotchkiss 6 pounder\r gun is a shortened version of the Hotchkiss 6 pounder\r naval gun, designed for use in the sponsons of World\r War I-era tanks such as the Mark IV. The Hotchkiss\r 6 pounder is a direct-f ire advanced siege f irearm that\r must be mounted in place on a vehicle to be used. It\r f ires high explosive (HE) shells that deal 8d6 points\r of bludgeoning, piercing, and slashing\r damage in a 30-foot radius around the\r point of impact (Ref lex DC 20 for\r half ). A Hotchkiss 6 pounder is a Medium weapon and\r has hardness 10 and 70 hit points. Hotchkiss HE shells\r cost 25 gp each and weigh 6 pounds each."
    },
    "Gas cylinder": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see description",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "300 gp",
      "weight": "50 lbs.",
      "damage": "see description (medium);",
      "critical": ";",
      "range": ";",
      "type": ";",
      "category": "Explosive;",
      "proficiency": "Exotic Description This large metal canister\r releases a cloud of toxic gas. It is usually placed on the\r ground and triggered so that the wind blows the gas toward\r enemy positions. Normally, multiple gas cylinders are\r placed in line and triggered together to cover a wider area\r of the battlefield. First, determine what direction the wind\r is blowing by rolling 1d4 (1 is north, 2 is east, 3 is south,\r and 4 is west). When triggered, a gas cylinder releases a\r cloud of mustard gas (see the sidebar on page 67) in a 15-\r foot cone. On the following 2 rounds, the cloud extends\r by an additional 15-foot square away from the canister,\r forming a 15-foot-wide, 45-foot-long cloud at the end of\r 3 rounds. The cloud moves with the wind, rolling along\r the surface of the ground, and disperses after 10 rounds. A\r strong wind (21+ mph) disperses the cloud in 4 rounds, and\r a severe wind (31+ mph) disperses it in 1 round. Mustard Gas Used in warfare during the Great War, mustard gas (along with other gases such as chlorine and phosgene) were responsible for the grisly and painful deaths of nearly 90,000 people, and permanently scarred more than a million. Mustard gas is normally deployed via gas cylinders or chemical grenades. A cloud of mustard gas obscures vision like fog cloud and looks like a bank of fog, except that its vapors are yellowish-brown. Living creatures within a cloud of mustard gas take 3d6 points of acid damage when first exposed to the gas and must succeed at a DC 18 Fortitude save each round or become nauseated and blinded for as long as they are in the cloud and for 1d4+1 rounds after leaving the cloud. Creatures that succeed at their save but remain in the cloud must continue to save each round on their turn. This is a poison effect. Because mustard gas is heavier than air, its vapors sink to the lowest level of the land, pouring down into holes and trenches. A gas mask completely protects the wearer from the nausea and blindness effects of mustard gas, though holding one's breath does not."
    },
    "M1914 grenade (concussion)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see description",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "50 gp",
      "weight": "1 lb.",
      "damage": "3d6 (medium);",
      "critical": "x2;",
      "range": "20 ft.;",
      "type": "B;",
      "category": "Explosive;",
      "proficiency": "Exotic Description This time-delayed\r concussion grenade is a mainstay of trench warfare. The\r device appears to be little more than a metal cylinder\r tapering to a handle containing a spring-loaded lever. To\r detonate the device, you disengage the safety pin while\r depressing the handle's lever, which releases the firing\r pin when thrown. The device detonates at the beginning\r of your next turn, hopefully in the area you targeted. The\r device relies on a concussive blast to deal damage, and\r all creatures within a 20-foot radius take 3d6 points of\r bludgeoning damage (Ref lex DC 15 for half )."
    },
    "M1914 grenade (fragmentation)": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see description",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "75 gp",
      "weight": "1 lb.",
      "damage": "4d6 (medium);",
      "critical": "x2;",
      "range": "20 ft.;",
      "type": "B, P, and S;",
      "category": "Explosive;",
      "proficiency": "Exotic Description Standard M1914\r grenades can be fitted with an optional fragmentation\r sleeve. This sleeve converts the normal concussive\r blasts into a cloud of deadly shrapnel at the expense of\r a decreased damage radius. The device is armed and\r detonated in the same manner as a regular M1914 grenade,\r though the explosion radius is reduced to a 15-foot radius\r and the grenade instead deals 4d6 bludgeoning, piercing,\r and slashing damage (Ref lex DC 15 for half )."
    },
    "M1917 chemical grenade": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "see description",
      "source": "Pathfinder #71: Rasputin Must Die! pg. 64 Statistics",
      "cost": "100 gp",
      "weight": "2 lbs.",
      "damage": "see description (medium);",
      "critical": ";",
      "range": "20 ft.;",
      "type": "acid;",
      "category": "Explosive;",
      "proficiency": "Exotic Description The M1917 is a\r modified M1914 grenade specially modified and\r enlarged to release a cloud of toxic gas upon\r detonation. Resembling an overlarge metal can\r with a small lever and handle protruding from\r the bottom, the grenade is armed by pulling back\r on a metal firing pin held in place by the handle's depressed lever, which is released when thrown. At the\r beginning of your next turn, the grenade spews forth\r a cloud of mustard gas (see the sidebar on this page) in\r a 20-foot radius. The cloud disperses naturally after 4\r rounds; a strong wind (21+ mph) disperses the cloud in\r 1 round. Mustard Gas Used in warfare during the Great War, mustard gas (along with other gases such as chlorine and phosgene) were responsible for the grisly and painful deaths of nearly 90,000 people, and permanently scarred more than a million. Mustard gas is normally deployed via gas cylinders or chemical grenades. A cloud of mustard gas obscures vision like fog cloud and looks like a bank of fog, except that its vapors are yellowish-brown. Living creatures within a cloud of mustard gas take 3d6 points of acid damage when first exposed to the gas and must succeed at a DC 18 Fortitude save each round or become nauseated and blinded for as long as they are in the cloud and for 1d4+1 rounds after leaving the cloud. Creatures that succeed at their save but remain in the cloud must continue to save each round on their turn. This is a poison effect. Because mustard gas is heavier than air, its vapors sink to the lowest level of the land, pouring down into holes and trenches. A gas mask completely protects the wearer from the nausea and blindness effects of mustard gas, though holding one's breath does not."
    }
  },
  "Mod": {
    "Brutally weighted": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+1,500 gp",
      "weight": "+1 lb.",
      "category": "Modification;",
      "proficiency": "Modification Description A brutally weighted weapon is balanced to put more weight on the striking surface, knocking targets off balance with every blow. Only bludgeoning melee weapons can be brutally weighted. This modification can be added to a greatclub or tetsubo UE without increasing its weapon's category, but doing so increases the cost of modification by an additional 1,500 gp. A creature hit with a brutally weighted weapon takes a 2 penalty to its CMD against bull rush, reposition, and trip combat maneuvers until the end of its next turn or until after it is subject to such a maneuver (whichever comes first)."
    },
    "Dual-balanced": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+2,000 gp",
      "weight": "",
      "category": "Modification;",
      "proficiency": "Modification Description Dual-balanced weapons are balanced to be wielded in tandem. Only melee weapons can be dual-balanced. When wielding two weapons with the dual-balanced modification, reduce any two-weapon fighting penalties by 1 for both weapons. The weapons do not need to be the same type, but both must have the dual-balanced modification."
    },
    "Jagged hooks": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+1,000 gp",
      "weight": "+1 lb.",
      "category": "Modification;",
      "proficiency": "Modification Description Brutal hooks and barbs are worked along the weapon's blade or length. Only piercing or slashing weapons can have jagged hooks. Projectile weapons can't have jagged hooks, but their ammunition can. A weapon with jagged hooks deals additional damage equal to the weapon's critical hit multiplier on a confirmed critical hit; this additional damage is added to the final total, and is not multiplied by the critical hit multiplier."
    },
    "Razor-sharp": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+1,000 gp",
      "weight": "",
      "category": "Modification;",
      "proficiency": "Modification Description The weapon's edge is honed to incredible sharpness. The weapon's edge dulls after a number of daily uses, but the bonus can be reset by spending 15 minutes whetting the blade after a night's rest. Only piercing or slashing weapons can have the razor-sharp modification. Projectile weapons can't be razorsharp, but their ammunition can. A razor-sharp weapon gains a +1 bonus on weapon damage rolls for a number of attacks each day equal to 3 + your base attack bonus."
    },
    "Serrated edge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+2,000 gp",
      "weight": "",
      "category": "Modification;",
      "proficiency": "Modification Description The weapon's blade inflicts wounds that bleed profusely. Only piercing or slashing melee weapons can have a serrated edge. This modification can be added to a sawtooth sabre UE or rhoka sword UE without increasing its weapon category, but doing so increases the cost of modification by 2,000 gp. When you make an attack with a weapon with a serrated edge, you can take a 2 penalty on the attack roll. If you do and the attack deals damage, the weapon also inflicts 1 point of bleed damage. This bleed stacks with itself (to a maximum equal to the weapon's critical multiplier), but does not stack with bleed from other sources."
    },
    "Tactically adapted": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+2,000 gp",
      "weight": "",
      "category": "Modification;",
      "proficiency": "Modification Description A tactically adapted weapon is designed for specialized tactics rather than just swinging and stabbing. Only melee weapons can be tactically adapted. When this quality is added to a weapon, choose a weapon quality from the following list: blocking UE , brace, disarm, distracting UE , nonlethal, performance UE , or trip. The modified weapon gains that weapon quality."
    },
    "Versatile design": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Adventurer's Armory 2 pg. 10 Statistics",
      "cost": "+500 gp",
      "weight": "",
      "category": "Modification;",
      "proficiency": "Modification Description A weapon with the versatile design modification is easier to wield for those skilled with other weapon groups. When versatile design is added to a weapon, choose a fighter weapon group. The modified weapon is considered to be a weapon of that weapon group (such as for the fighter's weapon training class feature). A melee weapon cannot be considered part of a weapon group for ranged weapons, and vice versa."
    }
  },
  "Siege": {
    "Ballista, light": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 160 , PRPG Core Rulebook pg. 435 Statistics",
      "cost": "500 gp",
      "weight": "",
      "damage": "3d8;",
      "critical": "19-20/x2;",
      "range": "120 ft.;",
      "type": "P",
      "crew": "1;",
      "aim": "0;",
      "load": "2;",
      "speed": "10 ft.",
      "category": "Direct-Fire (Large);",
      "proficiency": "Siege Engine Description Resembling a massive crossbow, a ballista's power is provided by twisted skeins of animal sinew used as torsion springs driving a pair of adjustable arms. A cord attached to both arms is winched back and a projectile is loaded into a grooved slider for release. Ballistae are direct-fire weapons. Light : This common type of ballista, also called an arbalest or scorpion, is size Large, maneuverable, and often mounted atop towers or even vehicles. Light ballistae have a hardness of 5 and 50 hit points. Light ballista bolts cost 10 gp each and weigh 10 pounds. Heavy : These Huge-sized siege engines are commonly used as castle defenses, as well as on large warships. Heavy ballistae have a hardness of 5 and 100 hit points. Heavy ballista bolts cost 30 gp and weigh 20 pounds each. Gate Breaker : This massive ballista fires specially weighted quarrels with blunt metal tips. These are used as long-range battering rams, shot at walls or the gates of castles. When they hit a wooden structure, they have a critical range of 1920/3. Gate breaker ballistae have a hardness of 5 and 200 hit points. Gate breaker ballista bolts cost 50 gp and weigh 30 pounds each."
    },
    "Cannon": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 162 Statistics",
      "cost": "6,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": "x4;",
      "range": "100 ft.;",
      "type": "B and P",
      "crew": "2;",
      "aim": "1;",
      "load": "3;",
      "speed": "10 ft.",
      "category": "Direct-Fire (Large);",
      "proficiency": "Siege Engine Description Cannons are crafted of metalsome are cast in one piece, others welded with iron bandsand mounted either in the ground or on wooden frames. Cannons use black powder to propel their projectiles with great force. A cannon has a misfire range of 1 (20 feet). Cannons have a hardness of 10 and 70 hit points. Cannon balls cost 30 gp each and weigh 25 pounds."
    },
    "Ballista, heavy": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 160 Statistics",
      "cost": "800 gp",
      "weight": "",
      "damage": "4d8;",
      "critical": "19-20/x2;",
      "range": "180 ft.;",
      "type": "P",
      "crew": "3;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Direct-Fire (Huge);",
      "proficiency": "Siege Engine Description Resembling a massive crossbow, a ballista's power is provided by twisted skeins of animal sinew used as torsion springs driving a pair of adjustable arms. A cord attached to both arms is winched back and a projectile is loaded into a grooved slider for release. Ballistae are direct-fire weapons. Light : This common type of ballista, also called an arbalest or scorpion, is size Large, maneuverable, and often mounted atop towers or even vehicles. Light ballistae have a hardness of 5 and 50 hit points. Light ballista bolts cost 10 gp each and weigh 10 pounds. Heavy : These Huge-sized siege engines are commonly used as castle defenses, as well as on large warships. Heavy ballistae have a hardness of 5 and 100 hit points. Heavy ballista bolts cost 30 gp and weigh 20 pounds each. Gate Breaker : This massive ballista fires specially weighted quarrels with blunt metal tips. These are used as long-range battering rams, shot at walls or the gates of castles. When they hit a wooden structure, they have a critical range of 1920/3. Gate breaker ballistae have a hardness of 5 and 200 hit points. Gate breaker ballista bolts cost 50 gp and weigh 30 pounds each."
    },
    "Cannon, fiend's mouth": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "9,000 gp",
      "weight": "",
      "damage": "8d6;",
      "critical": "x4;",
      "range": "150 ft.;",
      "type": "B and P",
      "crew": "3;",
      "aim": "1;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Direct-Fire (Huge);",
      "proficiency": "Siege Engine Description These massive cannons are usually crafted in multiple pieces, and sometimes feature the heads of demons, devils, or other fiends at their mouths. Like normal canons, they propel their projectiles with great force. A fiend's mouth cannon has a misfire range of 1 (30 ft.). Fiend's mouth canons have a hardness of 10 and 140 hit points. Fiend's mouth cannon balls cost 45 gp and weigh 30 pounds each."
    },
    "Firedrake": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "4,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": ";",
      "range": ";",
      "type": "fire",
      "crew": "3;",
      "aim": "2;",
      "load": "5;",
      "speed": "10 ft.",
      "category": "Direct-Fire (Huge);",
      "proficiency": "Siege Engine Description These large siege engines are typically wheeled or attached to vehicles that can transport them to the battlefield. This apparatus fires gouts of alchemist's fire in either a 60-foot line or a 30-foot cone (siege crew leader's choice). Targets in the area take 6d6 points of fire damage (DC 15 Reflex save halves); those who fail their saves also catch on fire. A firedrake with the broken condition that suffers a further mishap explodes, dealing its damage to all creatures within a 20-foot blast (DC 15 Reflex save halves). Firedrakes have a hardness of 10 and 70 hit points. One use of firedrake ammunition costs 200 gp and weighs 20 pounds."
    },
    "Manticore's Tail": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "3d8;",
      "critical": "19-20/x2;",
      "range": "see text;",
      "type": "P",
      "crew": "3;",
      "aim": "0;",
      "load": "4;",
      "speed": "0 ft.",
      "category": "Direct-Fire (Huge);",
      "proficiency": "Siege Engine Description This massive ballista fires a dozen or more bolts at once in a devastating rain of steel that deals 3d8 points of damage. The crew leader makes a separate attack roll with a 2 penalty against each creature and object within a 60-foot cone, ignoring concealment. Confirm any critical threats separately. This weapon has a mishap only if the first attack roll is a mishap. A manticore's tail has a hardness of 5 and 100 hit points. Ammunition for one use of the manticore's tail costs 120 gp and weighs 120 pounds."
    },
    "Ballista, gate breaker": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 160 Statistics",
      "cost": "1,200 gp",
      "weight": "",
      "damage": "6d8;",
      "critical": "19-20/x2;",
      "range": "100 ft.;",
      "type": "B",
      "crew": "5;",
      "aim": "3;",
      "load": "5;",
      "speed": "0 ft.",
      "category": "Direct-Fire (Gargantuan);",
      "proficiency": "Siege Engine Description Resembling a massive crossbow, a ballista's power is provided by twisted skeins of animal sinew used as torsion springs driving a pair of adjustable arms. A cord attached to both arms is winched back and a projectile is loaded into a grooved slider for release. Ballistae are direct-fire weapons. Light : This common type of ballista, also called an arbalest or scorpion, is size Large, maneuverable, and often mounted atop towers or even vehicles. Light ballistae have a hardness of 5 and 50 hit points. Light ballista bolts cost 10 gp each and weigh 10 pounds. Heavy : These Huge-sized siege engines are commonly used as castle defenses, as well as on large warships. Heavy ballistae have a hardness of 5 and 100 hit points. Heavy ballista bolts cost 30 gp and weigh 20 pounds each. Gate Breaker : This massive ballista fires specially weighted quarrels with blunt metal tips. These are used as long-range battering rams, shot at walls or the gates of castles. When they hit a wooden structure, they have a critical range of 1920/3. Gate breaker ballistae have a hardness of 5 and 200 hit points. Gate breaker ballista bolts cost 50 gp and weigh 30 pounds each."
    },
    "Firewyrm": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "6,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": ";",
      "range": ";",
      "type": "fire",
      "crew": "5;",
      "aim": "2;",
      "load": "6;",
      "speed": "0 ft.",
      "category": "Direct-Fire (Gargantuan);",
      "proficiency": "Siege Engine Description This siege engine is a larger version of the firedrake. A firewyrm is too large to be transported to the battlefield in one piece and must be assembled once the component parts reach the battlefield. A firewyrm fires its gout of flame in either a 120-foot line or a 60-foot cone (crew leader's choice). Targets in the area take 6d6 points of fire damage (DC 20 Reflex save halves). Those who fail their saves catch on fire. A firewyrm with the broken condition that suffers a further mishap explodes, dealing its damage to all creatures within a 30-foot blast (DC 20 Reflex save halves). Firewyrms have a hardness of 10 and 140 hit points. One use of firewyrm ammunition costs 400 gp and weighs 40 pounds."
    },
    "Bombard, light": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 161 Statistics",
      "cost": "6,000 gp",
      "weight": "",
      "damage": "5d6;",
      "critical": "x4;",
      "range": "100 ft. (50 ft. min.);",
      "type": "B and P",
      "crew": "2;",
      "aim": "1;",
      "load": "3;",
      "speed": "10 ft.",
      "category": "Indirect-Fire (Large);",
      "proficiency": "Siege Engine Description Resembling either large cauldrons or more traditional cannons, these firearms lob their ammunition in an arc in order to deliver their deadly payloads over troops or castle walls. Bombards are normally fired indirectly, but can also be fired as direct-fire siege engines. When they are used for direct fire, they take a 4 penalty on attack rolls and have their range increment halved, but do not have a minimum range. Like all firearms, bombards do not suffer mishaps, but instead have a misfire chance. Light : These bombards resemble cauldrons attached to swivels. Often they are mounted into the ground or into the stone of castle walls because of the mighty power of their recoil. The targeting DC of a light bombard is 15. A light bombard has a base misfire range of 12 (10 feet). Light bombards have a hardness of 10 and 70 hit points. Light bombard balls cost 30 gp each and weigh 25 pounds. Standard : These bombards feature the greatest diversity of forms. Many take the cauldron shape of the light bombard, but they may also take the forms of more traditional cannons, albeit featuring stabilizing mechanisms that allow them to fire at a much steeper incline. The targeting DC of a standard bombard is 20. A standard bombard has a misfire range of 12 (20 feet). Standard bombards have a hardness of 10 and 140 hit points. Standard bombard balls cost 35 gp each and weigh 30 pounds. Heavy : These massive siege engines are often fixed to positions on high hilltops or atop massive keeps, raining death down on a valley or strait. Often these firearms come in two pieces connected by a screw mechanism. The bombard is unscrewed to be loaded, and then the main part of the muzzle is screwed back on to the barrel section in order to be fired. Heavy bombards are too large and powerful to mount on vehicles. The targeting DC of a heavy bombard is 25. A heavy bombard has a misfire range of 12 (30 feet). Heavy bombards have a hardness of 10 and 280 hit points. Heavy bombard balls cost 45 gp each and weigh 50 pounds."
    },
    "Catapult, light": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 162 , PRPG Core Rulebook pg. 435 Statistics",
      "cost": "550 gp",
      "weight": "",
      "damage": "4d6;",
      "critical": "x2;",
      "range": "150 ft. (50 ft. min.);",
      "type": "B",
      "crew": "2;",
      "aim": "2;",
      "load": "3;",
      "speed": "10 ft.",
      "category": "Indirect-Fire (Large);",
      "proficiency": "Siege Engine Description Catapults are stone-throwing siege engines powered by winched arms that run through torsion skeins, and hold their payload in a cup that swings up and over the weapon when released. Catapults can hurl a variety of different types of ammunition (the damage given is for stone projectiles; other types of ammunition can be found later in this chapter). They are indirect-fire siege engines. Light : These catapults are Large and often mounted on wheels. The targeting DC of a light catapult is 15. Light catapults have a hardness of 5 and 50 hit points. Light catapult stones cost 10 gp and weigh 50 pounds each. Standard : These Huge siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 20). Standard catapults have a hardness of 5 and 100 hit points. Standard catapult stones cost 15 gp and weigh 75 pounds each. Heavy : These Gargantuan siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 25). Heavy catapults have a hardness of 5 and 200 hit points. Heavy catapult stones cost 25 gp and weigh 90 pounds each."
    },
    "Trebuchet, light": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "800 gp",
      "weight": "",
      "damage": "4d6;",
      "critical": "x2;",
      "range": "200 ft. (100 ft. min.);",
      "type": "B",
      "crew": "3;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Large);",
      "proficiency": "Siege Engine Description Trebuchets are similar in form to catapults, with the payload placed into a basket, cup, or sling at the end of a long lever, and a counterweight (often with crew or animals pulling attached ropes) close to the fulcrum. The leverage imparted by a trebuchet allows it to hurl massive missiles that scatter to a number of squares around the target square based on the size of the trebuchet. Trebuchets are too bulky to move on wheels or vehicles and must be assembled on the battlefield. Trebuchets have a minimum range of 150 feet. Light : These Large siege engines typically hurl large stones indirectly at a target (targeting DC 15). A light trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 5 feet of the target square (creatures can make a DC 15 Reflex save to halve the damage again). Light trebuchets have a hardness of 5 and 50 hit points. One use of light trebuchet stones costs 15 gp and weighs 60 pounds. Standard : These Huge siege engines typically hurl large stones indirectly at a target (targeting DC 20). A standard trebuchet's ammunition scatters on contact, dealing full damage to the target square and half damage to creatures and objects within 15 feet of the target square (creatures can make a DC 20 Reflex save to halve the damage again). Standard trebuchets have a hardness of 5 and 100 hit points. One use of standard trebuchet stones costs 30 gp and weighs 110 pounds. Heavy : These Gargantuan siege engines typically hurl large stones indirectly at a target (targeting DC 25). A heavy trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 30 feet of the target square (creatures can make a DC 25 Reflex save to halve the damage again). Heavy trebuchets have a hardness of 5 and 200 hit points. One use of heavy trebuchet stones costs 40 gp and weighs 120 pounds."
    },
    "Bombard, standard": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 161 Statistics",
      "cost": "8,000 gp",
      "weight": "",
      "damage": "7d6;",
      "critical": "x4;",
      "range": "150 ft. (100 ft. min.);",
      "type": "B and P",
      "crew": "2;",
      "aim": "1;",
      "load": "3;",
      "speed": "10 ft.",
      "category": "Indirect-Fire (Huge);",
      "proficiency": "Siege Engine Description Resembling either large cauldrons or more traditional cannons, these firearms lob their ammunition in an arc in order to deliver their deadly payloads over troops or castle walls. Bombards are normally fired indirectly, but can also be fired as direct-fire siege engines. When they are used for direct fire, they take a 4 penalty on attack rolls and have their range increment halved, but do not have a minimum range. Like all firearms, bombards do not suffer mishaps, but instead have a misfire chance. Light : These bombards resemble cauldrons attached to swivels. Often they are mounted into the ground or into the stone of castle walls because of the mighty power of their recoil. The targeting DC of a light bombard is 15. A light bombard has a base misfire range of 12 (10 feet). Light bombards have a hardness of 10 and 70 hit points. Light bombard balls cost 30 gp each and weigh 25 pounds. Standard : These bombards feature the greatest diversity of forms. Many take the cauldron shape of the light bombard, but they may also take the forms of more traditional cannons, albeit featuring stabilizing mechanisms that allow them to fire at a much steeper incline. The targeting DC of a standard bombard is 20. A standard bombard has a misfire range of 12 (20 feet). Standard bombards have a hardness of 10 and 140 hit points. Standard bombard balls cost 35 gp each and weigh 30 pounds. Heavy : These massive siege engines are often fixed to positions on high hilltops or atop massive keeps, raining death down on a valley or strait. Often these firearms come in two pieces connected by a screw mechanism. The bombard is unscrewed to be loaded, and then the main part of the muzzle is screwed back on to the barrel section in order to be fired. Heavy bombards are too large and powerful to mount on vehicles. The targeting DC of a heavy bombard is 25. A heavy bombard has a misfire range of 12 (30 feet). Heavy bombards have a hardness of 10 and 280 hit points. Heavy bombard balls cost 45 gp each and weigh 50 pounds."
    },
    "Catapult, standard": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 162 Statistics",
      "cost": "800 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": "x2;",
      "range": "200 ft. (100 ft. min.);",
      "type": "B",
      "crew": "3;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Huge);",
      "proficiency": "Siege Engine Description Catapults are stone-throwing siege engines powered by winched arms that run through torsion skeins, and hold their payload in a cup that swings up and over the weapon when released. Catapults can hurl a variety of different types of ammunition (the damage given is for stone projectiles; other types of ammunition can be found later in this chapter). They are indirect-fire siege engines. Light : These catapults are Large and often mounted on wheels. The targeting DC of a light catapult is 15. Light catapults have a hardness of 5 and 50 hit points. Light catapult stones cost 10 gp and weigh 50 pounds each. Standard : These Huge siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 20). Standard catapults have a hardness of 5 and 100 hit points. Standard catapult stones cost 15 gp and weigh 75 pounds each. Heavy : These Gargantuan siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 25). Heavy catapults have a hardness of 5 and 200 hit points. Heavy catapult stones cost 25 gp and weigh 90 pounds each."
    },
    "Springal, arrow": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "3d8;",
      "critical": "x3;",
      "range": "100 ft. (50 ft. min.);",
      "type": "P",
      "crew": "3;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Huge);",
      "proficiency": "Siege Engine Description A springal uses a torsion-cranked composite paddle to strike a firing rack containing multiple arrows or black-powder-propelled rockets, which rain down in an arc over a burst area. Springals are indirect-fire weapons that affect an area centered on the target square (targeting DC 20). Arrow : This springal propels a group of arrows that rains down on the targeted square and in a 15-foot burst around that square. One use of arrow springal ammunition costs 20 gp and weighs 10 pounds. Rocket : This highly volatile springal propels a group of black-powder rockets that rain down on the targeted square and in a 15-foot burst around the area. If the rocket springal misfires, it explodes, dealing its damage in a 20- foot blast around the springal. This explosion destroys the rocket springal. One use of rocket springal ammunition costs 500 gp and weighs 30 pounds."
    },
    "Springal, rocket": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "6,000 gp",
      "weight": "",
      "damage": "3d10;",
      "critical": "x4;",
      "range": "100 ft. (50 ft. min.);",
      "type": "fire",
      "crew": "3;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Huge);",
      "proficiency": "Siege Engine Description A springal uses a torsion-cranked composite paddle to strike a firing rack containing multiple arrows or black-powder-propelled rockets, which rain down in an arc over a burst area. Springals are indirect-fire weapons that affect an area centered on the target square (targeting DC 20). Arrow : This springal propels a group of arrows that rains down on the targeted square and in a 15-foot burst around that square. One use of arrow springal ammunition costs 20 gp and weighs 10 pounds. Rocket : This highly volatile springal propels a group of black-powder rockets that rain down on the targeted square and in a 15-foot burst around the area. If the rocket springal misfires, it explodes, dealing its damage in a 20- foot blast around the springal. This explosion destroys the rocket springal. One use of rocket springal ammunition costs 500 gp and weighs 30 pounds."
    },
    "Trebuchet, standard": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": "x2;",
      "range": "300 ft. (150 ft. min.);",
      "type": "B",
      "crew": "4;",
      "aim": "2;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Huge);",
      "proficiency": "Siege Engine Description Trebuchets are similar in form to catapults, with the payload placed into a basket, cup, or sling at the end of a long lever, and a counterweight (often with crew or animals pulling attached ropes) close to the fulcrum. The leverage imparted by a trebuchet allows it to hurl massive missiles that scatter to a number of squares around the target square based on the size of the trebuchet. Trebuchets are too bulky to move on wheels or vehicles and must be assembled on the battlefield. Trebuchets have a minimum range of 150 feet. Light : These Large siege engines typically hurl large stones indirectly at a target (targeting DC 15). A light trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 5 feet of the target square (creatures can make a DC 15 Reflex save to halve the damage again). Light trebuchets have a hardness of 5 and 50 hit points. One use of light trebuchet stones costs 15 gp and weighs 60 pounds. Standard : These Huge siege engines typically hurl large stones indirectly at a target (targeting DC 20). A standard trebuchet's ammunition scatters on contact, dealing full damage to the target square and half damage to creatures and objects within 15 feet of the target square (creatures can make a DC 20 Reflex save to halve the damage again). Standard trebuchets have a hardness of 5 and 100 hit points. One use of standard trebuchet stones costs 30 gp and weighs 110 pounds. Heavy : These Gargantuan siege engines typically hurl large stones indirectly at a target (targeting DC 25). A heavy trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 30 feet of the target square (creatures can make a DC 25 Reflex save to halve the damage again). Heavy trebuchets have a hardness of 5 and 200 hit points. One use of heavy trebuchet stones costs 40 gp and weighs 120 pounds."
    },
    "Bombard, heavy": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 161 Statistics",
      "cost": "16,000 gp",
      "weight": "",
      "damage": "9d6;",
      "critical": "x4;",
      "range": "200 ft. (100 ft. min.);",
      "type": "B and P",
      "crew": "4;",
      "aim": "3;",
      "load": "5;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Gargantuan);",
      "proficiency": "Siege Engine Description Resembling either large cauldrons or more traditional cannons, these firearms lob their ammunition in an arc in order to deliver their deadly payloads over troops or castle walls. Bombards are normally fired indirectly, but can also be fired as direct-fire siege engines. When they are used for direct fire, they take a 4 penalty on attack rolls and have their range increment halved, but do not have a minimum range. Like all firearms, bombards do not suffer mishaps, but instead have a misfire chance. Light : These bombards resemble cauldrons attached to swivels. Often they are mounted into the ground or into the stone of castle walls because of the mighty power of their recoil. The targeting DC of a light bombard is 15. A light bombard has a base misfire range of 12 (10 feet). Light bombards have a hardness of 10 and 70 hit points. Light bombard balls cost 30 gp each and weigh 25 pounds. Standard : These bombards feature the greatest diversity of forms. Many take the cauldron shape of the light bombard, but they may also take the forms of more traditional cannons, albeit featuring stabilizing mechanisms that allow them to fire at a much steeper incline. The targeting DC of a standard bombard is 20. A standard bombard has a misfire range of 12 (20 feet). Standard bombards have a hardness of 10 and 140 hit points. Standard bombard balls cost 35 gp each and weigh 30 pounds. Heavy : These massive siege engines are often fixed to positions on high hilltops or atop massive keeps, raining death down on a valley or strait. Often these firearms come in two pieces connected by a screw mechanism. The bombard is unscrewed to be loaded, and then the main part of the muzzle is screwed back on to the barrel section in order to be fired. Heavy bombards are too large and powerful to mount on vehicles. The targeting DC of a heavy bombard is 25. A heavy bombard has a misfire range of 12 (30 feet). Heavy bombards have a hardness of 10 and 280 hit points. Heavy bombard balls cost 45 gp each and weigh 50 pounds."
    },
    "Catapult, heavy": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 162 , PRPG Core Rulebook pg. 434 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "8d6;",
      "critical": "x2;",
      "range": "300 ft. (100 ft. min.);",
      "type": "B",
      "crew": "4;",
      "aim": "3;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Gargantuan);",
      "proficiency": "Siege Engine Description Catapults are stone-throwing siege engines powered by winched arms that run through torsion skeins, and hold their payload in a cup that swings up and over the weapon when released. Catapults can hurl a variety of different types of ammunition (the damage given is for stone projectiles; other types of ammunition can be found later in this chapter). They are indirect-fire siege engines. Light : These catapults are Large and often mounted on wheels. The targeting DC of a light catapult is 15. Light catapults have a hardness of 5 and 50 hit points. Light catapult stones cost 10 gp and weigh 50 pounds each. Standard : These Huge siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 20). Standard catapults have a hardness of 5 and 100 hit points. Standard catapult stones cost 15 gp and weigh 75 pounds each. Heavy : These Gargantuan siege engines are too large to be transported to the battlefield in one piece, and require assembly. They typically hurl large stones indirectly at a target (targeting DC 25). Heavy catapults have a hardness of 5 and 200 hit points. Heavy catapult stones cost 25 gp and weigh 90 pounds each."
    },
    "Trebuchet, heavy": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 163 Statistics",
      "cost": "1,500 gp",
      "weight": "",
      "damage": "8d6;",
      "critical": "x2;",
      "range": "400 ft. (200 ft. min.);",
      "type": "B",
      "crew": "4;",
      "aim": "3;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Indirect-Fire (Gargantuan);",
      "proficiency": "Siege Engine Description Trebuchets are similar in form to catapults, with the payload placed into a basket, cup, or sling at the end of a long lever, and a counterweight (often with crew or animals pulling attached ropes) close to the fulcrum. The leverage imparted by a trebuchet allows it to hurl massive missiles that scatter to a number of squares around the target square based on the size of the trebuchet. Trebuchets are too bulky to move on wheels or vehicles and must be assembled on the battlefield. Trebuchets have a minimum range of 150 feet. Light : These Large siege engines typically hurl large stones indirectly at a target (targeting DC 15). A light trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 5 feet of the target square (creatures can make a DC 15 Reflex save to halve the damage again). Light trebuchets have a hardness of 5 and 50 hit points. One use of light trebuchet stones costs 15 gp and weighs 60 pounds. Standard : These Huge siege engines typically hurl large stones indirectly at a target (targeting DC 20). A standard trebuchet's ammunition scatters on contact, dealing full damage to the target square and half damage to creatures and objects within 15 feet of the target square (creatures can make a DC 20 Reflex save to halve the damage again). Standard trebuchets have a hardness of 5 and 100 hit points. One use of standard trebuchet stones costs 30 gp and weighs 110 pounds. Heavy : These Gargantuan siege engines typically hurl large stones indirectly at a target (targeting DC 25). A heavy trebuchet's ammunition scatters on contact, dealing full damage to the target square and half its damage to creatures and objects within 30 feet of the target square (creatures can make a DC 25 Reflex save to halve the damage again). Heavy trebuchets have a hardness of 5 and 200 hit points. One use of heavy trebuchet stones costs 40 gp and weighs 120 pounds."
    },
    "Bridge, assault, Colossal": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 165 Statistics",
      "cost": "250 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "0;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description An assault bridge is used to span a ditch, moat, or other gap. Raising an assault bridge requires one full-round action per 5 feet of length; up to four creatures may cooperate to raise a bridge. The time required is doubled for each size category that the bridge is larger than the creatures raising it. Large assault bridges have 40 hit points, Huge ones have 60 hit points, Gargantuan ones have 160 hit points, and Colossal ones have 240 hit points. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Bridge, assault, Gargantuan": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 165 Statistics",
      "cost": "50 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "0;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description An assault bridge is used to span a ditch, moat, or other gap. Raising an assault bridge requires one full-round action per 5 feet of length; up to four creatures may cooperate to raise a bridge. The time required is doubled for each size category that the bridge is larger than the creatures raising it. Large assault bridges have 40 hit points, Huge ones have 60 hit points, Gargantuan ones have 160 hit points, and Colossal ones have 240 hit points. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Bridge, assault, Huge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 165 Statistics",
      "cost": "10 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "0;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description An assault bridge is used to span a ditch, moat, or other gap. Raising an assault bridge requires one full-round action per 5 feet of length; up to four creatures may cooperate to raise a bridge. The time required is doubled for each size category that the bridge is larger than the creatures raising it. Large assault bridges have 40 hit points, Huge ones have 60 hit points, Gargantuan ones have 160 hit points, and Colossal ones have 240 hit points. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Bridge, assault, Large": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 165 Statistics",
      "cost": "1 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "0;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description An assault bridge is used to span a ditch, moat, or other gap. Raising an assault bridge requires one full-round action per 5 feet of length; up to four creatures may cooperate to raise a bridge. The time required is doubled for each size category that the bridge is larger than the creatures raising it. Large assault bridges have 40 hit points, Huge ones have 60 hit points, Gargantuan ones have 160 hit points, and Colossal ones have 240 hit points. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Corvus": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 165 Statistics",
      "cost": "100 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "1;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A corvus is a boarding device that features a hinged counterweight system for mounting a bridge vertically on a siege tower or a vehicle, with a hooked end to grab onto a target vehicle or structure. A corvus is usually 10 feet wide and 15 feet long. It has a hardness of 5 and 10 hit points per square. Using a corvus requires a DC 10 Profession (siege engineer) check as a full-round action; if the check fails, the corvus fails to catch on the target and must be reset (a full-round action). A corvus mounted on a vehicle can target another moving vehicle (see Chapter 4: Vehicles). Doing so requires an opposed driving check to get the corvus into the correct position, which is within the length of the corvus and adjacent to the other vehicle. Once a corvus is attached, it takes a Strength check as a full-round action to dislodge the corvus. Alternatively, if the corvus is attached to a vehicle, either vehicle driver can make a driving check as a standard action to dislodge the corvus (a check that succeeds by 5 or more destroys the corvus). The base DC for either of these checks is 15, and the DC increases by 5 for every Small or Medium creature currently standing on the corvus. If a corvus is disengaged while creatures are standing on it, those creatures must make a DC 15 Reflex saving throw or fall. Succeeding at the saving throw allows them to move to the nearest area of safe ground, but such movement provokes attacks of opportunity. A corvus cannot be armored."
    },
    "Crushing Wheel": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "500 gp",
      "weight": "",
      "damage": "4d6;",
      "critical": ";",
      "range": ";",
      "type": "B",
      "crew": "4;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description The bulk of this weapon is a steel roller nearly 10 feet wide. Handles or a harness project from the axle, allowing four orcs or one Large beast to push the crushing wheel from behind. As a full-round action, its crew can roll the crushing wheel over creatures in front of it. This functions as the trample monster ability except as noted here. Creatures that are overrun fall prone and take 4d6 points of damage. Targets that succeed at a DC 15 Reflex saving throw take only half damage and avoid falling prone. A crushing wheel has a hardness of 10 and 100 hit points. A crushing wheel is a Large siege engine."
    },
    "Earthmaul": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": ";",
      "range": ";",
      "type": "B",
      "crew": "3;",
      "aim": "0;",
      "load": "3;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description This war machine is fitted with an enormous hammer. When dropped into the horizontal position, it functions like a sideways-mounted catapult, and is capable of clearing wide swaths of enemies. Although it doesn't use ammunition, the earthmaul must effectively be reloaded by winding the torsion. When the earthmaul is activated, creatures on the ground in a 15-foot cone take 6d6 points of damage, are knocked 10 feet in the direction of the swing, and fall prone. A successful DC 20 Reflex saving throw halves the damage and negates the additional effects. An earthmaul has a hardness of 5 and 100 hit points. An earthmaul is a Huge siege engine."
    },
    "Gallery, Colossal": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "2,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "18;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A mobile temporary defense, a gallery is similar to a building made of hide or wood. Most are of flimsy construction, but rare examples are more stoutly built (use the rules for giving siege engines armor, and adjust AC, hardness, and hit points accordingly). Galleries are almost always a single section of movable wall plus another section that acts as the roof. (Galleries made to house battering rams are an exception, and typically have two joined wall sections and roof sections.) Because a gallery is partially open, it does not provide the same cover as a normal building: a creature inside a gallery gains cover if it is the same size as the gallery, improved cover if it is one size smaller, and total cover if it is two or more sizes smaller. Galleries are sized like creaturesa Larger gallery protects the same space as a Large creature, and so on. Wooden galleries can be moved on rollers at a speed of 10 feet with their full crew, or 5 feet with at least half the required crew. Galleries have a base speed of 15 feet (or 10 feet if protected with medium or heavy armor). Galleries have a hardness of 5, and hit points based on their size. A Large gallery has 30 hit points, a Huge one has 120 hit points, a Gargantuan one has 320 hit points, and a colossal one has 625 hit points."
    },
    "Gallery, Gargantuan": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "9;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A mobile temporary defense, a gallery is similar to a building made of hide or wood. Most are of flimsy construction, but rare examples are more stoutly built (use the rules for giving siege engines armor, and adjust AC, hardness, and hit points accordingly). Galleries are almost always a single section of movable wall plus another section that acts as the roof. (Galleries made to house battering rams are an exception, and typically have two joined wall sections and roof sections.) Because a gallery is partially open, it does not provide the same cover as a normal building: a creature inside a gallery gains cover if it is the same size as the gallery, improved cover if it is one size smaller, and total cover if it is two or more sizes smaller. Galleries are sized like creaturesa Larger gallery protects the same space as a Large creature, and so on. Wooden galleries can be moved on rollers at a speed of 10 feet with their full crew, or 5 feet with at least half the required crew. Galleries have a base speed of 15 feet (or 10 feet if protected with medium or heavy armor). Galleries have a hardness of 5, and hit points based on their size. A Large gallery has 30 hit points, a Huge one has 120 hit points, a Gargantuan one has 320 hit points, and a colossal one has 625 hit points."
    },
    "Gallery, Huge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "500 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "6;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A mobile temporary defense, a gallery is similar to a building made of hide or wood. Most are of flimsy construction, but rare examples are more stoutly built (use the rules for giving siege engines armor, and adjust AC, hardness, and hit points accordingly). Galleries are almost always a single section of movable wall plus another section that acts as the roof. (Galleries made to house battering rams are an exception, and typically have two joined wall sections and roof sections.) Because a gallery is partially open, it does not provide the same cover as a normal building: a creature inside a gallery gains cover if it is the same size as the gallery, improved cover if it is one size smaller, and total cover if it is two or more sizes smaller. Galleries are sized like creaturesa Larger gallery protects the same space as a Large creature, and so on. Wooden galleries can be moved on rollers at a speed of 10 feet with their full crew, or 5 feet with at least half the required crew. Galleries have a base speed of 15 feet (or 10 feet if protected with medium or heavy armor). Galleries have a hardness of 5, and hit points based on their size. A Large gallery has 30 hit points, a Huge one has 120 hit points, a Gargantuan one has 320 hit points, and a colossal one has 625 hit points."
    },
    "Gallery, Large": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "250 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "3;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A mobile temporary defense, a gallery is similar to a building made of hide or wood. Most are of flimsy construction, but rare examples are more stoutly built (use the rules for giving siege engines armor, and adjust AC, hardness, and hit points accordingly). Galleries are almost always a single section of movable wall plus another section that acts as the roof. (Galleries made to house battering rams are an exception, and typically have two joined wall sections and roof sections.) Because a gallery is partially open, it does not provide the same cover as a normal building: a creature inside a gallery gains cover if it is the same size as the gallery, improved cover if it is one size smaller, and total cover if it is two or more sizes smaller. Galleries are sized like creaturesa Larger gallery protects the same space as a Large creature, and so on. Wooden galleries can be moved on rollers at a speed of 10 feet with their full crew, or 5 feet with at least half the required crew. Galleries have a base speed of 15 feet (or 10 feet if protected with medium or heavy armor). Galleries have a hardness of 5, and hit points based on their size. A Large gallery has 30 hit points, a Huge one has 120 hit points, a Gargantuan one has 320 hit points, and a colossal one has 625 hit points."
    },
    "Harvester": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "800 gp",
      "weight": "",
      "damage": "2d8;",
      "critical": "x4;",
      "range": ";",
      "type": "S",
      "crew": "4;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A variety of scythe-like blades extend from two sides of this wheeled machine. When it's pulledtypically by an aurochs or enslaved giantsthe wheels' rotation causes the blades to slash indiscriminately. Each round the harvester moves, it makes a melee attack with a +10 modifier against any adjacent creature it passes; it deals 2d8 points of damage to those it hits. Multiple harvesters can be strung together. The crew required for a train of harvesters is equal to the total crew of the individual machines. Adjacent creatures are attacked by each individual harvester that passes them. A harvester has a hardness of 5 and 50 hit points. A  harvester is a Large siege engine."
    },
    "Ladder, escalade, Colossal": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "250 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "8;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description Escalade ladders have spiked bases for stability, and the upper 5 feet are metal-shod, with hardness 10 and 20 hit points. The remainder of the ladder is wooden and has hardness 5 and hit points based on its size. Large escalade ladders have 20 hit points, Huge ones have 30 hit points, Gargantuan ones have 80 hit points, and Colossal ones have 120 hit points. Escalade ladders cannot be armored. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Ladder, escalade, Gargantuan": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "50 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "6;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description Escalade ladders have spiked bases for stability, and the upper 5 feet are metal-shod, with hardness 10 and 20 hit points. The remainder of the ladder is wooden and has hardness 5 and hit points based on its size. Large escalade ladders have 20 hit points, Huge ones have 30 hit points, Gargantuan ones have 80 hit points, and Colossal ones have 120 hit points. Escalade ladders cannot be armored. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Ladder, escalade, Huge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "10 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "4;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description Escalade ladders have spiked bases for stability, and the upper 5 feet are metal-shod, with hardness 10 and 20 hit points. The remainder of the ladder is wooden and has hardness 5 and hit points based on its size. Large escalade ladders have 20 hit points, Huge ones have 30 hit points, Gargantuan ones have 80 hit points, and Colossal ones have 120 hit points. Escalade ladders cannot be armored. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Ladder, escalade, Large": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "5 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "2;",
      "aim": "0;",
      "load": "0;",
      "speed": "0 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description Escalade ladders have spiked bases for stability, and the upper 5 feet are metal-shod, with hardness 10 and 20 hit points. The remainder of the ladder is wooden and has hardness 5 and hit points based on its size. Large escalade ladders have 20 hit points, Huge ones have 30 hit points, Gargantuan ones have 80 hit points, and Colossal ones have 120 hit points. Escalade ladders cannot be armored. Table 3-16: Bridges and Escalade Ladders Size Width Length/Height Large 5 ft. 20 ft. Huge 5 ft. 30 ft. Gargantuan 10 ft. 40 ft. Colossal 10 ft. 60 ft.",
      "size": "",
      "width": "",
      "length/height": ""
    },
    "Ram, Colossal": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "5,000 gp",
      "weight": "",
      "damage": "10d6;",
      "critical": "x3;",
      "range": ";",
      "type": "B",
      "crew": "40;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description"
    },
    "Ram, Gargantuan": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "2,000 gp",
      "weight": "",
      "damage": "6d6;",
      "critical": "x3;",
      "range": ";",
      "type": "B",
      "crew": "20;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description"
    },
    "Ram, Huge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": "3d6;",
      "critical": "x3;",
      "range": ";",
      "type": "B",
      "crew": "10;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description"
    },
    "Ram, Large": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 , PRPG Core Rulebook pg. 435 Statistics",
      "cost": "500 gp",
      "weight": "",
      "damage": "2d6;",
      "critical": "x3;",
      "range": ";",
      "type": "B",
      "crew": "5;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description The most basic close assault weapons are iron-shod logs carried by one or more creatures to combine their strength. A ram can be used to deal damage or to make a Strength check against the target's break DC. Ramming Charge : Rams require momentum to be effective. All creatures using the ram must use the charge action to gain its full effect. Creatures not wishing to charge may make a ram attack as a full-round action, taking a 4 penalty on attack and damage rolls and Strength checks with the ram. Breaking : The crew leader makes a Strength check with a +2 bonus, adding +2 for each member of the crew (or equivalent number of larger creatures; see Crew under Siege Engine Rules ) assisting. The ram also provides a +4 bonus per size category above Medium. Damage : The crew leader makes an attack roll with a 4 nonproficiency penalty. A hit deals the listed damage, plus the Strength modifiers of the crew leader and all members of the crew, regardless of their size. Improvised Ram : Any tree, log, or timber can be used as a ram with a 4 penalty on attack and damage rolls and Strength checks. Pick : A ram with a pick head grants a +2 circumstance bonus on Strength checks and attack and damage rolls made against stone structures. Screw : A ram with a screw head grants a +2 circumstance bonus on Strength checks and attack and damage rolls made against earthen structures. Gallery Ram : This is a ram suspended from chains or ropes within a gallery. A gallery ram does not require a charge action for full momentum. In addition, adding tethers to the back end of the ram allows four additional crew members to assist in using the ram. Hit Points : Rams have a hardness of 5 and hit points based on their size. A Large ram has 30 hit points, a Huge one has 120 hit points, a Gargantuan one has 320 hit points, and a Colossal one has 625 hit points. Improvised rams have half the normal hit points."
    },
    "tower, Colossal": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "10,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "48;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A wooden gallery of stout construction, a siege tower consists of a tall protective shell with a roof section. The lower story of the tower contains the crew members who propel the tower, and provides total cover to those within. A siege tower with the broken condition moves at half speed. If a siege tower is destroyed, the entire tower collapses. Treat this as a cave-in The upper section of a siege tower provides improved cover for a number of soldiers (see below) and may have pierced walls allowing creatures to fire ranged weapons out the sides. The roof section may have a battlement and may mount a siege engine of the siege tower's size or smaller and a corvus. Siege towers have a base speed of 15 (or 10 feet if protected with medium or heavy armor). Siege towers have a hardness of 5, and hit points based on their size. A Large siege tower has 60 hit points, a Huge one has 240 hit points, a Gargantuan one has 640 hit points, and a Colossal one has 1,250 hit points. Table 3-17: Siege Tower Complement Size Soldiers Large 5 Huge 20 Gargantuan 50 Colossal 200",
      "size": "",
      "soldiers": ""
    },
    "tower, Gargantuan": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "5,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "24;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A wooden gallery of stout construction, a siege tower consists of a tall protective shell with a roof section. The lower story of the tower contains the crew members who propel the tower, and provides total cover to those within. A siege tower with the broken condition moves at half speed. If a siege tower is destroyed, the entire tower collapses. Treat this as a cave-in The upper section of a siege tower provides improved cover for a number of soldiers (see below) and may have pierced walls allowing creatures to fire ranged weapons out the sides. The roof section may have a battlement and may mount a siege engine of the siege tower's size or smaller and a corvus. Siege towers have a base speed of 15 (or 10 feet if protected with medium or heavy armor). Siege towers have a hardness of 5, and hit points based on their size. A Large siege tower has 60 hit points, a Huge one has 240 hit points, a Gargantuan one has 640 hit points, and a Colossal one has 1,250 hit points. Table 3-17: Siege Tower Complement Size Soldiers Large 5 Huge 20 Gargantuan 50 Colossal 200",
      "size": "",
      "soldiers": ""
    },
    "tower, Huge": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 Statistics",
      "cost": "2,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "12;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A wooden gallery of stout construction, a siege tower consists of a tall protective shell with a roof section. The lower story of the tower contains the crew members who propel the tower, and provides total cover to those within. A siege tower with the broken condition moves at half speed. If a siege tower is destroyed, the entire tower collapses. Treat this as a cave-in The upper section of a siege tower provides improved cover for a number of soldiers (see below) and may have pierced walls allowing creatures to fire ranged weapons out the sides. The roof section may have a battlement and may mount a siege engine of the siege tower's size or smaller and a corvus. Siege towers have a base speed of 15 (or 10 feet if protected with medium or heavy armor). Siege towers have a hardness of 5, and hit points based on their size. A Large siege tower has 60 hit points, a Huge one has 240 hit points, a Gargantuan one has 640 hit points, and a Colossal one has 1,250 hit points. Table 3-17: Siege Tower Complement Size Soldiers Large 5 Huge 20 Gargantuan 50 Colossal 200",
      "size": "",
      "soldiers": ""
    },
    "tower, Large": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 166 , PRPG Core Rulebook pg. 435 Statistics",
      "cost": "1,000 gp",
      "weight": "",
      "damage": ";",
      "critical": ";",
      "range": ";",
      "type": "",
      "crew": "6;",
      "aim": "0;",
      "load": "0;",
      "speed": "15 ft.",
      "category": "Close Assault;",
      "proficiency": "Siege Engine Description A wooden gallery of stout construction, a siege tower consists of a tall protective shell with a roof section. The lower story of the tower contains the crew members who propel the tower, and provides total cover to those within. A siege tower with the broken condition moves at half speed. If a siege tower is destroyed, the entire tower collapses. Treat this as a cave-in The upper section of a siege tower provides improved cover for a number of soldiers (see below) and may have pierced walls allowing creatures to fire ranged weapons out the sides. The roof section may have a battlement and may mount a siege engine of the siege tower's size or smaller and a corvus. Siege towers have a base speed of 15 (or 10 feet if protected with medium or heavy armor). Siege towers have a hardness of 5, and hit points based on their size. A Large siege tower has 60 hit points, a Huge one has 240 hit points, a Gargantuan one has 640 hit points, and a Colossal one has 1,250 hit points. Table 3-17: Siege Tower Complement Size Soldiers Large 5 Huge 20 Gargantuan 50 Colossal 200",
      "size": "",
      "soldiers": ""
    },
    "Alchemist's fire": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "200 gp",
      "weight": "10 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description This hard, ceramic canister of alchemist's fire can be used as ammunition in catapults and trebuchets. When it hits its target square, it deals 4d6 points of fire damage to each creature and wooden structure within 5 feet of the target space, and each creature must make a DC 20 Reflex saving throw or catch on fire (wooden objects automatically catch on fire). Every creature and wooden object within the area between 5 and 30 feet of the target space must make a DC 20 Reflex saving throw or take half the fire damage, but they do not catch on fire. On a siege engine mishap, this ammunition explodes before it is launched, dealing its damage to the siege engine and all nearby creatures and wooden objects as if one of the spaces of the siege engine (crew leader's choice) were the target square. This alchemical fire ignores the hardness of wooden objects."
    },
    "Blast Shot": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "30 gp",
      "weight": "25 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description Instead of a single hard ball, this ammunition is a bundle of large pellets, balls, or pieces of scrap metal, propelled a short distance by black powder and attacking all creatures and objects within an area. Both cannons and fiend's mouth cannons can fire this kind of ammunition. When such a siege engine fires this ammunition, it hits every creature and object within a 30-foot-cone burst. The siege engine makes attack rolls against each creature and unattended object in the burst. It must miss every creature or target to misfire, and a misfire generates the normal effect. It deals its normal damage on a hit, but does not ignore the hardness of objects."
    },
    "Bomb": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "600 gp",
      "weight": "30 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description A bomb is a metal canister filled with metal balls and black powder that can be used as ammunition in catapults and trebuchets or carried by two Medium creatures or one Large creature to its destination. A bomb either explodes on impact (if fired from a catapult or trebuchet, or within 3 rounds of a fuse being lit if carried). When it explodes, it deals 6d6 points of piercing and bludgeoning damage to all creatures and objects within 30 feet of the target square. On a siege engine mishap, this ammunition explodes before it is launched, dealing its damage to the siege engine and all nearby creatures and wooden objects as if one of the spaces of the siege engine (crew leader's choice) were the target square. It ignores the hardness of wood and stone."
    },
    "Chain shot": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "50 gp",
      "weight": "30 lbs",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description This siege engine firearm ammunition can be loaded in a cannon or a fiend's mouth cannon. It is especially good at tearing through sails and dirigibles (see the Vehicle rules ), dealing double its normal damage to those forms of propulsion. When fired at a creature, on a hit, the creature must succeed at a DC 20 Fortitude saving throw or be knocked prone."
    },
    "Defoliant Shot": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "300 gp",
      "weight": "20 lbs",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description When used as ammunition in a catapult or trebuchet, this ceramic canister releases a mist of defoliant on impact. When it hits the target square, it deals 2d6 points of damage to any creature in that space. Plant creatures within 30 feet of the target square take an additional 4d6 points of damage. A successful DC 20 Fortitude saving throw halves this additional damage. Plant creatures within 5 feet of the target space that fail their saving throws also take 1d4 points of Strength damage and 1d4 points of Constitution damage. The defoliant also kills vegetation within 30 feet of the target square as described in Ultimate Equipment On a siege engine mishap, this ammunition explodes before it's launched, dealing its damage to the siege engine and all nearby plant creatures as if one of the spaces of the siege engine (crew leader's choice) were the target square."
    },
    "Entangling Bolt": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "50 gp",
      "weight": "25 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description When launched from a ballista, this specialized bolt unfurls into a large net. An attack with entangling ammunition is a ranged touch attack, but it's only effective within one range increment. If it hits, the target is entangled, but the attack deals no damage. An entangled creature can escape with a successful DC 20 Escape Artist check (a full-round action). The net has 5 hit points and can be burst with a successful DC 25 Strength check (also a full-round action). Entangling ammunition is useful only against creatures within one size category of the firing ballista."
    },
    "Liquid ice": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "400 gp",
      "weight": "20 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description This hard, ceramic canister filled with alchemical liquid ice can be used as ammunition in catapults and trebuchets. When it hits its target square, it deals 4d6 points of cold damage to each creature within 5 feet of the targeting space, and each creature must make a DC 20 Fortitude save or become entangled for 1 round. Every creature within the area between 5 and 30 feet of the target space must make a DC 20 Fortitude saving throw or take half damage. On a siege engine mishap, this ammunition explodes before it is launched, dealing its damage to all nearby creatures as if one of the spaces of the siege engine (crew leader's choice) were the target square."
    },
    "Plague bundle": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "80 gp",
      "weight": "20 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description This hard, ceramic canister is filled with a noxious mass of diseased carrion and offal that can be used as ammunition for a catapult or a trebuchet. It deals only half damage, but every creature hit by it is exposed to filth fever ( Core Rulebook 557). A GM might allow a plague bundle to inflict other diseases."
    },
    "Rockwasp Bomb": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Belkzen, Hold of the Orc Hordes pg. 39 Statistics",
      "cost": "2,000 gp",
      "weight": "100 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description Usable in catapults and trebuchets, this ammunition consists of a wooden crate packed with wax globes, from which a faint buzzing sound emanates. Visible as a dark shape at the center of each globe is a rat-sized hornet known as a rockwasp. The alchemical wax keeps the wasps immobilized, while tiny air holes allow them to breath. This ammunition deals only half damage, but releases a wasp swarm two wasp swarms if used for a heavy catapult or heavy trebuchet. The wasps attack for 1 minute before dispersing. On a siege engine mishap, the wasps escape before the ammunition is launched."
    },
    "Smoke shot": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Ultimate Combat pg. 164 Statistics",
      "cost": "250 gp",
      "weight": "20 lbs.",
      "category": "Ammunition;",
      "proficiency": "Siege Engine Description This hard ceramic sphere contains two alchemical substances separated by a thin barrier, much like a smoke pellet<%END in larger form, usable by cannons and fiend's mouth cannons. When it hits the targeting space, it deals 2d6 points of damage to any creature in that space, and the substances mingle and then create an area of foul but harmless yellow smoke radiating 30 feet from the target square. Treat the effect as a  fog cloud  spell. On a siege engine mishap, the ammunition explodes before it is launched. Its effect is centered on one of the spaces of the siege engine (crew leader's choice)."
    }
  },
  "Special": {
    "Claw blades": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "catfolk only, see description",
      "source": "Advanced Race Guide pg. 93 Statistics",
      "cost": "305 gp",
      "weight": "2 lbs.",
      "damage": " (small),  (medium);",
      "critical": ";",
      "range": ";",
      "type": "S;",
      "category": "Light;",
      "proficiency": "Special Description These subtle blades can only be used by catfolk with the cat's claws racial trait. Bought in a set of five, they fit over the wearer's claws on one hand. The blades grant the wearer a +1 enhancement bonus on claw attack rolls with that hand and change the weapon type from a natural weapon to a light slashing weapon. Catfolk with the cat's claws racial trait are proficient with this weapon. The claw blades can be enhanced like a masterwork weapon for the normal costs. The listed cost of the item is for one set of five claws for one hand."
    },
    "Kobold tail, long lash": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "reach",
      "source": "Advanced Race Guide pg. 135 Statistics",
      "cost": "15 gp",
      "weight": "1 lb.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x2;",
      "range": ";",
      "type": "S;",
      "category": "Light;",
      "proficiency": "Special Description A kobold with the Tail Terror feat (see below) can slip this device over the tip of his tail to augment his natural attack. Each tail attachment provides just enough weight, balance, and striking power to increase the damage of his tail slap. It takes a full-round action to slip on a kobold tail attachment, and the kobold gains a +4 bonus against disarm attempts made to remove his tail attachment. While a kobold is wearing a kobold tail attachment, the attack deals the tail attachment damage, and some attachments gain a special feature. Tail attachments are light weapons and can be improved by feats that can improve weapon attacks (such as Weapon Focus and Weapon Specialization). All kobold tail attachments make up a kobold tail attachment weapon group that can be improved by the fighter's weapon training class ability. Tail attachments can be constructed of special material and made into masterwork or magic items. There are five types of common tail attachments. Long Lash : This slender cord has tiny bits of glass and stone embedded in its length. Pounder : This squat ball is made from some sort of dull metal. Razored : This metal wedge has a prickly edge on one of its sides. Spiked : This narrow spike tapers to a sharp point. Sweeper : When properly used, this sharply curved piece of metal can knock opponents off their feet. Unlike most trip weapons, you cannot drop it if you are tripped during your own trip attempt."
    },
    "Kobold tail, pounder": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Advanced Race Guide pg. 135 Statistics",
      "cost": "1 gp",
      "weight": "4 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x2;",
      "range": ";",
      "type": "B;",
      "category": "Light;",
      "proficiency": "Special Description A kobold with the Tail Terror feat (see below) can slip this device over the tip of his tail to augment his natural attack. Each tail attachment provides just enough weight, balance, and striking power to increase the damage of his tail slap. It takes a full-round action to slip on a kobold tail attachment, and the kobold gains a +4 bonus against disarm attempts made to remove his tail attachment. While a kobold is wearing a kobold tail attachment, the attack deals the tail attachment damage, and some attachments gain a special feature. Tail attachments are light weapons and can be improved by feats that can improve weapon attacks (such as Weapon Focus and Weapon Specialization). All kobold tail attachments make up a kobold tail attachment weapon group that can be improved by the fighter's weapon training class ability. Tail attachments can be constructed of special material and made into masterwork or magic items. There are five types of common tail attachments. Long Lash : This slender cord has tiny bits of glass and stone embedded in its length. Pounder : This squat ball is made from some sort of dull metal. Razored : This metal wedge has a prickly edge on one of its sides. Spiked : This narrow spike tapers to a sharp point. Sweeper : When properly used, this sharply curved piece of metal can knock opponents off their feet. Unlike most trip weapons, you cannot drop it if you are tripped during your own trip attempt."
    },
    "Kobold tail, razored": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Advanced Race Guide pg. 135 Statistics",
      "cost": "3 gp",
      "weight": "2 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "19-20/x2;",
      "range": ";",
      "type": "S;",
      "category": "Light;",
      "proficiency": "Special Description A kobold with the Tail Terror feat (see below) can slip this device over the tip of his tail to augment his natural attack. Each tail attachment provides just enough weight, balance, and striking power to increase the damage of his tail slap. It takes a full-round action to slip on a kobold tail attachment, and the kobold gains a +4 bonus against disarm attempts made to remove his tail attachment. While a kobold is wearing a kobold tail attachment, the attack deals the tail attachment damage, and some attachments gain a special feature. Tail attachments are light weapons and can be improved by feats that can improve weapon attacks (such as Weapon Focus and Weapon Specialization). All kobold tail attachments make up a kobold tail attachment weapon group that can be improved by the fighter's weapon training class ability. Tail attachments can be constructed of special material and made into masterwork or magic items. There are five types of common tail attachments. Long Lash : This slender cord has tiny bits of glass and stone embedded in its length. Pounder : This squat ball is made from some sort of dull metal. Razored : This metal wedge has a prickly edge on one of its sides. Spiked : This narrow spike tapers to a sharp point. Sweeper : When properly used, this sharply curved piece of metal can knock opponents off their feet. Unlike most trip weapons, you cannot drop it if you are tripped during your own trip attempt."
    },
    "Kobold tail, spiked": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "",
      "source": "Advanced Race Guide pg. 135 Statistics",
      "cost": "3 gp",
      "weight": "2 lbs.",
      "damage": "1d6 (small), 1d8 (medium);",
      "critical": "x3;",
      "range": ";",
      "type": "P;",
      "category": "Light;",
      "proficiency": "Special Description A kobold with the Tail Terror feat (see below) can slip this device over the tip of his tail to augment his natural attack. Each tail attachment provides just enough weight, balance, and striking power to increase the damage of his tail slap. It takes a full-round action to slip on a kobold tail attachment, and the kobold gains a +4 bonus against disarm attempts made to remove his tail attachment. While a kobold is wearing a kobold tail attachment, the attack deals the tail attachment damage, and some attachments gain a special feature. Tail attachments are light weapons and can be improved by feats that can improve weapon attacks (such as Weapon Focus and Weapon Specialization). All kobold tail attachments make up a kobold tail attachment weapon group that can be improved by the fighter's weapon training class ability. Tail attachments can be constructed of special material and made into masterwork or magic items. There are five types of common tail attachments. Long Lash : This slender cord has tiny bits of glass and stone embedded in its length. Pounder : This squat ball is made from some sort of dull metal. Razored : This metal wedge has a prickly edge on one of its sides. Spiked : This narrow spike tapers to a sharp point. Sweeper : When properly used, this sharply curved piece of metal can knock opponents off their feet. Unlike most trip weapons, you cannot drop it if you are tripped during your own trip attempt."
    },
    "Kobold tail, sweeper": {
      "simple": "",
      "martial": "",
      "exotic": "",
      "ammunition": "",
      "firearms": "",
      "mods": "",
      "siege engines": "",
      "special": "trip",
      "source": "Advanced Race Guide pg. 135 Statistics",
      "cost": "7 gp",
      "weight": "3 lbs.",
      "damage": "1d4 (small), 1d6 (medium);",
      "critical": "x2;",
      "range": ";",
      "type": "B;",
      "category": "Light;",
      "proficiency": "Special Description A kobold with the Tail Terror feat (see below) can slip this device over the tip of his tail to augment his natural attack. Each tail attachment provides just enough weight, balance, and striking power to increase the damage of his tail slap. It takes a full-round action to slip on a kobold tail attachment, and the kobold gains a +4 bonus against disarm attempts made to remove his tail attachment. While a kobold is wearing a kobold tail attachment, the attack deals the tail attachment damage, and some attachments gain a special feature. Tail attachments are light weapons and can be improved by feats that can improve weapon attacks (such as Weapon Focus and Weapon Specialization). All kobold tail attachments make up a kobold tail attachment weapon group that can be improved by the fighter's weapon training class ability. Tail attachments can be constructed of special material and made into masterwork or magic items. There are five types of common tail attachments. Long Lash : This slender cord has tiny bits of glass and stone embedded in its length. Pounder : This squat ball is made from some sort of dull metal. Razored : This metal wedge has a prickly edge on one of its sides. Spiked : This narrow spike tapers to a sharp point. Sweeper : When properly used, this sharply curved piece of metal can knock opponents off their feet. Unlike most trip weapons, you cannot drop it if you are tripped during your own trip attempt."
    }
  }
}