[
  {
    "Aasimar": {
      "Source": "Blood of Angels pg. 31",
      "Monster Entry": "Link",
      "Physical Description": ": Aasimars look mostly human except for some minor physical trait that reveals their unusual heritage. Typical aasimar features include hair that shines like metal, jewel-toned eyes, lustrous skin color, or even glowing, golden halos.",
      "Society": ": Aasimars cannot truly be said to have an independent society of their own. As an offshoot of humanity, they adopt the societal norms around them, though most find themselves drawn to those elements of society that work for the redress of injustice and the assuagement of suffering. This sometimes puts them on the wrong side of the law in more tyrannical societies, but aasimars can be careful and cunning when necessary, able to put on a dissembling guise to divert the attention of oppressors elsewhere. While corrupt aasimars may be loners or may establish secret societies to conceal their involvement in crime, righteous aasimars are often found congregating in numbers as part of good-aligned organizations, especially (though not always) churches and religious orders.",
      "Relations": ": Aasimars are most common and most comfortable in human communities. This is especially true of those whose lineage is more distant and who bear only faint marks of their heavenly ancestry. It is unclear why the touch of the celestial is felt so much more strongly in humanity than other races, though it may be that humanity's inherent adaptability and affinity for change is responsible for the evolution of aasimars as a distinct race. Perhaps the endemic racial traits of other races are too deeply bred, too strongly present, and too resistant to change. Whatever dalliances other races may have had with the denizens of the upper planes, the progeny of such couplings are vanishingly rare and have never bred true.",
      "Alignment and Religion": ": Aasimars are most often of good alignment, though this isn't necessarily universal, and aasimars that have turned their back on righteousness may fall into an unfathomable abyss of depravity. For the most part, however, aasimars favor deities of honor, valor, protection, healing, and refuge, or simple and prosaic faiths of home, community, and family. Some also follow the paths of art, music, and lore, finding truth and wisdom in beauty and learning.",
      "Adventurers": ": Aasimars frequently become adventurers, as they often do not quite feel at home in human society and feel the pull of some greater destiny. Clerics, oracles, and paladins are most plentiful in their ranks, though bards, sorcerers, and summoners are not uncommon among those with a fondness for arcane magic. Aasimar barbarians are rare, but when born into such tribes they often rise to leadership and encourage their clans to embrace celestial totems.",
      "Male Names": ": Aritian, Beltin, Cernan, Cronwier, Eran, Ilamin, Maudril, Okrin, Parant, Tural, Wyran, Zaigan.",
      "Female Names": ": Arken, Arsinoe, Davina, Drinma, Imesah, Masozi, Nijena, Niramour, Ondrea, Rhialla, Valtyra.",
      "+2 Wisdom, +2 Charisma": ": Aasimars are insightful, confident, and personable. Aasimars of specific bloodlines (see below) gain different ability score modifiers as indicated.",
      "Native Outsider": ": Aasimars are outsiders with the native subtype.",
      "Medium": ": Aasimars are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Aasimars have a base speed of 30 feet.",
      "Darkvision": ": Aasimars can see in the dark up to 60 feet.",
      "Skilled": ": Aasimars have a +2 racial bonus on Diplomacy and Perception checks. Aasimars of specific bloodlines (see below) gain a +2 bonus on different skill checks as indicated.",
      "Spell-Like Ability": ": Aasimars can useonce per day as a spell-like ability (with a caster level equal to the aasimar's character level). Aasimars of specific bloodlines (see below) gain other spell-like abilities in place of",
      "Celestial Resistance": ": Aasimars have acid resistance 5, cold resistance 5, and electricity resistance 5.",
      "Languages": ": Aasimars begin play speaking Common and Celestial. Aasimars with high Intelligence scores can choose from the following languages: Draconic, Dwarven, Elven, Gnome, Halfling, and Sylvan.Blood of Angels pg. 21",
      "Ancestry": "Peri",
      "Typical Alignment": "NG",
      "Ability Modifiers": "+2 Int, +2 Cha",
      "Alternate Skill Modifiers": "Knowledge (planes), Spellcraft",
      "Alternate Spell-Like Ability": "Emberkin gainas a spell-like ability.",
      "Bard": ": Choose one bardic performance; treat the bard as +1/6 level higher when determining the effects of that performance.",
      "Cavalier": ": Add +1/4 to the cavalier's bonus on damage against targets of his challenge.",
      "Cleric": ": Add +1/2 to damage when using positive energy against undead or using Alignment Channel to damage evil outsiders.",
      "Inquisitor": ": Add +1/2 on Intimidate, Knowledge, and Sense Motive checks made against outsiders.",
      "Oracle": ": Add +1/6 to the oracle's level for the purpose of determining the effects of one revelation.",
      "Paladin": ": Add +1/6 to the morale bonus on saving throws provided by the paladin's auras.",
      "Sorcerer": ": Add +1/4 to the sorcerer's caster level when casting spells with the good descriptor.",
      "Summoner": ": Add DR 1/evil to the summoner's eidolon. Each additional time the summoner selects this benefit, the DR/evil increases by +1/2 (maximum DR 10/evil).Blood of Angels pg. 31",
      "Subraces": {
        "Non-Human Aasimars": [
          "It should be noted that while any creature that breeds with a celestial may give birth to half-celestial offspring, only humanoids can give birth to aasimars. Thus, while it’s possible to encounter a half-celestial dragon, unicorn, or griffon, any children of such creatures would be either half-celestials or normal members of their race. (And just as often, these less conventional half-celestials are sterile.) When discussing half-celestials and aasimars, it’s important to distinguish them from both true celestials (angels, azatas, agathions, etc.) and simple celestial creatures (creatures with the celestial template, which are themselves denizens of the good-aligned Outer Planes but similar in many ways to their Material Plane counterparts). Most aasimars also have a difficult time getting people to grasp distinctions between celestial types, with common folk erroneously grouping all such beings together as “angels.”Non-human aasimars have the same statistics as human aasimars with the exception of size. Thus a halfling aasimar is Small but otherwise possesses the same statistics and abilities as a human aasimar—the difference is purely cosmetic. Non-human aasimars do not possess any of the racial abilities of their base race. However, they are usually raised in the same cultural context as other members of their base race, and thus generally adopt the same fighting style as their peers, use the same types of weapons and armor, and study the same skills."
        ],
        "Agathion-Blooded (Idyllkin)": [
          "Idyllkin possess bestial aspects and calm dispositions, and often act as peaceful intermediaries between lawful and chaotic agents of good.AgathionNG+2 Con, +2 ChaHandle Animal, SurvivalIdyllkin gainas a spell-like ability."
        ],
        "Angel-Blooded (Angelkin)": [
          "Angelkin are mortal paragons of exceptional beauty, and they serve as exemplars of good and light regardless of the myriad forms they may take.AngelAny good+2 Str, +2 ChaHeal, Knowledge (planes)Angelkin gainas a spell-like ability."
        ],
        "Archon-Blooded (Lawbringers)": [
          "Lawbringers are champions of justice and of doling out punishment to the wicked, and often believe chaos is the cause of all mortal suffering.ArchonLG+2 Con, +2 WisIntimidate, Sense MotiveLawbringers gainas a spell-like ability."
        ],
        "Azata-Blooded (Musetouched)": [
          "The musetouched epitomize freedom and joy, and travel the world to liberate less fortunate individuals.AzataCG+2 Dex, +2 ChaDiplomacy, PerformMusetouched gainas a spell-like ability."
        ],
        "Garuda-Blooded (Plumekith)": [
          "Their shimmering avian features make plumekith instantly recognizable. Though they can act rashly, plumekith never shirk their duty after making a commitment.GarudaCG+2 Dex, +2 WisAcrobatics, FlyPlumekith gain seeas a spell-like ability."
        ],
        "Peri-Blooded (Emberkin)": [
          "Masters of fire magic, emberkin feel the dual pull of their peri forebear as well as that of a fallen angel further down their ancestry, and wrestle with their urges to do both good and evil.PeriNG+2 Int, +2 ChaKnowledge (planes), SpellcraftEmberkin gainas a spell-like ability."
        ]
      }
    }
  },

  {
    "Catfolk": {
      "Source": "Advanced Race Guide pg. 91",
      "Monster Entry": "Link",
      "Physical Description": ": In general, catfolk are lithe and slender, standing midway between dwarves and humans in stature. While clearly humanoid, they possess many feline features, including a coat of soft fine fur, slit pupils, and a sleek, slender tail. Their ears are pointed, but unlike those of elves, are more rounded and catlike. They manipulate objects as easily as any other humanoid, but their fingers terminate in small, sharp, retractable claws. These claws are typically not powerful enough to be used as weapons, but some members of the species—either by quirk of birth or from years of honing—can use them with deadly effect. Feline whiskers are not uncommon, but not universal, and hair and eye color vary greatly.",
      "Society": ": While self-expression is an important aspect of catfolk culture, it is mitigated by a strong sense of community and group effort. In the wild, catfolk are a hunter-gatherer tribal people. The pursuit of personal power never comes before the health and wellbeing of the tribe. More than one race has underestimated this seemingly gentle people only to discover much too late that their cohesion also provides them great strength.",
      "Relations": ": Adaptable and curious, catfolk get along with almost any race that extends reciprocal goodwill. They acclimate easily to halflings, humans, and especially elves. Catfolk and elves share a passionate nature, as well as a love of music, dance, and storytelling; elven communities often gently mentor catfolk tribes, though such elves are careful not to act in a patronizing manner toward their feline friends. Gnomes make natural companions for catfolk, as catfolk enjoy gnomes' strange and obsessive qualities. Catfolk are tolerant of kobolds as long as the reptilian beings respect the catfolk's boundaries. The feral nature of orcs stirs as much puzzlement as it does revulsion among catfolk, as they don't understand orcs' savagery and propensity for self-destruction. Half-Orcs, on the other hand, intrigue catfolk, especially those Half-Orcs who strive to excel beyond the deleterious and hateful nature of their savage kin. Catfolk often view goblins and ratfolk as vermin, as they disdain the swarming and pernicious tendencies of those races.",
      "Alignment and Religion": ": With community and unselfish cooperation at the center of their culture, as well as a good-natured curiosity and willingness to adapt to the customs of many other races, most catfolk tend toward good alignments. The clear majority of catfolk are also chaotic, as wisdom is not their strongest virtue; nevertheless, there are exceptions with cause.",
      "Adventurers": ": Natural born trackers, the hunter-gatherer aspect of their tribes pushes many catfolk toward occupations as rangers and druids by default, but such roles don't always speak to their love of performance art, be it song, dance, or storytelling. Catfolk legends also speak of a rich tradition of great sorcerer heroes. Those catfolk who internalize their wanderlust often become wizards and monks, with many of those monks taking the path of the nimble guardian. While catfolk cavaliers and inquisitors are rare (steadfast dedication to a cause is often alien to the catfolk mindset) individuals who choose these paths are never looked down upon. Catfolk understand that exploration and self-knowledge can lead down many roads, and are accepting of nearly all professions and ways of life.",
      "Male Names": ": Carruth, Drewan, Ferus, Gerran, Nyktan, Rouqar, Zithembe.",
      "Female Names": ": Alyara, Duline, Hoya, Jilyana, Milah, Miniri, Siphelele, Tiyeri.: Catfolk are sociable and agile, but often lack common sense.",
      "+2 Dexterity, +2 Charisma, –2 Wisdom": ": Catfolk are sociable and agile, but often lack common sense.",
      "Catfolk": ": Catfolk are humanoids with the catfolk subtype.",
      "Medium": ": Add 1/3 to the result of any spirit surge die that the medium rolls.",
      "Normal Speed": ": Catfolk have a base speed of 30 feet.",
      "Low-Light Vision": ": In dim light, catfolk can see twice as far as humans.",
      "Cat's Luck": ": Once per day when a catfolk attempts a Reflex saving throw, he can roll the saving throw twice and take the better result. He must decide to use this ability before the saving throw is attempted.",
      "Natural Hunter": ": Catfolk receive a +2 racial bonus on Perception, Stealth, and Survival checks.",
      "Sprinter": ": Catfolk gain a 10-foot racial bonus to their speed when using the charge, run, or withdraw actions.",
      "Languages": ": Catfolk begin play speaking Common and Catfolk. Catfolk with high Intelligence scores can choose from the following languages: Elven, Gnoll, Gnome, Goblin, Halfling, Orc, and Sylvan.",
      "Alchemist": ": Gain 1/6 of a bonus discovery.",
      "Bard": ": Add +1/2 to the bard's bardic knowledge bonus.",
      "Bloodrager": ": Add 1 foot to the bloodrager's base speed. In combat, this has an effect only for every five increases in base speed. This bonus stacks with the bloodrager's fast movement class feature, and applies under the same conditions as that feature.",
      "Cavalier": ": Add +1/4 to the cavalier's banner bonus.",
      "Druid": ": Add +1 hit points to the druid's animal companion. If the druid ever replaces her animal companion, the new animal companion gains these bonus hit points.",
      "Hunter": ": Gain 1/6 of a bonus teamwork feat.",
      "Inquisitor": ": Add 1/2 to the inquisitor's track bonus.",
      "Investigator": ": Add 1 to the bonus provided to a single skill (maximum +2) by inspiration. This skill must be one the investigator can already apply inspiration to. The investigator can select a different skill each level.",
      "Monk": ": Add 1/2 to the monk's damage rolls with claw attacks and claw blades. A monk who selects this bonus at 1st level also treats claw bladesas a monk weapon. If he is an unchained monk, he can use his style strikes with unarmed strike or claw blade attacks.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast.",
      "Ranger": ": Choose a weapon from the following list: claws, kukri, longbow, longsword, short spear, or shortbow. Add +1/2 on critical hit confirmation rolls made while using that weapon (maximum bonus of +4). This bonus does not stack with Critical Focus.",
      "Rogue": ": Add a +1/2 bonus on Bluff checks to feint and Sleight of Hands checks to pickpocket.",
      "Shaman": ": Add 1/6 to the shaman's class level for the purpose of determining the effects of one hex.",
      "Shifter": ": Add 1/5 to the damage dealt when using the shifter claws ability.",
      "Slayer": ": Add 1/3 to the result of any sneak attack damage that the slayer deals after all sneak attack damage dice have been totaled.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds + 1/2 to the number of uses per day of that bloodline power."
    }
  },

  {
    "Dhampir": {
      "Source": "Inner Sea Races pg. 215",
      "Monster Entry": "Link",
      "Physical Description": ": Tall and slender and with well-defined musculature, dhampirs look like statuesque humans of unearthly beauty. Their hair, eye, and skin colors resemble unnerving versions of their mothers'; many possess a ghastly pallor, particularly in the sunlight, while those with dark complexions often possess skin the color of a bruise.",
      "Society": ": Dhampirs have no culture of their own, nor do they have any known lands or even communities. Often born in secret and abandoned at orphanages or left to die on the outskirts of town, they tend to live solitary lives as exiles and outcasts. Individuals acquire the cultural beliefs and teachings of the regions in which they grew up, and adopt additional philosophies over the course of their complex lives. This ability to adapt to a verity of circumstances provides dhampirs with a social camouflage that hides them from both predators and prey.",
      "Relations": ": As dhampirs are scions of evil, few races view them favorably. They share an affinity for those half-breeds whose sinister ancestry also sets them apart from human society, particularly tieflings and Half-Orcs. Humans view them with a combination of fear and pity, though such feelings often devolve into hatred and violence. Other humanoid races, such as dwarves, elves, and halflings, simply shun them. Similarly, dhampirs bear a deep-seeded loathing for living creatures, their hatred planted by jealousy and fed by frustration.",
      "Alignment and Religion": ": Most dhampirs succumb to the evil within their blood. They are unnatural creatures, and the foul influence of their undead heritage makes an evil outlook difficult to overcome. Those who struggle against their wicked natures rarely progress beyond a neutral outlook.",
      "Adventurers": ": The life of an adventurer comes naturally to most dhampirs, since constant persecution condemns many to spend their days wandering. Evil dhampirs keep moving to maintain their secrecy and evade lynch mobs, while those who follow the path of vengeance venture forth in search of their despised fathers. Regardless of their reasons, most dhampirs simply feel more at home on the road than in a settlement. Having little formal training, a great many of these journeyers become fighters and rogues.",
      "Names": ": Lacking a culture and unified traditions, dhampirs share humans' predilection for a diversity of names, and most keep their human birth names. Many dhampirs take their mother's surname, while others take the surname of the towns or regions in which they were born, or use a surname derived from a significant event.: Dhampirs are fast and seductive, but their mortal vigor is impeded. Dhampirs of specific heritages (see below) gain different ability score modifiers as indicated.",
      "+2 Dexterity, +2 Charisma, –2 Constitution": ": Dhampirs are fast and seductive, but their mortal vigor is impeded. Dhampirs of specific heritages (see below) gain different ability score modifiers as indicated.",
      "Dhampir": ": Dhampirs are humanoids with the dhampir subtype.",
      "Medium": ": Dhampirs are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Dhampirs have a base speed of 30 feet.",
      "Senses": ": Dhampirs get low-light vision and darkvision with a range of 60 feet.",
      "Manipulative": ": Dhampirs gain a +2 racial bonus on Bluff and Perception checks. Dhampirs of specific heritages (see below) gain a +2 bonus on different skill checks as indicated.",
      "Undead Resistance": ": Dhampirs gain a +2 racial bonus on saving throws against disease and mind-affecting effects.",
      "Light Sensitivity": ": Dhampirs are dazzled in areas of bright sunlight or within the radius of aspell. Dhampirs of specific heritages (see below) gain different weaknesses.",
      "Negative Energy Affinity": ": Though they're living creatures, dhampirs react to positive and negative energy as if they were undead; positive energy harms them, and negative energy heals them.",
      "Spell-Like Ability": ": A dhampir can usethree times per day as a spell-like ability (with a caster level equal to the dhampir's character level). Dhampirs of specific heritages (see below) gain other spell-like abilities in place of",
      "Resist Level Drain": ": A dhampir takes no penalties from energy drain effects, though he can still be killed if he accrues more negative levels then he has Hit Dice. After 24 hours, any negative levels a dhampir takes are removed without the need for an additional saving throw.",
      "Languages": ": Dhampirs begin play speaking Common. Dhampirs with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic).Inner Sea Races pg. 241,Blood of the Night pg. 20",
      "Alternate Ability Modifiers": ": +2 Dexterity, +2 Intelligence, –2 Wisdom.",
      "Alternate Skill Modifiers": ": Escape Artist, Use Magic Device.",
      "Alternate Spell-Like Ability": ":Comprehend languages",
      "Alternate Weakness": ": Ajibachanas take a –1 penalty to their caster levels when they're in an area affected byconsecrate,hallow, or a similar spell that makes an area holy.",
      "Alchemist": ": Add +10 minutes to the duration of the alchemist's mutagens.",
      "Cleric": ": Add +1 to the caster level of any channeling feat used to affect undead.",
      "Fighter": ": Add a +2 bonus on rolls to stabilize when dying.",
      "Inquisitor": ": Add a +1/2 bonus on Intimidate checks to demoralize humanoids.",
      "Oracle": ": Add +1/2 point of negative energy damage to spells that deal negative energy damage.",
      "Rogue": ": Add a +1/2 bonus on Stealth checks and Perception checks made in dim light or darkness.",
      "Shifter": ": Add a +1 bonus on wild empathy checks to improve the attitude of bats, rats, and wolves.",
      "Wizard": ": Add +1/4 to the wizard's caster level when casting spells of the necromancy school.",
      "Subraces": {
        "Jiang-Shi-Born (Ru-Shi)": [
          "The ru-shi are dhampirs who descend from the jiang-shi of Tian Xia. They generally lack any interest in physical contact, and their movements are stiff and awkward.: +2 Strength, +2 Intelligence, –2 Dexterity.: Acrobatics, Knowledge (engineering).:.: Ru-shi take a –1 penalty on saves against sonic effects and spells."
        ],
        "Moroi-Born (Svetocher)": [
          "These dhampirs are blessed with unnatural grace, beauty, and charm, and they often feel most at home among a region's aristocracy.: +2 Strength, +2 Charisma, –2 Constitution.: Diplomacy, Knowledge (nobility).:.: Svetochers take a –1 penalty on saves against effects that deal positive energy damage."
        ],
        "Nosferatu-Born (Ancient-Born)": [
          "Many of the ancient-born dhampirs possess a deep hatred for humanity—a hatred most humans return in kind.: +2 Strength, +2 Wisdom, –2 Constitution.: Climb, Survival.:.: Ancient-born take a –1 penalty on saves against effects that damage, drain, or reduce physical ability scores."
        ],
        "Vetala-Born (Ajibachana)": [
          "These dhampirs are more often the result of magical experiments than mating.: +2 Dexterity, +2 Intelligence, –2 Wisdom.: Escape Artist, Use Magic Device.:.: Ajibachanas take a –1 penalty to their caster levels when they're in an area affected by,, or a similar spell that makes an area holy."
        ]
      }
    }
  },
  {
    "Drow": {
      "Source": "Blood of Shadows pg. 5",
      "Monster Entry": "Link",
      "Physical Description": ": Drow are similar in stature to humans, but share the slender build and features of elves, including the distinctive long, pointed ears. Their eyes lack pupils and are usually solid white or red. Drow skin ranges from coal black to a dusky purple. Their hair is typically white or silver, though some variation is not unknown.",
      "Society": ": Drow society is traditionally class-oriented and matriarchal. Male drow usually fulfill martial roles, defending the species from external threats, while female drow assume positions of leadership and authority. Reinforcing these gender roles, one in 20 drow are born with exceptional abilities and thus considered to be nobility, and the majority of these special drow are female. Noble houses define drow politics, with each house governed by a noble matriarch and composed of lesser families, business enterprises, and military companies. Each house is also associated with a demon lord patron. Drow are strongly driven by individual self-interest and advancement, which shapes their culture with seething intrigue and politics, as common drow jockey for favor of the nobility, and the nobility rise in power through a combination of assassination, seduction, and treachery.",
      "Relations": ": Drow have a strong sense of racial superiority and divide non-drow into two groups: slaves, and those that are not yet slaves. In practice, however, races that may share similar inclinations (such as hobgoblins and orcs) and those who serve willingly may be treated as servitor races and granted a measure of trust and modest rank in drow society. Others, such as dwarves, gnomes, and halflings, are deemed fit only for the lash. Manipulative drow delight in exploiting the weak character of humans. While they claim no kinship with fetchlings, the drow harbor a curiosity toward the shadow race, as both are adaptations of races exposed to extreme and dangerous conditions. Finally, the drow's hatred of elves sets these beings apart from all other races, and the dark elves desire nothing more than to ruin everything about their surface cousins.",
      "Alignment and Religion": ": Drow place a premium on power and survival, and are unapologetic about any vile choices they might make to ensure their survival. After all, they do not just survive adversity—they conquer it. They have no use for compassion, and are unforgiving of their enemies, both ancient and contemporary. Drow retain the elven traits of strong emotion and passion, but channel it through negative outlets, such as hatred, vengeance, lust for power, and raw carnal sensation. Consequently, most drow are chaotic evil.",
      "Adventurers": ": Conquerors and slavers, drow are driven to expand their territory, and many seek to settle ancient grudges upon elven and dwarven nations in ruinous and dreary sites of contested power on the surface. Male drow favor martial or stealth classes that put them close to their enemies and their homes, as either soldiers or spies. Female drow typically assume classes that lend themselves to leadership, such as bards and especially clerics. Both genders have an innate talent for the arcane arts, and may be wizards or summoners. Drow make natural antipaladins, but males are often discouraged from this path, as the feminine nobility feel discomforted by the idea of strong-willed males with autonomous instincts and a direct relationship with a demon lord.",
      "Male Names": ": Arcavato, Drovic, Firyin, Kaelmourn, Mirrendier, Pharnox, Syrendross, Zov.",
      "Female Names": ": Belmarniss, Cylellinth, Ilvaria, Johysis, Loscivia, Tyvorhan, Ulumbralya, Volundeil.: Drow are nimble and manipulative.",
      "+2 Dexterity, +2 Charisma, –2 Constitution": ": Drow are nimble and manipulative.",
      "Elf": ": Drow are humanoids with the elf subtype.",
      "Medium": ": Drow are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Drow have a base speed of 30 feet.",
      "Darkvision": ": Drow can see in the dark up to 120 feet.",
      "Drow Immunities": ": Drow are immune to magic sleep effects and gain a +2 racial bonus on saving throws against enchantment spells and effects.",
      "Keen Senses": ": Drow gain a +2 racial bonus on Perception checks.",
      "Poison Use": ": Drow are skilled in the use of poison and never risk accidentally poisoning themselves.",
      "Spell Resistance": ": A drow possesses an amount of spell resistance equal to 6 + her character level.",
      "Spell-Like Abilities": ": A drow can cast,, and, each once per day, using her total character level as her caster level.",
      "Light Blindness": ": Abrupt exposure to bright light blinds drow for 1 round; on subsequent rounds, they are dazzled as long as they remain in the affected area.",
      "Weapon Familiarity": ": Drow are proficient with the hand crossbow, rapier, and short sword.",
      "Languages": ": Drow begin play speaking Elven and Undercommon. Drow with high Intelligence scores can choose from the following: Abyssal, Aklo, Aquan, Common, Draconic, Gnome, Goblin, and Sakvroth.",
      "Alchemist": ": Add +10 minutes to the duration of the alchemist's mutagens.",
      "Antipaladin": ": The antipaladin adds +1/4 to the number of cruelties he can inflict.",
      "Bard": ": Add +1/2 to Bluff and Disguise checks to appear as an elf or Half-Elf.",
      "Bloodrager": ": Add a +1/2 bonus to concentration checks to cast or maintain spells when taking damage.",
      "Cleric": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the cleric's Wisdom modifier. The cleric adds +1/2 to the number of uses per day of that domain power.",
      "Druid": ": Add a +1 bonus to wild empathy checks to influence animals and magical beasts that live underground.",
      "Fighter": ": Choose the disarm or reposition combat maneuver. Add +1/3 to the fighter's CMB when attempting this maneuver (maximum bonus of +4).",
      "Inquisitor": ": Gain 1/4 of a teamwork feat.",
      "Paladin": ": Add a +1/2 sacred bonus to saving throws against spells of the shadow subschool or that have the darkness or shadowdescriptor.",
      "Psychic": ": Gain 1/6 of a phrenic amplification (or a major amplification if the psychic is at least 11th level).",
      "Ranger": ": Add +1/3 to initiative checks in one of the ranger's favored terrains.",
      "Rogue": ": Add a +1/2 bonus on Bluff checks to feint and pass secret messages.",
      "Shifter": ": Add a +1/2 bonus on Climb checks.",
      "Sorcerer": ": Add one spell known from the sorcerer spell list. This spell must have the curse, evil, or pain descriptor, and be at least one level below the highest spell level the sorcerer can cast.",
      "Summoner": ": Add 1 hit point or 1 skill rank to the summoner's eidolon.",
      "Warpriest": ": Add 1/2 point to the amount of damage dealt or healed by the warpriest's fervor ability.",
      "Wizard": ": Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power."
    }
  },

  {
    "Duergar": {
      "Source": "Advanced Race Guide pg. 186",
      "Monster Entry": "Link",
      "+2 Constitution, +2 Wisdom, –4 Charisma": ": Duergar are hearty and observant, but also belligerent.",
      "Medium": ": Duergar are Medium creatures and have no bonuses or penalties due to their size.",
      "Dwarf": ": Duergar are humanoids with the dwarf subtype.",
      "Slow and Steady": ": Duergar have a base speed of 20 feet, but their speed is never modified by armor or encumbrance.",
      "Superior Darkvision": ": Duergar can see in the dark up to 120 feet.",
      "Duergar Immunities": ": Duergar are immune to paralysis, phantasms, and poison. They gain a +2 racial bonus on saves against spells and spell-like abilities.",
      "Stability": ": Duergar receive a +4 racial bonus to their Combat Maneuver Defense against bull rush or trip attempts while standing on the ground.",
      "Spell-Like Abilities": ": A duergar can useandeach once per day, using her character level as her caster level and affecting itself only.",
      "Light Sensitivity": ": Duergar are dazzled in areas of bright light.",
      "Languages": ": Duergar begin play speaking Common, Dwarven, and Undercommon. Duergar with high Intelligence scores can choose from the following languages: Aklo, Draconic, Giant, Goblin, Orc, and Terran.",
      "Cleric": ": Add a +1/2 bonus on checks made to craft magic items.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a bull rush or trip attempt.",
      "Inquisitor": ": Add +1/6 to the number of times per day the inquisitor can use the judgment class feature.",
      "Kineticist": ": Add 1/5 of an Extra Wild Talent feat that must be spent on an earth element wild talent.",
      "Psychic": ": The psychic treats her Wisdom bonus as 1/3 point higher for the purpose of determining the number of uses or rounds per day of her discipline powers."
    }
  },

  {
    "Fetchling": {
      "Source": "Agents of Evil pg. 24",
      "Monster Entry": "Link",
      "Physical Description": ": Superficially, fetchlings resemble unnaturally lithe—bordering on fragile—humans. Their adopted home has drained their skin and hair of bright colors. Their complexion ranges from stark white to deep black, and includes all the various shades of gray between those two extremes. Their eyes are pupilless and pronounced, and they typically glow a luminescent shade of yellow or greenish yellow, though rare individuals possess blue-green eyes. While their hair tends to be stark white or pale gray, many fetchlings dye their hair black. Some members of higher station or those who dwell on the Material Plane dye their hair with more striking colors, often favoring deep shades of violet, blue, and crimson.",
      "Society": ": Fetchling are adaptable creatures, and as such display no singular preference for moral philosophy or the rule of law. Most mimic the cultural norms and governmental structures of those they live near or the creatures they serve. While fetchlings are arguably the most populous race on the Shadow Plane, they rarely rule over their own kind; most serve as vassals or subjects to the great umbral dragons of their homeland, or the bizarre nihiloi who dwell in the deeper darkness. Above all, fetchlings are survivors. Their tenacity, versatility, and devious pragmatism have helped them survive the harsh environs of the Shadow Plane and plots of the powerful creatures dwelling within it. On the Material Plane, especially if unable to return to their home plane at will, fetchlings tend to cluster in small, insular communities of their own kind, mimicking the cultural norms and political structures of those they trade with.",
      "Relations": ": Because of their shared ancestry, fetchlings interact most easily with humans, though they also find kinship with gnomes and other races that were cut off from their home planes or are not native to the Material Plane. Their pragmatism and adaptable nature put them at odds with warlike or destructive races, and when they do have to deal with orcs, goblinoids, or other savage cultures, fetchlings will often play the part of the fawning sycophant, a tactic learned from serving umbral dragons and one they see as key to their race's survival. Strangely, their relationship with dwarves and elves are rather strained. Dwarves find fetchlings duplicitous and creepy, while the tension with elves is so subtle and inexplicable that both races find it difficult to explain.",
      "Alignment and Religion": ": Fetchlings—especially those living outside the Shadow Plane—worship a wide variety of gods. A smaller number of evil fetchlings worship demon lords of darkness and lust.",
      "Adventurers": ": The Shadow Plane's ever-present hazards pose great danger to fetchling adventurers, but also great opportunity. Because of their servile status on their home plane, however, most fetchlings prefer to adventure on the Material Plane, which often offers more freedom and trading opportunities between the two planes. Fetchlings make excellent ninjas, oracles, rangers, rogues, and summoners.",
      "Male Names": ": Arim, Drosil, Jegan, Somar, Yetar, Zoka.",
      "Female Names": ": Acera, Amelisce, Inva, Renza, Zaitherin.: Fetchlings are quick and forceful, but often strange and easily distracted by errant thoughts.",
      "+2 Dexterity, +2 Charisma, –2 Wisdom": ": Fetchlings are quick and forceful, but often strange and easily distracted by errant thoughts.",
      "Native Outsider": ": Fetchlings are outsiders with the native subtype.",
      "Medium": ": Fetchlings are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Fetchlings have a base speed of 30 feet.",
      "Darkvision": ": Fetchlings can see in the dark up to 60 feet.",
      "Low-Light Vision": ": Fetchlings can see twice as far as humans in conditions of dim light.",
      "Skilled": ": Fetchlings have a +2 racial bonus on Knowledge (planes) and Stealth checks.",
      "Shadow Blending": ": Attacks against a fetchling in dim light have a 50% miss chance instead of the normal 20% miss chance. This ability does not grant total concealment; it just increases the miss chance.",
      "Shadowy Resistance": ": Fetchlings have cold resistance 5 and electricity resistance 5.",
      "Spell-Like Abilities": ": A fetchling can useonce per day as a spell-like ability. He can assume the form of any humanoid creature using this spell-like ability. When a fetchling reaches character 9th level in any combination of classes, he gains(self only) as a spell-like ability usable once per day, and at 13th level, he gains(self only, to the Shadow Plane or the Material Plane only) usable once per day. A fetchling's caster level for these abilities is equal to his character level.",
      "Languages": ": Fetchlings begin play speaking Common. Fetchlings with a high Intelligence scores can choose from the following languages: Aklo, Aquan, Auran, Draconic, D'ziriak (understanding only, cannot speak), Ignan, Terran, and any regional human tongue.",
      "Alchemist": ": Add +1 to Craft (alchemy) checks to craft poison and +1/4 to the DCs of poisons the alchemist creates.",
      "Arcanist": ": When the arcanist casts an illusion (shadow) spell that deals a percentage of its damage or effect against nonbelievers, increase this amount by 2% (to a maximum of 100%).",
      "Barbarian": ": Add +1 to either cold or electricity resistance while raging (maximum resistance 15 for either type).",
      "Bard": ": Add a +1 bonus on Disguise checks when using",
      "Cleric": ": Add 1/2 point to negative energy damage dealt by channeling energy andspells.",
      "Druid": ": The druid's animal companion gains resistance 1 against either cold or electricity. Each time the druid selects this reward, he increases his animal companion's resistance to one of those energy types by 1 (maximum 10 for any one energy type). If the druid ever replaces his animal companion, the new animal companion gains these resistances.",
      "Fighter": ": Choose a slashing melee weapon. Add +1/2 to critical hit confirmation rolls made while using that weapon (maximum bonus of +4). This bonus does not stack with Critical Focus.",
      "Gunslinger": ": Add 1/4 point to the gunslinger's grit.",
      "Hunter": ": The hunter's animal companion gains DR 1/magic. Each additional time the hunter selects this benefit, the DR increases by +1/2 (maximum DR 10/magic). If the hunter ever replaces his animal companion, the new animal companion gains this DR.",
      "Inquisitor": ": Add a +1 bonus on Knowledge (planes) checks made to identify creatures.",
      "Magus": ": Add 1/4 point to the magus's arcane pool.",
      "Monk": ": Add a +1/2 bonus on Escape Artist and Stealth checks attempted while in dim light or darkness.",
      "Oracle": ": Treat the oracle's level as +1/3 higher for the purposes of determining which of its racial spell-like abilities it can use.",
      "Paladin": ": Add +1/4 to the morale bonus the paladin grants on allies' saving throws against fear effects.",
      "Ranger": ": Add a +1/2 bonus on Perception and Survival checks made on the Plane of Shadow.",
      "Rogue": ": Add a +1/2 bonus on Stealth and Sleight of Hand checks made while in dim light or darkness.",
      "Slayer": ": Add a +1/4 dodge bonus to Armor Class against the slayer's studied target.",
      "Sorcerer": ": Add +1/2 to either cold or electricity resistance (maximum resistance 10 for either type).",
      "Summoner": ": The summoner's eidolon gains resistance 1 against either cold or electricity. Each time the summoner selects this reward, he increases his eidolon's resistance to one of those energy types by 1 (maximum 10 for any one energy type).",
      "Wizard": ": Add one spell from the wizard spell list to wizard's spellbook. The spell must be at or below the highest level he can cast and be of the illusion (shadow) subschool or have the darkness descriptor."
    }
  },


  {
    "Goblin": {
      "Source": "Advanced Race Guide pg. 115",
      "Monster Entry": "Link",
      "Physical Description": ": Goblins are short, ugly humanoids that stand just over 3 feet tall. Their scrawny bodies are topped with oversized and usually hairless heads with massive ears and beady red or occasionally yellow eyes. Goblins' skin tone varies based on the surrounding environment; common skin tones include green, gray, and blue, though black and even pale white goblins have been sighted. Their voracious appetites are served well by their huge mouths filled with jagged teeth.",
      "Society": ": Violent but fecund, goblins exist in primitive tribal structures with constant shifts in power. Rarely able to sustain their own needs through farming or hunting and gathering, goblin tribes live where food is abundant or near places that they can steal it from. Since they are incapable of building significant fortifications and have been driven out of most easily accessible locations, goblins tend to live in unpleasant and remote locations, and their poor building and planning skills ensure that they dwell primarily in crude caves, ramshackle villages, and abandoned structures. Few goblins are good with tools or skilled at farming, and the rare items of any value that they possess are usually cast-off implements from humans or other civilized cultures.",
      "Relations": ": Goblins tend to view other beings as sources of food, which makes for poor relations with most civilized races. Goblins often survive on the fringes of human civilization, preying on weak or lost travelers and occasionally raiding small settlements to fuel their voracious appetites. They have a special animosity toward gnomes, and celebrate the capturing or killing of such victims with a feast. Of the most common races, Half-Orcs are the most tolerant of goblins, sharing a similar ancestry and experiencing the same hatred within many societies. Goblins are mostly unaware of Half-Orcs' sympathy, however, and avoid them because they are larger, meaner, and less flavorful than other humanoids.",
      "Alignment and Religion": ": Goblins are greedy, capricious, and destructive by nature, and thus most are neutral or chaotic evil.",
      "Adventurers": ": Goblin adventurers are usually curious and inclined to explore the world, though they are often killed off by their own foolish misdeeds or hunted down for their random acts of destruction. Their pernicious nature makes interacting with civilized races almost impossible, so goblins tend to adventure on the fringes of civilization or in the wilds. Adventurous individuals who survive long enough often ride goblin dogs or other exotic mounts, and focus on archery to avoid close confrontation with larger enemies. Goblin spellcasters prefer fire magic and bombs over almost all other methods of spreading mayhem.",
      "Male Names": ": Boorgub, Gogmurch, Rotfoot, Zobmaggle.",
      "Female Names": ": Geedra, Goomluga, Hoglob, Luckums.: Goblins are fast but weak, and they're unpleasant to be around.",
      "+4 Dexterity, –2 Strength, –2 Charisma": ": Goblins are fast but weak, and they're unpleasant to be around.",
      "Goblinoid": ": Goblins are humanoids with the goblinoid subtype.",
      "Small": ": Goblins are Small and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Normal Speed": ": Goblins are fast for their size, and have a base speed of 30 feet.",
      "Darkvision": ": Goblins can see in the dark up to 60 feet.",
      "Skilled": ": +4 racial bonus on Ride and Stealth checks.",
      "Languages": ": Goblins begin play speaking Goblin. Goblins with high Intelligence scores can choose from the following languages: Common, Draconic, Dwarven, Gnoll, Gnome, Halfling, and Orc.Monster Codex pg. 104",
      "Alchemist": ": The alchemist gains fire resistance 1. Each time this reward is selected, increase fire resistance by +1. This fire resistance does not stack with fire resistance gained from other sources.",
      "Barbarian": ": Add +1/2 on critical hit confirmation rolls for attacks made with unarmed strikes or natural weapons (maximum bonus of +4). This bonus does not stack with Critical Focus.",
      "Bard": ": Add +1 to the bard's total number of bardic performance rounds per day.",
      "Cavalier": ": Add +1 hit points to the cavalier's mount companion. If the cavalier ever replaces his mount, the new mount gains these bonus hit points.",
      "Druid": ": Add +1 hit points to the druid's animal companion. If the druid ever replaces her animal companion, the new animal companion gains these bonus hit points.",
      "Gunslinger": ": Add +1/3 on critical hit confirmation rolls made with firearms (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Oracle": ": Add +1 on concentration checks made when casting spells with the fire descriptor.",
      "Ranger": ": Gain a +1/2 bonus on damage dealt to dogs (and doglike creatures) and horses (and horselike creatures).",
      "Rogue": ": Add a +1 bonus on the rogue's sneak attack damage rolls during the surprise round or before the target has acted in combat.",
      "Sorcerer": ": Add +1 spell known from the sorcerer spell list. This spell must be at least one level below the highest spell level the sorcerer can cast, and must have the fire descriptor.",
      "Summoner": ": Add +1/4 evolution point to the eidolon's evolution pool. These bonus evolution points must be spent on evolutions that deal fire damage or protect the eidolon from fire (for example, resistance, energy attacks, immunity, breath weapon, and so on).",
      "Witch": ": Add +1 spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells.",
      "Subraces": {
        "Oversized Goblins": [
          "A few goblins attain a much larger size than their kin. No one is exactly sure why they grow to be giants among their kind, but it’s probably due to a combination of luck, diet, and constant access to food. These goblins are monsters among their own kind, not just in height, but also in girth and in strength. If not cast out for eating all of the tribe’s food, oversized goblins often become the bosses of their tribes, and the most powerful of them become chiefs.Oversized goblins are Medium size, and grow to 4 to 5 feet tall. They tend to be particularly obese, weighing between 225 and 275 pounds. Instead of the normal racial ability score modifiers for goblins, oversized goblins gain a +2 bonus to Strength, a +2 bonus to Dexterity, and a –2 penalty to Charisma."
        ]
      }
    }
  },

  {
    "Hobgoblin": {
      "Source": "Advanced Race Guide pg. 121",
      "Monster Entry": "Link",
      "Physical Description": ": Burly and muscled, hobgoblins stand a few inches shorter than the average human, and their long arms, thick torsos, and relatively short legs give them an almost apelike stature. Hobgoblins' skin is a sickly gray-green that darkens to mossy green after long exposure to the sun. Their eyes burn fiery orange or red, and their broad faces and sharply pointed ears give their features a somewhat feline cast. Hobgoblins lack facial hair, and even hobgoblin women are bald. Except for their size, hobgoblins bear a strong physical resemblance to their goblin cousins.",
      "Society": ": Hobgoblins live in militaristic tyrannies, each community under the absolute rule of a hobgoblin general. Every hobgoblin in a settlement receives military training, with those who excel serving in the army and the rest left to serve more menial roles. Those deemed unfit for military service have little social status, barely rating above favored slaves. Despite this, hobgoblin society is egalitarian after a fashion. Gender and birth offer no barrier to advancement, which is determined almost solely by each individual's personal merit. Hobgoblins eschew strong attachments, even to their young. Matings are matters of convenience, and are almost always limited to hobgoblins of equal rank. Any resulting baby is taken from its mother and forcibly weaned after 3 weeks of age. Young mature quickly—most take no more than 6 months to learn to talk and care for themselves. Hobgoblins' childhoods last a scant 14 years, a mirthless span filled with brutal training in the art of war.",
      "Relations": ": Hobgoblins view other races as nothing more than tools—implements to be enslaved, cowed, and put to work. Without slaves, hobgoblin society would collapse, so reliant is it on stolen labor. An injured, sickly, or defiant slave is like a broken tool, useless waste to be tossed out with the day's garbage. Not surprisingly, hobgoblin communities count no other races as their friends, and few as allies. Elves and dwarves earn special enmity, and are devilishly hard to break into proper slavery as both races hold blood feuds against goblinkind. Halflings and Half-Orcs make especially prized slaves—the former for their agile skills and the ease of breaking them to the collar, and the latter for their talent at thriving under the harshest of conditions. Hobgoblins have little love for the rest of goblinkind, though they typically treat goblinoid slaves better than they do other races.",
      "Alignment and Religion": ": Hobgoblin life is nothing if not ordered and hierarchical, and hobgoblins lean strongly toward the lawful alignments. While not innately evil, the callous and brutal training that fills the too-short childhood of hobgoblins leaves most embittered and full of hate. Hobgoblins of good alignment number the fewest, and almost exclusively consist of individuals raised in other cultures. More numerous but still rare are hobgoblins of chaotic bent, most often exiles cast out by the despots of their homelands. Religion, like most non-militaristic pursuits, matters little to the majority of hobgoblins. Most pay lip-service to one or more gods and occasionally make offerings to curry favor or turn aside ill fortune. Those hobgoblins who feel a stronger religious calling venerate fearsome, tyrannical gods and devils.",
      "Adventurers": ": Hobgoblin adventurers tend to be iconoclasts, loners who chafe under the strict hierarchy of military life. Others have fled or been exiled in disgrace for showing weakness or cowardice. Some harbor dreams of one day returning to the hobgoblin flock flush with wealth and tales of great deeds. A few serve farsighted hobgoblin generals, who send the most promising youths out into the world that they might someday return as mighty heroes for the hobgoblin cause. Hobgoblins lean toward martial classes, particularly cavaliers, fighters, monks, and rogues. The arcane arts are distrusted in hobgoblin society and consequently their practitioners are rare, save for alchemists, who gain grudging praise and admiration for their pyrotechnic talents.",
      "Male Names": ": Aronok, Bankanir, Dorduken, Fentanas, Grur, Hagors, Kalmant, Malgroar, Slatark, Talogan.",
      "Female Names": ": Arinet, Eloqi, Eskani, Horinnia, Korumun, Moranassa, Moritla, Nimanisi, Noranillim, Vortiga.: Hobgoblins are fast and hardy.",
      "+2 Dexterity, +2 Constitution": ": Hobgoblins are fast and hardy.",
      "Goblinoid": ": Hobgoblins are humanoids with the goblinoid subtype.",
      "Medium": ": Hobgoblins are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Hobgoblins have a base speed of 30 feet.",
      "Darkvision": ": Hobgoblins can see in the dark up to 60 feet.",
      "Sneaky": ": Hobgoblins receive a +4 racial bonus on Stealth checks.",
      "Languages": ": Hobgoblins begin play speaking Common and Goblin. Hobgoblins with high Intelligence scores can choose from the following languages: Draconic, Dwarven, Infernal, Giant, and Orc.",
      "Alchemist": ": Add +1/2 to the number of bombs per day the alchemist can create.",
      "Cavalier": ": Add a +1/2 bonus on Intimidate checks and Ride checks.",
      "Cleric": ": Add +1/2 to negative energy spell damage, including inflict spells.",
      "Fighter": ": Add a +1/2 circumstance bonus on critical hit confirmation rolls with a weapon of the fighter's choice (maximum bonus +4). This bonus does not stack with Critical Focus.",
      "Gunslinger": ": Add +1/4 to the gunslinger's grit points.",
      "Inquisitor": ": Add a +1 bonus on concentration checks made to cast inquisitor spells.",
      "Monk": ": Add a +1/4 bonus on combat maneuver checks made to grapple or trip.",
      "Ranger": ": Add +1/4 to a single existing favored enemy bonus (maximum bonus +1 per favored enemy).",
      "Rogue": ": Reduce the penalty for not being proficient with one weapon by 1. When the nonproficiency penalty for a weapon becomes 0 because of this ability, the rogue is treated as having the appropriate Martial or Exotic Weapon Proficiency feat for that weapon."
    }
  },
  {
    "Ifrit": {
      "Source": "Advanced Race Guide pg. 126",
      "Monster Entry": "Link",
      "Physical Description": ": Ifrits vary in appearance as widely as their elemental ancestors do. Most have pointy ears, red or mottled horns on the brow, and hair that flickers and waves as if it were aflame. Some possess skin the color of polished brass or have charcoal-hued scales covering their arms and legs. Ifrits favor revealing and ostentatious clothing in bright oranges and reds, preferably paired with gaudy jewelry.",
      "Society": ": Ifrits are most often born into human communities, and rarely form societies of their own. Those who grow up in a city are almost always imprisoned or driven off before they reach adulthood; most are simply too hot-headed and independent to fit into civilized society, and their predilection toward pyromania doesn't endear them to the local authorities. Those born into nomadic or tribal societies fare much better, since ifrits' instinctive urge to explore and conquer their surroundings can easily earn them a place among their tribe's leadership.",
      "Relations": ": Even the best-natured ifrits tend to view other individuals as tools to use as they see fit, and as such they get along best with races they can charm or browbeat into submission. Half-elves and gnomes often find themselves caught up in an ifrit's schemes, while halflings, Half-Orcs, and dwarves usually bridle at ifrits' controlling nature. Strangely, ifrits sometimes form incredibly close bonds with elves, whose calm, aloof nature seems to counterbalance an ifrit's impulsiveness. Most ifrits refuse to associate with sylphs, but are otherwise on peaceable terms with the other elemental-touched races.",
      "Alignment and Religion": ": Ifrits are a dichotomous people—on one hand, fiercely independent, and on the other, imperious and demanding. They are often accused of being morally impoverished, but their troublemaking behavior is rarely motivated by true malice. Ifrits are usually lawful neutral or chaotic neutral, with a few falling into true neutrality. Most ifrits lack the mindset to follow a god's teachings, and resent the strictures placed on them by organized faith. When ifrits do take to worship (usually venerating a fire-related deity), they prove to be zealous and devoted followers.",
      "Adventurers": ": Ifrits adventure for the sheer thrill of it and for the chance to test their skill against worthy foes, but most of all they adventure in search of power. Once ifrits dedicate themselves to a task, they pursue it unflinchingly, never stopping to consider the dangers ahead of them. When this brashness finally catches up with them, ifrits often rely on sorcery or bardic magic to combat their resulting troubles.",
      "Male Names": ": Aja, Denat, Efit, Elum, Jalij, Maqej, Urah.",
      "Female Names": ": Alayi, Etwa, Maqan, Qari, Sami, Zetaya.: Ifrits are passionate and quick, but also impetuous and destructive.",
      "+2 Dexterity, +2 Charisma, –2 Wisdom": ": Ifrits are passionate and quick, but also impetuous and destructive.",
      "Native Outsider": ": Ifrits are outsiders with the native subtype.",
      "Medium": ": Ifrits are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Ifrits have a base speed of 30 feet.",
      "Darkvision": ": Ifrits can see in the dark up to 60 feet.",
      "Spell-Like Ability": ": Ifrits can use1/day as a spell-like ability (caster level equals the ifrit's character level).",
      "Energy Resistance": ": Ifrits have fire resistance 5.",
      "Fire Affinity": ": Ifrit sorcerers with the elemental (fire) bloodline treat their Charisma scores as 2 points higher for the purposes of all sorcerer spells and class abilities. Ifrit spellcasters with the Fire domain use their domain powers and spells at +1 caster level.",
      "Languages": ": Ifrits begin play speaking Common and Ignan. Ifrits with high Intelligence scores can choose from the following languages: Aquan, Auran, Dwarven, Elven, Gnome, Halfling, and Terran.Plane-Hopper's Handbook pg. 20",
      "Typical Alignment": "LG",
      "Ability Modifiers": "+2 Str, +2 Cha, –2 Wis",
      "Alternate Spell-Like Ability": "Sunsouls gainsun metalas a spell-like ability.",
      "Magma Affinity": "This racial trait functions as and can be replaced as the base ifrit's fire affinity, except it benefits sorcerers with the efreeti bloodline and spellcasters with the Ash subdomain.",
      "Solar Affinity": "This racial trait functions as and can be replaced as the base ifrit's fire affinity, except it benefits sorcerers with the celestial bloodline and spellcasters with the Sun domain.",
      "Alchemist": ": Add +1/2 to the alchemist's bomb damage.",
      "Bard": ": Add +1/6 to the number of people the bard can affect with the fascinate bardic performance.",
      "Cleric": ": Add a +1/2 bonus on Knowledge (planes) checks relating to the Plane of Fire and creatures with the fire subtype.",
      "Gunslinger": ": Add +1/2 to the bonus on initiative checks the gunslinger makes while using her gunslinger initiative deed.",
      "Inquisitor": ": Add a +1/2 bonus on Intimidate checks made against creatures with the fire subtype and a +1/2 bonus on Knowledge (planes) checks relating to the Plane of Fire.",
      "Oracle": ": Add +1/6 to the oracle's level for the purpose of determining the effects of one revelation.",
      "Rogue": ": Add a +1/2 bonus on Acrobatics checks to jump and a +1/2 bonus on Intimidate checks to demoralize enemies.",
      "Sorcerer": ": Choose a bloodline power from the elemental (fire) bloodline or the efreeti bloodline that the sorcerer can use. The sorcerer treats her class level as though it were +1/6 higher (to a maximum of +2) when determining the effects of that power.",
      "Subraces": {
        "Lavasoul (Magma Ifrit)": [
          "Like the primal fires of creation, lavasoul ifrits are both fluid and fixed, alternating between stability and violent alteration.CN+2 Con, +2 Int, –2 DexLavasouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base ifrit’s fire affinity, except it benefits sorcerers with the efreeti bloodline and spellcasters with the Ash subdomain.Mutable and intense, lavasouls evoke the cycle of creation and destruction in their colorful lives, unafraid to pursue new paradigms when the old ones no longer suit them. Many are dark-skinned but riven with blazing lines, which are sometimes also reflected in bright hair or eye colors. They tend to embrace body modification, acquiring and discarding tattoos and piercings as they feel appropriate.Lavasouls can be found in places where seismic change is commonplace and destructive creation is not seen as a contradiction; they excel in the fast-paced markets of Katapesh and the constant flux of Galt."
        ],
        "Sunsoul (Solar Ifrit)": [
          "Strong in character and in body, sunsoul ifrits are incurably optimistic agents of positive change.LG+2 Str, +2 Cha, –2 WisSunsouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base ifrit’s fire affinity, except it benefits sorcerers with the celestial bloodline and spellcasters with the Sun domain.With fire comes light, and the brightness of the sunsouls comes both from their affinity for positive energy and their own luminous attitudes. Where others despair, they labor on, striving to lead by example. Strong leaders and passionate ethos attract sunsouls, drawing them toward powerful religions or crusading nations such as Mendev. They can also be found in places where darkness is settling in; both Taldor and Ustalav have their share of sunsouls working to return these nations to the light.Sunsouls cannot easily hide their presence, and most would never try. Most sunsouls tend to have fair hair, often nearly white, and eyes that glow with a twinkle all their own. Some seem to glow from within, as if lit from inside by an inner sunlight. Unafraid to be seen, they dress in whatever styles please them, even when it means they stand out among populations either more daring or more conservative."
        ]
      }
    }
  },

  {
    "Kitsune": {
      "Source": "Blood of the Beast pg. 12",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Charisma, –2 Strength": ": Kitsune are agile and companionable, but tend to be physically weak.",
      "Kitsune": ": Kitsune are humanoids with the kitsune and shapechanger subtypes.",
      "Medium": ": Kitsune are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Kitsune have a base speed of 30 feet.",
      "Low-Light Vision": ": Kitsune can see twice as far as humans in conditions of dim light.",
      "Change Shape": ": A kitsune can assume the appearance of a specific single human form of the same sex. The kitsune always takes this specific form when she uses this ability. A kitsune in human form cannot use her bite attack, but gains a +10 racial bonus on Disguise checks made to appear human. Changing shape is a standard action. This ability otherwise functions as, except that the kitsune does not adjust her ability scores and can remain in this form indefinitely.",
      "Agile": ": Kitsune receive a +2 racial bonus on Acrobatics checks.",
      "Kitsune Magic": ": Kitsune add 1 to the DCs of any saving throws to resist enchantment spells that they cast. Kitsune with a Charisma score of 11 or higher gain the following spell-like ability: 3/day—",
      "Natural Weapons": ": In her natural form, a kitsune has a bite attack that deals 1d4 points of damage.",
      "Languages": ": Kitsune begin play speaking Common and Sylvan. Kitsune with high Intelligence scores can choose from the following languages: any human language, Aklo, Celestial, Elven, Gnome, and Tengu.",
      "All": ": Gain 1/6 of a new Magical Tailfeat. Any kitsune character can choose this bonus upon gaining a level in her favored class.",
      "Arcanist": ": When casting arcanist enchantment spells, add 1/3 to the effective caster level, but only for the purpose of determining duration.",
      "Bard": ": Add a +1/2 bonus on Bluff checks to lie and a +1/2 bonus on Diplomacy checks to gather information.",
      "Brawler": ": Increase the number of times per day the brawler can use martial flexibility by 1/4.",
      "Cavalier": ": Add 1/4 to the cavalier's banner bonus.",
      "Druid": ": Add a +1/2 bonus on Diplomacy and Intimidate checks to change a creature's attitude.",
      "Fighter": ": Add 1/3 to damage rolls the fighter makes with weapon attacks against an opponent that he is f lanking or that is denied its Dexterity bonus to AC.",
      "Mesmerist": ": Increase the number of mesmerist tricks the mesmerist can use per day by 1/3.",
      "Oracle": ": Reduce the penalty for not being proficient for one weapon by 1. When the nonproficiency penalty for a weapon becomes 0 because of this ability, the oracle is treated as having the appropriate Martial or Exotic Weapon Proficiency feat for that weapon.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Shaman": ": Add one enchantment spell from the sorcerer/ wizard spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Shifter": ": Add 1/4 to the number of minutes the shifter can assume her minor form each day.",
      "Sorcerer": ": Add +1/4 to the DC of enchantment spells.",
      "Swashbuckler": ": Increase the total number of points in the swashbuckler's panache pool by 1/4.",
      "Vigilante": ": Add 1/2 to the Disguise bonus provided by seamless guise."
    }
  },
  {
    "Kobold": {
      "Source": "Kobolds of Golarion pg. 7",
      "Monster Entry": "Link",
      "Male Names": ": Athraz, Dyrtrax, Fazij, Grytnok, Jekkajak, Kaidynn, Keegyn, Kirrok, Merlokrep, Nydryn, Nyktox, Ryzztyl, Torphrex, Varrann, Vreknog, Xahndyg",
      "Female Names": ": Ahmmra, Azzlyn, Enga, Grymwyr, Gynnezz, Kregnaan, Jynnjun, Lyrtrahk, Melrynn, Petrahk, Ryzzntyg, Skyxa, Tyrrell, Varshez, Vregma, Zarrnyl: Kobolds are fast but weak.",
      "+2 Dexterity, –4 Strength, –2 Constitution": ": Kobolds are fast but weak.",
      "Reptilian": ": Kobolds are humanoids with the reptilian subtype.",
      "Small": ": Kobolds are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Normal Speed": ": Kobolds have a base speed of 30 feet.",
      "Darkvision": ": Kobolds can see in the dark up to 60 feet.",
      "Armor": ": Kobolds have a +1 natural armor bonus.",
      "Crafty": ": Kobolds gain a +2 racial bonus on Craft (traps), Perception, and Profession (miner) checks. Craft (traps) and Stealth are always class skills for a kobold.",
      "Light Sensitivity": ": Kobolds are dazzled as long as they remain in an area of bright light.",
      "Languages": ": Kobolds begin play speaking Draconic. Kobolds with high Intelligence scores can choose from the following languages: Common, Dwarven, Gnome, and Undercommon.",
      "Alchemist": ": Add +1/2 to the number of bombs per day the alchemist can create.",
      "Barbarian": ": While you are raging, your racial natural\r attacks deal +1/4 point of damage.",
      "Bard": ": Treat the bard's level as +1/2 level higher for the purpose of determining the effect of the fascinate bardic performance.",
      "Cavalier": ": Add 5 feet (up to 15 feet maximum) to the cavalier's mount's speed when it uses the charge or withdraw action.",
      "Cleric": ": Add +1 to channel energy damage dealt to creatures denied their Dexterity bonus to AC (whether or not the creature has a Dexterity bonus to AC).",
      "Druid": ": Add +1/2 to the druid's wild empathy bonus.",
      "Fighter": ": Add +1/2 to damage rolls the fighter makes with weapon attacks against an opponent he is flanking or an opponent that is denied its Dexterity bonus to AC.",
      "Gunslinger": ": Add +1/4 to the dodge bonus to AC granted by the nimble class feature (maximum +4).",
      "Inquisitor": ": Add 1/2 to Survival checks made to track\r creatures in total darkness.",
      "Magus": ": Add a +1/2 bonus on concentration checks made to cast defensively.",
      "Monk": ": Add +1/3 to the monk's AC bonus class ability.",
      "Oracle": ": Add +1/4 to the armor or natural armor bonus granted by oracle spells she casts on herself.",
      "Paladin": ": Add 1/4 to the deflection bonus granted by\r your smite evil ability.",
      "Ranger": ": Add +1/4 to the number of opponents the ranger may select when using hunter's bond to grant a bonus to allies. All selected creatures must be of the same type.",
      "Rogue": ": Add +1/2 to the rogue's trap sense bonus to AC.",
      "Shifter": ": Add a +1/4 bonus on Stealth checks while in the shifter's minor or major form.",
      "Sorcerer": ": Choose acid, cold, electricity, or fire damage. Add +1/2 point of the chosen energy damage to spells that deal the chosen energy damage cast by the sorcerer.",
      "Summoner": ": Add +1/4 to the summoner's shield ally bonus (maximum +2).",
      "Witch": ": Add +5 feet to the distance at which her familiar grants the Alertness feat (maximum +20 feet).",
      "Wizard": ": Add 1/2 to your familiar's Will saves against\r enchantment effects, or increase the hit points of your\r bonded item by 1."
    }
  },

  {
    "Monkey Goblin": {
      "Source": "Bestiary 6 pg. 138,Inner Sea Bestiary pg. 16,Inner Sea Races pg. 244",
      "Monster Entry": "Link",
      "+4 Dexterity, –2 Wisdom, –2 Charisma": ": Monkey goblins are fast, but foolishly impulsive and disagreeable.",
      "Small": ": Monkey goblins are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty to their CMD and on combat maneuver checks, and a +4 size bonus on Stealth checks.",
      "Humanoid": ": Monkey goblins are humanoids with the goblinoid subtype.",
      "Slow Speed": ": Monkey goblins have a base speed of 20 feet.",
      "Low-Light Vision": ": Monkey goblins can see twice as far as humans in conditions of dim light.",
      "Acrobatic": ": Monkey goblins gain a +2 racial bonus on Acrobatics and Stealth checks.",
      "Fearless": ": Monkey goblins gain a +2 racial bonus on all saving throws against fear.",
      "Natural Climber": ": Monkey goblins have a climb speed of 30 feet.",
      "Prehensile Tail (Ex)": ": All monkey goblins have long, flexible tails that they can use to carry objects. They cannot wield weapons with their tails, but the tails do allow them to retrieve small objects stowed on their persons as a swift action.",
      "Languages": ": Monkey goblins begin play speaking Goblin. Monkey goblins with high Intelligence scores can choose from the following: Common, Draconic, Dwarven, Gnoll, Gnome, Halfling, Orc."
    }
  },

  {
    "Orc": {
      "Source": "Advanced Race Guide pg. 138",
      "Monster Entry": "Link",
      "Physical Description": ": Powerfully built, orcs typically stand just a few inches taller than most humans but have much greater muscle mass, their broad shoulders and thick, brawny hips often giving them a slightly lurching gait. They typically have dull green skin, coarse dark hair, beady red eyes, and protruding, tusklike teeth. Orcs consider scars a mark of distinction and frequently use them as a form of body art.",
      "Society": ": Orcs usually live amid squalor and constant mayhem, and intimidation and brutal violence are the glue that holds orc culture together. They settle disputes by making increasingly grisly threats until, when a rival fails to back down, the conflict escalates into actual bloodshed. Orcs who win these ferocious brawls not only feel free to take whatever they want from the loser, but also frequently indulge in humiliating physical violation, casual mutilation, and even outright murder. Orcs rarely spend much time improving their homes or belongings since doing so merely encourages a stronger orc to seize them. In fact, whenever possible, they prefer to occupy buildings and communities originally built by other races.",
      "Relations": ": Orcs admire strength above all things. Even members of enemy races can sometimes win an orc's grudging respect, or at least tolerance, if they break his nose enough times.",
      "Alignment and Religion": ": Orcs have few redeeming qualities. Most are violent, cruel, and selfish. Concepts such as honor or loyalty usually strike them as odd character flaws that tend to afflict members of the weaker races. Orcs are typically not just evil, but chaotic to boot, though those with greater self-control may gravitate toward lawful evil. Orcs pray to gods of fire, war, and blood, often creating tribal \"pantheons\" by combining these aspects into uniquely orc concepts.",
      "Adventurers": ": Orcs usually leave their tribes only after losing out in a power struggle. Facing humiliation, slavery, or even death at the hands of their own kind, they opt instead to live and work with members of other races. Orcs who fail to rein in their tempers and the instinctive drive to dominate rarely last long once they strike out on their own. Though orcs who do manage to get by in other societies often enjoy the luxuries and comforts these societies can deliver, they still tend to dream of returning home, seizing power, and taking revenge.",
      "Male Names": ": Arkus, Carrug, Felzak, Murdut, Prabur.",
      "Female Names": ": Durra, Grillgiss, Ilyat, Krugga, Leffit, Olbin, Trisgrak.: Orcs are brutal and savage.",
      "+4 Strength, –2 Intelligence, –2 Wisdom, –2 Charisma": ": Orcs are brutal and savage.",
      "Orc": ": Orcs are humanoids with the orc subtype.",
      "Medium": ": Orcs are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Orcs have a base speed of 30 feet.",
      "Darkvision": ": Orcs can see in the dark up to 60 feet.",
      "Light Sensitivity": ": Orcs are dazzled in areas of bright sunlight or within the radius of a daylight spell.",
      "Ferocity": ": Orcs can remain conscious and continue fighting even if their hit point totals fall below 0. Orcs are still staggered at 0 hit points or lower and lose 1 hit point each round as normal.",
      "Weapon Familiarity": ": Orcs are always proficient with greataxes and falchions, and treat any weapon with the word \"orc\" in its name as a martial weapon.",
      "Languages": ": Orcs begin play speaking Common and Orc. Orcs with high Intelligence scores can choose from the following languages: Dwarven, Giant, Gnoll, Goblin, and Undercommon.",
      "Alchemist": ": Add +10 minutes to the duration of the alchemist's mutagens.",
      "Barbarian": ": Add +1 to the barbarian's total number of rage rounds per day.",
      "Cavalier": ": Add +1 to the cavalier's CMB when making bull rush or overrun combat maneuvers against a challenged target.",
      "Druid": ": Add +1/2 to the damage dealt by the druid's animal companion's natural attacks.",
      "Fighter": ": Add +2 to the fighter's Constitution score for the purpose of determining when he dies from negative hit points.",
      "Ranger": ": Add +1 hit point to the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains these bonus hit points.",
      "Shifter": ": Add 1/5 to the damage dealt when using the shifter claws ability.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells."
    }
  },
  {
    "Oread": {
      "Source": "Advanced Race Guide pg. 145",
      "Monster Entry": "Link",
      "Physical Description": ": Oreads are strong and solidly built, with skin and hair colored stony shades of black, brown, gray, or white. While all oreads appear vaguely earthy, a few bear more pronounced signs of their elemental heritage—skin that shines like polished onyx, rocky outcroppings protruding from their flesh, glowing gemstones for eyes, or hair like crystalline spikes. They often dress in earthy tones, wearing practical clothing well suited to vigorous physical activity and preferring fresh flowers, simple gemstones, and other natural accents to complex manufactured jewelry.",
      "Society": ": As a minor offshoot of the human race, oreads have no real established society of their own. Instead, most oreads grow up in human communities learning the customs of their parents. Adult oreads have a well-deserved reputation among other races for being hermits and loners. Few take well to the bustle of city life, preferring instead to spend their days in quiet contemplation atop some remote mountain peak or deep below the earth in a secluded cavern. Oreads with a greater tolerance for life among humans often join the city watch, or find some other way to serve their community in a position of responsibility.",
      "Relations": ": Oreads feel comfortable in the company of dwarves, with whom they have much in common. They find gnomes too strange and many halflings far too brash, and so avoid these races in general. Oreads gladly associate with Half-Orcs and half-elves, feeling a sense of kinship with the other part-human races despite inevitable personality conflicts. Among the elemental-touched races, oreads have few friends but no true enemies.",
      "Alignment and Religion": ": Oreads are, perhaps above all else, set in their ways, and any disruption of their routine is met with quiet disapproval. Oreads are fiercely protective of their friends, but don't seem particularly concerned with the well-being of those outside their small circle of acquaintances. As such, most oreads are lawful neutral. Religious life comes easily to the earth-touched. They appreciate the quiet, contemplative life of the monastic order, and most dedicate themselves to the worship of earth- or nature-related deities.",
      "Adventurers": ": Oreads are initially hesitant adventurers. They dislike leaving their homes and don't handle the shock of new experiences well. Usually it takes some outside force to rouse oreads into action, often by threatening their homes, lives, or friends. Once the initial threat is dealt with, however, oreads often find they've grown accustomed to the adventuring life, and continue to pursue it through the rest of their days. Oreads make good monks and fighters thanks to their prodigious strength and self-discipline.",
      "Male Names": ": Andanan, Jeydavu, Mentys, Oret, Sithundan, Urtar.",
      "Female Names": ": Besthana, Echane, Ghatiyara, Irice, Nysene, Pashe.: Oreads are strong, solid, stable, and stoic.",
      "+2 Strength, +2 Wisdom, –2 Charisma": ": Oreads are strong, solid, stable, and stoic.",
      "Native Outsider": ": Oreads are outsiders with the native subtype.",
      "Medium": ": Oreads are Medium creatures and have no bonuses or penalties due to their size.",
      "Slow Speed": ": Oreads have a base speed of 20 feet.",
      "Darkvision": ": Oreads can see in the dark up to 60 feet.",
      "Spell-Like Ability": ": Oreads can use1/day as spell-like ability (with a caster level equal to the oread's character level).",
      "Energy Resistance": ": Oreads have acid resistance 5.",
      "Earth Affinity": ": Oread sorcerers with the elemental (earth) bloodline treat their Charisma scores as 2 points higher for the purposes of all sorcerer spells and class abilities. Oread clerics with the Earth domain use their domain powers and spells at +1 caster level.",
      "Languages": ": Oreads begin play speaking Common and Terran. Oreads with high Intelligence scores can choose from the following languages: Aquan, Auran, Dwarven, Elven, Gnome, Halfling, Ignan, and UndercommonPlane-Hopper's Handbook pg. 20",
      "Typical Alignment": "LN",
      "Ability Modifiers": "+2 Con, +2 Wis, –2 Dex",
      "Alternate Spell-Like Ability": "Ironsouls gainunerring weaponas a spell-like ability.",
      "Crystal Affinity": "This racial trait functions as and can be replaced as the base oread's earth affinity, except it benefits sorcerers with the deep earth bloodline and spellcasters with the Charm domain.",
      "Metal Affinity": "This racial trait functions as and can be replaced as the base oread's earth affinity, except it benefits sorcerers with the shaitan bloodline and spellcasters with the Metal subdomain.",
      "Binding Earth": ": +1 damage; +1 to DC of Strength checks.: Garnet worth 50 gp.",
      "Binding Earth, Mass": ": As binding earth augmentation, affecting all targets of the augmented spell.: Garnets worth 250 gp.",
      "Calcific Touch": ": +1 Dexterity damage.: Aquamarine worth 250 gp.",
      "Clashing Rocks": ": +1 damage per damage die.: Emeralds worth 1,500 gp.",
      "Earthquake": ": +2 Reflex save DC in whatever application the spell is used; area increases to 100-foot-radius shapeable spread.: Jet worth 500 gp.",
      "Elemental Body": ": Duration increases to 10 minutes/level.: Amber worth 250 gp for, +100 gp per spell level for greater versions.",
      "Elemental Swarm": ": Earth elementals summoned gain the advanced simple template (this does not stack with the Augment Summoning feat).: Rubies worth 1,200 gp.",
      "Magic Stone": ": Range increment increases by 10 feet.: Moonstone worth 25 gp.",
      "Meld into Stone": ": Can bring up to 200 pounds of equipment with you; you can see as normal out of the stone.: Peridots worth 150 gp.",
      "Mighty Fist of Earth": ": Increase unarmed strike damage by one step (to 1d4 in most instances).: Sard or sardonyx worth 25 gp.",
      "Raging Rubble": ": Rubble deals +1 damage; distraction DC increases by 1.: Tourmaline worth 80 gp.",
      "Shifting Sand": ": Move area of sands up to 15 feet as a move action.: Turquoise worth 125 gp.",
      "Soften Earth and Stone": ": Creatures can move only at a quarter their normal speed (minimum 5 feet) in areas of mud and loose dirt.: Fluorite worth 100 gp.",
      "Spike Stones": ": +1 piercing damage; spikes deal 1 point of bleed damage.: Topaz worth 300 gp.",
      "Stone Shape": ": Shapes that include moving parts have only 5% chance of not working.: Opal worth 250 gp.",
      "Stone Shield": ": If your opponent's attack strikes the stone shield, its full damage roll is also applied to its weapon. Unarmed strikes and natural attacks are not affected.: Jade worth 75 gp.",
      "Stoneskin": ": The cost of this spell's expensive material component can be reduced or increased to affect the spell's power accordingly. With reduced components, the spell grants DR 10/silver (instead of adamantine); with increased components, the spell absorbs 15 points of damage per caster level before it's discharged.: Diamonds worth 150 gp (reduced); diamonds worth 500 gp (increased).",
      "Bard": ": Add +5 feet to the range of one of the bard's bardic performances (max +30 feet to any one performance).",
      "Cleric": ": Add a +1/2 bonus on Knowledge (planes) checks relating to the Plane of Earth and creatures with the earth subtype.",
      "Druid": ": Add a +1/2 bonus on Knowledge (nature) checks relating to plants and burrowing animals.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a bull rush or drag attempt.",
      "Monk": ": Add +1/3 on critical hit confirmation rolls made with unarmed strikes (maximum bonus of +5). This bonus does not stack with Critical Focus.",
      "Paladin": ": Add +1/4 to the bonus the paladin grants her allies with her aura of courage and aura of resolve special abilities.",
      "Ranger": ": Add +1/4 to the natural armor bonus of the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains this bonus.",
      "Summoner": ": Add a +1/4 natural armor bonus to the AC of the summoner's eidolon.",
      "Subraces": {
        "Gemsoul (Crystal Oread)": [
          "With scintillating personalities to match their captivating appearances, gemsoul oreads command attention—and prefer it that way.N+2 Str, +2 Cha, –2 WisGemsouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base oread’s earth affinity, except it benefits sorcerers with the deep earth bloodline and spellcasters with the Charm domain.Gemsouls tend to have large egos and are flashy in their relationships. They gravitate towards artistic pursuits, most frequently of a performative nature, though they also have a strong tradition of symmetric poetry. Gemsouls prefer to make their homes in flamboyant societies or places where they can make meaningful personal contributions, as well as in nations that appreciate cultivated beauty, like Kyonin.Gemsouls typically have dazzling, faceted skin, along with a cluster of crystalline formations instead of hair and pupil-less eyes of vivid colors. Some favor tattoos in complex, branching geometric shapes, and they can frequently be seen wearing silks or brightly dyed linen to contrast their complexions."
        ],
        "Ironsoul (Metal Oread)": [
          "Stolid and indomitable, ironsoul oreads undertake great works, both physical and conceptual, with unwavering determination.LN+2 Con, +2 Wis, –2 DexIronsouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base oread’s earth affinity, except it benefits sorcerers with the shaitan bloodline and spellcasters with the Metal subdomain.Possessed of patience and a sense of self-refinement through struggle, ironsouls reflect their ancestry in their continuous and determined efforts towards self-improvement. Ironsouls are most at home in areas that reflect that same sense of directed and intentional growth, and they operate best within existing formal structures.Ironsouls wear their elemental heritage on their skin, with most having some amount of metallic sheen. Their skin tone varies, with colors ranging from gold and silver to copper-green and dull, oxide gray."
        ]
      }
    }
  },

  {
    "Ratfolk": {
      "Source": "Advanced Race Guide pg. 150",
      "Monster Entry": "Link",
      "Physical Description": ": Typical ratfolk are average 4 feet tall and weigh 80 pounds. They often wear robes to stay cool in the desert or conceal their forms in cities, as they know other humanoids find their rodent features distasteful. Ratfolk have a strong attraction to shiny jewelry, especially copper, bronze, and gold, and many decorate their ears and tails with small rings made of such metals. They are known to train giant rats (dire rats with the giant creature simple template), which they often use as pack animals and mounts.",
      "Society": ": Ratfolk are extremely communal, and live in large warrens with plenty of hidden crannies in which to stash their hoards or flee in times of danger, gravitating toward subterranean tunnels or tightly packed tenements in city slums. They feel an intense bond with their large families and kin networks, as well as with ordinary rodents of all sorts, living in chaotic harmony and fighting fiercely to defend each other when threatened. They are quick to use their stockpiles of gear in combat, but prefer to work out differences and settle disputes with mutually beneficial trades.",
      "Relations": ": Ratfolk tend to get along quite well with humans, and often develop ratfolk societies dwelling in the sewers, alleys, and shadows of human cities. Ratfolk find dwarves too hidebound and territorial, and often mistake even mild criticisms from dwarves as personal attacks. Ratfolk have no particular feelings about gnomes and halflings, although in areas where those races and ratfolk must compete for resources, clan warfare can become dogma for generations. Ratfolk enjoy the company of elves and half-elves, often seeing them as the calmest and most sane of the civilized humanoid races. Ratfolk are particularly fond of elven music and art, and many ratfolk warrens are decorated with elven art pieces acquired through generations of friendly trade.",
      "Alignment and Religion": ": Ratfolk individuals are driven by a desire to acquire interesting items and a compulsion to tinker with complex objects. The strong ties of ratfolk communities give them an appreciation for the benefits of an orderly society, even if they are willing to bend those rules when excited about accomplishing their individual goals.",
      "Adventurers": ": Ratfolk are often driven by a desire to seek out new opportunities for trade, both for themselves and for their warrens. Ratfolk adventurers may seek potential markets for their clan's goods, keep an eye out for sources of new commodities, or just wander about in hopes of unearthing enough treasure to fund less dangerous business ventures. Ratfolk battles are often decided by cunning traps, ambushes, or sabotage of enemy positions, and accordingly young ratfolk heroes often take up classes such as alchemist, gunslinger, and rogue.",
      "Male Names": ": Agiz, Brihz, Djir, Ninnec, Rerdahl, Rikkan, Skivven, Tamoq.",
      "Female Names": ": Bessel, Fhar, Jix, Kitch, Kubi, Nehm, Rissi, Thikka.: Ratfolk are agile and clever, yet physically weak.",
      "+2 Dexterity, +2 Intelligence, –2 Strength": ": Ratfolk are agile and clever, yet physically weak.",
      "Ratfolk": ": Ratfolk are humanoids with the ratfolk subtype.",
      "Small": ": Ratfolk are Small and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Ratfolk have a base speed of 20 feet.",
      "Darkvision": ": Ratfolk can see in the dark up to 60 feet.",
      "Rodent Empathy": ": Ratfolk gain a +4 racial bonus on Handle Animal checks made to influence rodents.",
      "Swarming": ": Ratfolk are used to living and fighting communally, and are adept at swarming foes for their own gain and their foes' detriment. Up to two ratfolk can share the same square at the same time. If two ratfolk in the same square attack the same foe, they are considered to be flanking that foe as if they were in two opposite squares.",
      "Tinker": ": Ratfolk gain a +2 racial bonus on Craft (alchemy), Perception, and Use Magic Device checks.",
      "Languages": ": Ratfolk begin play speaking Common. Ratfolk with high Intelligence scores can choose from the following languages: Aklo, Draconic, Dwarven, Gnoll, Gnome, Goblin, Halfling, Orc, and Undercommon.",
      "Alchemist": ": The alchemist gains +1/6 of a new discovery.",
      "Arcanist": ": Add 1/3 to the number of times per day the arcanist can use the consume magic items exploit.",
      "Barbarian": ": When raging, add +1/4 to the barbarian's swarming trait's flanking bonus on attack rolls.",
      "Bard": ": Increase the bonus provided by the bard's inspire competence performance by 1/6, and add 1/6 to the number of allies the bard can affect with his inspire greatness performance.",
      "Druid": ": Add a +1 bonus on wild empathy checks made to influence animals and magical beasts that live underground.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a bull rush or grapple attempt.",
      "Gunslinger": ": Add a +1/2 bonus on initiative checks when the gunslinger has at least 1 grit point.",
      "Hunter": ": Add 1 skill rank to the hunter's badger, dire rat, or riding rat () animal companion.",
      "Inquisitor": ": Add 1/2 to Sense Motive checks and Knowledge (dungeoneering) checks to identify creatures.",
      "Investigator": ": Add 1 to the bonus provided to a single skill (maximum +2) by inspiration. This skill must be one to which the investigator can already apply inspiration. The investigator can select a different skill at each level.",
      "Mesmerist": ": Gain a +1 bonus on concentration checks to maintain the mesmerist's hypnotic stare.",
      "Monk": ": Add +1 feet to the speed the monk can move while making a Stealth check without taking a penalty. This has no effect unless the monk has selected this reward five times (or another increment of five). This does not allow the monk to use Stealth while running or charging.",
      "Occultist": ": Gain 1/6 of a new focus power.",
      "Psychic": ": Gain 1/6 of a new phrenic amplification.",
      "Ranger": ": Add +1 to an animal companion's CMD when adjacent to the ranger. If the ranger ever replaces his animal companion, the new animal companion gains this bonus.",
      "Rogue": ": Add a +1/2 bonus on Escape Artist checks.",
      "Shifter": ": Add a +1 bonus on wild empathy checks to influence animals and magical beasts that live underground.",
      "Spiritualist": ": Add 1/2 hit point and 1/2 skill point to the spiritualist's phantom.",
      "Summoner": ": Add a +1 bonus on saving throws against poison made by the summoner's eidolon.",
      "Swashbuckler": ": Add 1/4 to the AC bonus provided by cover or improved cover.",
      "Witch": ": Add +5 feet to the range of one hex with a range other than \"touch.\""
    }
  },

  {
    "Sylph": {
      "Source": "Advanced Race Guide pg. 157",
      "Monster Entry": "Link",
      "Physical Description": ": Sylphs tend to be pale and thin to the point of appearing delicate, but their skinny bodies are often more resilient than they look. Many sylphs can easily pass for humans with some effort, though the complex blue markings that swirl across their skin reveal their elemental ancestry. Sylphs also bear more subtle signs of their heritage, such as a slight breeze following them wherever they go. These signs become more pronounced as a sylph experiences intense passion or anger, spontaneous gusts of wind tousling the sylph's hair or hot blusters knocking small items off of shelves.",
      "Society": ": Sylphs are usually born to human parents, and so are raised according to human customs. Most sylphs dislike the attention they receive growing up in human society, so it's common for them to leave home soon after coming of age. They rarely abandon civilization altogether, however, preferring instead to find some new city or settlement where they can go unnoticed among (and spy upon) the masses. A sylph who happens upon another sylph unnoticed instantly becomes obsessed with her kin, spying on and learning as much about the other as she possibly can. Only after weighing all the pros and cons and formulating plans for every potential outcome will the sylph introduce herself to the other. Rarely, two sylphs will discover each other's presence in a community at the same time. What ensues thereafter is a sort of cat-and-mouse game, a convoluted dance in which each sylph spies on the other as both attempt to gain the upper hand. Sylphs who meet this way always become either inseparable friends or intractable enemies.",
      "Relations": ": Sylphs enjoy prying into the affairs of most other races, but have little taste for actually associating with most of them. Sylphs can relate on some level with elves, who share their tendency toward aloofness, but often spoil any possible relationship by violating the elven sense of privacy. Dwarves distrust sylphs intensely, considering them flighty and unreliable. They form excellent partnerships with halflings, relying on the short folk's courage and people skills to cover their own shortcomings. Sylphs are amused by the annoyed reactions they provoke in ifrits, and find oreads too boring to give them much attention.",
      "Alignment and Religion": ": Sylphs have little regard for laws and traditions, for such strictures often prohibit the very things sylphs love—subterfuge and secrecy. This doesn't mean sylphs are opposed to law, merely that they use the most expedient means available to accomplish their goals, legal or not. Most sylphs are thus neutrally aligned. Sylphs are naturally drawn to mystery cults, and to deities who focus on secrets, travel, or knowledge.",
      "Adventurers": ": An inborn urge to get to the bottom of things drives many sylphs to the adventuring life. A sylph who runs across the trail of a mystery will never be satisfied until she has uncovered every thread of evidence, followed up on every lead, and found the very heart of the trouble. Such sylphs make plenty of enemies by poking around into other peoples' affairs, and usually turn to their roguish talents or wizardry to defend themselves.",
      "Male Names": ": Akaash, Eydan, Hanuun, Siival, Vasaam.",
      "Female Names": ": Inam, Keeya, Lissi, Nava, Radaya, Tena.: Sylphs are quick and insightful, but slight and delicate.",
      "+2 Dexterity, +2 Intelligence, –2 Constitution": ": Sylphs are quick and insightful, but slight and delicate.",
      "Native Outsider": ": Sylphs are outsiders with the native subtype.",
      "Medium": ": Sylphs are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Sylphs have a base speed of 30 feet.",
      "Darkvision": ": Sylphs can see in the dark up to 60 feet.",
      "Spell-Like Ability": ": Sylphs can use1/day as a spell-like ability (with a caster level equal to the sylph's character level).",
      "Energy Resistance": ": Sylphs have electricity resistance 5.",
      "Air Affinity": ": Sylph sorcerers with the elemental (air) bloodline treat their Charisma scores as 2 points higher for the purposes of all sorcerer spells and class abilities. Sylph spellcasters with the Air domain use their domain powers and spells at +1 caster level.",
      "Languages": ": Sylphs speak Common and Auran. Sylphs with high Intelligence scores can choose from the following languages: Aquan, Dwarven, Elven, Gnome, Halfling, Ignan, and Terran.Plane-Hopper's Handbook pg. 21",
      "Typical Alignment": "CN",
      "Ability Modifiers": "+2 Dex, +2 Cha, –2 Wis",
      "Alternate Spell-Like Ability": "Stormsouls gainshocking graspas a spell-like ability.",
      "Smoke Affinity": "This racial trait functions as and can be replaced as the base sylph's air affinity, except it benefits sorcerers with the shadow bloodline and spellcasters with the Smoke subdomain.",
      "Lightning Affinity": "This racial trait functions as and can be replaced as the base sylph's air affinity, except it benefits sorcerers with the stormborn bloodline and spellcasters with the Weather domain.",
      "Cleric": ": Add a +1/2 bonus on Knowledge (planes) checks relating to the Plane of Air and creatures with the air subtype.",
      "Druid": ": Add a +1/2 bonus on Knowledge (nature) checks relating to weather and flying animals.",
      "Inquisitor": ": Add a +1/2 bonus on Stealth checks while motionless and on opposed Perception checks.",
      "Oracle": ": Add +1/6 to the oracle's level for the purpose of determining the effects of one revelation.",
      "Rogue": ": Add a +1/2 bonus on Acrobatics checks to jump and a +1/2 bonus on Sense Motive checks.",
      "Sorcerer": ": Choose a bloodline power from the djinni or elemental (air) bloodline that the sorcerer can use. The sorcerer treats her class level as though it were +1/6 higher (to a maximum of +2) when determining the effects of that power.",
      "Witch": ": Add a +1/2 bonus on Stealth checks and Perception checks made by the witch's familiar. If the sylph ever replaces her familiar, the new familiar gains these bonus skill ranks.",
      "Wizard": ": Select one arcane school power from the air or wood elemental schools that the wizard can currently use. The wizard treats her class level as though it were +1/6 higher (to a maximum of +2) when determining the effects of that power.",
      "Subraces": {
        "Smokesoul (Fume Sylph)": [
          "Veiled and surreptitious, smokesoul sylphs are natural deceivers, always concealing their true intentions.CE+2 Dex, +2 Cha, –2 ConSmokesouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base sylph’s air affinity, except it benefits sorcerers with the shadow bloodline and spellcasters with the Smoke subdomain.Obfuscation, secrecy, and the shape of things not there: all these are the natural realms of smokesouls. They are experts at concealing both their bodies and motivations, and at making the insubstantial seem as real as any physical object. Smokesouls are drawn to areas of dangerous politics and intrigue, and many can be found in Nidal and Brevoy pursuing whatever machinations amuse them.With few distinguishing features save ashen skin and dark hair, smokesouls can be mistaken for any number of other races. Smokesouls often change their clothing, cosmetics, or style to keep their appearance in a constant state of flux."
        ],
        "Stormsoul (Lightning Sylph)": [
          "With an abundance of confidence and a shortage of patience, stormsoul sylphs are personalities who cannot be ignored.CN+2 Dex, +2 Cha, –2 WisStormsouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base sylph’s air affinity, except it benefits sorcerers with the stormborn bloodline and spellcasters with the Weather domain.When a stormsoul moves, either in word or in action, the world notices. Unafraid to speak their minds, they are both direct and unsubtle, and they make fierce allies. When friends are in need, stormsouls act without thinking and are always the first to leap to their aid.A stormsoul sylph has hair that always seems to move, even when there is no breeze, and acts with a sudden intensity that can seem out of control. Their eyes are the color of stormy water or lightning-lit skies, and even a casual glance from a stormsoul can seem severe."
        ]
      }
    }
  },

  {
    "Tengu": {
      "Source": "Advanced Race Guide pg. 163",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Wisdom, –2 Constitution": ": Tengus are fast and observant, but relatively fragile.",
      "Tengu": ": Tengus are humanoids with the tengu subtype.",
      "Medium": ": Add 1/4 to the bonus on checks when the medium uses the spirit surge ability.",
      "Normal Speed": ": Tengus have a base speed of 30 feet.",
      "Senses": ": Tengus have low-light vision.",
      "Sneaky": ": Tengus gain a +2 racial bonus on Perception and Stealth checks.",
      "Gifted Linguist": ": Tengus gain a +4 racial bonus on Linguistics checks, and learn two languages each time they gain a rank in Linguistics rather than one language.",
      "Swordtrained": ": Tengus are automatically proficient with swordlike weapons (including bastard swords, daggers, elven curve blades, falchions, greatswords, kukris, longswords, punching daggers, rapiers, scimitars, short swords, and two-bladed swords).",
      "Natural Weapon": ": A tengu has a bite attack that deals 1d3 points of damage.",
      "Languages": ": Tengus begin play speaking Common and Tengu. Tengus with high Intelligence scores can choose any languages they want (except for secret languages, such as Druidic).",
      "Barbarian": ": Add +1/3 to the bonus from the superstitious rage power.",
      "Bard": ": Gain a +1/3 bonus on Perform checks attempted as part of countersong and distraction bardic performances.",
      "Brawler": ": Gain a +1/2 insight bonus on attack rolls made with the beak as a secondary natural attack (to a maximum of +3); the brawler must have a beak natural attack to select this option.",
      "Cleric": ": Gain a +1/2 bonus on Diplomacy checks to gather information and on Knowledge (local and religion) checks to know local religious practices and superstitions.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a grapple or trip attempt.",
      "Hunter": ": Add 1 skill rank to the hunter's animal companion. If the hunter ever replaces her animal companion, the new companion gains these bonus skill ranks.",
      "Kineticist": ": Gain 1/6 of an Extra Wild Talentfeat.",
      "Mesmerist": ": Add 1/4 to the AC bonus provided by the meek facade mesmerist trick.",
      "Monk": ": Add +1/4 point to the monk's ki pool.",
      "Oracle": ": Add +1/2 to the oracle's level for the purpose of determining the effects of the oracle's curse ability.",
      "Rogue": ": Choose a weapon from those listed under the tengu's swordtrained ability. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus does not stack with Critical Focus.",
      "Slayer": ": Gain a +1/4 bonus on Disguise, Knowledge (local), and Perception checks.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power.",
      "Spiritualist": ": The spiritualist's phantom gains 1/6 of a bonus feat. The phantom must meet all prerequisites of the selected feat.",
      "Swashbuckler": ": Add 1/2 to the swashbuckler's Acrobatics, Climb, Escape Artist, Fly, Ride, and Swim checks when using the derring-do deed.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells."
    }
  },
  {
    "Tiefling": {
      "Source": "Blood of Fiends pg. 31",
      "Monster Entry": "Link",
      "Physical Description": ": No two tieflings look alike; the fiendish blood running through their veins manifests inconsistently, granting them an array of fiendish traits. One tiefling might appear as a human with small horns, a barbed tail, and oddly colored eyes, while another might manifest a mouth of fangs, tiny wings, and claws, and yet another might possess the perpetual smell of blood, foul incenses, and brimstone. Typically, these qualities hearken back in some way to the manner of fiend that spawned the tiefling's bloodline, but even then the admixture of human and fiendish blood is rarely ruled by sane, mortal laws, and the vast flexibility it produces in tieflings is a thing of wonder, running the gamut from oddly beautiful to utterly terrible.",
      "Society": ": Tieflings on the Material Plane rarely create their own settlements and holdings. Instead, they live on the fringes of the land where they were born or choose to settle. Most societies view tieflings as aberrations or curses, but in cultures where there are frequent interactions with summoned fiends, and especially where the worship of demons, devils, or other evil outsiders is legal or obligatory, tieflings might be much more populous and accepted, even cherished as blessings of their fiendish overlords.",
      "Relations": ": Tieflings face a significant amount of prejudice from most other races, who view them as fiend-spawn, seeds of evil, monsters, and lingering curses placed upon the world. Far too often, civilized races shun or marginalize them, while more monstrous ones simply fear and reject them unless forced or cowed into acceptance. But half-elves, Half-Orcs, fetchlings and—most oddly—aasimars tend to view them as kindred spirits who are too often rejected or who don't fit into most societies by virtue of their birth. The widespread assumption that tieflings are innately evil—ill-founded though it may be—prevents many from easily fitting into most cultures on the Material Plane except in exceedingly cosmopolitan or planar-influenced nations.",
      "Alignment and Religion": ": Despite their fiendish heritage and the insidious influence of prejudice, tieflings can be of any alignment. Many of them fall prey to the dark desires that haunt their psyches, and give in to the seduction of the whispering evil within, yet others steadfastly reject their origins and actively fight against evil lures and the negative assumptions they face from others by performing acts of good. Most, however, strive to simply find their own way in the world, though they tend to adopt a very amoral, neutral view when they do. Though many creatures just assume that tieflings worship devils and demons, their religious views are as varied as their physical forms. Individual tieflings worship all manner of deities, but they are just as likely to shun religion all together. Those who give in to the dark whispers that haunt the psyche of all tieflings serve all manner of powerful fiends.",
      "Adventurers": ": Tieflings rarely integrate into the mortal societies they call home. Drawn to the adventuring life as a method of escape, they hope to make a better life for themselves, to prove their freedom from their blood's taint, or to punish a world that fears and rejects them. Tieflings make skilled rogues, powerful wizards and magi, and especially puissant sorcerers as their potent blood empowers them. Those who succumb to the evil within often become powerful clerics of fiendish powers.",
      "Male Names": ": Baru, Dellisar, Maldrek, Molos, Sarvin, Shoremoth, Temerith, Voren, Zoren.",
      "Female Names": ": Allizsah, Indranna, Kasidra, Kilarra, Mellisan, Mordren, Nisha.",
      "+2 Dexterity, +2 Intelligence, –2 Charisma": ": Tieflings are quick in body and mind, but are inherently unnerving. Tieflings of specific bloodlines (see below) gain different ability score modifiers as indicated.",
      "Native Outsider": ": Tieflings are outsiders with the native subtype.",
      "Medium": ": Tieflings are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Tieflings have a base speed of 30 feet.",
      "Darkvision": ": Tieflings see in the dark for up to 60 feet.",
      "Skilled": ": Tieflings gain a +2 racial bonus on Bluff and Stealth checks. Tieflings of specific bloodlines (see below) gain a +2 bonus on different skill checks as indicated.",
      "Spell-Like Ability": ": Tieflings can use darkness once per day as a spell-like ability (with a caster level equal to the tiefling's character level). Tieflings of specific bloodlines (see below) gain different spell-like abilities.",
      "Fiendish Resistance": ": Tieflings have cold resistance 5, electricity resistance 5, and fire resistance 5.",
      "Fiendish Sorcery": ": Tiefling sorcerers with the Abyssal or Infernal bloodlines treat their Charisma scores as 2 points higher for the purposes of all sorcerer class abilities.",
      "Languages": ": Tieflings begin play speaking Common and either Abyssal or Infernal. Tieflings with high intelligence scores can choose from the following languages: Abyssal, Draconic, Dwarven, Elven, Gnome, Goblin, Halfling, Infernal, and Orc.Blood of Fiends pg. 19",
      "Ancestry": "Rakshasa",
      "Typical Alignment": "LE",
      "Ability Modifiers": "+2 Dex, +2 Cha, –2 Wis",
      "Alternate Skill Modifiers": "Disguise, Sense Motive",
      "Alternate Spell-Like Ability": "Beastbrood gainas a spell-like ability.",
      "Alternate Skill": "Modifiers Intimidate, Knowledge (religion)",
      "Alchemist": ": Add +1/2 to the alchemist's bomb damage.",
      "Cleric": ": Add a +1 bonus on caster level checks made to overcome the spell resistance of outsiders.",
      "Druid": ": Add a +1 bonus on wild empathy checks made to improve the attitude of fiendish animals.",
      "Inquisitor": ": Add a +1/2 bonus on Intimidate checks and Knowledge checks to identify creatures.",
      "Magus": ": Add +1/4 point to the magus's arcane pool.",
      "Paladin": ": Add +1 to the amount of damage the paladin heals with lay on hands, but only when the paladin uses that ability on herself.",
      "Rogue": ": Add +1/2 to sneak attack damage dealt to creatures with the outsider type.",
      "Shifter": ": Add a +1 bonus on wild empathy checks to improve the attitude of fiendish creatures.",
      "Sorcerer": ": Add +1/2 to the number of times per day a sorcerer can use the corrupting touch infernal bloodline power, or +1 to the total number of rounds per day the sorcerer can use the claws abyssal bloodline power. The sorcerer must possess the applicable power to select these bonuses.",
      "Summoner": ": Add +1 hit point or +1 skill rank to the summoner's eidolon.",
      "Witch": ": The witch's familiar gains resistance 1 against cold, electricity, or fire. Each time the witch selects this reward, increase the familiar's resistance to one of these energy types by 1 (maximum 5 for any one type). If the witch ever replaces her familiar, the new familiar has these resistances.",
      "Wizard": ": Select one arcane school power at 1st level that is normally usable a number of times per day equal to 3 + the wizard's Intelligence modifier. The wizard adds +1/2 to the number of uses per day of that arcane school power.Blood of Fiends pg. 31",
      "Subraces": {
        "Non-Human Tieflings": [
          "It should be noted that while any monster or animal that breeds with a fiend may give birth to half-fiend offspring, only humanoids may give birth to tieflings. Thus, while it’s possible to encounter a half-fiend dragon, bear, or otyugh, any children of such creatures would be either half-fiends or normal members of their race. (And just as often, these less conventional half-fiends are simply sterile.) When discussing half-fiends and tieflings, it’s important to distinguish them from both true fiends (devils, demons, etc.) and simple fiendish creatures (creatures with the fiendish template, which are themselves denizens of the evil Outer Planes but similar in many ways to their Material Plane counterparts).In game terms, the difference between non-human tieflings and human tieflings is purely a matter of size. Unless they have specific tiefling-related size modifiers, the tieflings of each of these races are the same size as their non-fiendish ancestors. They gain any of the bonuses or penalties related to that size, but gain no racial bonuses except those of the tiefling; beyond size, their humanoid ancestry is purely cosmetic."
        ],
        "Asura-Spawn (Faultspawn)": [
          "Lacking any sense of empathy or pity, faultspawn often abhor all ways of life but their own. They inflict severe emotional and physical pain on others, and never stop picking at the resulting psychological scars.AsuraLE+2 Dex, +2 Wis, –2 IntAppraise, Knowledge (local)Faultspawn gainas a spell-like ability."
        ],
        "Daemon-Spawn (Grimspawn)": [
          "Dreary and pessimistic, grimspawn are so enthralled by death, disease, and dilapidation that they often dedicate themselves to ending lives from behind the scenes as macabre saboteurs.DaemonNE+2 Dex, +2 Int, –2 WisDisable Device, Sleight of HandGrimspawn gainas a spell-like ability."
        ],
        "Demodand-Spawn (Foulspawn)": [
          "Crude and boorish, foulspawn take a particular delight in giving offense and scandalizing polite society. They enjoy violating taboos even more than breaking laws, especially if it means degrading or repulsing an innocent.DemodandCE+2 Con, +2 Wis, –2 IntModifiers Intimidate, Knowledge (religion)Foulspawn gainas a spell-like ability."
        ],
        "Demon-Spawn (Pitborn)": [
          "Pitborn delight in destruction, especially while unleashing their havoc on what others consider valuable or precious. Perhaps because of this volatility, others tend to simply defer to pitborn, an act that often grants them the dominance they crave.DemonCE+2 Str, +2 Cha, –2 IntDisable Device, PerceptionPitborn gainas a spell-like ability."
        ],
        "Devil-Spawn (Hellspawn)": [
          "While often rigid, stubborn, and highly focused on sticking to plans and schedules, hellspawn also have a rare talent for penetrating others’ facades. They know a lie when they hear one, and can often determine what hidden vice or secret shame motivates another.DevilLE+2 Con, +2 Wis, –2 ChaDiplomacy, Sense MotiveHellspawn gainas a spell-like ability."
        ],
        "Div-Spawn (Spitespawn)": [
          "An innate sense of jealousy and pure malice drives spitespawn to spread misery and despair. Unable to experience joy themselves, they devote their lives to promoting gloom, all the while hiding the hatefulness that lurks at their core.DivNE+2 Dex, +2 Cha, –2 IntDiplomacy, LinguisticsSpitespawn gainas a spell-like ability."
        ],
        "Kyton-Spawn (Shackleborn)": [
          "Shackleborn are fascinated by mutilation and torture. Though they prefer to practice their cruel art on others, they accept that sometimes the wheel must turn and greet their own moments of anguish and confinement with an odd serenity.KytonLE+2 Con, +2 Cha, –2 WisEscape Artist, IntimidateShackleborn gainas a spell-like ability."
        ],
        "Oni-Spawn (Hungerseed)": [
          "Endowed with brawny muscles and thick bones, hungerseed always seem poised to explode into some larger, more powerful form, and have a voracious appetite for sensory pleasures and carnal delights.OniLE+2 Str, +2 Wis, –2 ChaDisguise, IntimidateHungerseed gainas a spell-like ability."
        ],
        "Qlippoth-Spawn (the Motherless)": [
          "No woman survives the birth of a babe whose qlippoth ancestry has emerged. At best, qlippoth-spawn rip their mothers apart during labor. At worst, they tear themselves out even earlier.QlippothCE+2 Str, +2 Wis, –2 IntEscape Artist, SurvivalThe motherless gainas a spell-like ability."
        ],
        "Rakshasa-Spawn (Beastbrood)": [
          "Beastbrood regard themselves as deserving of appreciation and opulence. Through deceit and sheer willpower, they often achieve privileged stations in society.RakshasaLE+2 Dex, +2 Cha, –2 WisDisguise, Sense MotiveBeastbrood gainas a spell-like ability."
        ]
      }
    }
  },



  {
    "Wayang": {
      "Source": "Blood of Shadows pg. 10",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Intelligence, –2 Wisdom": ": Wayangs are nimble and cagey, but their perception of the world is clouded by shadows.",
      "Wayang": ": Wayangs are humanoids with the wayang subtype.",
      "Small": ": Wayangs are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Wayangs have a base speed of 20 feet.",
      "Darkvision": ": Wayangs can see in the dark up to 60 feet.",
      "Light and Dark": ": Once per day as an immediate action, a wayang can treat positive and negative energy effects as if she were an undead creature, taking damage from positive energy and being healed of damage by negative energy. This ability lasts for 1 minute once activated.",
      "Lurker": ": Wayangs gain a +2 racial bonus on Perception and Stealth checks.",
      "Shadow Magic": ": Wayangs add 1 to the DC of any saving throws to resist spells of the shadow subschool that they cast. Wayangs with a Charisma score of 11 or higher also gain the following spell-like abilities: 1/day—,, and. The caster level for these effects is equal to the wayang's character level. The DCs of these spells are equal to 10 + the spell's level + the wayang's Charisma modifier.",
      "Shadow Resistance": ": Wayangs get a +2 racial bonus on saving throws against spells of the shadow subschool.",
      "Languages": ": Wayangs begin play speaking Common and Wayang. Wayangs with high Intelligence scores can choose from the following languages: any human language, Abyssal, Aklo, Draconic, Goblin, Infernal, Nagaji, Samsaran, and Tengu.",
      "Barbarian": ": Add a +1/4 bonus to weapon damage rolls that the barbarian makes against opponents that are within dim light or darkness.",
      "Bard": ": Add one spell known from the wizard's illusion school spell list. This spell must be at least one level below the highest spell level the bard can cast. The spell is treated as being one level higher, unless it is also on the bard spell list.",
      "Cleric": ": Add a +1/2 bonus to damage rolls the cleric makes when using channel energy and casting spells that deal negative energy damage or positive energy damage, including cure and inflict spells. This bonus does not apply to healing via negative energy effects or positive energy effects.",
      "Druid": ": Select one domain power granted at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds +1/2 to the number of uses per day of that domain power. In addition, a druid that selects this bonus at 1st level can choose the Darkness domain with her natural bond ability.",
      "Fighter": ": Add a +1/4 bonus on Stealth checks and on weapon damage rolls against flat-footed opponents.",
      "Kineticist": ": Add 1/4 to the save DC of the kineticist's void infusions and wild talents .",
      "Medium": ": When gaining a taboo, the medium can use spirit surge without incurring influence an additional 1/4 time per day.",
      "Monk": ": Add 1/6 to the monk's AC bonus.",
      "Oracle": ": Add one spell known from the wizard's illusion school spell list. This spell must be at least one level below the highest spell level the oracle can cast. That spell is treated as one level higher unless it is also on the oracle spell list.",
      "Paladin": ": Add 1/3 hit point to the paladin's channel energy and lay on hands abilities (whether using it to heal or harm).",
      "Ranger": ": Gain 1/6 of an additional favored terrain. Gaining a favored terrain in this manner does not increase the bonuses provided by his other favored terrains.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Shaman": ": Add one spell from the sorcerer/wizard spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast and be of the illusion (shadow) subschool or have the darkness descriptor.",
      "Slayer": ": Add 1/4 to the studied target bonus on Bluff and Perception checks. When the slayer gains the stalker class feature, he also adds this amount to the studied target bonus on Stealth checks.",
      "Sorcerer": ": Add +1/2 point of damage to any illusion spells of the shadow subschool cast by the sorcerer.",
      "Spiritualist": ": Add 1/4 to the number of rounds that the spiritualist's incorporeal phantom can be out of sight and line of effect before being sent back to the Ethereal Plane.",
      "Summoner": ": Add +1 skill rank to the summoner's eidolon.",
      "Witch": ": Add one spell from the sorcerer/wizard spell list that isn't on the witch spell list to the list of spells the witch knows. This spell must be at least 1 level below the highest spell level the witch can cast and be of the illusion (shadow) subschool or have the darkness descriptor.",
      "Wizard": ": Add one spell from the wizard spell list to the wizard's spellbook. The spell must be an illusion spell of the shadow subschool or have the darkness descriptor."
    }
  }
]