// Syrinx 
"Syrinx": {
    "age": [18, "5d6"],
    "height": [60, "2d10"],
    "weight": [95, "3d31"],
    "size": "Medium",
    "speed": 30,
    "traits": ["Darkvision", "Air Affinity","Spell-Like Abilities","5 Electric Resistance"],
    "languages": ["Auran", "Common"],
    "ability scores": {
        "Dexterity": "-2",
        "Wisdom": "+2"
    }
}


{
    "Syrinx": {
      "Source": "Inner Sea Races pg. 216",
      "Monster Entry": "Link",
      "+2 Wisdom, –2 Dexterity": ": Syrinxes are contemplative and patient, traits that make them somewhat slow to act.",
      "Normal Speed": ": Syrinxes have a base speed of 30 feet.",
      "Flight": ": Syrinxes have a fly speed of 60 feet with average maneuverability.",
      "Low-Light Vision": ": Syrinxes can see twice as far as humans in conditions of dim light.",
      "Darkvision": ": Syrinxes can see in the dark up to 60 feet.",
      "Nocturnal": ": Syrinxes gain a +2 racial bonus on Perception and Stealth checks at night.",
      "Pride": ": Syrinxes receive a +2 racial bonus on saving throws against mind-affecting effects.",
      "Speak with Avians": ": Syrinxes can speak with all birds of the animal creature type and birdlike magical beasts (such as phoenixes and thunderbirds).",
      "Languages": ": Syrinxes begin play speaking Syrinx. Syrinxes with high Intelligence scores can choose from the following: Auran, Azlant, Celestial, Strix, and Infernal."
    }
  },


//   Triaxian

{
    "Triaxian": {
      "Source": "Inner Sea Races pg. 217",
      "Monster Entry": "Link",
      "+2 Constitution, +2 Wisdom, –2 Strength": ": Triaxians are a hardy and wily, but also somewhat weak.",
      "Low-Light Vision": ": In dim light, Triaxians can see twice as far as humans.",
      "Keen Senses": ": Triaxians' unique ear construction grants them a +2 bonus on Perception checks.",
      "Bonus Feat": ": Triaxians select one extra feat at 1st level.",
      "Seasoned": ": Summerborn Triaxians can exist comfortably in conditions between 90 and 140 degrees Fahrenheit without having to attempt Fortitude saves. Winterborn Triaxians can exist comfortably in conditions between 40 and –20 degrees Fahrenheit without having to attempt Fortitude saves. When in conditions of severe cold or heat, Triaxians have to attempt Fortitude saves only once per hour instead of once every 10 minutes. Transitional Triaxians do not have this ability.",
      "Languages": ": Triaxians speak Triaxian (the common trade language of Triaxus). Triaxians with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."
    }
  },

//   Triton
  {
    "Triton": {
      "Source": "Blood of the Sea pg. 14",
      "Monster Entry": "Link",
      "Triton Adventurers": ": Upon reaching maturity, tritons typically embark on a journey of a year or longer, exploring their region and researching the threats within it. Tritons consider this experience important for personal development and preparation for service to their community, and in some cases, the journey is a prerequisite to joining an organized military group. Tritons may work together with other travelers they meet along the way, and they eagerly summon allies from the sea with theirspell-like ability when needed, but they refuse aid from their home—part of the purpose of their journey is to learn to get along without relying on the strong bonds of familyhood and friendship which they have always drawn on for support.",
      "+2 Strength, +2 Charisma, –2 Dexterity": ": Tritons are strong and have forceful personalities, but they are not very nimble.",
      "Outsider": ": Tritons are native outsiders with the water subtype.",
      "Medium": ": Tritons are Medium creatures and have no bonuses or penalties due to their size.",
      "Darkvision": ": Tritons have darkvision with a range of 60 feet.",
      "Low-Light Vision": ": Tritons have low-light vision.",
      "Natural Armor": ": Tritons have a +2 natural armor bonus.",
      "Slow Speed": ": Tritons are ungainly out of the water and have a base speed of only 5 feet.",
      "Swim Speed": ": Tritons have a swim speed of 40 feet.",
      "Spell-Like Ability": ": Tritons can castonce per day to summon either a Small water elemental or 1d3 dolphins only.",
      "Languages": ": Tritons begin play speaking Aquan and Common. Tritons with a high Intelligence score can choose from the following: Aboleth, Aklo, Celestial, Draconic, Elven, Gnome, and Sylvan."
    }
  },

//   Trox
  {
    "Trox": {
      "Source": "Inner Sea Races pg. 217",
      "Monster Entry": "Link",
      "+6 Strength, –2 Intelligence, –2 Wisdom, –2 Charisma": ": Trox are very strong, but they can be dim, unreceptive, and inhospitable.",
      "Monstrous Humanoid": ": Trox are monstrous humanoids.",
      "Normal Speed": ": Trox have a base speed of 30 feet.",
      "Large": ": Trox are Large and take a –1 size penalty to their AC, take a –4 size penalty on Stealth checks, and gain a +1 size bonus on combat maneuver checks and to combat maneuver defense.",
      "Darkvision": ": Trox can see in the dark up to 60 feet.",
      "Burrow": ": Trox have a burrow speed of 20 feet.",
      "Frenzy": ": Once per day when a trox takes damage, it flies into a frenzy for 1 minute, gaining a +2 racial bonus to Constitution and Strength, but a –2 penalty to their AC.",
      "Grabbing Appendages": ": A trox's smaller arms are useful for little more than aiding it with grappling. Trox gain Improved Grapple as a bonus feat, and can maintain a grapple and still make attacks with their main arms.",
      "Languages": ": Trox begin play speaking Terran. A trox with a high Intelligence score can choose from the following: Common, Dwarven, Giant, Orc, and Undercommon."
    }
  },



// Wyrwood
  ,
  {
    "Wyrwood": {
      "Source": "Heroes of Golarion pg. 6",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Intelligence, –2 Charisma": ": Wyrwoods are quick and calculating. As constructs, wyrwoods do not have a Constitution score.",
      "Construct": ": Wyrwoods have the construct type.",
      "Normal Speed": ": Wyrwoods have a base speed of 30 feet.",
      "Small": ": Wyrwoods are Small creatures and gain a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, a +2 bonus on Fly checks, and a +4 size bonus on Stealth checks.",
      "Darkvision": ": Wyrwoods can see in the dark up to 60 feet.",
      "Low-Light Vision": ": Wyrwoods have low-light vision.",
      "Languages": ": Wyrwoods speak Common. A wyrwood with a high Intelligence score can choose from the following: Draconic, Dwarven, Elven, Gnome, Goblin, and Orc.",
      "Alchemist": ": Reduce the mental ability score penalty of the alchemist's mutagens by 1/5 (minimum 0).",
      "Arcanist": ": Add 1/4 to the arcanist's level for the spell resistance exploit.",
      "Cleric": ": Add 1/4 to the cleric's caster level when casting spells or using abilities from the Law domain or one of its subdomains, or when casting spells with the lawful descriptor.",
      "Magus": ": Add 2 rounds to the duration of the magus' arcane pool enhancements.",
      "Oracle": ": Add one spell known from the wizard's evocation school spell list. This spell must be at least 1 level below the highest-level spell the oracle can cast. That spell is treated as 1 level higher unless it is also on the oracle spell list.",
      "Paladin": ": The paladin gains 1/4 of a bonus spell per day of the highest-level spell that the paladin can cast.",
      "Psychic": ": psychic gains 1/6 of a phrenic amplification.",
      "Rogue": ": The rogue gains 1/6 of a rogue talent.",
      "Slayer": ": The slayer gains 1/6 of a slayer talent.",
      "Wizard": ": The wizard gains 1/6 of a bonusitem creation,metamagic, or spell mastery feat."
    }
  },

//   Wyvaran
  {
    "Wyvaran": {
      "Source": "Legacy of Dragons pg. 18",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Wisdom, –2 Intelligence": ": Wyvarans have a reptilian grace and a strong will, but are a little dim-witted.",
      "Dragon": ": Wyvarans have the dragon type.",
      "Medium": ": Wyvarans are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Wyvarans have a base speed of 30 feet.",
      "Flight": ": Wyvarans have dragonlike wings that grant them a fly speed of 30 feet with clumsy maneuverability.",
      "Slapping Tail": ": Wyvarans have a tail attack they can use only when making attacks of opportunity. This slapping tail attack deals a number of points of damage equal to 1d8 + the wyvaran's Strength modifier.",
      "Darkvision": ": Wyvarans can see in the dark up to 60 feet.",
      "Low-Light Vision": ": Wyvarans have low-light vision.",
      "Languages": ": Wyvarans speak Common and Draconic. A wyvaran with a high Intelligence score can choose from the following: Dwarven, Elven, Gnome, Goblin, and Orc.",
      "Bloodrager": ": Add 1 to the bloodrager's total rounds of bloodrage each day.",
      "Mesmerist": ": Add 1/4 to the mesmerist's level for the purpose of determining the effect of mesmerist tricks.",
      "Oracle": ": Add 1/4 to the oracle's level for the purpose of determining the effects of an oracle curse.",
      "Paladin": ": Add 1/2 to the paladin's level when determining the effect of smite evil against evil-aligned dragons.",
      "Rogue": ": Add a +1/2 bonus to Stealth and Sleight of Hand checks to steal or hide objects.",
      "Sorcerer": ": Add a +1/2 bonus to the damage of spells or spell-like abilities that deal damage of the same energy type as the sorcerer's draconic bloodline breath weapon."
    }
  },

//   Yaddithian
  {
    "Yaddithian": {
      "Source": "Bestiary 6 pg. 285",
      "Monster Entry": "Link",
      "Slow": ": Yaddithians have a land speed of 20 feet.",
      "Darkvision": ": Yaddithians can see in the dark up to 60 feet.",
      "Defensive Abilities": ": Yaddithians have cold resistance 5 and theno breathability.",
      "Claws": ": A Yaddithian has two claws that deal 1d4 points of damage each.",
      "Rugose": ": A Yaddithian gains a +1 natural armor bonus.",
      "Cosmic Mind (Ex)": "A Yaddithian gets a +2 racial bonus on Knowledge and Spellcraft checks. A yaddithian spellcaster who would store spells in a spellbook or familiar instead stores those spells in its mind (but must expend the normal resources to learn new spells).",
      "Long-Lived (Ex)": "Yaddithians live for thousands of years; they gain no benefit or penalty from aging and are immune to magical aging effects.",
      "Languages": ": Yaddithians begin play speaking Yaddithian. Those with high Intelligence scores can choose any language as a bonus language."
    }
  }


// Vishkanya

{
    "Vishkanya": {
      "Source": "Advanced Race Guide pg. 208",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Charisma, –2 Wisdom": ": Vishkanyas are graceful but often irrational.",
      "Vishkanya": ": Vishkanyas are humanoids with the vishkanya subtype.",
      "Medium": ": Vishkanyas are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Vishkanyas have a base speed of 30 feet.",
      "Low-Light Vision": ": Vishkanyas can see twice as far as humans in conditions of dim light.",
      "Keen Senses": ": Vishkanyas receive a +2 racial bonus on Perception checks.",
      "Limber": ": Vishkanyas receive a +2 racial bonus on Escape Artist and Stealth checks.",
      "Poison Resistance": ": A vishkanya has a racial bonus on saving throws against poison equal to its Hit Dice.",
      "Poison Use": ": Vishkanyas are skilled in the use of poison and never accidentally poison themselves when using or applying poison.",
      "Toxic": ": A number of times per day equal to his Constitution modifier (minimum 1/day), a vishkanya can envenom a weapon that he wields with his toxic saliva or blood (using blood requires the vishkanya to be injured when he uses this ability). Applying venom in this way is a swift action.",
      "Weapon Familiarity": ": Vishkanyas are always proficient with blowguns, kukri, and shuriken.",
      "Languages": ": Vishkanyas begin play speaking Common and Vishkanya. Vishkanyas with high Intelligence scores can choose from the following languages: Aklo, Draconic, Elven, Goblin, Sylvan, and Undercommon.",
      "Bard": ": Add +1 to the bard's total number of bardic performance rounds per day.",
      "Rogue": ": Add +1 to the rogue's CMD when resisting a grapple or reposition attempt.",
      "Sorcerer": ": Select one bloodline power at 1st level that is normally usable a number of times per day equal to 3 + the sorcerer's Charisma modifier. The sorcerer adds +1/2 to the number of uses per day of that bloodline power."
    }
  },


// vanara

  {
    "Vanara": {
      "Source": "Advanced Race Guide pg. 206",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Wisdom, –2 Charisma": ": Vanaras are agile and perceptive, but are also rather impish and mischievous.",
      "Vanara": ": Vanaras are humanoids with the vanara subtype.",
      "Medium": ": Vanaras are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Vanaras have a base speed of 30 feet and a Climb speed of 20 feet.",
      "Low-Light Vision": ": A vanara can see twice as far as a human in dim light.",
      "Nimble": ": Vanaras have a +2 racial bonus on Acrobatics and Stealth checks.",
      "Prehensile Tail": ": A vanara has a long, flexible tail that she can use to carry objects. She cannot wield weapons with her tail, but the tail allows her to retrieve a small, stowed object carried on her person as a swift action.",
      "Languages": ": Vanaras begin play speaking Common and Vanaran. Vanaras with high Intelligence scores can choose from the following languages: Aklo, Celestial, Elven, Gnome, Goblin, and Sylvan.",
      "Alchemist": ": Add +1/2 to the alchemist's bomb damage.",
      "Arcanist": ": Add 1/4 to the arcanist's effective class level when determining the effects of any two arcanist exploits that the arcanist has.",
      "Bard": ": Add 1/2 to the bard's bardic Knowledge bonus.",
      "Brawler": ": Gain 1/5 of a new Fleet feat.",
      "Cavalier": ": Add 1/2 to the cavalier's level when determining the duration of the tactician ability.",
      "Druid": ": Add a +1/2 bonus on wild empathy checks and a +1/2 bonus on Handle Animal skill checks.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a reposition or trip attempt.",
      "Hunter": ": Add 1 minute to the number of minutes per day that the hunter can use animal focus.",
      "Kineticist": ": Add 1/3 to the total number of points of burn that the kineticist can accept before she can't choose to accept additional points of burn.",
      "Monk": ": Add a +1 bonus on Acrobatics checks made to jump.",
      "Occultist": ": Gain 1/6 of a new focus power.",
      "Psychic": ": When casting psychic divination spells, the psychic adds 1/2 to the effective caster level of the spell, but only to determine the spell's range and its d% chance to provide correct or meaningful information (such as with augury or divination).",
      "Ranger": ": Add +1/4 dodge bonus to Armor Class against the ranger's favored enemies.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Shaman": ": Add one spell from the cleric spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest level the shaman can cast.",
      "Shifter": ": Add a +1/2 bonus on Acrobatics checks to jump and a +1/2 bonus on wild empathy checks.",
      "Summoner": ": Add 1/4 to the eidolon's evolution pool.",
      "Witch": ": Add 1/4 to the witch's caster level when determining the effects of spells granted to her by her patron (to a maximum of +2).",
      "Wizard": ": 1/6 of a bonus feat. This feat must be an item creation feat, a metamagic feat, or Spell Mastery."
    }
  },

// vine leshy
  {
    "Vine Leshy": {
      "Source": "Ultimate Wilderness pg. 21",
      "Physical Description": ": A vine leshy's body is made of masses of twisted vines and leaves, sometimes incorporating flowers and fruits as well. Their appearance is mostly determined by the species of vine used in their creation, but most have a large cluster of leaves that forms a face with round eyes, a small mouth, and no visible nose.",
      "Society": ": Because of their ritual-based genesis, vine leshys do not have a traditional family structure. They form strong friendships with those who accompany them on explorations or who assist them in protecting a natural site. Unlike most leshys, vine leshys usually feel a strong desire to seek out the one who created them. They see their creators as friends and allies rather than as parents.",
      "Relations": ": Vine leshys are interested in learning about the cultures of many other races. Their initial attitudes when they encounter new races are based on biases from the nature spirit's past incarnations, but they evolve over time through the leshy's experiences. In unfamiliar situations, vine leshys prefer to blend in with vegetation to observe before venturing out and introducing themselves.",
      "Alignment and Religion": ": Vine leshys see themselves as part of the ancient cycle of nature. They care for their friends and any natural areas under their care, but rarely feel compelled toward either charity or malice. Most vine leshys are truly neutral, and they almost always have at least one neutral aspect to their alignments. Religion is not particularly important to vine leshys. Those who do find faith tend toward worship of Gozreh, a green man , or one of the Eldest of the First World (see page 130), but the Green Faith is the most common philosophy followed by vine leshys.",
      "Adventurers": ": Like most leshys, vine leshys typically do not fear death. They know that if their bodies die, their spirits will return to the natural world and may someday find themselves in new bodies. This lack of fear combined with their curiosity leads them to take risks. However, they typically avoid excessively dangerous activities, as they would rather gather a story from their adventures to tell later. Vine leshys gravitate toward classes that let them use their connection to nature, such as druid and ranger.",
      "Names": ": Vine leshys' names change throughout their lives. A young vine leshy typically names herself after her physical characteristics or a natural feature that she particularly enjoys. As vine leshys age, they modify their names to better reflect their personality and experiences. A leshy may even have several names that she cycles among, such as one name for each season. Most vine leshys select names that are at least two words long. Example vine leshy names include Burbling Waterfall, Lovely Triple Leaves, Masterful Sun Drinker, Snowy Pine Branches, Verdant Taleweaver, and Vibrant Tree Climber.Vine leshys grow best in areas where they can receive ample sunlight. After a vine leshy sprouts, the leshy's creator must use a sturdy tree, trellis, or other support to guide it as it grows. For more information about growing leshys, see page 176 of5th;1,500 gpKnowledge (nature) 5 ranks,,,;Knowledge (nature) DC 13;750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "CL": "5th;1,500 gpKnowledge (nature) 5 ranks,,,;Knowledge (nature) DC 13;750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "Price": "1,500 gpKnowledge (nature) 5 ranks,,,;Knowledge (nature) DC 13;750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "Requirements": "Knowledge (nature) 5 ranks,,,;Knowledge (nature) DC 13;750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "Skill": "Knowledge (nature) DC 13;750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "Cost": "750 gp: Vine leshys are hardy and insightful, but sometimes forgetful.",
      "+2 Constitution, +2 Wisdom, –2 Intelligence": ": Vine leshys are hardy and insightful, but sometimes forgetful.",
      "Leshy": ": Vine leshys are plants with the leshy subtype but lack the immunities to mind-affecting effects, paralysis, poison, polymorph, sleep, and stunning that the plant type usually grants, and they lack the immunity to electricity and sonic that the leshy subtype usually grants.",
      "Small": ": Vine leshys are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Vine leshys have a base speed of 20 feet.",
      "Darkvision": ": Vine leshys can see in the dark up to 60 feet.",
      "Low-Light Vision": ": Vine leshys can see twice as far as humans under conditions of dim light.",
      "Pass without Trace": ": Vine leshys haveas a constant spell-like ability (caster level 2nd).",
      "Change Shape": ": Vine leshys can transform into vines, with results similar to. In this form, the leshy appears as a particularly healthy Small vine. The leshy can assume plant form or revert to its true form as a swift action.",
      "Plantspeech": ": Vine leshys can speak with vines as if subject to a continualspell.",
      "Verdant Burst": ": When slain, a vine leshy explodes in a burst of fertile energies. All plant creatures within 30 feet of the slain leshy regain hit 1d8 points, and vines quickly infest the area. If the terrain can support vines, the undergrowth is dense enough to make the region into difficult terrain for 24 hours, after which the plant life diminishes to a normal level; otherwise, this plant life has no significant effect on movement and withers and dies within an hour.",
      "Unassuming Foliage": ": Vine leshys gain a +4 racial bonus on Stealth checks in forests.",
      "Climber": ": Vine leshys gain a +2 racial bonus on Climb checks.",
      "Languages": ": Vine leshys begin play speaking Common and Sylvan. Vine leshys with high Intelligence scores can choose from the following: Aquan, Auran, Aklo, Elven, Gnome, Goblin, Terran, or Undercommon.",
      "Alchemist": ": Add 1/4 to the alchemist's natural armor bonus when using his mutagen.",
      "Bard": ": Add a +1/3 bonus to Perform (oratory) checks, including checks using versatile performance, as long as the bard first spends at least 10 minutes telling a story.",
      "Druid": ": Add a +1/2 bonus to the druid's wild empathy or plant empathy checks.",
      "Kineticist": ": Gain 1/5 of the Extra Wild Talent feat. This feat must be spent on a wood-element talent.",
      "Oracle": ": An oracle with the nature or wood mystery adds one spell from the druid's spell list that isn't on the cleric spell list to the oracle's spell list; she still must select this spell as one of her spells known in order to cast it. This spell must be at least 1 level lower than the highest spell level the oracle can cast.",
      "Ranger": ": Add a +1/2 bonus to Knowledge (nature) checks in the ranger's favored terrain.",
      "Rogue": ": Add a +1/2 bonus to Climb checks and on Stealth checks in forests.",
      "Shaman": ": Shamans with the nature or wood spirit add one spell from the druid's spell list that isn't on the shaman spell list to the shaman's spell list; she still must select this spell as one of her spells known in order to cast it. This spell must be at least 1 level lower than the highest spell level the shaman can cast.",
      "Shifter": ": Add a +1 bonus on Knowledge (nature) checks relating to plants."
    }
  },


// Undine

  {
    "Undine": {
      "Source": "Advanced Race Guide pg. 175",
      "Monster Entry": "Link",
      "Physical Description": ": Undines display a wide variation of skin tones, ranging from pale turquoise to deep blue to sea green. An undine's straight, thick hair tends to be of a similar, yet slightly darker color than her skin. All have limpid blue eyes. Physically, undines most resemble humans, and their physiques show human diversity in regard to overall height and body type. Aside from their coloration, their most racially defining traits remain their fin-like ears and webbed hands and feet.",
      "Society": ": Undines define themselves as a unique race and are capable of producing undine offspring. While they remain able to interbreed with humans, they tend to keep to themselves, and form small, reclusive communities near bodies of water, or in some cases, floating settlements. A typical undine community lives under the guidance of a small council comprising officials appointed by consensus. Council positions can be held indefinitely, though a community unhappy with the performance of a council member can call for her resignation.",
      "Relations": ": Undines hold no biases or prejudices toward any particular races. Their communities rely primarily on trade, giving them ample opportunity to interact with a diverse range of outsiders and foreigners. They have no qualms about establishing neighborhoods within the settlements of other races, provided adequate respect is given to both the undines and any nearby bodies of water. Still, in such instances, a given undine community does what it can to retain its autonomy.",
      "Alignment and Religion": ": Most undines are neutral. Their principle interests lie in the welfare of their people, and thus their moral concerns focus upon the community and upon themselves. This neutral view also allows them to interact with a broad scope of non-undine races with whom they trade. While not deeply religious, undines possess a strong spiritual connection to both their supernatural ancestors and to water itself. Those who pursue nonsecular paths almost always worship the gods of their ancestors or gods whose portfolios feature some aspect of water.",
      "Adventurers": ": On occasion, an undine leaves her people to seek out a life of adventure. Like water itself, some undines simply feel compelled to move, and adventuring gives them an ample excuse for living on the road. Others adventure for less wholesome reasons, and exile is a common punishment for crimes within undine society. With few other options, most exiles turn to adventuring hoping to find a new place in the world. Undines' affinity toward water makes them particularly good druids, while undine sorcerers usually have aquatic bloodlines.",
      "Male Names": ": Aven, Dharak, Ghiv, Jamash, Maakor, Ondir, Radid, Shiradahz.",
      "Female Names": ": Afzara, Baarah, Calah, Iryani, Maarin, Nylgune, Pari, Radabeh, Urdahna.: Undines are perceptive and agile, but somewhat weak.",
      "+2 Dexterity, +2 Wisdom, –2 Strength": ": Undines are perceptive and agile, but somewhat weak.",
      "Native Outsider": ": Undines are outsiders with the native subtype.",
      "Medium": ": Undines are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Undines have a base speed of 30 feet on land. They also have a swim speed of 30 feet, can move in water without needing to attempt Swim checks, and always treat Swim as a class skill.",
      "Darkvision": ": Undines can see in the dark up to 60 feet.",
      "Spell-Like Ability": ": Undines can castonce per day as a spell-like ability (with a caster level equal to the undine's character level).",
      "Energy Resistance": ": Undines have cold resistance 5.",
      "Water Affinity": ": Undine sorcerers with the elemental (water) bloodline treat their Charisma scores as 2 points higher for the purposes of all sorcerer spells and class abilities. Undine clerics with the Water domain cast their Water domain powers and spells at +1 caster level.",
      "Languages": ": Undines begin play speaking Common and Aquan. Undines with high Intelligence scores can choose from the following languages: Auran, Dwarven, Elven, Gnome, Halfling, Ignan, and Terran.Plane-Hopper's Handbook pg. 21",
      "Typical Alignment": "LN",
      "Ability Modifiers": "+2 Dex, +2 Int, –2 Cha",
      "Alternate Spell-Like Ability": "Rimesouls gainchill touchas a spell-like ability.",
      "Mist Affinity": "This racial trait functions as and can be replaced as the base undine's water affinity, except it benefits sorcerers with the dreamspun bloodline and spellcasters with the Repose domain.",
      "Ice Affinity": "This racial trait functions as and can be replaced as the base undine's water affinity, except it benefits sorcerers with the boreal bloodline and spellcasters with the Ice subdomain.",
      "Bard": ": Add a +1 bonus on Perform checks to use the countersong bardic performance against creatures with the aquatic or water subtypes.",
      "Cleric": ": Add a +1 bonus on caster level checks to overcome the spell resistance of creatures with the aquatic or water subtype.",
      "Druid": ": Add a +1 bonus on wild empathy checks to influence animals and magical beasts with the aquatic subtype.",
      "Monk": ": Add +1 to the monk's CMD when resisting a grapple and +1/3 to the number of stunning attacks he can attempt per day.",
      "Shifter": ": Add a +1 bonus on wild empathy checks to influence animals and magical beasts with the aquatic subtype.",
      "Sorcerer": ": Add a +1 bonus on caster level checks to cast spells underwater.",
      "Summoner": ": If the summoner's eidolon has an aquatic base form , add +5 feet to the range of the summoner's life link ability.",
      "Wizard": ": Add one spell from the cleric, druid, or wizard spell list with the water descriptor to the wizard's spellbook. This spell must be at least one level below the highest spell level he can cast. This spell is treated as one level higher unless it also appears on the wizard spell list.",
      "Subraces": {
        "Mistsoul (Vapor Undine)": [
          "Soothing and insightful, mistsoul undines move through the world with airy resilience and earnest action.NG+2 Con, +2 Wis, –2 IntMistsouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base undine’s water affinity, except it benefits sorcerers with the dreamspun bloodline and spellcasters with the Repose domain.With gentle spirits and contemplative minds, mistsouls are drawn to the more mystic aspects of their element. Their ephemeral, vaporous natures can allow them to lull others into a dreamlike state, or facilitate a peaceful transition into the next life. They tend to seek out places where ideological and political struggles converge, and thus they are at home in communities like those of the common folk of Brevoy.Physically, mistsouls have rounded features and graceful deliberation in their movement. They prefer soft, highquality garments of neutral or earth tones and simple jewelry chosen for significance rather than expense."
        ],
        "Rimesoul (Frost Undine)": [
          "Rimesoul undines are distant and imperious, aloof in their intellect and hesitant to change their ways.LN+2 Dex, +2 Int, –2 ChaRimesouls gainas a spell-like ability.This racial trait functions as and can be replaced as the base undine’s water affinity, except it benefits sorcerers with the boreal bloodline and spellcasters with the Ice subdomain.Like their ice-coated ancestors, rimesouls represent the solidification of change. They have precise, ordered minds that take well to individual pursuits. Rimesouls often choose to live in sparsely populated areas in Irrisen and Varisia. When they do live in cities, they prefer areas of disciplined culture such as Druma and Cheliax.In appearance, rimesouls are frequently pale, sometimes with translucent or blue-tinged skin. Rimesouls usually dress in crisp, understated fashions that present an impression of austerity."
        ]
      }
    }
  },



// Strix

  {
    "Strix": {
      "Source": "Advanced Race Guide pg. 200",
      "Monster Entry": "Link",
      "+2 Dexterity, –2 Charisma": ": Strix are swift and elusive, but tend to be stubborn and swift to anger.",
      "Medium": ": Strix are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Strix have a base speed of 30 feet on land.",
      "Flight": ": Strix have a fly speed of 60 feet (average).",
      "Low-Light Vision": ": Strix can see twice as far as humans in conditions of dim light.",
      "Darkvision": ": Strix can see in the dark up to 60 feet.",
      "Hatred": ": Strix receive a +1 bonus on attack rolls against humanoid creatures of the human subtype because of their special training against these hated foes.",
      "Nocturnal": ": Strix gain a +2 racial bonus on Perception and Stealth checks in dim light or darkness.",
      "Suspicious": ": Strix receive a +2 racial bonus on saving throws against illusion spells or effects.",
      "Languages": ": Strix begin play speaking Strix. Those with high Intelligence scores can choose any of the following languages: Auran, Azlanti, Common, Draconic, Giant, Gnome, Goblin, and Infernal.",
      "Barbarian": ": Add +1 to the barbarian's total number of rage rounds per day.",
      "Bloodrager": ": Increase the bloodrager's total number of bloodrage rounds per day by 1.",
      "Brawler": ": Add 1/4 to the brawler's effective class level to determine her unarmed strike damage.",
      "Druid": ": Add a +1/2 bonus to Knowledge (nature) checks related to weather and flying animals.",
      "Fighter": ": Add +1/4 to the attack roll bonus from the strix's hatred racial trait.",
      "Hunter": ": Add 1 hit point to the hunter's animal companion. If the hunter replaces her animal companion, the new animal companion gains these bonus hit points.",
      "Monk": ": Add +1/4 point to the monk'spool.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least 1 level below the highest spell level the oracle can cast.",
      "Ranger": ": Add +1/2 round to the duration of the bonus granted to the companions of the ranger using his hunter's bond ability.",
      "Shaman": ": Add 1/2 to the shaman's effective class level for the purpose of determining her spirit animal's natural armor adjustment, Intelligence, and special abilities.",
      "Slayer": ": Increase the studied target bonus on Perception and Survival checks by 1/4. When the slayer gains the stalker class feature, the slayer also gains this increase to the studied target bonus on Stealth checks.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least 1 level below the highest spell level the witch can cast. If the witch ever replaces this familiar, the new familiar knows these bonus spells."
    }
  },

// Suli

  {
    "Suli": {
      "Source": "Inner Sea Races pg. 215",
      "Monster Entry": "Link",
      "+2 Strength, +2 Charisma, –2 Intelligence": ": Sulis are brawny and charming, but slow-witted.",
      "Native Outsider": ": Sulis are outsiders with the native subtype.",
      "Medium": ": Sulis are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Sulis have a base speed of 30 feet.",
      "Low-Light Vision": ": Sulis can see twice as far as humans in dim light.",
      "Negotiator": ": Sulis are keen negotiators, and gain a +2 racial bonus on Diplomacy and Sense Motive checks.",
      "Elemental Assault": ": Once per day as a swift action, a suli can shroud her arms in acid, cold, electricity, or fire. This effect lasts for 1 round per level and can be dismissed as a free action. Unarmed strikes with her arms or hands (or attacks with weapons held in those hands) deal +1d6 points of damage of the appropriate energy type.",
      "Energy Resistance": ": Sulis have resistance to acid 5, cold 5, electricity 5, and fire 5.",
      "Languages": ": Sulis begin play speaking Common and one elemental language (Aquan, Auran, Ignan, or Terran). Sulis with high Intelligence scores can choose from the following languages: Aquan, Auran, Draconic, Ignan, and Terran.",
      "Magus": ": Add +1/4 point to the magus's arcane pool.",
      "Monk": ": Add +1/2 point of damage to elemental assault.",
      "Ranger": ": Add +1 to acid resistance, cold resistance, electricity resistance, or fire resistance."
    }
  },

//   Svirfneblin
  {
    "Svirfneblin": {
      "Source": "Advanced Race Guide pg. 204",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Wisdom, –2 Strength, –4 Charisma": ": Svirfneblin are fast and observant but relatively weak and emotionally distant.",
      "Gnome": ": Svirfneblin are humanoids with the gnome subtype.",
      "Small": ": Svirfneblin are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Slow Speed": ": Svirfneblin have a base speed of 20 feet.",
      "Defensive Training": ": Svirfneblin gain a +2 dodge bonus to their AC.",
      "Senses": ": Svirfneblin have darkvision 120 feet and lowlight vision.",
      "Fortunate": ": Svirfneblin gain a +2 racial bonus on all saving throws.",
      "Skilled": ": Svirfneblin gain a +2 racial bonus on Stealth checks; this improves to a +4 bonus underground. They gain a +2 racial bonus on Craft (alchemy) checks and Perception checks.",
      "Hatred": ": Svirfneblin receive a +1 bonus on attack rolls against humanoid creatures of the reptilian and dwarven subtypes due to training against these hated foes.",
      "Stonecunning": ": Svirfneblin gain the stonecunning trait as dwarves.",
      "Spell Resistance": ": A svirfneblin has an amount of spell resistance equal to 11 + his character level.",
      "Svirfneblin Magic": ": Svirfneblin add 1 to the DCs of any saving throws to resist illusion spells they cast. Svirfneblin also gain the following spell-like abilities: constant—; 1/day—,,; caster level equals the svirfneblin's character level.",
      "Languages": ": Svirfneblin begin play speaking Gnome and Undercommon. Those with high Intelligence scores can choose from the following languages: Aklo, Common, Draconic, Dwarven, Elven, Giant, Goblin, Orc, and Terran.",
      "Alchemist": ": Add one extract formula from the alchemist's list to the alchemist's formula book. This formula must be at least one level below the highest formula level the alchemist can create.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast.",
      "Ranger": ": Add DR 1/magic to the ranger's animal companion. Each additional time the ranger selects this benefit, the DR/magic increases +1/2 (maximum DR 10/magic). If the ranger ever replaces his animal companion, the new companion gains this DR."
    }
  },


// Samsaran

  {
    "Samsaran": {
      "Source": "Advanced Race Guide pg. 198",
      "Monster Entry": "Link",
      "+2 Intelligence, +2 Wisdom, –2 Constitution": ": Samsarans are insightful and strong-minded, but with frail bodies.",
      "Samsaran": ": Samsarans are humanoids with the samsaran subtype.",
      "Medium": ": Samsarans are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Samsarans have a base speed of 30 feet.",
      "Low-Light Vision": ": Samsarans can see twice as far as humans in conditions of dim light.",
      "Lifebound": ": Samsarans gain a +2 racial bonus on all saving throws to resist death effects, saving throws against negative energy effects, Fortitude saves to remove negative levels, and Constitution checks to stabilize if reduced to negative hit points.",
      "Samsaran Magic": ": Samsarans with a Charisma score of 11 or higher gain the following spell-like abilities: 1/day—,deathwatch, andstabilize. The caster level for these effects equals the samsaran's character level.",
      "Shards of the Past": ": A samsaran's past lives grant her bonuses on two skills. The samsaran chooses two skills—she gains a +2 racial bonus on both, and they are always class skills for her. Once made, this choice can't be altered.",
      "Languages": ": Samsarans begin play speaking Common and Samsaran. Samsarans with high Intelligence scores can choose from the following languages: any human language, Abyssal, Aquan, Auran, Celestial, Draconic, Giant, Ignan, Infernal, Nagaji, Tengu, and Terran.",
      "Monk": ": Add a +1/2 bonus on the monk's saving throws to resist death attacks.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least one level below the highest spell level the oracle can cast.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Wizard": ": Add one spell from the wizard spell list to the wizard's spellbook. This spell must be at least one level below the highest spell level the wizard can cast."
    }
  },

//   Shabti
  {
    "Shabti": {
      "Source": "Plane-Hopper's Handbook pg. 23",
      "Monster Entry": "Link",
      "+2 Constitution, +2 Charisma": ": Shabti have powerful bodies and presences to match.",
      "Native Outsider": ": Shabti are outsiders with the native subtype.",
      "Medium": ": Add 1/5 to the bonus allies gain from shared seance. This doesn't increase the medium's seance boon.",
      "Darkvision": ": Shabti can see in the dark up to 60 feet.",
      "Immortal (Ex)": ": Shabti do not age naturally and can't die of old age. While some might come into being at age categories other than adulthood, they never leave their original age categories. Spells and effects that cause aging affect a shabti as normal.",
      "Immune to Undeath (Ex)": ": Shabti can't become undead. Spells and abilities that would transform a shabti into an undead creature have no effect.",
      "Past Life Knowledge (Ex)": ": Shabti remember bits of their past lives. As a result, they treat all Knowledge skills as class skills.",
      "Resist Level Drain (Ex)": ": A shabti takes no penalties from energy drain effects, though it can still be killed if it accrues more negative levels than it has Hit Dice. After 24 hours, any negative levels a shabti takes are automatically removed without the need for additional saving throws.",
      "Shattered Soul (Ex)": ": Shabti who are killed are exceptionally difficult to return to life. Anyone who attempts to return a shabti to life usingraise dead,resurrection, or a similar spell must succeed at a caster level check whose DC is equal to 10 + the shabti's Hit Dice. If it fails, the spell fails and the caster can't return the shabti to life for the next 24 hours (though the caster can try again after this period).",
      "Normal Speed": ": Shabti have a base speed of 30 feet.",
      "Spell-Like Ability": ": A shabti can usesuggestiononce per day as a spell-like ability, with a caster level equal to the shabti's class level.",
      "Languages": ": Shabti begin play speaking Common. Those with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic).",
      "Bard": ": Add 1/2 to the bard's bardic knowledge bonus.",
      "Bloodrager": ": Add 1/4 to the bloodrager's effective class level when determining the power of her bloodrager bloodline powers.",
      "Investigator": ": Add 1/6 rounds to the duration of the investigator's studied combat.",
      "Oracle": ": Add one spell from the psychic spell list that isn't on the cleric spell list to the list of spells the oracle knows. This spell must be at least 1 level below the highest spell level the oracle can cast.",
      "Paladin": ": Add 1/2 to the paladin's level when determining the effect of smite evil against incorporeal and ethereal creatures.",
      "Ranger": ": Add 1/4 to a single existing favored terrain bonus (maximum bonus +1 per favored terrain).",
      "Shaman": ": Add one spell from the psychic spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Skald": ": Add 1/2 to the skald's bardic knowledge bonus.",
      "Spiritualist": ": Add 1 foot to the limit of etheric tether. This includes how far the spiritualist's phantom can be before needing to concentrate and before the tether is broken."
    }
  },

//   Skinwalker
  {
    "Skinwalker": {
      "Source": "Inner Sea Races pg. 216",
      "Monster Entry": "Link",
      "Physical Description": ": Outwardly human, skinwalkers are virtually indistinguishable from others of the ethnic group into which they are born. Those rare skinwalkers who have bred true for generations tend to have dark eyes, straight dark hair, and richly colored skin. Skinwalkers' features vary greatly when they shapechange. They gain a bestial visage evoking the creatures they emulate; the snout elongates, teeth become more prominent, claws emerge from fingertips, and skin toughens into hide. Despite their shapechanging abilities, they are not immune to infection from full lycanthropes.",
      "Society": ": Skinwalkers sometimes weave themselves into other societies, hoping their peculiar talents go unnoticed. They may also be nomads found in lands with wide-open spaces. Groups of skinwalkers hidden among a larger community of non-skinwalkers may regularly gather for lunar rituals or nocturnal pack hunting.",
      "Relations": ": Skinwalkers mostly populate human settlements and communities. They tend to get along with catfolk, tengus, and members of other animal-like races (including lycanthropes), and are comfortable taking their animalistic forms in the company of these fellows. However, many natural lycanthropes see skinwalkers as weaker, inferior versions of their own kind, and some lycanthropes even take to infecting or even hunting their distant kin.",
      "Alignment and Religion": ": Skinwalkers tend toward neutral alignments, but may be of any. Many follow the Green Faith or venerate deities with close ties to nature and the animal world, as well as those connected with hunting, transformation, travel, and trickery.",
      "Adventurers": ": Often on the move, skinwalkers make for excellent adventurers. Once they become comfortable in a group, most skinwalkers come to see their adventuring allies as their pack or herd.",
      "Names": ": Skinwalkers born in human and humanoid societies share the naming conventions of the surrounding culture. Skinwalkers born in their own packs typically have names similar to their overarching ethnicities appended with flavorful, animal-inspired appellations such as Bearmaw, Wolftamer, Fangblood, or Owlmarked.: Skinwalkers are attuned to the natural order and value passion above reason. Their bestial forms strengthen their bodies in various ways.",
      "+2 Wisdom, –2 Intelligence, +2 to One Physical Ability Score While in Bestial Form": ": Skinwalkers are attuned to the natural order and value passion above reason. Their bestial forms strengthen their bodies in various ways.",
      "Medium": ": Skinwalkers are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Skinwalkers have a base speed of 30 feet.",
      "Low-Light Vision": ": Skinwalkers can see twice as far as humans can in dim light.",
      "Spell-Like Ability": ": A skinwalker with a Wisdom score of 11 or higher can usespeak with animalsonce per day as a spell-like ability, using his Wisdom modifier to determine his concentration checks. The caster level for this ability is equal to the skinwalker's character level.",
      "Animal-Minded": ": Skinwalkers have a +2 racial bonus on Handle Animal checks and on wild empathy checks.",
      "Change Shape (Su)": "A skinwalker can change shape to a bestial form as a standard action. In bestial form, a skinwalker gains a +2 racial bonus to his choice of Strength, Dexterity, or Constitution. While in this form, a skinwalker also takes on an animalistic feature that provides a special effect. Each time a skinwalker assumes bestial form, he can choose to gain two claw attacks that each deal 1d4 points of damage, 60 foot darkvision, or a +1 natural armor bonus. These benefits last until the skinwalker returns to his humanoid form as a swift action. A skinwalker must first return to his humanoid form before changing to bestial form again to change benefits.",
      "Languages": ": Skinwalkers all begin play speaking Common. Skinwalkers with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic).Inner Sea Races pg. 248,Blood of the Moon pg. 8",
      "Ability Modifiers": "+2 Constitution, –2 Intelligence (+2 Wisdom while shapechanged)",
      "Alternate Skill Modifiers": "Perception, wild empathy",
      "Alternate Spell-Like Ability": "magic fang1/day",
      "Ancestry": "wereraptor",
      "Typical Alignment": "LN",
      "Subraces": {
        "Werebat-Kin (Bloodmarked)": [
          "These skinwalkers are usually communal and defer readily to their superiors. They prefer dwelling in areas of dense foliage, such as jungles or forests. They often have little trust for those not in their immediate clan.+2 Intelligence, –2 Wisdom (+2 Dexterity while shapechanged)Fly, Perception at night1/day"
        ],
        "Werebear-Kin (Coldborn)": [
          "Known and respected as the defenders of the wild in many parts of the Lands of the Linnorm Kings, these skinwalkers often prefer to live as recluses.+2 Constitution, –2 Charisma (+2 Wisdom while shapechanged)Climb, wild empathy1/day"
        ],
        "Wereboar-Kin (Ragebred)": [
          "These skinwalkers are known for their fiery tempers and stubborn streaks, features that have earned them respect in remote corners of Garund, Cheliax, and Varisia as freedom fighters.+2 Strength, –2 Charisma (+2 Constitution while shapechanged)Handle Animal, Perception(pigs and boars only) 3/day"
        ],
        "Werecrocodile-Kin (Scaleheart)": [
          "Found most often in areas such as the Shackles and the Sodden lands, these skinwalkers are often brutish and cruel.+2 Constitution, –2 Wisdom (+2 Strength while shapechanged)Stealth, wild empathy1/day"
        ],
        "Wereraptor-Kin (Aerieborn)": [
          "wereraptorLN+2 Wis, –2 Cha (+2 Dex while shapechanged)Perception, Sense Motive1/day"
        ],
        "Wererat-Kin (Nightskulk)": [
          "These creatures, who are among the more common of the skinwalkers, prefer to dwell in urban areas.+2 Intelligence, –2 Strength (+2 Dexterity while shapechanged)Handle Animal, Stealth in urban environments(rodents only) 3/day"
        ],
        "Wereshark-Kin (Seascarred)": [
          "These unusual skinwalkers tend to be strong-willed and brisk in their patterns of speech. They often serve aboard pirate ships, where their traits are well appreciated.+2 Wisdom, –2 Intelligence (+2 Constitution while shapechanged)Perception, Swim(aquatic animals only) 3/day"
        ],
        "Weretiger-Kin (Fanglord)": [
          "More common in Vudra than the Inner Sea region, these skinwalkers are notorious for their fickle attitudes.+2 Dexterity, –2 Wisdom (+2 Charisma while shapechanged)Acrobatics, Perception1/day"
        ],
        "Werewolf-Kin (Witchwolf)": [
          "Perhaps the most prevalent breed of skinwalker, witchwolves prefer dwelling with others of their kind.+2 Constitution, –2 Intelligence (+2 Wisdom while shapechanged)Perception, wild empathy1/day"
        ]
      }
    }
  },



// Reborn Samsaran

  {
    "Reborn Samsaran": {
      "Source": "Occult Bestiary pg. 50",
      "Monster Entry": "Link",
      "+2 Intelligence, +2 Wisdom, –2 Constitution": ": Reborn samsarans are insightful and learn quickly, but their bodies tend to be frail.",
      "Medium": ": Reborn samsarans are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Reborn samsarans have a base speed of 30 feet.",
      "Low-Light Vision": ": Reborn samsarans can see twice as far as humans in conditions of dim light.",
      "Psychic Attunement": ": Reborn samsarans receivePsychic Virtuosoas a bonus feat at 1st level. Those who can't useoccult skill unlocksat 1st level instead gain thePsychic Sensitivity featas a bonus feat.",
      "Reborn Magic": ": A reborn samsaran with a Charisma score of 11 or higher can cast the following spells (as per the psychic magic universal monster rule [see page 2], using his Charisma modifier to determine the DCs):(1 PE),(0 PE),(2 PE), and(1 PE). The caster level is equal to the reborn samsaran's level. The reborn samsaran has a reservoir of 5 PE per day.",
      "Special Qualities": ": A reborn samsaran gains the following special qualities.",
      "Languages": ": Reborn samsarans begin play speaking Common and Samsaran. Those reborn samsarans with high Intelligence scores can choose from the following: any human language, Abyssal, Aquan, Auran, Celestial, Draconic, Giant, Ignan, Infernal, and Terran."
    }
  },

//   Reptoid

  {
    "Reptoid": {
      "Source": "Bestiary 5 pg. 202",
      "Monster Entry": "Link",
      "+2 Strength, +2 Charisma, –2 Dexterity": ": Reptoids are both manipulative and strong, but they're deliberate in their movements.",
      "Medium": ": Reptoids are Medium creatures and have no bonuses or penalties due to their size.",
      "Humanoid": ": Reptoids are humanoids with the reptilian and shapechanges subtypes.",
      "Normal Speed": ": Reptoids have a base speed of 30 feet.",
      "Low-Light Vision (Ex)": ": Reptoids can see twice as far as humans in dim light.",
      "Scales": ": When in its natural form, a reptoid has a +1 natural armor bonus.",
      "Cold-Blooded (Ex)": ": Reptoids receive a +2 racial saving throw bonus against mind-affecting effects and poison.",
      "Natural Weapons (Ex)": ": When in its natural form, a reptoid has a bite attack and two claw attacks that deal 1d3 points of damage each.",
      "Change Shape (Su)": ": A reptoid can assume the appearance of a specific single Medium humanoid. The reptoid always takes this specific form when it uses this ability. The reptoid gains a +10 racial bonus on Disguise checks to appear as that type of humanoid. This ability otherwise functions asalter self, except the reptoid does not adjust its ability scores. A reptoid can select a new humanoid form by spending 1 week preparing itself for the change, but can then no longer assume its previous humanoid form.",
      "Mental Potency (Ex)": ": A reptoid's mental effects can affect more powerful creatures or a greater number of creatures than normal. Both the Hit Die limit and the total number of Hit Dice affected by each enchantment or illusion spell it casts increase by 1. For enchantment and illusion spells it casts that target a number of creatures greater than one, the number of creatures affected also increases by one (so a spell that targets one creature per level would be affected, but a spell that targets only one creature would not be). This ability stacks with themesmerist'sability of the same name.",
      "Languages": ": All reptoids begin play speaking Common and Reptoid. Reptoids with high Intelligence scores can choose any languages they want (except for secret languages, such as Druidic)."
    }
  },

//   Rougarou

  {
    "Rougarou": {
      "Source": "Bestiary 6 pg. 242",
      "Monster Entry": "Link",
      "+2 Str, +2 Wis, –2 Int": ": Rougarous are strong and alert, but simplistic.",
      "Medium": ": Rougarous are Medium creatures.",
      "Normal Speed": ": Rougarous have a base speed of 30 feet.",
      "Senses": ": Rougarous have low-light vision and the scent special ability.",
      "Change Shape (Su)": "A rougarou can change shape once per day into a wolf as a standard action, asbeast shape I. A rougarou can revert to its true form as a swift action.",
      "Natural Weapon": ": Rougarous have a bite attack that deals 1d4 points of damage. This is a secondary attack if a rougarou wields a manufactured weapon.",
      "Languages": ": Rougarous speak Common and their own racial language of Rougarou. Rougarous with high Intelligence scores can choose from these bonus languages: Aklo, Elven, Gnoll, Gnome, Goblin, or Sylvan."
    }
  },

// Sahuagin

  {
    "Sahuagin": {
      "Source": "Heroes from the Fringe pg. 31",
      "Monster Entry": "Link",
      "+2 Strength, +2 Wisdom, –2 Charisma": ": While sahuagin are powerful and cunning, they are repulsive creatures.",
      "Monstrous Humanoid": ": Sahuagin are monstrous humanoids with the aquatic subtype.",
      "Medium": ": Sahuagin are Medium creatures and have no bonuses or penalties due to their size.",
      "Blindsense": ": Sahuagin have blindsense with a range of 30 feet.",
      "Darkvision": ": Sahuagin have darkvision with a range of 60 feet.",
      "Light Blindness": ": Sahuagin have the light blindness trait.",
      "Natural Armor": ": Sahuagin have a +3 natural armor bonus.",
      "Normal Speed": ": Sahuagin have a base speed of 30 feet.",
      "Fast Swimmer (5 RP)": ": Sahuagin have a swim speed of 60 feet.",
      "Bite": ": Sahuagin have a natural bite attack that deals 1d4 points of damage. This bite is a primary attack, or a secondary attack if the creature is wielding manufactured weapons.",
      "Claws": ": Sahuagin have two claw attacks that deal 1d4 points of damage. These are primary natural attacks.",
      "Blood Frenzy": ": Once per day, whenever a sahuagin takes damage, it can fly into a frenzy for 1 minute; gaining a +2 racial bonus to Constitution and Strength but a –2 penalty to AC.",
      "Speak with Sharks (1 RP)": ": Sahuagin can communicate telepathically with sharks to a distance of 100 feet. This communication is limited to simple concepts, such as \"attack,\" \"come,\" and \"defend.\"",
      "Languages": ": Sahuagin begin play speaking Aquan and Common. Sahuagin with high Intelligence scores can choose from the following: Aboleth, Abyssal, Aklo, Draconic, Giant, Goblin, and Infernal.Heroes from the Fringe pg. 31",
      "Subraces": {
        "Outsear Sahuagin": [
          "The settlement of Outsea is a bizarre environment: a saltwater oasis for merfolk and sahuagin in the freshwater River Kingdoms. Centuries ago, a sahuagin nation from the Inner Sea mobilized a city-sized saltwater bolus for an overland assault on a merfolk state located near modern-day Korvosa. The merfolk learned of this ambitious plan and sent an elite group of soldiers in saltwater tanks to intercept the ocean-bubble. The two sides clashed in Lake Encarthan and eventually worked their way up into what is now the River Kingdoms. In this battle, many of the wizards maintaining the sahuagin’s briny mobile fortress perished, and the two sides ended up stranded hundreds of miles from any ocean. Begrudgingly putting aside their grievances, the merfolk and sahuagin worked together to prevent their mutual extinction, holding back the fresh water with spells and building the settlement of Outsea to serve as a permanent home. Now Outsea is a thriving city, home to all kinds of peoples. Centuries of coexistence have worn down the merfolk and sahuagin’s hatred for each other, and now they live and work together in peace. Outsear sahuagin can take the sahuagin song and stoic defender alternate racial traits described below."
        ]
      }
    }
  },

// Primitive Human

  {
    "Primitive Human": {
      "Source": "Paizo Blog: The Gauntlet Will Be Ours! pg. 1",
      "Physical Description": ": While quite varied in terms of height, skin tone, and body types, most primitive humans stand about 6 inches shorter than their modern descendants. In addition, most have a great deal of body hair and are generally unkempt. Most have a tan skin complexion due to an excessive amount of time spent outdoors, gathering food and hunting prey.",
      "Society": ": Primitive humans live in small clans ruled over either by the clan's elders or its most brutal and warlike members. Such clans usually span only a few generations with members frequently mixing with those from other nearby clans. Occasionally a number of clans will band together or gather for a large moot, but such unifications are short-lived unless held together by a particularly powerful or charismatic leader.",
      "Relations": ": Primitive humans are fearful of most other races, and this fear often drives them to violence when they come in contact with such outsiders. To them, there is little difference between an elf and a goblin; both are a threat to the clan. They view half-orcs and half-elves with distrust, but some have been known to accept such exotic kin into their fold, occasionally even viewing them as superior, thus placing them in a position of importance.",
      "Alignment and Religion": ": Primitive humans rarely follow any set of laws other than those of the tribe, and even these are often quite flexible. Likewise, codified concepts of good and evil are somewhat extreme for these simple folk, who often spend most of their time just trying to survive in a harsh and unforgiving world. There are exceptions of course—some primitive humans strive to help their fellows, and others embrace total barbarism and wanton destruction. Most primitive humans have only a simple understanding of religion, worshiping the forces of nature and spirits of the world around them. They are known to make offerings and sacrifices to placate their deities and garner their favor.",
      "Adventurers": ": While most primitive humans stay with their clans, some set out on their own to explore the world, and still others are forced out due to some conflict or misdeed. These outcasts sometimes join up with others to improve their chances of survival or to form a group more capable of taking on dangerous challenges.",
      "Male Names": ": Arn, Bak, Farg, Gon, Merd, Oog, Tral, Ugg.",
      "Female Names": ": Ala, Desa, Fola, Ili, Hoda, Marg, Sus, Ula.: Primitive humans are as varied in their physical abilities as modern humans, though the lack the same mental flexibility.",
      "+2 to Strength, Dexterity, or Constitution": ": Primitive humans are as varied in their physical abilities as modern humans, though the lack the same mental flexibility.",
      "Medium": ": Primitive humans are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Primitive humans have a base speed of 30 feet.",
      "Frightened by Magic": ": Primitive humans are uneasy around magic, especially spells that have large, impressive effects. Whenever a primitive human is damaged or affected by a spell or supernatural ability that has an obvious visual component, the human is shaken for 1 round (subject to GM discretion). A primitive human that gains the ability to cast spells from a class feature is unaffected by this racial trait.",
      "Primitive Feat": ": Primitive humans receiveEndurance,Fleet,Great Fortitude,Iron Will,Lightning Reflexes, orToughnessas a bonus feat at 1st level.",
      "Savage Skills": ": Primitive humans receive a +2 racial bonus on Climb, Survival, and Swim skill checks.",
      "Savage Surge": ": Once per day, a primitive human can call upon a well of inner savagery. This grants a +2 bonus to any one Strength-based skill check, Strength check, or weapon damage roll. Using this ability is a free action, but it must be used before the check or attack roll is made.",
      "Languages": ": Primitive humans begin play speaking Common. Those with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."
    }
  },


// Munavri

  {
    "Munavri": {
      "Source": "Bestiary 6 pg. 197,Occult Bestiary pg. 34,Darklands Revisited pg. 37",
      "Monster Entry": "Link",
      "–2 Str, +4 Dex, +2 Con, +2 Int, +2 Wis, +2 Cha": ": Descended from humans who were changed by the harsh lands in the depths of the earth, munavris have exceptional abilities.",
      "Medium": ": Munavris are Medium creatures.",
      "Normal Speed": ": Munavris have a base speed of 30 feet.",
      "Darkvision": ": Munavris have darkvision 120 feet.",
      "Light Blindness": ": Munavris have thelight blindnessuniversal monster ability.",
      "Advanced Object Reading (Su)": "A munavri can instantly learn how to use almost any device. Once per day, she can select one weapon, suit of armor, or spell trigger item on which she has castobject reading. For a number of minutes equal to her character level, she is considered proficient with that item or can make use of the spell trigger device as if she were a spellcaster of the appropriate class.",
      "Spell Resistance": ": A munavri has an amount of spell resistance equal to 8 + her total number of class levels.",
      "Spell-Like Ability": ": A munavri can castobject readingat will (the caster level is equal to her character level).",
      "Telepathy (Su)": ": A munavri is able to mentally communicate with other munavris within 60 feet.",
      "Languages": ": Munavris begin play speaking Munavri. Munavris with high Intelligence scores can choose from the following: Aklo, Aboleth, Aquan, Dark Folk, Draconic, Terran, and Undercommon."
    }
  },

// Nagaji

  {
    "Nagaji": {
      "Source": "Advanced Race Guide pg. 196",
      "Monster Entry": "Link",
      "+2 Strength, +2 Charisma, –2 Intelligence": ": Nagaji are strong and have forceful personalities, but they tend to ignore logic and mock scholarly pursuits.",
      "Medium": ": Nagaji are Medium creatures and have no bonuses or penalties due to their size.",
      "Reptilian": ": Nagaji are humanoids with the reptilian subtype.",
      "Normal Speed": ": Nagaji have a base speed of 30 feet.",
      "Low-Light Vision": ": Nagaji can see twice as far as humans in conditions of dim light.",
      "Armored Scales": ": Nagaji have a +1 natural armor bonus because of their scaly flesh.",
      "Resistant": ": Nagaji receive a +2 racial saving throw bonus against mind-affecting effects and poison.",
      "Serpent's Sense": ": Nagaji receive a +2 racial bonus on Handle Animal checks against reptiles, and a +2 racial bonus on Perception checks.",
      "Languages": ": Nagaji begin play speaking Common and Nagaji. Nagaji with high Intelligence scores can choose from the following languages: any human tongue, Abyssal, Aklo, Celestial, Draconic, Giant, Infernal, and Sylvan.",
      "Alchemist": ": Add +1 on Craft (alchemy) checks to craft poison and +1/3 on the DCs of poisons the alchemist creates.",
      "Cavalier": ": Add 1 foot to the base speed of the cavalier's mount. This has no effect in combat unless the cavalier has selected this reward five times (or another increment of five). If the cavalier ever replaces this mount, the new mount gains this bonus to its speed.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting a grapple or trip attempt.",
      "Mesmerist": ": Add 1/5 to the Hit-Die limit and the total number of Hit Die affected with each enchantment or illusion spell the mesmerist casts. This bonus stacks with the mesmerist's mental potency class feature and is applicable under the same conditions as that ability.",
      "Monk": ": Add +1/4 point to the monk'spool.",
      "Oracle": ": Add 1/6 to the oracle's level for the purpose of determining the effects of one revelation.",
      "Paladin": ": Add 1/2 minute to the duration of the paladin's divine bond with her weapon.",
      "Ranger": ": Add 1 skill rank to the ranger's constrictor snake or viper snake animal companion.",
      "Slayer": ": Gain 1/6 of a new slayer talent.",
      "Sorcerer": ": Add 1/2 to the sorcerer's caster level when determining the duration of transmutation spells she casts that target the sorcerer or spells she casts with the poison descriptor.",
      "Summoner": ": Add +1 hit point to the summoner's eidolon.",
      "Warpriest": ": Add 1/2 to the number of times per day the warpriest can use blessings, although he can use these additional blessings only for Charm, Magic, Nobility, Rune, or Scalykind () blessings."
    }
  },

// Naiad

  {
    "Naiad": {
      "Source": "Bestiary 6 pg. 200",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Charisma, –2 Strength": ": Naiads have elegant fey grace and beauty but have delicate builds.",
      "Medium": ": Naiads are Medium creatures.",
      "Speed": ": Naiads have a base speed of 30 feet and a swim speed of 30 feet.",
      "Low-Light Vision": ": All Naiads can see twice as far as humans can in dim light.",
      "Fey Nature": ": Naiads have a +2 racial bonus on Handle Animal and Knowledge (nature) checks.",
      "Inspiration (Su)": "A naiad can choose another intelligent creature to inspire by giving that creature a token (typically a lock of her hair). As long as the creature carries the naiad's token and retains her favor, that creature gains a +1 insight bonus on Will saving throws and Craft and Perform checks. The naiad retains a link to her token and its carrier as if she had cast a status spell on the carrier. The naiad can end this effect at any time as a free action. A single naiad can only inspire one other creature at a time in this manner.",
      "Water Bond (Su)": "A naiad gains strength from a pond, lake, river, or other body of fresh water by bonding with it. While within 300 yards of her bonded body of water, she gains a +1 insight bonus to Armor Class and a +1 racial bonus on saving throws (these bonuses are not included in the stats above). Once per day as a full-round action that provokes attacks of opportunity, a naiad can forge a bond with a body of fresh water.",
      "Languages": ": Naiads begin play speaking Common and Sylvan. Naiads that have high Intelligence scores are able to choose from any of the following bonus languages: Aklo, Aquan, Dwarven, Elven, Giant, Gnome, Goblin, Halfling, Sylvan, and any regional human tongue."
    }
  },

// Orang-Pendak


  {
    "Orang-Pendak": {
      "Source": "Bestiary 5 pg. 186",
      "Monster Entry": "Link",
      "+2 Strength, +2 Wisdom, –2 Intelligence": ": Orang-pendaks are strong and intuitive, but not particularly clever.",
      "Type": ": Orang-pendaks are humanoids with the sasquatch subtype.",
      "Small": ": Orang-pendaks are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to CMD, and a +4 size bonus on Stealth checks.",
      "Forest Walker": ": Orang-pendaks gain a +4 bonus on Climb and Stealth checks in forests and jungles.",
      "Low-Light Vision": ": Orang-pendaks can see twice as far as humans in conditions of dim light.",
      "Own Two Feet": ": Orang-pendaks are extremely unnerved whenever they are riding another creature or on a vehicle, and they take a – 2 penalty on ability checks, attack rolls, damage rolls, saving throws, and skill checks when doing so.",
      "Simian Empathy": ": Orang-pendaks gain a +4 racial bonus on Handle Animal and wild empathy checks with apes and monkeys.",
      "Tear Apart": ": Orang-pendaks have powerful upper bodies and gain a +2 racial bonus on Strength checks to break or burst an object. This bonus also applies on combat maneuver checks to sunder with their unarmed attacks.",
      "Languages": ": Orang-pendaks begin play speaking Sasquatch. Orang-pendaks who have high Intelligence scores can choose from the following: Aklo, Common, Draconic, Goblin, Grippli, Sylvan, Vanaran, and Vishkanya."
    }
  },



// Kuru
  {
    "Kuru": {
      "Source": "Isles of the Shackles pg. 51",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Constitution, –2 Intelligence": ": Kuru are abnormally fast and hardy, but bloodlust clouds their thinking.",
      "Low-Light Vision": ": In dim light, kuru can see twice as far as humans.",
      "Blood Courage": ": Once per day when a kuru makes a saving throw against a fear effect, he can roll the saving throw twice and take the better result. He must decide to use this ability before the saving throw is attempted.",
      "Cannibalistic Vitality": ": When a kuru hits a living creature with its bite attack, he gains 1 temporary hit point by ingesting the target's blood. This ability does not work on creatures that do not have blood.",
      "Light Sensitivity": ": Kuru are dazzled in areas of bright sunlight or within the radius of a daylight spell.",
      "Natural Weapon": ": Kuru possess a natural bite attack that deals 1d6 points of damage.",
      "Languages": ": Kuru begin play speaking Kuru. Kuru with high Intelligence scores can choose bonus languages from the following: Abyssal, Common, Polyglot, Undercommon."
    }
  },

//   Lashunta

  {
    "Lashunta": {
      "Source": "Inner Sea Races pg. 216",
      "Monster Entry": "Link",
      "+2 Intelligence": ": Lashunta are almost universally intelligent and eager to learn.",
      "Sexual Dimorphism": ": Male and female lashunta have very different body and personality types, more so than most humanoid species. Male lashunta are muscular (+2 Strength) and often brash and unobservant (–2 Wisdom). Female lashunta, though beautiful and commanding (+2 Charisma), lack the males' rugged builds (–2 Constitution).",
      "Lashunta Magic": ": A lashunta possessing an Intelligence score of 11 or higher gains the following spell-like abilities: at will—,; 1/day—. The caster level for these effects is equal to the lashunta's character level.",
      "Knowledgeable": ": A lashunta gains a +2 racial bonus to any one Knowledge skill.",
      "Limited Telepathy": ": A lashunta is able to mentally communicate with any creature within 30 feet with whom she shares a language. Otherwise this ability is identical to the telepathy ability.",
      "Languages": ": Lashunta begin play speaking Lashunta and Elven. Lashunta with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."
    }
  },

// Locathath

  {
    "Locathah": {
      "Source": "Blood of the Sea pg. 11",
      "Monster Entry": "Link",
      "Locathah Adventurers": ": Locathahs enjoy meeting new people from all races, often hiring themselves out as laborers, mercenaries, or guides aboard ships. Though locathahs are slow and somewhat uncomfortable out of the water, they can breathe air and suffer no ill effects from traveling on land. Locathahs work for fair rates but are canny enough to charge more for the use of their aquatic expertise, such as helping a ship navigate dangerous reefs. Locathahs are usually willing to accept useful items as payment rather than coins or gems, so long as their value is commensurate. They prefer artwork, metal weapons, and surface food (especially tubers) as payment for their services.",
      "+2 Dexterity, +2 Wisdom, –2 Intelligence": ": Locathahs are agile and intuitive, but they are more interested in travel and experiences than in academia.",
      "Aquatic": ": Locathahs are humanoids with the aquatic subtype.",
      "Medium": ": Locathahs are Medium creatures and have no bonuses or penalties due to their size.",
      "Low-Light Vision": ": Locathahs live in areas where sunlight illuminates the water, and they have low-light vision.",
      "Natural Armor": ": Locathahs have thick scales that provide a +2 natural armor bonus.",
      "Slow Speed": ": Locathahs have a base speed of 10 feet.",
      "Fast Swimmer (5 RP)": ": Locathahs have a swim speed of 60 feet.",
      "Amphibious": ": Locathahs have the aquatic subtype but can breathe both water and air.",
      "Languages": ": Locathahs begin play speaking Aquan and Common. Locathahs with a high Intelligence score can choose from the following:  Aklo, Draconic, Elven, Giant, Gnome, Goblin, and Halfling.",
      "Cavalier": ": Add 1 hit point to the cavalier's mount. If the cavalier ever replaces his mount, the new mount gains these bonus hit points.",
      "Druid": ": Add 1 skill rank to the druid's animal companion. If the druid ever replaces her animal companion, the new animal companion gains these bonus skill ranks.",
      "Investigator": ": Add a +1/2 bonus on Bluff checks to feint and a +1/2 bonus on Diplomacy checks to gather information.",
      "Monk": ": Add 1/4 point to the monk's ki pool.",
      "Ranger": ": Add 1 skill rank to the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains these bonus skill ranks.",
      "Rogue": ": Choose a piercing melee weapon. Add a +1/2 bonus on critical hit confirmation rolls with that weapon (maximum bonus +4). This bonus does not stack with Critical Focus.",
      "Slayer": ": Gain 1/6 of a new slayer talent."
    }
  },


// Merfolk

  {
    "Merfolk": {
      "Source": "Advanced Race Guide pg. 194",
      "Monster Entry": "Link",
      "Merfolk Adventurers": ": Merfolk are an insular and guarded race. While they might work with non-merfolk on occasion, only rarely do they trust these allies fully. Merfolk who adventure on their own often do so because nothing is left for them in their homes.",
      "+2 Dexterity, +2 Constitution, +2 Charisma": ": Merfolk are graceful, hale, and beautiful.",
      "Aquatic": ": Merfolk are aquatic and can breathe water. Their land speed is 5 feet, but their swim speed is 50 feet. They are amphibious, but prefer not to spend long periods out of the water.",
      "Low-Light Vision": ": All merfolk have low-light vision.",
      "Armor": ": Merfolk have a +2 natural armor bonus.",
      "Languages": ": Merfolk begin play speaking Common and Aquan. Merfolk with high Intelligence scores can choose any of the following bonus languages: Aboleth, Aklo, Draconic, Elven, Sahuagin, and Sylvan.Heroes from the Fringe pg. 31",
      "Mesmerist": ": The mesmerist learns 1/4 of a new trick.",
      "Bard": ": The bard learns 1/6 of a new bardic masterpiece. (The bard selects the masterpiece once he has made this selection six times and must meet its prerequisites when it is selected.)",
      "Druid": ": Add +1 hit point to the druid's animal companion. If the merfolk ever replaces her animal companion, the new animal companion gains these bonus hit points.",
      "Monk": ": Add a +1/4 bonus on combat maneuver checks to grapple or trip.",
      "Oracle": ": Add one spell known from the oracle spell list. This spell must be at least 1 level below the highest level spell the oracle can cast.",
      "Ranger": ": Add +1 hit point to the ranger's animal companion. If the ranger ever replaces his animal companion, the new animal companion gains these bonus hit points.",
      "Skald": ": Add one spell from the skald's spell list to the skald's known spells. This spell must be at least 1 spell level below the highest level of spell the skald can cast.",
      "Sorcerer": ": Add +1/2 to the sorcerer's caster level when determining the range of any spells with the water descriptor.",
      "Witch": ": Add 1 to the witch's caster level for one of her patron spells (to a maximum of +3 caster level to any one spell).",
      "Subraces": {
        "Outsear Merfolk": [
          "The settlement of Outsea is a bizarre environment: a saltwater oasis for merfolk and sahuagin in the freshwater River Kingdoms. Centuries ago, a sahuagin nation from the Inner Sea mobilized a city-sized saltwater bolus for an overland assault on a merfolk state located near modern-day Korvosa. The merfolk learned of this ambitious plan and sent an elite group of soldiers in saltwater tanks to intercept the ocean-bubble. The two sides clashed in Lake Encarthan and eventually worked their way up into what is now the River Kingdoms. In this battle, many of the wizards maintaining the sahuagin’s briny mobile fortress perished, and the two sides ended up stranded hundreds of miles from any ocean. Begrudgingly putting aside their grievances, the merfolk and sahuagin worked together to prevent their mutual extinction, holding back the fresh water with spells and building the settlement of Outsea to serve as a permanent home. Now Outsea is a thriving city, home to all kinds of peoples. Centuries of coexistence have worn down the merfolk and sahuagin’s hatred for each other, and now they live and work together in peace. Outsear merfolk can take the unexpected ally alternate racial trait described below."
        ]
      }
    }
  },


// Kasatha
  
  "Kasatha": {
    "Source": "Inner Sea Races pg. 215",
    "Monster Entry": "Link",
    "+2 Dexterity, +2 Wisdom": ": Kasathas are nimble and sharply perceptive.",
    "Kasatha": ": Kasathas are humanoids with the kasatha subtype.",
    "Medium": ": Kasathas are Medium creatures and have no bonuses are penalties due to their size.",
    "Normal Speed": ": Kasathas have a base speed of 30 feet.",
    "Defensive Training": ": Kasathas have a +2 dodge bonus to Armor Class.",
    "Desert Runner": ": A kasatha has a +4 racial bonus on Constitution checks and Fortitude saves to avoid fatigue, exhaustion, and other ill effects from running, forced marches, starvation, thirst, and hot or cold environments.",
    "Desert Stride": ": A kasatha moves through nonmagical difficult terrain in desert environments at normal speed.",
    "Jumper": ": A kasatha is always considered to have a running start when attempting Acrobatics checks to jump.",
    "Multi-Armed": ": A kasatha has four arms. One hand is considered its primary hand; all others are considered off hands. It can use any of its hands for other purposes that require free hands.",
    "Stalker": ": Perception and Stealth are class skills for kasathas.",
    "Languages": ": Kasathas speak Common and Kasatha. Kasathas with high Intelligence scores can choose from the following: Dwarven, Draconic, Gnoll, Orc, and Sphinx."
  }
},



// Green Martian

{
    "Green Martian": {
      "Source": "Pathfinder: Worldscape #2 pg. 24",
      "Physical Description": ": Green Martians stand 12 to 15 feet tall. with imposing features accentuated by their four agile arms, their mighty tusks, and the red hue of their perceptive eyes. They dress simply in leather harnesses and jewels, each carrying at least one weapon at all times from a very young age. Skin ranges from olive hues to deep forest green, with heavy scarring common among more savage tribes such as the much-feared Warhoon.",
      "Society": ": Green Martians gather in tribes under the leadership of a chieften counseled by a gaggle of elder warlords. Their tribes usually take the names of the abandoned ruined cities of Martian ancients along the dried seabeds of Barsoom that they inhabit, though few tribes remain stationary for long, preferring a nomadic existence centered on the hardscrabble hunt for the precious resources of the Martian desert. All green folk maintain their status within the tribe through constant examples of skill, strength, and courage. Prone to shocking displays of violence, green Martians possess dark humors; they are more likely to laugh at the gruesome beheading of an enemy than at a simple irony or turn of phrase. Apart from their weapons and harnesses, green Martians tend toward communal ownership of property, even raising children collectively. leaving them with little sense of friendship or family. Their limited telepathic abilities ensure that green Martians speak with few words. preferring hrutish action to academic conversation.",
      "Relations": ": Green Martians tend to keep to their own, and are. inherently distrustful of Barsoom's other barbaric races. The more civilized green Martian tribes—such as the Tharks under the leadership of Jeddak Tars Tarkas—make common cause with the red Martians of Helium. Despite the shared religion of Issus, green Martians as a rule interact infrequently with the white-skinned Therns or black-skinned First Born. Green Martians hold particular antipathy toward the Red Planet's cannibalistic four-armed apes, whom they attack upon sight.",
      "Alignment and Religion": ": Green Martians are brutish and devoid of sentiments of friendship or love, worshiping only physical prowess and bravery. Most green Martians are chaotic neutral and worship Issus, Goddess ofDeath and Life Eternal.",
      "Adventurers": ": Before a green Martian kills his ﬁrst enemy and takes his victim's name, he is \"o mad,\" a warrior with a single name. Many green Martian adventurers begin their careers as o mads with something to prove, delving abandoned ancient cities, baiting the much-hated Barsoomian White Ape denizens of these crumbling ruins into hard-fought battles to the death to prove their bravery and achieve status within the tribe. Others sell themselves as mercenaries, arena ﬁghters, or bounty hunters aﬂcr being exiled from their tribes. forced away from lack of resources, or defeated in war. Green Martians eschew spellcasting classes (magic is almost completely unknown on Barsoom), preferring instead martial occupations like ﬁghter, brawler. or swashbuckler. With its focus on providing a boost to Armor Class when unarmored, the warlord ﬁghter archetype (forthcoming in a future issue of) is a particularly popular choice for many green Martians.",
      "APL Adjustment": ": Green Martian characters are more powerful than members of the standard Pathﬁnder RPG races presented in the.When creating encounters to challenge a party of green Martians, the Game Master should add +2 to the party's Average Party Level (APL) for levels 1-5 and +1 for levels 6-10. Fnr groups containing a mixture ofraces, GMs should carefully watch the party's relative power and adjust APL on an  ad hoc basis: Green Martians are keen-sighted and agile, but they understand little of social graces and are prone to brutishness.",
      "+2 Strength, +2 Wisdom, -2 Charisma": ": Green Martians are keen-sighted and agile, but they understand little of social graces and are prone to brutishness.",
      "Large": ": Green Martians are Large creatures and take a -1 size penalty to their AC, a -1 size penalty on attack rolls, a +1 bonus on combat maneuver checks and to their CMD, and a -4 size penalty on Stealth checks. A Green Martian takes up a space that is 10 Feet by 10 feet, and has a reach of 5 feet.",
      "Normal Speed": ": Green Martians have a base speed at 30 feet.",
      "Detect Thoughts": ": Green Martians possess limited telepathy. allowing them to read the surface thoughts at those around them. they can useas a constant spell-like ability. The caster level of the spell-like ability is equal to the user's character level.",
      "Fearless": ": Green Martians gain a +2 racial bonus on all saving throws against fear eftects.",
      "Ferocity": ": If the hit points of a green Martian fall below 0 but it is not yet dead, it can continue to fight. It it does, it is staggered, and loses 1 hit point each round. It still dies when its hit points reach a negative amount equal to its Constitution score.",
      "Multi-Armed": ": A green Martian has four arms. One hand is considered its primary hand; all others are considered off hands. It can use any of its hands for other purposes that require free hands.",
      "Weapon Familiarity": ": Green Martians are proficient with longswords and spears.",
      "Skill Training": ": Ride and Survival are always considered class skills for green Martians.",
      "Languages": ": Green Martians begin play speaking Common. Green Martians with high Intelligence scores can choose any languages they want (except secret languages, such as Druidic)."
    }
  },


// Grindylow

  {
    "Grindylow": {
      "Source": "Blood of the Sea pg. 17",
      "Monster Entry": "Link",
      "+4 Dexterity, –2 Intelligence, –2 Wisdom, –2 Charisma": ": Grindylows are cruel, ignorant, and thoughtless, but they have a startling inherent agility.",
      "Aberration": ": Grindylows are aberrations with the aquatic subtype.",
      "Small": ": Grindylows are Small creatures. They gain a +1 size bonus to AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to their CMD, and a +4 size bonus on Stealth checks.",
      "Darkvision": ": Grindylows have darkvision with a range of 60 feet.",
      "Natural Armor": ": Grindylows have tough, rubbery skin that grants a +2 natural armor bonus.",
      "Slow Speed": ": Grindylows can scuttle about on land with their tentacles and have a base speed of 15 feet.",
      "Swim Speed": ": Grindylows have a swim speed of 30 feet.",
      "Jet (1 RP)": ": Grindylows can swim 200 feet backward as a full-round action. A grindylow must move in a straight line when jetting and does not provoke attacks of opportunity when using this ability.",
      "Bite": ": Grindylows have a natural bite attack that deals 1d3 points of damage. This bite is a primary attack, or a secondary attack if the creature is wielding manufactured weapons.",
      "Tangling Tentacles (4 RP)": ": Grindylows have constantly writhing tentacles that reach out to tug at and trip adjacent foes. During the grindylow's turn, it can make a single trip attack against any adjacent foe as a swift action. The grindylow gains a +4 racial bonus on trip attacks with its tangling tentacles, and if it fails to trip a foe, that creature can't attempt to trip the grindylow in retaliation.",
      "Amphibious": ": Grindylows have the aquatic subtype, but they can breathe both water and air.",
      "Sneaky": ": Grindylows have a +4 racial bonus on Stealth checks.",
      "Languages": ": Grindylows begin play speaking Aquan. Grindylows with high Intelligence scores can choose from the following: Aklo, Common, and Goblin."
    }
  },


// Grippli

  {
    "Grippli": {
      "Source": "Advanced Race Guide pg. 190",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Wisdom, –2 Strength": ": Gripplis are nimble and alert, but spindly.",
      "Small": ": Gripplis are Small creatures and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls,a –1 penalty on combat maneuver checks and to their Combat Maneuver Defense, and a +4 size bonus on Stealth checks.",
      "Grippli": ": Gripplis are humanoids with the grippli subtype.",
      "Normal Speed": ": Gripplis have a base speed of 30 feet.",
      "Natural Climber": ": Gripplis have a climb speed of 20 feet.",
      "Darkvision": ": Gripplis can see in the dark up to 60 feet.",
      "Camouflage": ": Gripplis receive a +4 racial bonus on Stealth checks in marshes and forested areas.",
      "Swamp Stride": ": A grippli can move through difficult terrain at its normal speed while within a swamp. Magically altered terrain affects a grippli normally.",
      "Weapon Familiarity": ": Gripplis are proficient with nets.",
      "Languages": ": Gripplis begin play speaking Common and Grippli. Gripplis with high Intelligence scores can choose from the following languages: Boggard, Draconic, Elven, Gnome, Goblin, and Sylvan.",
      "Alchemist": ": Add +1/4 to the number of toxic skin uses per day.",
      "Barbarian": ": Add 1/5 to the armor bonus granted by hide armor or bone armor the barbarian wears (maximum +3).",
      "Bard": ": Add 5 feet to the range of one bardic performance.",
      "Druid": ": Add a +1/2 bonus on concentration checks. This bonus doubles in a forest or swamp terrain.",
      "Gunslinger": ": Add a +1/4 bonus on attack rolls when making a utility shot or a dead shot.",
      "Medium": ": Add 1/4 to any checks modified by the medium's spirit surge ability.",
      "Oracle": ": Add one spell known with the poison or water descriptor from the druid's spell list. This spell must be at least 1 level below the highest spell level the oracle can cast. The spell is treated as 1 spell level higher, unless it is also on the oracle spell list.",
      "Ranger": ": Add a +1 racial bonus on Swim skill checks. When this bonus reaches +8, the ranger gains a swim speed of 15 feet (this does not grant the ranger another +8 racial bonus on Swim checks).",
      "Rogue": ": Add a +1/2 bonus on Perception checks while in a forest or swamp.",
      "Shaman": ": Add one spell from the druid spell list that isn't on the shaman spell list to the list of spells the shaman knows. This spell must be at least 1 level below the highest spell level the shaman can cast.",
      "Shifter": ": Add a +1 bonus on Survival checks to follow tracks through swamps.",
      "Skald": ": Increase the skald's total number of raging song rounds per day by 1.",
      "Slayer": ": Add 1/3 to the damage the slayer deals with bone weapons (maximum +4).",
      "Swashbuckler": ": Add 1/2 to the swashbuckler's Acrobatics, Climb, Escape Artist, Fly, Ride, and Swim checks when using the derring-do deed.",
      "Witch": ": Add 1/3 to the saving throw DC to resist the poison of the witch's familiar."
    }
  },



// Gathlain



  {
    "Gathlain": {
      "Source": "Wilderness Origins pg. 10",
      "Monster Entry": "Link",
      "Physical Description": ": Wings of wood and vines grow out of the bodies of these lithesome fey. Gathlains prefer to wear a mix of clothing, with a base of natural materials like grass skirts or simply woven tunics combined with bits of finery gathered from a variety of sources.",
      "Society": ": Gathlain society is built around art, discovery, experimentation, and storytelling. These fey constantly seek new ways to look at the world. Gathlain leaders are often popular explorers followed primarily as idols worth emulating and as sources of intriguing gossip. Although gathlains tend to engage in raucous romances born of melodramatic or fanciful encounters, they do not procreate conventionally from such pairings, even when the two happen to be of different physical sexes. Gathlains show little interest in gender, finding it quaint when other races use it as a basis for assigning roles or choosing partners.",
      "Relations": ": Gathlains associate with a variety of other fey as freely as among their own kind. These mixed communities of fey are called courts and feature elaborate titles for those members deemed most interesting or most worthy of admiration. When a gathlain chooses to join a different community, it is generally a temporary membership, whether it lasts only a season or persists for decades. Adventuring gathlains frequently seek out and attempt to mingle with like-minded gnomes; however, gnomes often find gathlains too flighty, foolish, and undisciplined for their tastes.",
      "Alignment and Religion": ": Mischievous and capricious, gathlains have discordant temperaments. Most are chaotic, and they tend to be morally neutral. The typical gathlain finds mortal religions strange; like many fey, they trade respect and token offerings to godlike fey in exchange for protection, but they see little difference between that and offerings to lesser kings and queens.",
      "Adventurers": ": Gathlains strive to entertain themselves and sate their immense curiosity about the world around them, and those who decide to become adventurers often migrate to the Material Plane to explore. Those who remain in the First World seek the strangest parts of their home plane and try to learn about its most unusual inhabitants. They favor spellcasting classes and skilled classes such as bard or rogue.",
      "Names": ": Gathlains lack gender-specific names, but instead attempt to create unique names for each individual. Some examples are Agollia, Armath, Arnonwy, Brazial, Dwynnen, Eirgara, Finnath, Gummow, Inirha, Marcanth, Nirialu, Sollowy, Tiltiu, and Urhiod.: Gathlains are quick, with dynamic and engaging personalities, but are rather fragile.",
      "+2 Dexterity, +2 Charisma, –2 Constitution": ": Gathlains are quick, with dynamic and engaging personalities, but are rather fragile.",
      "Fey": ": Gathlain are fey.",
      "Small": ": Gathlains are Small and gain a +1 size bonus to their AC, a +1 size bonus on attack rolls, a –1 penalty on combat maneuver checks and to CMD, a +2 bonus on Fly checks, and a +4 size bonus on Stealth checks.",
      "Normal Speed": ": Gathlains have a base speed of 30 feet and a fly speed of 40 feet (poor maneuverability).",
      "Low-Light Vision": ": Gathlains can see twice as far as humans in dim light.",
      "Natural Armor": ": Gathlains have a +1 natural armor bonus.",
      "Spell-Like Abilities": ": 1/day—,(caster level equals the gathlain's character level).",
      "Languages": ": Gathlains speak Common and Sylvan. A gathlain with a high Intelligence score can choose from the following languages: Draconic, Elven, Goblin, Halfling, and Orc.",
      "Alchemist": ": Add 10 minutes to the duration of the alchemist's mutagens.",
      "Barbarian": ": Add 1/4 to the barbarian's damage reduction. If the barbarian would not otherwise have damage reduction, this damage reduction can be bypassed by cold iron.",
      "Bard": ": Add one spell from the druid spell list to the bard's spell list and known spells. This spell must be at least 1 level lower than the highest-level spell the bard can cast.",
      "Bloodrager": ": Add 1 additional round of bloodrage per day.",
      "Cavalier": ": Add a +1/2 bonus to the cavalier's Knowledge (nature) and Knowledge (nobility) checks relating to fey courts and fey courtiers.",
      "Druid": ": Add a +1/2 bonus to wild empathy checks.",
      "Hunter": ": The hunter's animal companion gains DR 1/cold iron. Each time the hunter gains another level, this DR increases by 1/3 (maximum DR 5/cold iron). If the hunter replaces this animal companion, the new companion gains this damage reduction.",
      "Investigator": ": Add a +1/3 bonus on inspiration rolls applied to Bluff and Knowledge checks.",
      "Kineticist": ": Increase the amount of burn cost reduction when using the kineticist's gather power ability by 1/6 point (the minimum burn cost of 0 still applies).",
      "Mesmerist": ": Increase the number of mesmerist tricks the mesmerist can use per day by one-third.",
      "Oracle": ": Add one spell known that is an enchantment spell from the sorcerer/wizard spell list. This spell must be at least one level below the highest spell level the oracle can cast. That spell is treated as one level higher unless it is also on the oracle spell list.",
      "Ranger": ": Add 1/4 to the damage dealt by the ranger's animal companion's natural attacks.",
      "Rogue": ": Add a +1/2 bonus to Bluff checks to pass secret messages or create a distraction to hide and on Sleight of Hands checks to pickpocket.",
      "Shaman": ": Add one spell from the druid spell list to the shaman's spell list. This spell must be at least 1 level lower than the highest-level spell the shaman can cast.",
      "Shifter": ": Add a +1 bonus on Knowledge (nature) checks relating to plants and flying animals.",
      "Skald": ": Add a +1/2 bonus to Acrobatics checks to avoid attacks of opportunity and to Perform checks while performing a raging song.",
      "Sorcerer": ": Choose a bloodline power from the fey or verdantbloodlines that the sorcerer can use. The sorcerer treats her class level as though it were 1/2 higher (to a maximum of +4) when determining the effects of that power.",
      "Summoner": ": Add 1/4 evolution point to the eidolon's evolution pool. These bonus evolution points must be spent on evolutions that grant spell-like abilities or protect the eidolon from spells.",
      "Witch": ": Add one spell from the druid spell list to the witch's familiar. This spell must be at least one level below the highest spell level the witch can cast. If the familiar is ever replaced, the new familiar knows these bonus spells."
    }
  },

// Ghoran

  {
    "Ghoran": {
      "Source": "Ultimate Wilderness pg. 16",
      "Monster Entry": "Link",
      "Physical Description": ": The typical ghoran stands roughly as tall as a human and occupies a similar silhouette, but that's where their similarities with humanity end. A ghoran's \"skin\" is a complex layer of fibrous vines and rinds with a texture similar to moss-covered bark. Ghoran faces consist of layered petals that flush and flutter at a whim, allowing them to mimic the facial behaviors of their wouldbe devourers. They do not lack emotion per se, but ghoran \"feelings\" are primordial and abstract, making them utterly alien to most non-ghorans. A ghoran might laugh, smile, or raise its voice, but their companions seldom understand if these are displays of true emotion or merely more adaptive evolutions designed—like so many other aspects of their physiology—simply to keep them alive.",
      "Society": ": A ghoran's alien thought processes (to say nothing of the empty holes upon its flower-petal face roughly approximating its eyes and mouth) make it very difficult for other races to understand and empathize with, leading many ghorans to stick to themselves in segregated communities of cosmopolitan and magic-rich city-states or in the deepest wild places of their barren homeland and its neighboring kingdoms.",
      "Relations": ": Ghorans are most comfortable with other intelligent plants (such as treants and vine leshys) and wary around plant-eating creatures (including humans, whom ghorans know created them as a food source). Because their regeneration brings minor personality changes with each incarnation, ghorans have trouble forming long-lasting relationships with races such as elves, dwarves, and gnomes. Ghorans deeply distrust warmongering humanoids such as goblins and gnolls, especially those with pyromaniac tendencies. The ghorans' relation with humanity is the most complex, for while they admire humans for their capacities and are grateful for their creation, they fear their appetites more, and it is difficult for a ghoran to trust that a human doesn't simply want to eat it.",
      "Alignment and Religion": ": Ghorans seldom follow humanoid deities, instead preferring to worship nature itself by means of the Green Faith (see page 136) or other powerful nature spirits, such as the Eldest of the First World. Ghorans have no predisposition toward law, chaos, good, or evil, but many struggle to differentiate right from wrong as defined by most societies.",
      "Adventurers": ": Owing to their delicious nature, ghorans seldom know peace the way that humanoid races do, and many are forced to contend with nature and learn to fight as a means of self-defense against capture and consumption. Many have taken to adventuring lifestyles either to aid friends and companions or out of a darker drive for vengeance. Others join adventuring groups in hopes of accumulating enough power and lore to, perhaps, determine a solution to their race's central problem of reproduction, though so far no ghoran has solved this essential riddle.",
      "Names": ": Ghoran naming conventions seem random, as each ghoran is self-named and \"born\" with a near perfect recollection of every memory from previous incarnations. As a result, ghorans sometimes pick names they found pleasing in other lives or name themselves after people or places they once knew. Others maintain the same name over several incarnations, though minor personality and physical changes from life to life ensure that while the ghoran's name might remain the same, aspects of the ghoran's gradual change can often confuse and frustrate longtime friends and allies.: Ghorans are hardy, guileful, and eager to explore their emotions, but they process complex thoughts slowly.",
      "+2 Constitution, +2 Charisma, –2 Intelligence": ": Ghorans are hardy, guileful, and eager to explore their emotions, but they process complex thoughts slowly.",
      "Medium": ": Ghorans are Medium creatures and receive no bonuses or penalties due to their size.",
      "+2 Natural Armor": ": Ghorans have tough, rugged skin.",
      "Plant": ": Ghorans have the plant type but lack the immunities to mind-affecting, paralysis, poison, polymorph, sleep, and stunning effects that type usually has.",
      "Delicious (Ex)": ": Ghorans take a –2 penalty on Escape Artist and combat maneuver checks to escape a grapple against a creature that has a bite attack with the grab ability.",
      "Natural Magic (Sp)": ": Ghorans with a Charisma score of 11 or higher gain the following spell-like abilities: 1/day—,(created berries bud from the ghoran's own body), and. The caster level is equal to the ghoran's level. The DC for these spells is equal to 10 + the spell's level + the ghoran's Charisma bonus.",
      "Seed (Ex)": ": As a full-round action, a ghoran can expel the seed from an orifice in its abdomen. If planted in fertile ground and left undisturbed for 2d6 days, the seed grows into a healthy duplicate of the original ghoran, save that the duplicate can reallocate all skill ranks upon sprouting. Once a ghoran expels this seed, it gains 1 negative level, and it dies as soon as the duplicate sprouts. This duplicate replaces the previous ghoran character.",
      "Light Dependent": ": Ghorans take 1d4 points of Constitution damage each day they go without exposure to sunlight.",
      "Past-Life Knowledge (Ex)": ": Ghorans have memories encoded in their seeds. They treat all Knowledge skills as class skills.",
      "Languages": ": Ghorans begin play speaking Common and Sylvan. Ghorans with high Intelligence scores can choose any languages they want (except secret languages such as Druidic).",
      "Druid": ": When casting spells that target plants or plant creatures, add 1/3 to the effective caster level, but only for the purpose of determining duration.",
      "Hunter": ": Add 1 skill rank to the hunter's plant companion. If the hunter replaces her plant companion, the new plant companion gains these bonus skill ranks.",
      "Mesmerist": ": Choose one mind-affecting mesmerist trick that the mesmerist knows. The mesmerist can affect intelligent plant creatures with that trick or spell as if they weren't immune to mind-affecting effects.",
      "Ranger": ": Add a +1/4 bonus on initiative checks and Survival checks when the ranger is in a favored terrain.",
      "Rogue": ": Choose one type of ranger favored enemy (or one subtype in case of either humanoid or outsider). The rogue adds 1/2 to her sneak attack damage when using sneak attack against creatures of the chosen type (maximum +3).",
      "Shaman": ": Add one spell from the druid spell list that isn't on the shaman spell list to the list of spells she knows. This spell must be at least 1 level lower than the highest-level spell the shaman can cast.",
      "Shifter": ": Add 1/5 to the shifter's natural armor bonus when using wild shape to assume a major form.",
      "Sorcerer": ": When casting sorcerer/wizard spells that are also on the druid spell list, add 1/3 to the effective class level, but only for the purpose of determining durations.",
      "Witch": ": Add 1/4 to the witch's caster level when attempting dispel checks using,, and similar effects."
    }
  },


// Gillman

  {
    "Gillman": {
      "Source": "Advanced Race Guide pg. 188",
      "Monster Entry": "Link",
      "Gillman Adventurers": ": Though small gillman communities exist underwater, most gillmen operate independently or in small family groups. They share no overreaching racial goals or desires, banding together solely for survival. Each gillman has unique experiences and motivations that may lead to an adventuring life. Although gillmen are slow to make friends with other races, they are nonetheless a stable addition to any group of adventurers.",
      "+2 Constitution, +2 Charisma, –2 Wisdom": ": Gillmen are vigorous and beautiful, but their domination by the aboleths has made them weak-willed.",
      "Medium": ": Increase the medium's spirit bonus by 1/6.",
      "Aquatic": ": Gillmen are humanoids with the aquatic subtype.",
      "Normal Speed": ": Gillmen have a base speed of 30 feet on land. As aquatic creatures, they also have a swim speed of 30 feet, can move in water without making Swim checks, and always treat Swim as a class skill.",
      "Amphibious": ": Gillmen have the aquatic subtype, but can breathe both water and air.",
      "Enchantment Resistance": ": Gillmen gain a +2 racial saving throw bonus against non-aboleth enchantment spells and effects, but take a –2 penalty on such saving throws against aboleth sources.",
      "Water Dependent": ": A gillman's body requires constant submersion in fresh or salt water. Gillmen who spend more than 1 day without fully submerging themselves in water risk internal organ failure, painful cracking of the skin, and death within 4d6 hours.",
      "Languages": ": Gillmen begin play speaking Common and Aboleth. Gillmen with high Intelligence scores can choose from the following: Aklo, Aquan, Draconic, and Elven.",
      "Bard": ": Add 1/2 to the bard's Bluff checks to fool someone and gain a +1/2 bonus on the bard's Sense Motive checks to sense enchantments.",
      "Fighter": ": Add +1 to the fighter's CMD when resisting two combat maneuvers of the character's choice.",
      "Investigator": ": Increase the total number of points in the investigator's inspiration pool by 1/3.",
      "Monk": ": Add 1 foot to the monk's swim speed. In combat, this option has no effect unless the monk has selected it five times (or another increment of five).",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Sorcerer": ": Add one spell known from the sorcerer spell list. This spell must be at least one level below the highest spell level the sorcerer can cast.",
      "Wizard": ": Add one spell from the wizard spell list to the wizard's spellbook. This spell must be at least one level below the highest spell level he can cast."
    }
  },



// Ganzi

  {
    "Ganzi": {
      "Source": "Plane-Hopper's Handbook pg. 18",
      "Monster Entry": "Link",
      "+2 Constitution, +2 Charisma, –2 Intelligence": ": Ganzis are passionate, creative, and resilient, but they have difficulty focusing on intellectual pursuits.",
      "Native Outsider": ": Ganzis are outsiders with the native subtype.",
      "Medium": ": Ganzis are Medium creatures and have no bonuses of penalties due to their size.",
      "Normal Speed": ": Ganzis have a base speed of 30 feet.",
      "Darkvision": ": Ganzis can see in the dark up to 60 feet.",
      "Maelstrom Resistance": ": Ganzis have acid resistance 5, electricity resistance 5, and sonic resistance 5, and they gain a +2 racial bonus on saving throws against spells of the polymorph subschool.",
      "Skilled": ": Ganzis gain a +2 racial bonus on Sense Motive and Survival checks.",
      "Ganzi Oddity": ": As creatures infused with the entropic forces of the Maelstrom, all ganzis have a distinct and unusual oddity that manifests as a physical or magical ability that sets the ganzi apart. Typically, a ganzi's oddity is chosen from the most common manifestations of entropy listed below, but other, more unique oddities can certainly exist. The numbers listed for each option can be used to randomly determine what form of ganzi oddity a particular Ganzi might have, at the GM's option, but the quibble ability is the most common.",
      "1–2: Chaos Champion (Su)": "Ganzis with a lineage linked to the einherji often become crusaders for the forces of entropy and excel in combat against lawful beings. The ganzi can smite law once per day as a swift action, targeting a lawful foe. She adds her Charisma modifier as a bonus on attack rolls and gains a bonus on damage rolls equal to her Hit Dice. Once activated, smite law persists until the target is dead or the ganzi rests, whichever comes first.",
      "3–4: Entropic Flesh (Ex)": "Ganzis with lineages that link strongly to chaos beasts retain some of their ancestors' immunity to transformation. In addition to gaining a +2 bonus on Escape Artist checks and to CMD against grapple combat maneuvers, when such ganzis are affected by a hostile transmutation effect (such as polymorphing or petrification), they can attempt a new saving throw at the start of their next turn to end the effect. They gain a +4 bonus on this second saving throw, but if they fail, the transmutation effect persists as long as it normally would.",
      "5–6: Prehensile Tail (Ex)": "Ganzis with lineages that are particularly influenced by the presence of proteans often have colorful feathers, scales, or skin, and a long serpentine tail. This tail can be used to carry items. While ganzis with this oddity cannot wield weapons with their tails, they can use their tails to retrieve small, stowed objects carried on their persons as a swift action.",
      "7–14: Quibble (Su)": "For most ganzis, the influence of chaos is relatively subtle and manifests as an ability to infect others with entropy and unexpected luck (be it good luck or bad). Once per day as an immediate action, a ganzi can twist probability and alter the luck of a single creature within 20 feet, forcing it to reroll a single d20 roll it has just made. The target must take the second result, even if it is worse. A ganzi can use this ability after the target has rolled but must use it before the GM declares whether the roll was a success or failure. Unwilling creatures can resist a ganzi's quibble with a successful Will save (DC = 10 + half the ganzi's level + the ganzi's Charisma modifier). This is a curse effect.",
      "15–18: Spell-Like Ability (Sp)": "Ganzis whose chaotic influences rise from regions other than the Maelstrom or its inhabitants often manifest an oddity that duplicates the effects of a specific spell. Such ganzis gain one of the following spell-like abilities, usable once per day at a caster level equal to the ganzi's HD:,,,,,, or",
      "19–20: Weaponplay (Ex)": "Ganzis with lineages that link to the valkyries manifest their heritage in their skill in combat. Such ganzis are always proficient with all simple and martial weapons, and they can qualify for feats normally available only to fighters (such as Weapon Specialization) even if they don't have any fighter class levels.",
      "Languages": ": Ganzis begin play speaking Common and one of the following: Abyssal, Celestial, or Protean. Ganzis with high Intelligence scores can select any of those languages as bonus languages, along with Aklo, Aquan, Auran, Ignan, Sylvan, or Terran.Plane-Hopper's Handbook pg. 18",
      "1–3: Amorphous Limbs (Su)": ": The influence of the Maelstrom manifests in the ganzi's ability to transform one of her limbs at will, often into a natural weapon such as a massive clawed arm. Every 1d4 rounds as a swift action, a ganzi can transform one of her limbs into a natural melee weapon that deals 1d6 points of damage. The transformation lasts until the beginning of the ganzi's next turn. The damage dealt by this natural weapon can be lethal or nonlethal, at the ganzi's discretion, and she chooses whether the damage type is bludgeoning, piercing, or slashing.",
      "4–6: Ink (Ex)": ": As a standard action, the ganzi can spit a stream of opaque, black ink from her mouth to a distance of up to 20 feet. The ganzi can target either a creature or a square on the ground, each with different effects, as detailed below. The ganzi can use this ability once per day, plus one additional time per day for every 4 Hit Dice she has.",
      "7–10: Racing Mind (Ex)": ": A ganzi whose lineage is linked to hunduns might inherit an aspect of the outsiders' chaotic minds. The ganzi's churning vortex of thoughts bolsters it against mental attacks, granting the ganzi a +2 bonus on Will saves against mind-affecting effects.",
      "11–13: Spell-Like Ability (Sp)": ": Ganzis whose chaotic influences rise from sources other than the Maelstrom or its inhabitants often manifest an oddity that duplicates the effects of a specific spell. Such a ganzi gains one of the following spell-like abilities, which can be used once per day with a caster level equal to the ganzi's HD:acid arrow,gust of wind,mirror image,resist energy,scorching ray,see invisibility, orwarp wood",
      "14–16: Uncanny Aura (Su)": ": Some ganzis have an unsettling aura of chaos that rattles hostile creatures that venture too close. Once per day as a standard action, such a ganzi can activate an uncanny aura; enemies within 30 feet must succeed at a Will saving throw (DC = 10 + half the ganzi's Hit Dice + the ganzi's Charisma modifier) or become frightened until the beginning of the ganzi's next turn. The aura remains for a number of rounds equal to the ganzi's Charisma modifier (minimum 1 round). Once a creature has been affected by an uncanny aura, whether it failed its save or not, it cannot be affected again for 24 hours.",
      "17–18: Vestigial Wings (Ex)": ": The ganzi has a pair of small, vestigial wings, likely but not limited to resembling those of a flying creature or some manner of construct. Though these appendages do not grant flight, these ganzis can use their wings to stabilize themselves when they're thrown off balance. Such ganzis gain a +1 bonus on Reflex saving throws and a +2 bonus on Acrobatics checks to balance.",
      "19–20: Void Touch (Su)": ": A ganzi whose lineage is influenced strongly by voidworms might exhibit the ability to inflict chaos on others' minds. Three times per day when such a ganzi hits a creature with a melee attack, the ganzi can deliver a burst of chaos to that creature as a free action. The target must succeed at a Will save (DC = 10 + half the ganzi's Hit Dice + the ganzi's Constitution modifier) or be confused for 1 round.",
      "Arcanist": ": Add 1/2 to the arcanist's effective caster level when casting spells with the chaotic descriptor.",
      "Bard": ": Add 1/2 to the bard's bardic knowledge bonus.",
      "Druid": ": The druid gains a +1 bonus on Knowledge (nature) or Knowledge (planes) checks related to extraplanar flora and fauna.",
      "Hunter": ": The hunter's animal companion is specially trained for extraplanar expeditions and gains a +1 bonus on Stealth and Acrobatics checks while on a plane other than the Material Plane.",
      "Investigator": ": Increase the total number of points in the investigator's inspiration pool by 1/3.",
      "Oracle": ": Add one spell known of the enchantment school from the cleric or wizard spell list. This spell must be at least 1 level below the highest spell level the oracle can cast.",
      "Rogue": ": Add a +1/2 bonus on Stealth checks while on a plane other than the Material Plane.",
      "Sorcerer": ": Choose a bloodline power from the abyssal or protean bloodlines that the sorcerer can use. The sorcerer treats her class level as though it were 1/2 higher (to a maximum of +4) when determining the effects of that power.",
      "Wizard": ": Add 1/3 to the wizard's effective caster level when casting a spell with the chaotic descriptor.",
      "Subraces": {
        "Expanded Oddities": [
          "Due to the Maelstrom’s entropic influence on their compositions, ganzis each have an unusual but defining feature—referred to as an oddity—that sets them apart from other races and even from other members of their own race. These oddities vary wildly from ganzi to ganzi, and they can manifest as physical features, such as feathers, scales, or a tail, or as more subtle magical abilities. At the GM’s discretion, players with ganzi characters can roll 1d20 to randomly determine what form their characters’ oddities take using the list below.: The influence of the Maelstrom manifests in the ganzi’s ability to transform one of her limbs at will, often into a natural weapon such as a massive clawed arm. Every 1d4 rounds as a swift action, a ganzi can transform one of her limbs into a natural melee weapon that deals 1d6 points of damage. The transformation lasts until the beginning of the ganzi’s next turn. The damage dealt by this natural weapon can be lethal or nonlethal, at the ganzi’s discretion, and she chooses whether the damage type is bludgeoning, piercing, or slashing.: As a standard action, the ganzi can spit a stream of opaque, black ink from her mouth to a distance of up to 20 feet. The ganzi can target either a creature or a square on the ground, each with different effects, as detailed below. The ganzi can use this ability once per day, plus one additional time per day for every 4 Hit Dice she has.: The ganzi shoots a stream of ink into a creature’s eyes as a ranged touch attack with a range of 30 feet. If the ganzi hits, the target must succeed at a Fortitude saving throw (DC = 10 + half the ganzi’s Hit Dice + the ganzi’s Constitution modifier) or be blinded for 1d4 rounds.: The ganzi spits the ink into a single square on the ground within 30 feet, which becomes slippery for 1d6 rounds. Any creatures entering the square must succeed at a Reflex save (DC = 10 + half the ganzi’s Hit Dice + the ganzi’s Constitution modifier) or fall prone.: A ganzi whose lineage is linked to hunduns might inherit an aspect of the outsiders’ chaotic minds. The ganzi’s churning vortex of thoughts bolsters it against mental attacks, granting the ganzi a +2 bonus on Will saves against mind-affecting effects.: Ganzis whose chaotic influences rise from sources other than the Maelstrom or its inhabitants often manifest an oddity that duplicates the effects of a specific spell. Such a ganzi gains one of the following spell-like abilities, which can be used once per day with a caster level equal to the ganzi’s HD:,,,,,, or.: Some ganzis have an unsettling aura of chaos that rattles hostile creatures that venture too close. Once per day as a standard action, such a ganzi can activate an uncanny aura; enemies within 30 feet must succeed at a Will saving throw (DC = 10 + half the ganzi’s Hit Dice + the ganzi’s Charisma modifier) or become frightened until the beginning of the ganzi’s next turn. The aura remains for a number of rounds equal to the ganzi’s Charisma modifier (minimum 1 round). Once a creature has been affected by an uncanny aura, whether it failed its save or not, it cannot be affected again for 24 hours.: The ganzi has a pair of small, vestigial wings, likely but not limited to resembling those of a flying creature or some manner of construct. Though these appendages do not grant flight, these ganzis can use their wings to stabilize themselves when they’re thrown off balance. Such ganzis gain a +1 bonus on Reflex saving throws and a +2 bonus on Acrobatics checks to balance.: A ganzi whose lineage is influenced strongly by voidworms might exhibit the ability to inflict chaos on others’ minds. Three times per day when such a ganzi hits a creature with a melee attack, the ganzi can deliver a burst of chaos to that creature as a free action. The target must succeed at a Will save (DC = 10 + half the ganzi’s Hit Dice + the ganzi’s Constitution modifier) or be confused for 1 round."
        ]
      }
    }
  },


// Duskwalker

  {
    "Duskwalker": {
      "Source": "Plane-Hopper's Handbook pg. 16",
      "Monster Entry": "Link",
      "+2 Dexterity, –2 Constitution, +2 Wisdom": ": Duskwalkers are agile and wise, but their bodies are fragile.",
      "Native Outsider": ": Duskwalkers are outsiders with the native subtype.",
      "Medium": ": Duskwalkers are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed": ": Duskwalkers have a base speed of 30 feet.",
      "Darkvision": ": Duskwalkers can see in the dark up to 60 feet.",
      "Skilled": ": Duskwalkers gain a +2 racial bonus on Knowledge (religion) and Heal checks.",
      "Ghost Hunter (Su)": ": In a duskwalker's hands, any weapon can strike true against spectral beings. A duskwalker's nonmagical weapons deal half damage to incorporeal creatures, as if they were magic weapons, and her magic weapons can deal critical hits and precision damage, even if they do not have the ghost touch property. Once per day as a standard action, a duskwalker can focus her natural revulsion toward undead. If she does so, she treats all weapons she wields as if they had theproperty for 1 minute.",
      "Ward against Corruption (Ex)": ": Duskwalkers gain a +2 racial bonus on saving throws against negative energy and death effects, as well as the spell-like and supernatural abilities of undead and sahkils. They are immune to all abilities that would transform their bodies or souls into undead.",
      "Languages": ": Duskwalkers begin play speaking Common and one of the following: Abyssal, Celestial or Infernal. Duskwalkers with high Intelligence scores can choose from the following bonus languages: Abyssal, Celestial, Draconic, Dwarven, Elven, Halfling, Infernal, or Protean.",
      "Antipaladin": ": Add 1/2 points of damage to the antipaladin's touch of corruption ability (whether using it to heal or harm).",
      "Arcanist": ": Add 1/4 to the arcanist's caster level when casting spells of the necromancy school.",
      "Bard": ": Add 1/2 to the bard's bardic Knowledge bonus.",
      "Cleric": ": Add 1/2 point of damage when using positive energy against undead.",
      "Fighter": ": Add 2 to the fighter's Constitution score for the purpose of determining death from negative hit points.",
      "Investigator": ": Add a +1/3 bonus on inspiration rolls applied to Heal, Knowledge and Linguistics checks.",
      "Kineticist": ": Increase the capacity of the kineticist's internal buffer by 1/6 point.",
      "Monk": ": Add 1/4 point to the monk's ki pool.",
      "Paladin": ": Add 1/2 point to hit points restored by the paladin's lay on hands ability (whether using it to heal or harm).",
      "Ranger": ": Add 1/5 to the ranger's favored enemy bonus against undead. The ranger must have favored enemy (undead) to select this option.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Skald": ": Add 1/2 to the skald's bardic Knowledge bonus.",
      "Spiritualist": ": Add 1 foot to the spiritualist's phantom's base speed. In combat, this option has no effect unless the spiritualist has selected it 5 times (or another increment of 5).",
      "Vigilante": ": Add 1/4 to the penalty inflicted by startling appearance, and a +1/2 bonus on the Intimidate check for frightening appearance.",
      "Witch": ": Add 1/4 to the witch's caster level when casting spells of the necromancy school.",
      "Wizard": ": Add 1/4 to the wizard's caster level when casting spells of the necromancy school."
    }
  },



//   Drow Noble

{
    "Drow Noble": {
      "Source": "Pathfinder RPG Bestiary pg. 115",
      "Monster Entry": "Link",
      "+4 Dexterity, +2 Intelligence, +2 Wisdom, +2 Charisma, –2 Constitution": ". Noble drow are very agile, observant, and regal. These ability score modifiers replace the standard drow ability score modifiers.",
      "Spell Resistance": ": Drow nobles have spell resistance equal to 11 + their character level.",
      "Spell-Like Abilities": ": Drow nobles can cast,,,, andeach at will, and haveas a constant spell-like ability. A drow noble can also cast,, andonce per day each. In some cases, a drow noble's spell-like abilities might vary, although the level of a particular spell-like ability does not. A drow noble's caster level for her spell-like abilities is equal to her character level."
    }
  },


// Cecaelia


  {
    "Cecaelia": {
      "Source": "Blood of the Sea pg. 7",
      "Monster Entry": "Link",
      "Cecaelia Adventurers": ": Cecaelias are restless wanderers at heart. The attraction of a new location is often enough to spark a journey—the more exotic and far-flung the destination, the better. They scavenge ruins and shipwrecks near coastlines, trading their finds with nearby land dwellers. Cecaelias enjoy traveling with adventuring parties, particularly those with surfacers in the mix. They may hire on with a group solely for the opportunity to socialize and explore. That doesn't mean cecaelias disdain their share of the treasure, though; they use the proceeds from their expeditions to fund their coastal trading and travel.",
      "+2 Dexterity, +2 Wisdom, –2 Intelligence": ": Cecaelias are nimble and have a canny insight, but they tend to be flighty.",
      "Monstrous Humanoid": ": Cecaelias are monstrous humanoids with the aquatic subtype.",
      "Medium": ": Cecaelias are Medium creatures, and they have no bonuses or penalties due to their size.",
      "Darkvision": ": Cecaelias have darkvision with a range of 60 feet.",
      "Tentacle Sense (1 RP)": ": While swimming and not grappled or grappling, a cecaelia can spread her tentacles wide to form a sensory net around herself as a swift action. This grants blindsight to a range of 10 feet and lasts as long as the cecaelia concentrates or until the cecaelia attacks with a tentacle or moves.",
      "Natural Armor": ": Cecaelias have a +2 natural armor bonus.",
      "Normal Speed": ": Cecaelias have no trouble moving about on land using their tentacles and have a base speed of 30 feet.",
      "Swim Speed": ": Cecaelias have a swim speed of 40 feet.",
      "Jet (1 RP)": ": Cecaelias can swim 200 feet backward as a full-round action. A cecaelia must move in a straight line when jetting and does not provoke attacks of opportunity when she uses jet.",
      "Tentacle Attacks (3 RP)": ": Cecaelias have two tentacle attacks that deal 1d4 points of damage. These attacks are primary natural attacks and have a reach of 10 feet. This extended reach only applies to the cecaelia's tentacle attacks and not to any other attacks she makes.",
      "Amphibious": ": Cecaelias are amphibious and can breathe both air and water.",
      "Ink Cloud (3 RP)": ": Once per hour as a standard action, a cecaelia can emit a 10-foot-radius sphere of ink while underwater. This ink cloud provides total concealment and persists for 1 minute.",
      "Stable Tentacles (4 RP)": ": Cecaelias cannot be tripped.",
      "Languages": ": Cecaelias begin play speaking Aquan and Common. Cecaelias with a high Intelligence score can choose from the following: Aklo, Celestial, Draconic, Elven, Giant, Gnome, and Halfling."
    }
  },


// Changeling

  {
    "Changeling": {
      "Source": "Blood of the Coven pg. 13",
      "Monster Entry": "Link",
      "+2 Wisdom, +2 Charisma, –2 Constitution": ": Changelings are frail, but are clever and comely.",
      "Medium": ": Changelings are Medium creatures and have no bonuses or penalties due to their size.",
      "Humanoid": ": Changelings are humanoids with the changeling subtype.",
      "Normal Speed": ": Changelings have a base speed of 30 feet.",
      "Hag Racial Trait": "Winter-born changelings gain a +5 racial bonus on Acrobatics and Climb checks on icy or slippery surfaces.",
      "Claws": ": Changelings' fingernails are hard and sharp, granting them two claw attacks (1d4 points of damage each).",
      "Natural Armor": ": Changelings have a +1 natural armor bonus.",
      "Darkvision": ": Changelings can see in the dark up to 60 feet.",
      "Languages": ": Changelings begin play speaking Common and the primary language of their host societies. Changelings with high Intelligence scores can choose from the following languages: Aklo, Draconic, Dwarven, Elven, Giant, Gnoll, Goblin, and Orc.Blood of the Coven pg. 5",
      "Ancestry": "Winter hag",
      "Typical Alignment": "CN",
      "Ability Modifiers": "+2 Int, +2 Cha, -2 Con",
      "Awakened Hag Heritage": "You gain cold resistance equal to your character level and are no longer affected by severe cold or extreme cold.",
      "Pyrophile": ": The changeling gains a +1 racial bonus on damage rolls when using spells with the fire descriptor. This bonus increases by 1 for every 4 levels the changeling has beyond 1st.",
      "Oracle": ": Add +1/2 to the oracle's level for the purpose of determining the effects of the oracle's curse ability.",
      "Rogue": ": The rogue gains 1/6 of a new rogue talent.",
      "Witch": ": Add one spell from the witch spell list to the witch's familiar. This spell must be at least one level below the highest spell level she can cast. If the witch ever replaces her familiar, the new familiar knows these bonus spells.Blood of the Coven pg. 13",
      "1st Level": ":,;:;:;:;:;:;:;:;:;:",
      "3rd Level": ":;:;:;:;:;:;:;:;:",
      "5th Level": ":;:;:;:;:;:;:;:",
      "7th Level": ":;:;:;:;:;:;:",
      "9th Level": ":;:;:;:;:;:",
      "11th Level": ":;:;:;:;:",
      "13th Level": ":;:;:;:",
      "15th Level": ":;:;:",
      "17th Level": ":;:",
      "19th Level": ":",
      "Subraces": {
        "Annis-Born (Slag May)": [
          "Broad-shouldered and athletic, slag mays demonstrate incredible talent for all physical tasks. They share a vivacity, an addiction to new sights and experiences, and a tendency to collect souvenirs wherever they go.Annis hagCN+2 Str, +2 Cha, –2 ConAnnis-born changelings gain a +1 racial bonus on melee damage rolls.Your jagged claws cause gaping wounds, dealing 1 point of bleed damage on a successful critical hit."
        ],
        "Ash-Born (Hearth May)": [
          "Possessed of a blazing inner fire, hearth mays are passionate and excitable. Ranging from bubbly to irate, they lack emotional nuance, but their drive and discipline can overcome nearly any obstacle.Ash hagLN+2 Wis, +2 Cha, -2 ConAsh-born changelings gain a +1 racial bonus on damage rolls for spells with the fire descriptor. This bonus increases by 1 for every 4 character levels the changeling has beyond 1st.You gain immunity to extremely warm conditions, as if you were under the effects of a permanentspell (heat only) that cannot be dispelled."
        ],
        "Blood-Born (Veil May)": [
          "Gifted with a face for every occasion, veil mays can adjust to any social situation, showing those around them exactly what they want to see. As easily as they read others, they are equally gifted at hiding their true intentions.Blood hagN+2 Wis, +2 Cha, -2 IntThe DCs of Sense Motive checks to gain a hunch about a blood-born changeling increase by 5.You gain a +2 racial bonus on Bluff, Diplomacy, and Sense Motive skill checks as your gifts for reading and manipulating others matures."
        ],
        "Dreamthief-Born (Waker May)": [
          "Rare beyond measure, waker mays exist only as the result of horrific rituals and bear stained souls. Cursed from birth, they mature like foul fruit into the deadliest of and most powerful of hags.Dreamthief hagNE+2 Str, +2 Cha, -2 WisDreamthief-born changelings gain a +2 racial bonus on saving throws against mind-affecting effects.You no longer need to sleep and cannot become fatigued due to lack of sleep. You can still be affected by other effects that inflict the fatigued condition, and must rest for 8 hours in order to prepare spells or regain uses of class abilities as normal, even if this time is not spent sleeping."
        ],
        "Green-Born (Callow May)": [
          "Shy and soft-spoken, but possessed of grace and insight, callow mays are masterful manipulators who deeply appreciate the beautiful things in the world.Green hagCN+2 Wis, +2 Cha, -2 ConGreen-born changelings gain a +2 racial bonus on Bluff checks against creatures that could be sexually attracted to them.You can castonce per day as a spell-like ability, treating your character level as your caster level. The bonus on Bluff checks you gain from your hag racial trait applies when someone could be sexually attracted to your disguised form as well."
        ],
        "Mute-Born (Sorrow May)": [
          "Unique among their kind, sorrow mays manifest spontaneously without the need for hag mothers, and likewise hold the potential to corrupt themselves, transforming into hags should their hearts grow cold.Mute hagCN+2 Int, +2 Wis, -2 ConMute-born changelings gain a +2 racial bonus on saving throws against gaze attacks.When you confirm a critical hit with your claw attack, your opponent is blinded for 1d6 rounds. A target that succeeds at a Fortitude saving throw (DC = 10 + half your character level + your Charisma modifier) is dazzled for 1 round instead."
        ],
        "Night-Born (Moon May)": [
          "As much made as born, moon mays are deliberately created by night hags with foul futures in mind. Destiny haunts their lives, fanning pride and natural talent into megalomania.Night hagN+2 Wis, +2 Cha, -2 DexNight-born changelings gain a +2 racial bonus on saving throws against disease.You can form aby performing an 8-hour ritual over any gem worth at least 500 gp. While you carry it, aallows you to apply your +2 racial bonus on saving throws against disease to all Fortitude saves. Acan also be used as a focus to replace any material spell components worth 10 gp or less. Ais considered to have a caster level equal to your character level at the time of its creation."
        ],
        "Sea-Born (Brine May)": [
          "Dauntless free spirits, brine mays wander like the wind and water, and just like the elements, they have little concern for others' plans.Sea hagCN+2 Dex, +2 Wis, -2 ConSea-born changelings can hold their breath for a number of rounds equal to three times their Constitution score before they risk drowning.You gain a swim speed equal to your base speed and can move in water without attempting Swim checks. Swim is a class skill for you."
        ],
        "Storm-Born (Virga May)": [
          "Born with cold temperaments but hot passions, virga mays reject large crowds and open spaces and prefer to keep their emotions under tight control, all too aware of raging torrents that burble below their calm exteriors.Storm hagCN+2 Wis, +2 Cha, -2 ConStorm-born changelings are treated as two size categories larger for the purpose of resolving wind effects.You can cast following spell-like abilities: 1/day—,, and. The caster level for these effects is equal to your level. The DC for these spells is equal to 10 + the spell's level + your Charisma modifier."
        ],
        "Winter-Born (Snow May)": [
          "Playful and easily amused, snow mays are lighthearted but terribly creative once their anger is roused. Little phases these capricious women for long, and their casual cruelty can easily melt back to kindness.Winter hagCN+2 Int, +2 Cha, -2 ConWinter-born changelings gain a +5 racial bonus on Acrobatics and Climb checks on icy or slippery surfaces.You gain cold resistance equal to your character level and are no longer affected by severe cold or extreme cold."
        ]
      }
    }
  },


//   Deep One Hybrid
  {
    "Deep One Hybrid": {
      "Source": "Bestiary 5 pg. 70",
      "Monster Entry": "Link",
      "+2 Constitution, +2 Wisdom, –2 Dexterity:": "Deep one hybrids are hearty and devout, but tend to be somewhat slow and awkward in their movements.",
      "Slow:": "A deep one hybrid's base speed is 20 feet, as it walks with a shuffling gait.",
      "Low-Light Vision:": "A deep one hybrid can see twice as far as a human in starlight, moonlight, torchlight, and similar conditions of dim light.",
      "Natural Armor:": "A deep one hybrid's thick skin and dense fatty tissues grant it a +1 natural armor bonus to AC.",
      "Final Change (Su):": "A deep one hybrid ages at the same rate as a half-orc. A mere 1d12 months after a deep one hybrid reaches venerable age (at 60 years old), it dies a painful, agonizing death, only to have its body transform into that of a mature deep one. This transformation functions as the reincarnate spell, with the newly formed deep one gaining the following modifications to its physical ability scores: +6 Strength, –2 Dexterity, and +6 Constitution.",
      "Sea Longing (Ex):": "Every 24 hours a deep one hybrid spends in an area more than 10 miles from the sea, it must succeed at a DC 20 Will save or take 1 point of Wisdom drain.",
      "Take to the Water (Ex):": "A deep one hybrid can hold its breath 10 times longer than a human can, and gains a +2 bonus on Initiative checks and Reflex saving throws while swimming. A deep one hybrid has a swim speed of 30 feet, and gains a +8 racial bonus on all Swim checks.",
      "Languages:": "Deep one hybrids begin play speaking Aklo and Common. Hybrids with high Intelligence scores can choose from the following languages: Abyssal, Aquan, Dwarven, Elven, Giant, Gnome, Goblin, Half ling, Orc, and Undercommon."
    }
  },



// Adaro


  {
    "Adaro": {
      "Source": "Blood of the Sea pg. 16",
      "Monster Entry": "Link",
      "+2 Strength, +2 Dexterity, +2 Constitution, –2 Intelligence": ": Adaros are terrifying physically, but their rampant bloodlust hampers their intellect.",
      "Monstrous Humanoid": ": Adaros are monstrous humanoids with the aquatic subtype.",
      "Medium": ": Adaros are Medium creatures and have no bonuses or penalties due to their size.",
      "Blindsense": ": Adaros have blindsense with a range of 30 feet.",
      "Darkvision": ": Adaros have darkvision with a range of 60 feet.",
      "Keen Scent (2 RP)": ": Adaros can detect creatures by scent in a 180-foot radius underwater and can detect blood in the water at ranges of up to a mile.",
      "Low-Light Vision": ": Adaros benefit from low-light vision.",
      "Natural Armor": ": Adaros have a +2 natural armor bonus.",
      "Slow Speed": ": Adaros have a base speed of 10 feet.",
      "Swim Speed": ": Adaros have a swim speed of 50 feet.",
      "Powerful Bite (3 RP)": ": Adaros have a natural bite attack that deals 1d6 points of damage. This bite is a primary attack, or a secondary attack if the creature is wielding manufactured weapons.",
      "Rain Frenzy (4 RP)": ": Adaros revere storms, and their lust for blood is amplified exponentially while it is raining. While fighting in the rain or during other stormy weather, adaros act as though affected by thespell. An adaro gains this benefit even if it is underwater, but only as long as it remains within its swim speed of the water's surface.",
      "Amphibious": ": Adaros have the aquatic subtype, but they can breathe both water and air.",
      "Poison Use": ": Adaros are skilled with poison and never risk accidentally poisoning themselves when applying poison to weapons.",
      "Speak with Sharks (1 RP)": ": Adaros can communicate telepathically with sharks to a distance of 100 feet. This communication is limited to simple concepts, such as \"attack,\" \"come,\" and \"defend.\"",
      "Languages": ": Adaros begin play speaking Aquan and Common. Adaros with high Intelligence scores can choose from the following: Abyssal, Aklo, Draconic, Giant, Infernal, and Undercommon."
    }
  },

// Android


  {
    "Android": {
      "Source": "Inner Sea Races pg. 214",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Intelligence, –2 Charisma:": "Androids have swift reflexes and are very intelligent, but often have difficulty relating to others.",
      "Exceptional Senses (Ex):": "Androids have darkvision to a range of 60 feet and lowlight vision. They also gain a +2 racial bonus on Perception checks.",
      "Constructed (Ex):": "For the purposes of effects targeting creatures by type (such as a ranger's favored enemy and bane weapons), androids count both as humanoids and as constructs. Androids gain a +4 racial bonus on all saving throws against mind-affecting effects, paralysis, poison, and stun effects. They are not subject to fatigue or exhaustion, and are immune to disease and sleep effects.",
      "Emotionless:": "Androids can never gain morale bonuses and are immune to fear effects and emotion effects. They have problems processing emotions properly, and thus take a –4 penalty on Sense Motive checks.",
      "Nanite Surge (Ex):": "An android's body is infused with nanites. Once per day as an immediate action, an android can cause her nanites to surge, granting her a bonus equal to 3 + the android's character level on any one d20 roll; this ability must be activated before the roll is made. When an android uses this power, her circuitry-tattoos glow with light equivalent to that of a torch for 1 round.",
      "Languages:": "Androids begin play speaking Common. Androids with high Intelligence can choose any language as a bonus language (except secret languages, such as Druidic)."
    }
  },


// Aphorite

  {
    "Aphorite": {
      "Source": "Plane-Hopper's Handbook pg. 14",
      "Monster Entry": "Link",
      "+2 Strength, +2 Intelligence, –2 Dexterity": ": Aphorites are strong and intelligent, but move and react somewhat stiffly.",
      "Native Outsider": ": Aphorites are outsiders with the native subtype.",
      "Medium": ": Aphorites are Medium creatures and have no bonuses of penalties due to their size.",
      "Normal Speed": ": Aphorites have a base speed of 30 feet.",
      "Darkvision": ": Aphorites can see in the dark up to 60 feet.",
      "Skilled": ": Aphorites gain a +2 racial bonus on checks with a single Craft skill of their choice.",
      "Spell-Like Ability": ": Aphorites can useonce per day as a spell-like ability (caster level equal to the aphorite's class level).",
      "Aphorite Resistances (Ex)": ": Aphorites have electricity resistance 5 and a +2 bonus on saves versus poison and mind-affecting effects.",
      "Crystalline Dust (Su)": ": An aphorite can manifest a haze of crystalline dust that forms into indistinct runes and glyphs surrounding its body. This effect grants the aphorite a 20% miss chance against melee and ranged attacks. Activating this dust is a move action, but it can be maintained each round as a free action. The effect cannot be disrupted, but it ends immediately if the aphorite is killed, paralyzed, stunned, knocked unconscious, or otherwise prevented from taking a free action to maintain it each round. An aphorite can use this ability a number of rounds per day equal to its Hit Dice, but the rounds do not need to be consecutive.",
      "Languages": ": Aphorites speak Common and either Celestial or Infernal. An aphorite with a high Intelligence score can choose from the following as bonus languages: Abyssal, Aquan, Auran, Celestial, Ignan, Infernal, or Terran.",
      "Alchemist": ": Add 1 foot to the range increment of the alchemist's thrown splash weapons (including the alchemist's bombs). This option has no effect unless the alchemist has selected it 5 times (or another increment of 5).",
      "Cleric": ": Add a +1/2 bonus on Knowledge (planes) checks relating to Axis and creatures with the lawful subtype.",
      "Fighter": ": Add 1 to the fighter's CMD when resisting disarm or trip attempts.",
      "Inquisitor": ": Add 1/4 to the number of times per day the inquisitor can change her most recent teamwork feat.",
      "Investigator": ": Gain a +1/4 bonus on damage rolls for critical hits made while using studied combat.",
      "Magus": ": Add one spell from the magus spell list to the magus's spellbook. This spell must be at least 1 level below the highest spell level he can cast.",
      "Ranger": ": Add 1 foot to the range of the ranger's hunter's bond ability when granting a bonus to allies. This option has no effect unless the ranger has selected it 5 times (or another increment of 5).",
      "Rogue": ": Add a +1 bonus on Disable Device and Use Magic Device checks related to glyphs, scrolls, symbols, and other magical writings.",
      "Warpriest": ": Add 1/2 to the number of times per day the warpriest can use blessings, but he can use these additional blessings on only those from the Artifice, Community, Knowledge, Law, Magic, or Rune domains.",
      "Witch": ": The witch gains 1/6 of a new witch hex.",
      "Wizard": ": Add 1/3 to the wizard's caster level when casting spells with the lawful descriptor or spells that create magical glyphs, runes, or symbols."
    }
  },


// Aquatic Elf

  {
    "Aquatic Elf": {
      "Source": "Blood of the Sea pg. 5",
      "Adventurers": ": Groups of aquatic elves are known to specialize in searching ruins for pieces of art, historical records, and magical artifacts from sunken and forgotten empires. Those exploring the submerged debris of long-lost cities sometimes partner with adventurers of other races to overcome dangerous traps or guardians. Prideful as they are, aquatic elves know that other creatures can contribute specialized abilities to an expedition, though they are happiest working with gnomes, halflings, and surface elves, as these creatures are likely to return to the surface when their business beneath the waves is done. Some aquatic elves distrust humans, who they believe conceal expansionist motives and have a reckless disregard for danger— especially as concerns ancient and dangerous magic. Aquatic elves ally with gillmen only when necessary, as they worry that any such collaboration could be a part of some deeper aboleth scheme.",
      "+2 Dexterity, +2 Intelligence, –2 Constitution": ": Aquatic elves are nimble, both in body and mind, but their form is frail.",
      "Medium": ": Aquatic elves are Medium creatures and receive no bonuses or penalties due to their size.",
      "Normal Speed": ": Aquatic elves have a base speed of 30 feet. They also have a swim speed of 30 feet, can move in water without making Swim checks, and always treat Swim as a class skill.",
      "Aquatic": ": Aquatic elves are humanoids with the aquatic subtype.",
      "Amphibious": ": Aquatic elves are amphibious and can breathe both air and water.",
      "Low-Light Vision": ": Aquatic elves can see twice as far as humans in conditions of dim light.",
      "Elven Immunities": ": Aquatic elves are immune to magic sleep effects and gain a +2 racial saving throw bonus against enchantment spells and effects.",
      "Elven Magic": ": Aquatic elves receive a +2 racial bonus on caster level checks made to overcome spell resistance. In addition, aquatic elves receive a +2 racial bonus on Spellcraft skill checks made to identify the properties of magic items.",
      "Keen Senses": ": Aquatic elves receive a +2 racial bonus on Perception checks.",
      "Weapon Familiarity": ": Aquatic elves are proficient with rapiers, short swords, and tridents, and treat any weapon with the word \"elven\" in its name as a martial weapon.",
      "Languages": ": Aquatic elves begin play speaking Common and Elven. Elves with high Intelligence scores can choose from the following: Celestial, Draconic, Gnoll, Gnome, Goblin, Orc, and Sylvan.",
      "Arcanist": ": Add 1/4 to the arcanist's caster level when casting spells with the water descriptor.",
      "Cavalier": ": Add 1 skill rank to the cavalier's mount. If the cavalier ever replaces his mount, the new mount gains these bonus skill ranks.",
      "Druid": ": Add 1 hit point to the druid's animal companion. If the druid ever replaces her animal companion, the new animal companion gains these bonus hit points. For a druid whose nature bond gives her a cleric domain, select one cleric domain power at 1st level that is normally usable a number of times per day equal to 3 + the druid's Wisdom modifier. The druid adds 1/2 to the number of uses per day of that domain power.",
      "Fighter": ": Choose a weapon from the following list: rapier, short sword, trident, or any weapon with \"elven\" in its name. Gain a +1/2 bonus on critical hit confirmation rolls made while using that type of weapon (maximum bonus +4). This bonus does not stack with those gained through Critical Focus and similar effects.",
      "Magus": ": Add one spell from the cleric, druid, or wizard spell list with the water descriptor to the magus's spellbook. This spell must be at least 1 level below the highest spell level he can cast. This spell is treated as 1 level higher unless it also appears on the magus spell list.",
      "Ranger": ": Choose a weapon from the following list: longbow, shortbow, or any weapon with \"elven\" in its name. Reduce the penalty on ranged attack rolls underwater made with this weapon by 1.",
      "Summoner": ": As long as the summoner's eidolon has a swim speed, add 5 feet to its swim speed (max +20 feet).",
      "Witch": ": When casting a witch spell underwater, add 1/3 to the effective caster level of the spell for the purpose of determining the spell's duration.",
      "Wizard": ": Add 1 to the wizard's caster level check when attempting to cast a spell with the fire descriptor underwater."
    }
  },


// Astomoi


  {
    "Astomoi": {
      "Source": "Bestiary 5 pg. 37",
      "Monster Entry": "Link",
      "–2 Constitution, +2 Intelligence, +2 Wisdom:": "Astomoi ever pursue enlightenment through self-denial and are psychically attuned to their surroundings, but their delicate bodies are more susceptible to the physical dangers of the world.",
      "Medium:": "Astomoi are Medium creatures and have no bonuses or penalties due to their size.",
      "Normal Speed:": "Astomoi have a base speed of 30 feet.",
      "Scent:": "Astomoi have the scent special ability.",
      "Telepathic Senses:": "Astomoi can't speak or see, but can mentally sense the area within 60 feet, as per darkvision, and can speak telepathically. An astomoi can't see anything beyond 60 feet. An astomoi must provide thought components for spells that normally require verbal components. It can use language-dependent abilities with its telepathy, but not abilities that depend on audible components.",
      "Sensitive Breath:": "Astomoi take a –2 penalty on saving throws against disease and inhaled poisons.",
      "Mouthless:": "Astomoi don't need to eat or drink to survive. Instead, they absorb the essence of food and drink; this consumes the nutrients of the meal as though it had been eaten, rendering the food useless to others. Astomoi consume potions and other ingested materials in the same fashion. Since they never actually ingest anything, they can't normally be exposed to ingested poisons.",
      "Languages:": "Astomoi begin play knowing Common, but as they have no mouths, they cannot speak. They have telepathy with a range of 100 feet. Astomoi with high Intelligence scores can choose any of the following languages: Abyssal, Aklo, Celestial, Elven, Gnome, Infernal, and Sylvan."
    }
  },


// Being of Ib

  {
    "Being of Ib": {
      "Source": "Pathfinder #111: Dreams of the Yellow King pg. 87",
      "–4 Strength, –2 Constitution, +4 Wisdom": ": Beings of Ib are frail and weak, yet profoundly faithful and devoted.: A being of Ib is aquatic. It can move in water without attempting Swim checks and can breathe underwater. It always treats Swim as a class skill.",
      "Aquatic": ": A being of Ib is aquatic. It can move in water without attempting Swim checks and can breathe underwater. It always treats Swim as a class skill.",
      "Darkvision": ": A being of Ib has darkvision to 60 feet.",
      "Low-Light Vision": ": A being of Ib can see twice as far as a human in dim light.",
      "Amphibious": ": A being of Ib is able to survive indefinitely on land.",
      "Speed": ": A being of Ib has a land speed of 20 feet and a swim speed of 30 feet.",
      "Amorphous": ": Although a being of Ib's body is solid and it cannot adjust its shape, its slimy skin and internal structures (skeleton and organs alike) are strangely composed of the same alien matter. This lack of any real single weak point means that the being of Ib is immune to precision damage (such as sneak attacks) and critical hits.",
      "Voiceless": ": Voiceless (Ex) An Ib shade has no voice and cannot speak or take any verbal action as a result. An Ib shade that gains a level in a spellcasting class automatically replaces any verbal components required by its spells withthought components",
      "Languages": ": A being of Ib cannot speak, but is entirely capable of learning and understanding languages. The creatures' language, Ib, is a combination of hand gestures and facial expressions."
    }
  },


//   Boggard


  {
    "Boggard": {
      "Source": "Monster Codex pg. 8",
      "Monster Entry": "Link",
      "Barbarian": ": Add 1 on the barbarian's Acrobatics checks to jump.",
      "Bard": ": Reduce the amount of time the bard must wait before using his terrifying croak ability by 5 minutes (minimum 5 minutes).",
      "Fighter": ": Increase the hit points of the fighter's tongue by 1 and add 1/2 on all opposed Strength checks to prevent a creature from detaching the fighter's tongue.",
      "Ranger": ": Add 1/4 to a single existing favored terrain bonus (maximum +2 per favored terrain)."
    }
  },


//   Caligni

  {
    "Caligni": {
      "Source": "Bestiary 5 pg. 66",
      "Monster Entry": "Link",
      "+2 Dexterity, +2 Constitution, –2 Intelligence:": "Caligni are quick and resilient, but generations of isolation and oppression have made them slow to accept new ideas.",
      "Normal Speed:": "Caligni have a base speed of 30 feet.",
      "See in Darkness:": "Caligni can see perfectly in darkness of any kind, including that created by",
      "Light Sensitivity:": "Caligni are dazzled in areas of bright light.",
      "Death Throes:": "When a caligni is slain, its body combusts in a flash of searing light. All creatures within a 5-foot burst must succeed at a Fortitude save (DC = 10 + 1/2 the caligni's Hit Dice + the caligni's Constitution bonus) or be dazzled for 1d4 rounds. The corpse left behind is a third of the caligni's size, withered and unrecognizable as the individual.and similar spells cast upon these remains restore a caligni as normal."
    }
  },