{
    "archmage": {
      "spirit bonus": "Your spirit bonus applies on concentration checks, Intelligence checks, and Intelligence-based skill checks.",
      "seance boon": "Your damaging spells deal an additional 2 points of damage of the same type to each target.",
      "favored locations": "Arcane redoubts, areas of unusual magic, libraries, schools.",
      "influence penalty": "You take a penalty equal to your spirit bonus on Strength checks, Strength-based skill checks, Constitution checks, attack rolls, and non-spell damage rolls. Your body responds as if you were a frail, aged scholar.",
      "taboos": [
        "You eschew all faith in the divine. You must not be the willing target of divine spells or abilities and must attempt a Will saving throw against even harmless divine spells and abilities.",
        "You must not pass up the opportunity to learn something new and significant (a nontrivial piece of information with a Knowledge check of DC 20 or higher) when that opportunity is directly present.",
        "You must use your own magical solution to a challenge if you can, even if a mundane solution that would require fewer resources is available."
      ],
      "archmage arcana": {
        "level": "Lesser",
        "description": "Instead of your normal spells per day for your medium level, use the spells per day from Table 1–4: Mesmerist. For each level of spell you can now cast, select a single spell of that level from the sorcerer/wizard spell list to add to your medium spell list and spells known until you lose contact with the archmage. When you cast these spells, they count as arcane (though not for the purpose of fulfilling prerequisites), and you must provide verbal and somatic components instead of thought and emotion components."
      },
      "arcane surge": {
        "level": "Intermediate",
        "description": "Allow the archmage spirit to gain 1 point of influence over you to cast one of your medium spells known without expending a spell slot. The caster level and DC of the spell increase by 1, and you can’t apply metamagic to the spell."
      },
      "wild arcana": {
        "level": "Greater",
        "description": "Allow the archmage spirit to gain 1 point of influence over you to cast any sorcerer/wizard spell of a level you can cast. You must expend a spell slot of the appropriate level, and you can’t apply metamagic to the spell."
      },
      "legendary archmage": {
        "level": "Supreme",
        "description": "Once per day, cast any spell on the sorcerer/wizard spell list as if using the wild arcana ability. The archmage doesn’t gain 1 point of influence over you, the spell doesn’t require a spell slot, and you can select a spell of any level."
      }
    },

    "champion": {
        "spirit bonus": "Your spirit bonus applies on attack rolls, non-spell damage rolls, Strength checks, Strength-based skill checks, and Fortitude saves.",
        "seance boon": "You gain a +2 bonus on all non-spell damage rolls.",
        "favored locations": "Arenas, battlefields, places of violence, practice yards.",
        "influence penalty": "You take a penalty equal to your spirit bonus on Intelligence checks and Intelligence-based skill checks, and to your caster level (to a minimum of caster level 0). You can’t benefit from effects that increase your caster level.",
        "taboos": [
          "You are superstitious about arcane spellcasting. You must not be the willing target of arcane spells or abilities and must attempt a Will saving throw against even harmless arcane spells and abilities.",
          "You may not make an attack with any weapon except a specific manufactured weapon (such as “my father’s +2 falchion”) that you choose when you take the taboo, and you may not choose unarmed strike for this taboo.",
          "You must accept any challenge to prove your prowess in battle, including challenges to single combat—if you or an ally breaks the rules of the challenge, you break this taboo."
        ],
        "champions prowess": {
          "level": "Lesser",
          "description": "Gain proficiency in all martial weapons and in one exotic weapon of your choice, which you choose each time you channel a champion spirit."
        },
        "sudden attack": {
          "level": "Intermediate",
          "description": "Whenever you take a full-attack action, gain one additional attack at your highest base attack bonus. This ability stacks with the extra attack from haste but doesn’t stack with special actions that grant extra attacks, such as flurry of blows or spell combat."
        },
        "fleet charge": {
          "level": "Greater",
          "description": "Take a swift action and a full-round action to move up to your speed and then make a full attack. This special action doesn’t combine with sudden attack, but works as normal with effects such as haste and two-weapon fighting."
        },
        "legendary champion": {
          "level": "Supreme",
          "description": "Gain two combat feats of your choice. You can treat your base attack bonus from your medium levels as equal to your medium level for the purposes of qualifying for combat feats and determining their effects. You can count your medium levels as levels of one other class whose base attack bonus equals its class level (such as fighter, barbarian, or slayer) for the purpose of qualifying for the two new combat feats."
        }
      }
,
"guardian": {
    "spirit bonus": "Your spirit bonus applies to AC and on Constitution checks, Fortitude saves, and Reflex saves.",
    "seance boon": "You gain a +1 bonus to CMD.",
    "favored locations": "City walls, forts, gates, keeps.",
    "influence penalty": "You always fight defensively when attacking and always cast defensively when casting a spell. Due to your focus on defense, you take a penalty on damage rolls equal to your spirit bonus.",
    "taboos": [
      "You must always protect others from danger when you can, including defeated enemies, but not enemies that are an active threat to you and others.",
      "You must keep your body in fit physical condition, and you break this taboo every time you drop below half your maximum hit points.",
      "You must speak no words and use no abilities with the sonic descriptor, and you break this taboo if you become enraged, frightened, or panicked."
    ],
    "guardians shield": {
      "level": "Lesser",
      "description": "Gain proficiency in heavy armors and shields (including tower shields)."
    },
    "absorb blow": {
      "level": "Intermediate",
      "description": "Gain DR/— and resistance to acid, cold, electricity, fire, and sonic equal to 1/2 your medium level. Add paladin’s sacrifice to your medium spells known as a 2nd-level spell."
    },
    "sudden block": {
      "level": "Greater",
      "description": "After an enemy’s attack would hit you or an adjacent creature, use spirit surge to increase the victim’s AC, possibly causing the attack to fail, by rolling your spirit surge die and adding it to the chosen character’s AC. If use of this ability causes the enemy’s attack to miss, you can make an attack at your highest base attack bonus against that enemy as an immediate action."
    },
    "legendary guardian": {
      "level": "Supreme",
      "description": "Once per day as an immediate action, ignore the effects of a single attack against you, including enemy spells targeting you or whose area or effect includes you. The attack affects other creatures as normal."
    }
  }
,
"hierophant": {
    "spirit bonus": "Your spirit bonus applies on Wisdom checks, Wisdom-based skill checks, and Will saves.",
    "seance boon": "Your healing spells and abilities heal an additional 2 points of damage to each target. This does not affect healing conferred by magic items, nor does it add to fast healing or similar effects.",
    "favored locations": "Altars, churches, sacred groves, shrines.",
    "influence penalty": "You must strike for nonlethal damage in combat whenever possible. You take a penalty equal to your spirit bonus on all Charisma checks and Charisma-based skill checks involving worshipers of faiths other than the spirit’s, except checks to convince others to convert to the spirit’s faith.",
    "taboos": [
      "You must strongly revere nature and may not wear metal armor or shields.",
      "You must follow a paladin or antipaladin code as appropriate for the spirit’s deity.",
      "You may not deliberately speak any lies, including bluffing, exaggerating, stating half-truths with intent to deceive, lies by omission, and so on, and if you know the answer to a question that someone asks you, you must give the answer."
    ],
    "divine surge": {
      "level": "Lesser",
      "description": "Functions as the archmage arcana spirit power, except that you add spells from the cleric/oracle list instead of the sorcerer/wizard list (these spells count as divine), and you need a divine focus if the spell requires one."
    },
    "energy font": {
      "level": "Intermediate",
      "description": "You can channel energy a number of times per day equal to 1 + your Charisma modifier. Choose whether you channel positive or negative energy each time you contact a hierophant spirit; this choice must match the spirit’s faith. If you choose positive energy, add cure spells of each level you can cast from the cleric list to your medium spell list and spells known. Otherwise, add inflict spells in the same way. These spells count as divine, as in the divine surge spirit power."
    },
    "overflowing grace": {
      "level": "Greater",
      "description": "When you heal a creature to full hit points or a creature already at full hit points with your positive or negative energy, that creature gains a +1 sacred bonus on attack rolls, skill checks, ability checks, and saving throws for 1 round. The bonus is sacred if you use positive energy and profane if you use negative energy. If you destroy or kill one or more creatures with positive or negative energy, you gain a +1 bonus of the same type on attack rolls, skill checks, ability checks, and saving throws for 1 round."
    },
    "legendary hierophant": {
      "level": "Supreme",
      "description": "Once per day, you can request a minor miracle. This request must be in line with the options for miracle that don’t cost powdered diamond. As usual for a miracle, the deity or other being the spirit worships can choose whether or not to grant the request at its whim."
    }
  }
,
"marshal": {
    "spirit bonus": "Your spirit bonus applies on Charisma checks and Charisma-based skill checks, as well as on spirit surge rolls. This allows the bonus to apply twice to the total result if you use a spirit surge on a Charisma check or on a Charisma-based skill check.",
    "seance boon": "Choose a seance boon from any of the other legends to benefit from. When using the shared seance class feature, each participant can choose a different boon.",
    "favored locations": "Council rooms, stages, theaters, throne rooms.",
    "influence penalty": "You take a penalty equal to your spirit bonus on Wisdom checks and Wisdom-based skill checks. Additionally, if you are not at least nominally in charge of your present allies, you lose the marshal’s spirit bonus and seance boon.",
    "taboos": [
      "You may not allow yourself or your allies to prevent a fleeing enemy from escaping, since an at-large villain makes a better tale (this applies only to enemies seeking to escape, not to those retreating to alert others or fight again from a better position).",
      "You may never leave an ally behind or allow yourself or your allies to sacrifice another ally, even a summoned creature.",
      "You must embrace any opportunity to spread the legend of yourself and your allies, even when a low profile would be helpful."
    ],
    "marshals order": {
      "level": "Lesser",
      "description": "Use your spirit surge on attack rolls, saving throws, ability checks, concentration checks, and skill checks rolled by you or any allies who participated in your seance as long as you have line of sight and line of effect, and are within 30 feet of the chosen ally. You can still use spirit surge only once per round."
    },
    "inspiring call": {
      "level": "Intermediate",
      "description": "As a standard action, grant all allies who can see and hear you a competence bonus equal to your spirit bonus on either saving throws or attack and damage rolls. You choose which bonus to grant each time you use inspiring call. This ability lasts for 1 round. If you have the decisive strike greater spirit power, you can use inspiring call as a move action. If you have the legendary marshal supreme spirit power, you can use inspiring call as a swift action."
    },
    "decisive strike": {
      "level": "Greater",
      "description": "Allow the marshal to gain 1 point of influence over you as a swift action to allow an ally within 30 feet who can see and hear you to make a single melee or ranged attack during your turn. Use this ability as a standard action to instead allow the ally to perform any standard action."
    },
    "legendary marshal": {
      "level": "Supreme",
      "description": "Use a lesser spirit surge without incurring influence. This lesser surge adds a maximum of 1d6 to the roll and does not apply your spirit bonus, regardless of other effects or abilities you have that alter your spirit surge. A lesser surge still counts as a spirit surge for the purpose of the limit of one spirit surge per round, but it does not consume any free uses of spirit surge you may have from effects such as taboo."
    }
  }
,
"trickster": {
    "spirit bonus": "Your spirit bonus applies on Dexterity checks, skill checks, and Reflex saves.",
    "seance boon": "Choose one skill when you gain this seance boon. You gain a +1 bonus on skill checks using that skill, and that skill counts as a class skill for you.",
    "favored locations": "Alleys, mazes, taverns, trap-filled locations.",
    "influence penalty": "You never count as an ally for the purpose of gaining benefits from another creature’s abilities, nor do you count as a willing target for spells. Anyone attempting to target you with a touch range spell, even a beneficial spell, must succeed at a melee touch attack. You gain no benefit from another creature’s aid another attempts.",
    "taboos": [
      "You can’t abide revealing your true identity, and you break this taboo when anyone pierces your disguise, even your own allies.",
      "You can never tell the truth.",
      "You can never pass up a more lucrative offer, even if it causes you to switch sides."
    ],
    "tricksters edge": {
      "level": "Lesser",
      "description": "Choose any two skills. These skills count as class skills for you, and you are treated as if you had an additional number of ranks in those skills equal to your medium level (to a maximum of your character level)."
    },
    "surprise strike": {
      "level": "Intermediate",
      "description": "When you attack an opponent that’s denied its Dexterity bonus to AC, you deal 1d6 points of extra precision damage for every 3 medium levels. Your target counts as flat-footed against the first attack you make against that target in a day, regardless of abilities like uncanny dodge. After your first attack, that target is immune to being made flat-footed by your surprise strike for 24 hours."
    },
    "transfer magic": {
      "level": "Greater",
      "description": "Allow the trickster to gain 1 point of influence over you to make a melee touch attack against another creature as a standard action. If the attack succeeds, you randomly steal one of the harmless spells of the highest spell level active on that creature, ending the effect for the original creature and gaining all remaining duration for yourself. This ability does not work on personal-range or instantaneous- or permanent-duration spells."
    },
    "legendary trickster": {
      "level": "Supreme",
      "description": "Once per day, instead of rolling for a skill check, you can choose your d20 result. Additionally, you gain the ability to change form at will as if using greater polymorph, except that you can mimic the form of a specific individual."
    }
  }
}
  